<HTML>
<HEAD>
</HEAD>
<BODY BGCOLOR="#ffffff">
<TD align="center" valign="top" width="900" bgcolor="#C7CFCE"><TABLE border="0" 
cellpadding="2" cellspacing="0" width="100%"></td>
<TR>
<TD width="100%" bgcolor="#191970"><FONT color="#ffffff" size="3" face="Arial">
<STRONG>Hacker attaccano il sito RAI</STRONG></FONT></TABLE></tr></td><p>
</P><font face="Arial" size="3">
<DIV STYLE="text-align: justify">
Venerd&igrave; 10 luglio chi si &egrave; collegato al sito del GR1 delle
ore 13:00 ha trovato <IMG SRC=
"img/gr1.jpg" WIDTH="200" HEIGHT="150" ALIGN="right" NATURALSIZEFLAG="3">al posto del giornale radio una voce maschile
che gli annunciava il programma radiofonico e, subito dopo cominciava ad insultare
il nuovo OS Microsoft Windows98, che era appena uscito nei computer shop
di tutta italia; subito dopo a questo messaggio &egrave; stata inserita
anche una specie di &quot;scenetta&quot; radiofonica che trova come protagonista
un Windows98 impazzito. Questo attacco al sito RAI &egrave; durato quattro
minuti e da fonti interne all'azienda si &egrave; appreso che l'hackeraggio
&egrave; stato molto probabilmente causato da uno degli addetti all'aggiornamento
del sito che ha dato all'esterno la propria password. La RAI ha sporto denuncia
contro ignoti ed ha modificato tutte le password in via precauzionale.
Alla RAI si sono accorti della violazione soltanto il mattino del luned&igrave;
dopo, e subito tutto &egrave; stato riportato alla normalit&agrave; e al
posto di quel messaggio ora c'&egrave; il GR1 delle ore 13:00 del 10 luglio.<br>
Dopo un mese esatto (il 10/08/1998) l'hacker &egrave stato identificato; Si tratta di un giovane studente universitario di 20 anni residente in profincia di Forl&igrave.<br>
Per effettuare "l'attacco", si &egrave servito di un abbonamento Internet dell'Ordine degli Ingegneri di Mantova, riuscendo a conquistare un posto di Amministratore di Sistema. Nella casa del ragazzo sono stati sequestrati dalle Forze dell'Ordine ben 2 Personal Computer, alcuni programmi e diversi documenti che spiegano come penetrare in sistemi informatici
<P>Grazie alla prontezza di uno dei nostri redattori che ha salvato su cassetta
il messaggio di questo hacker, noi ve lo possiamo proporre integralmente
qui di seguito.</P>

<P>&lt;&lt;Un buongiorno a voi e un buongiorno a me, questo &egrave; il
giornale radio di raiuno. Oggi, 10 luglio 1998, esce finalmente anche in
Italia il tanto discusso Windows98. Per l'avvenimento alcuni rivenditori
hanno deciso di restare aperti anche durante la notte, probabilmente perch&eacute;,
non avevano una gnocca che li aspettasse a casa. Le novit&agrave; principali
della nuova relase del popolare sistema operativo, sono sostanzialmente
tre:</P>

<P>1. La barra di avvio &egrave; stata sostituita con una BARA DI AVVIO,
chiamata cos&igrave; perch&eacute; i programmi che verranno eseguiti da
essa non ripartiranno mai pi&ugrave;.<BR>
2. Inoltre il cestino &egrave; stato sostituito con un pi&ugrave; USER FRIENDLY
&quot;cesso&quot;, con tanto di icona a forma di water e suono dello sciacquone.
<BR>
3. Ma la novit&agrave;, forse pi&ugrave; importante &egrave; la completa
integrazione con internet, infatti tutto, dal desktop all'Explorer, dalla
System Tray al pannello di controllo, puzzeranno di internet, tant'&egrave;
che rischierete di essere nukkati pure dal vostro orologio di sistema.</P>

<P>I primi pareri degli utenti sono stati abbastanza coerenti; mentre i
pi&ugrave; denigratori hanno espresso le loro opinioni con frasi del tipo
:&lt;&lt;Ma che merda &egrave;&gt;&gt;, i sostenitori del nuovo sistema
operativo della Microsoft sono usciti con espressioni del tipo :&lt;&lt;Senti
maaa!!! Che cagata &egrave;&gt;&gt;.<BR>
Si preannuncia quindi un difficoltoso cammino per la Microsoft. Bill Gates
infatti, dopo aver affrontato l'antitrust americano, dovr&agrave; affrontare
gli anticristi italiani. Gli hackers nostrani, dopo aver infatti venduto
la loro anima in cambio di un Linux funzionante, hanno deciso di dare del
filo da torcere a quest'uomo di merda. Sar&agrave; una battaglia a colpi
di flood? Solo il tempo potr&agrave; dirlo. <BR>
Dal vostro hacker di fiducia &egrave; tutto, un sentito saluto e buon divertimento,
ovviamente non Windows98.&gt;&gt;</P>

<P>&nbsp;</P>

<P>&nbsp;</P>

<P>Vi presentiamo adesso la nuova puntata di:</P>

<P>Va dove ti porta [?]</P>

<P><FONT COLOR="#ff0000" SIZE=-1>Benvenuto in Windows98...<BR>
</FONT></P>

<P><FONT COLOR="#ff0000" SIZE=-1>Win98: Memoria insufficiente</FONT> <BR>
<FONT SIZE=-1>Utente: Ma...ma come ci&ograve; solo il notepad</FONT> <BR>
<FONT COLOR="#ff0000" SIZE=-1>Win98: Errore... Conflitto di periferiche</FONT>
<BR>
<FONT SIZE=-1>Utente: Oh! Ma se prima andava tutto benissimo</FONT> <BR>
<FONT COLOR="#ff0000" SIZE=-1>Win98: Attenzione... Il modulo 1245:371 ha
provocato un errore irreversibile nel kernel</FONT> <BR>
<FONT SIZE=-1>Utente: Maaa che cazzo dici</FONT> <BR>
<FONT COLOR="#ff0000" SIZE=-1>Win98: La pallina del mouse &egrave; incrostata</FONT>
<BR>
<FONT SIZE=-1>Utente: Ti sto sui marroni? Se ti sto sui marroni allora dillo,
perch&egrave; non si pu&ograve; andare avanti cos&igrave;</FONT> <BR>
<FONT COLOR="#ff0000" SIZE=-1>Win98: Si! Mi stai sui marroni</FONT> <BR>
<FONT SIZE=-1>Utente: Cio&egrave;, fammi capire. T'ho comprato solo perch&eacute;
mi rompessi il cazzo?</FONT> <BR>
<FONT COLOR="#ff0000" SIZE=-1>Win98: Bravo!!! Hai completamente compreso
la strategia Microsoft</FONT> <BR>
<FONT SIZE=-1>Utente: Ah sii? La mettiamo cos&igrave;? Guarda che se non
mi lasci lavorare, ti collego al sito di Emilio Fede</FONT> <BR>
<FONT COLOR="#ff0000" SIZE=-1>Win98: Non mi fai paura. Ti posso friggere
in ogni momento il cervello con le radiazioni del monitor</FONT> <BR>
<FONT SIZE=-1>Utente: Ok allora beccati questo virus[?]</FONT> <BR>
<FONT COLOR="#ff0000" SIZE=-1>Win98: HA! HA! HA! Questo virus lo fermava
anche il Norton Antivirus; Di</FONT><FONT SIZE=-1> </FONT><FONT COLOR="#ff0000"
 SIZE=-1>addio alla tua cara 3Dfx</FONT> <BR>
<FONT SIZE=-1>Utente: No...No, ti prego la 3Dfx non ti ha fatto niente,
lasciala stare</FONT> <BR>
<FONT COLOR="#ff0000" SIZE=-1>Win98: Hey! Guarda che bella RAM ancora [?]</FONT>
<BR>
<FONT COLOR="#0000ff" SIZE=-1>MrLinux: Non ti preoccupare utente Microsoft.
Ora ci sono qua io</FONT> <BR>
<FONT SIZE=-1>Utente: Mitico, &egrave; arrivato Mr Linux</FONT> <BR>
<FONT COLOR="#ff0000" SIZE=-1>Win98: Mr Linux, non mi fai paura, ricorda
quello che &egrave; successo alla [?]</FONT> <BR>
<FONT COLOR="#0000ff" SIZE=-1>MrLinux: Mr Windows98, il tuo kernel ha le
ore contate</FONT> <BR>
<FONT SIZE=-1>Utente: Vai Mr Linux! Frammentalo</FONT> <BR>
<FONT COLOR="#0000ff" SIZE=-1>MrLinux: Lascia subito andare quella 3Dfx
innocente</FONT> <BR>
<FONT COLOR="#ff0000" SIZE=-1>Win98: Ok Mr Linux... Hai vinto, ma ricorda:
al mondo ci sono ancora milioni di utenti Microsoft che aspettano solo Windows98</FONT>
<BR>
<FONT COLOR="#0000ff" SIZE=-1>MrLinux: Non farti troppe illusioni</FONT>
<BR>
<FONT SIZE=-1>Utente: Grazie Mr Linux, hai salvato la vita alla mia 3Dfx</FONT>
<BR>
<FONT COLOR="#0000ff" SIZE=-1>Mr Linux: No... Non devi ringraziarmi, ex
utente Microsoft. Ricorda solo che la speranza &egrave; l'ultima a lasciarti</FONT>
<BR>
<FONT SIZE=-1>Utente: Me lo ricorder&ograve;, me lo ricorder&ograve; per
tutta la vita. Arrivederci Mr Linux.<BR>
</FONT></P>

<P><FONT SIZE=-1>Note:</FONT> <BR>
<FONT SIZE=-1>Quando vedete il simboletto: [?] vuol dire che l&igrave; c'era
una parola che non siamo riusciti a comprendere
<p>
Guido Revello<br>
<a href="mailto:grevello@freemail.it">grevello@freemail.it</a>
</div>
</FONT>
</BODY>
</HTML>
