<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.03 [fr] (Win95; I) [Netscape]">
   <TITLE>spehack2.htm</TITLE>
</HEAD>
<BODY>
<IMG SRC="ra.gif" HEIGHT=48 WIDTH=48>
<CENTER><FONT SIZE=+4>HACKER 2020</FONT></CENTER>

<CENTER><FONT SIZE=+2>(SPECIALE VERSION)</FONT></CENTER>
&nbsp;
<BR>&nbsp;
<BR>&nbsp;
<BR>&nbsp;
<BR>&nbsp;
<BR>&nbsp;
<BR>&nbsp;

<P>1&deg;/ Introduction. --> By Clad Strife
<BR>2&deg;/ Introduction aux mod&egrave;les OSI. --> By Clad Strife
<BR>3&deg;/ Les fonctions des couches OSI et le r&eacute;seau. --> By Clad
Strife
<BR>4&deg;/ les Routeurs et leurs hacking. --> By Clad Strife
<BR>5&deg;/ L'IP spoofing. --> By Bond introduit par Clad Strife
<BR>6&deg;/ Le social engeneering. --> By Clad Strife
<BR>&nbsp;
<CENTER><FONT SIZE=+2>1&deg;/ INTRODUCTION</FONT></CENTER>

<CENTER></CENTER>
&nbsp;&nbsp; Alors ce que vous allez trouver dans ce zine vous n'allez
pas devoir l'appliquer etc... Pour preuve: un de mes potes travaille au
SCSSI (Service Central de la S&eacute;curit&eacute; des Syst&egrave;mes
d'Information ), d'ailleurs le jour ou il va lire ce fichier il va m'd&eacute;chirer
et j'vais m'faire coffrer, et donc ce gars j'peux vous dire qu'il va pas
s'f'aire chier si vous faites des bidouilles... Bon j'vais pas vous faire
chier avec mes conneries...
<BR>Tout ce que je vousconseille c de ne pas appliquer ce qui est &eacute;crit
ci dessous... d'ailleurs je donnerais plus d'informations techniques que
d'astuces de hacking... Va falloir apprendre &agrave; s'demmerder... d'ailleurs
si tu lis ce txt c que z'&ecirc;tes d&eacute;j&agrave; pas mal avanc&eacute;.
<BR>Courte intro... au fait (j'dis &ccedil;a histoire de meubler la place
qui m'reste de place), ci ce texte est en fran&ccedil;ais c parce que les
francophone en ont ras-l'bol de devoir lire des txt en english: la moiti&eacute;
des gens pigent rien (j'en sais quelquechose). Bon ce txt est&nbsp; prot&eacute;g&eacute;
par le copyright: tu peux le modifier, &eacute;crire dessus, gribouiller,
m&ecirc;me chier dessus si &ccedil;a t'amuses, mais tu mets mon nom ok???
Nan parce que sinon &ccedil;a vous f'rais pas chier vous d'savoir que votre
boulot n'est pas reconnu? *comment &ccedil;a non???* :))
<BR>Putain... j'vous emmerde avec mes paroles de merde alors que j'parle
m&ecirc;me pas de trucs int&eacute;ressants??? Ok bon, c'est partii!
<CENTER></CENTER>

<CENTER><FONT SIZE=+2>2&deg;/ Introduction aux mod&egrave;les OSI</FONT></CENTER>

<CENTER></CENTER>
&nbsp;&nbsp; Bon sang: faut que je r'devienne s&eacute;rieux l&agrave;...
Nan parcequ'en fait &ccedil;a va devenir cors&eacute;!!! Qu'est-ce qu'un
mod&egrave;le OSI... C'est un plan de base misau point par l'ISO (International
Standard Organization), qui d&eacute;finit comment seront envoy&eacute;s
les packets d'informations... Ce mod&egrave;le est compos&eacute; de 7
couches: la couche d'application, de pr&eacute;sentation, de session, de
transport, la couche r&eacute;seau, la couche liaison et la couche physique!
J'vais pas d&eacute;crire &agrave; quoi sert chaque couche sinon t'en as
pour des heures &agrave; l'finir ce txt. Alors on va juste s'int&eacute;resser
aux 3 couches les plus basses (la 1, la 2 et la 3), donc la couche reseau,
la couche liaison, la physique. Chacune de ces trois couches est en communication
avec les autres couches de m&ecirc;me nom d'un autre mod&egrave;le OSI.
<UL>
<LI>
La couche r&eacute;seau: c'est ce qui permet de fournir les moyens d'&eacute;tablir,
de maintenir et de lib&eacute;rer des connexions de r&eacute;seau. Elle
permet l'acheminement des packets d'informations via le r&eacute;seau.
L'adressage du r&eacute;seau est fait par les routeurs. Donc les infos
passent par les routeurs eux-m&ecirc;mes... En devenant l'administrateur
d'un routeur on peut en juger que: on peut recevoir les informations, d&eacute;tourner
l'adressage du r&eacute;seau, etc... En devenant l'administrateur d'un
routeur on devient "l'BigBosss" :))</LI>

<LI>
œ La couche Liaison et la couche Physique nous int&eacute;resse moins vu
que c'est pas l&agrave; qu'on y trouvera les routeurs ^_^</LI>
</UL>
Voil&agrave; comment se pr&eacute;sente le mod&egrave;le OSI en liaison
avec un autre mod&egrave;le OSI:

<P><FONT COLOR="#FF0000">=================&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
=================</FONT>
<BR><FONT COLOR="#FF0000">| 7 APPLICATION&nbsp;&nbsp;&nbsp;&nbsp; |&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
|&nbsp;&nbsp; APLICATION&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
|</FONT>
<BR><FONT COLOR="#FF0000">=================&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
=================</FONT>
<BR><FONT COLOR="#FF0000">| 6 PRESENTATION&nbsp; |&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
|&nbsp;&nbsp; PRESENTATION&nbsp;&nbsp;&nbsp;&nbsp; |</FONT>
<BR><FONT COLOR="#FF0000">=================&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
=================</FONT>
<BR><FONT COLOR="#FF0000">|&nbsp;&nbsp; SESSION&nbsp;&nbsp; 5&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
|&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
|&nbsp;&nbsp; SESSION&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
|</FONT>
<BR><FONT COLOR="#FF0000">=================&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
=================</FONT>
<BR><FONT COLOR="#FF0000">|&nbsp;&nbsp; TRANSPORT 4&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
|&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
|&nbsp;&nbsp; TRANSPORT&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
|</FONT>
<BR><FONT COLOR="#FF0000">=================&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
=================</FONT>
<BR><FONT COLOR="#FF0000">|&nbsp;&nbsp; RESEAU&nbsp;&nbsp;&nbsp; 3&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
|------------|&nbsp;&nbsp; RESEAU&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
|</FONT>
<BR><FONT COLOR="#FF0000">=================&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
=================</FONT>
<BR><FONT COLOR="#FF0000">|&nbsp;&nbsp; LIAISON&nbsp;&nbsp; 2&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
|------------|&nbsp;&nbsp; LIAISON&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
|</FONT>
<BR><FONT COLOR="#FF0000">=================&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
=================</FONT>
<BR><FONT COLOR="#FF0000">|&nbsp;&nbsp; PHYSIQUE&nbsp; 1&nbsp;&nbsp;&nbsp;&nbsp;
|------------|&nbsp;&nbsp; PHYSIQUE&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
|</FONT>
<BR><FONT COLOR="#FF0000">=================&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
=================</FONT>

<P>Bon, un packet d'information va passer par chaque couche avant d'&ecirc;tre
envoy&eacute; via les couches de communications... Ces informations seront
encapsul&eacute;es (=enferm&eacute;es), dans une "enveloppe"... Le protocole
(le protocole X25 en fait) va d&eacute;finir la fa&ccedil;on dont l'adresse
va &ecirc;tre &eacute;crite sur l"enveloppe"... En fait un protocole d&eacute;finit
les r&egrave;gles d'adressage du packet de donn&eacute;es.
<BR>&nbsp;
<CENTER><FONT SIZE=+2>3&deg;/ Les fonctions des couches OSI et le r&eacute;seau</FONT></CENTER>

<CENTER></CENTER>
Bon je voulais passer les fonctions des couches mais mon pote me gueule
dessus pour que j'te raconte leurs fonctions.
<BR>on va m&ecirc;me d&eacute;finir celle RESEAU, m&ecirc;me que &ccedil;a
a &eacute;t&eacute; fait ci-haut. Mais abr&eacute;geons ^_^:
<UL>
<LI>
&nbsp;La couche Application: elle g&egrave;re le transfert d'informations
entre programmes.</LI>

<LI>
&nbsp;La couche Pr&eacute;sentation: elle s'occupe de la mise en forme
des textes et des conventions d'affichage.</LI>

<LI>
&nbsp;La couche Session: elle s'occupe de l'&eacute;tablissement, de la
gestion, de la coordination des communications.</LI>

<LI>
&nbsp;La couche Transport: elle g&egrave;re la remise correcte des informations.</LI>

<LI>
&nbsp;La couche R&eacute;seau: elle d&eacute;termine les routes de transport
et s'occupe du traitement et du transfert de messages.</LI>

<LI>
&nbsp;La couche Liaison de donn&eacute;es: elle s'occupe de du codage,
de l'adressage, et de la transmission des informations.</LI>

<LI>
&nbsp;La couche Physique: elle g&egrave;re les connections mat&eacute;rielles.</LI>
</UL>
&nbsp;
<CENTER><FONT SIZE=+2>4&deg;/ les Routeurs et leurs hacking</FONT></CENTER>

<CENTER></CENTER>
&nbsp;&nbsp; OUEEEEE! enfin du pur de dur! Le routeur... Comme expliqu&eacute;
ci-haut il permet d'indiquer par ou va passer le r&eacute;seau... (Cependant
certaines entreprises offres d'autres services que vous pourrez consulter
sur le net...) du moins c'est cette info qui nous int&eacute;resse car
en devenant l'administrateur d'un routeur il est &eacute;vident qu'on peut
changer l'adressage du r&eacute;seau, et ainsi de r&eacute;cup&eacute;rer
les informations de la plus haute importance * fantasmez pas l&agrave;!
:) *, mais en devenant l'administrateur du r&eacute;seau on est quasiment
le MASTER DU SYSTEME!!!
<BR>YEAH!!! TU KIFFES CA HEIN? Hehem... bon le tout pour trouver l'adresse
d'un routeur est d'abord de trouver le r&eacute;seau nan? tr&egrave;s simple...
z'avez l'url: www.perdu.com, merde comment avoir la liste des routeurs
de perdu.com? Vous tracez sous dos www.perdu.com de mani&egrave;re &agrave;
avoir l'adresse IP du site: 207.181.252.100. Sur cette IP seul 207.181.252
nous int&eacute;resse: c &ccedil;a qui d&eacute;finit l'adresse du r&eacute;seau...
Ainsi on va scanner tout ce qui est sur ce r&eacute;seau. De nombreux programmes
font &ccedil;a (le meilleur: WS PING PRO PACK sur http://www.ipswitch.com),
et on en scannant uniquement ce qui est SNMP on a:
<BR><FONT COLOR="#000099">207.181.252.095 SNMP</FONT>
<BR><FONT COLOR="#000099">207.181.252.161 SNMP</FONT>
<BR><FONT COLOR="#000099">207.181.252.191 SNMP</FONT>
<BR><FONT COLOR="#000099">207.181.252.192 SNMP</FONT>
<BR><FONT COLOR="#000099">207.181.252.193 SNMP</FONT>
<BR><FONT COLOR="#000099">207.181.252.223 SNMP</FONT>
<BR>&nbsp;

<P>Pas trop puissant &ccedil;a? Bien sur j'vous d&eacute;conseille encore
une fois de d&eacute;conner avec &ccedil;a... enfin:&nbsp; vous voil&agrave;
pr&eacute;venu. Maint'nant si vous vous en p&eacute;tez les couilles :))
Eh oui car chaque connexion OU tentative de connexion est enregistr&eacute;e
avec votre IP... Rien n'est simple... C'est pour &ccedil;a qu'il existe
le spoofing!!! K&eacute;zako??? Vous voulez l'savoir??? Bof, c simple,
mais j'vais vous expliquer &ccedil;a &agrave; la fin de ce chapitre. Now
je vais vous expliquer:
<BR>- comment te connecter &agrave; un routeur.
<BR>- sous quel environnement.
<BR>- que faire sur le routeur.
<BR>&nbsp;

<P>BON... On s'connait bien maintenant: j'vais vous tutoyer!
<BR>Comment se connecter &agrave; un routeur: c simple. Une fois que t'as
trouv&eacute; l'adresse d'un routeur: tu te connectes &agrave; lui via
telnet sur le port SNMP. Ensuite tu vas devoir utliser TES m&eacute;thodes
(chacun ses m&eacute;thodes) pour trouver les passwords et les pass. Moi
pour les logins je fais un lookup de l'adresse IP, pour les pass utilisez
l'art du sniffing. Sous quel environnement??? (j'lavais oubli&eacute; cette
question l&agrave;!) telnet bien sur!
<BR>Que faire sur le routeur, bah ce que t'as envie... en fait j'pensais
inclure ici une partie du texte de NeurAlien, mais il pr&eacute;f&egrave;re
qu'on l'oublie alors j'mets rien du tout (le mieux est de taper help pour
avoir la liste d'options).
<BR>&nbsp;
<CENTER><FONT SIZE=+2>5&deg;/ L'IP spoofing</FONT></CENTER>

<CENTER></CENTER>
Bon l'IP spoofing &ccedil;a consiste en koi? Prenons "Marcel" qui a un
compte sur la Machine A, et "Ren&eacute;" un compte sur la Machine B. "Ren&eacute;"
arrive &agrave; se connecter &agrave; la Machine B sans proc&eacute;dure
d'indentification car celle-ci reconnait son IP! donc si "Marcel" veut
s'ramener sur la Machine B va falloir qu'il se fasse identifier comme &eacute;tant
"ren&eacute;", prendre son IP koi. Now, c &agrave; ton tour Bond!!!

<P>ADD-On de "Comment hacker les routeurs"
<BR>&nbsp;&nbsp;&nbsp;&nbsp; ||//&not;By Bond&not;\\||

<P>Intro:
<BR>Bon, dans ce txt, je vais vous parlez de cette technique!
<BR>&nbsp;

<P>IP Spoofing:
<BR>Oky, alors c quoi l'IP spoofing?
<BR>Et bien c une m&eacute;thode "d'agression" tr&egrave;s dangereuses
pour les r&eacute;seaux!
<BR>Un paquet d'IP contient, outre son v&eacute;ritable msg (mail, telnet,
...), tout plein de donn&eacute;e
<BR>n&eacute;cessaires au transfert de donn&eacute;es entre 2PC. Donc si
je veux m'attaquer
<BR>&agrave; un ordi dans un r&eacute;seau prot&eacute;g&eacute; par un
firewall, je vais envoyer un
<BR>paquet IP, mais je vais y donner l'adresse IP d'un poste qui se trouve
<BR>dans le meme r&eacute;seau. (j'vais vous expliquer comment on fais
ca plus tard)
<BR>Alors quand le paquet arrive vers le firewall, ce dernier va v&eacute;rifier
<BR>l'adresse de l'&eacute;xp&eacute;diteur, et comme l'adresse que g "falcifi&eacute;e"
est celle
<BR>d'un PC dans le r&eacute;seau, ben le firewall va les laisser passer!
<BR>&nbsp;

<P>voici un exemple de spoofing de mail, mais &ccedil;a ne marche probablment
plus (Note de Clad)

<P>--------------------------------------------------------------------------------

<P>To inet-access@earth.com
<BR>From "Philip J. Nesser II" &lt;pjnesser@martigny.ai.mit.edu>
<BR>Date Fri, 18 Apr 1997 01:34:41 -0400 (EDT)
<BR>In-Reply-To &lt;199704180202.TAA11037@rgate.metricom.com> from "Matthew
James Gering" at Apr 17, 97 06:59:58 pm
<BR>Phone (206)481-4303
<BR>Reply-To inet-access@earth.com
<BR>Sender inet-access@earth.com
<BR>Us-Nail 13501 100th Ave NE, Suite 5202, Kirkland, WA 98034

<P>--------------------------------------------------------------------------------

<P>Matthew James Gering supposedly said:
<BR>>
<BR>> Would not filtering the outgoing packets on a particular network
such that
<BR>> only packets that have source addresses that originate on that network
<BR>> would be allowed to pass, prevent the spoofing of outside addresses?
<BR>>
<BR>> Is there any negative impact of doing so? If not, why is this not
common
<BR>> practice?
<BR>>
<BR>> ie. If I own xyz/24 and my upstream connection(s) filters to permit
only
<BR>> xyz/24 through my link(s), I could not hide the souce network of
my
<BR>> packets.
<BR>>
<BR>>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Matt
<BR>>
<BR>&nbsp;

<P>Matt,

<P>Its a good idea in general.&nbsp; You might even say its a network friendly
<BR>practice.&nbsp;&nbsp;&nbsp; You can see Paul Ferguson's draft at
<BR>ftp://ds.internic.net/internet-drafts

<P>If you happen to use IP mobility support its a problem, but other than
that
<BR>go for it.
<BR>&nbsp;

<P>--->&nbsp; Phil

<P>============================== ISP Mailing List ==============================
<BR>Email ``unsubscribe'' to inet-access-request@earth.com to be removed.
<BR>Changed email addresses? Use the ``unsubscribe &lt;my_old_address@foo.dom>''
<BR>form.
<BR>----------------------------------------------------------------------------------
<BR>----------------------------------------------------------------------------------

<P>Ok c compris?

<P><B><U><FONT COLOR="#FF0000">GREETINGS!!!!</FONT></U></B>
<BR>Enfin le truc que all people veut voir!!!
<BR>Special Thanks to: Thorgal, Bond, H117.
<BR>Je t'embrasse bien fort Nejda!
<BR>Salut &agrave; Mickey the screamer, facker adidas &lt; qui a pas fait
grand chose pour m'aider :))))) >, wanadoo et Bill gates (t'y as cru hein????)!
<BR>&nbsp;
<CENTER><FONT SIZE=+2>6&deg;/ Le social engeneering</FONT></CENTER>

<CENTER></CENTER>
&nbsp;&nbsp; Ouais, on a d&eacute;j&agrave; vu ce mot plein de fois mais
on sait ni ce que c'est ni comment faire hein? Ben j'suis l&agrave; pour
&ccedil;a! Le social engeneering consiste en gros &agrave; se faire passer
pour quelqu'un dans le but d'obtenir de bonnes informations. Un exemple:
Vous faites un lookup du site de la soci&eacute;t&eacute; Daoum, alors
vous vous dites: chic! j'vais essayer de m'amuser avec cette soci&eacute;t&eacute;
rentrer sur leurs ordis etc...
<BR>Donc vous allez prendre le tel de l'administrateur (appelons le Mr
Bilbao) de tout ce petit monde et vous allez vous faire passer pour un
autre administrateur, ou quelqu'un d'autre que Mr Bilbao pourrait connaitre.
Voil&agrave; &agrave; quoi devrait ressembler la conversation au t&eacute;l&eacute;phone:
<BR>Vous - All&ocirc;, Mr Bilbao?
<BR>Mr Bilbao - OUI?
<BR>- Voil&agrave; Mr Teteau (l'autre administrateur) m'a charg&eacute;
de v&eacute;rifier la s&eacute;curit&eacute; du routeur dont l'IP est:
154.154.154.154, et il a cependant omis de me remettre les passwords...
Auriez vous l'obligence de me les donner pour que je puisse me mettre au
travail?
<BR>- Vous ne pouvez pas les demander &agrave; monsieur Teteau lui-m&ecirc;me?
<BR>- J'ai essay&eacute; mais il est absent voil&agrave; bient&ocirc;t
plus d'un jour. Hors j'ai un d&eacute;lai imparti, comme &eacute;crit dans
mon contrat, comprenez donc.
<BR>- d'accord notez...

<P>Et c'est dans la poche, sinon sachez que &ccedil;a peut se g&acirc;ter,
on pourra vous r&eacute;pondre:
<BR>- On ne m'en a jamais parl&eacute;
<BR>- Mr Teteau qui est &agrave; cot&eacute; de moi nie ces faits
<BR>- rappelez le...
<BR>- Ecoutez je sais tr&egrave;s bien que ce ne sont que des mensonges.
<BR>- Je vous passe monsieur Teteau
<BR>Ca c'est les r&eacute;ponses qui vont vous niquer!!!
<BR>A chaque chose son astuce: une fois vous serez le stagiaire ou vous
travaillerez au SCSSI, faites marcher votre imagination... La r&eacute;ussite
de votre projet ne tient qu'&agrave; vous... derni&egrave;re indication,
si vous ne voulez pas vous faire rep&eacute;rer par le boitier France Telecom
qui indique votre N&deg; de tel tapez le 3651 avant de taper le tel du
gars, ayez une voix d'adulte et... Soyez convaincants!

<P>Il est fini mon zine!! Court mais bel et bien fini!!! Si vous voulez
m'&eacute;crire: <A HREF="mailto:clad_strife@hotmail.com">clad_strife@hotmail.com</A>
<BR>N'oubliez jamais ceci: <FONT COLOR="#FF0000">NE COMMENCE JAMAIS A T'ARR&Ecirc;TER
ET NE T'ARR&Ecirc;TE JAMAIS DE COMMENCER (BY THORGAL).</FONT>
<DIV ALIGN=right><IMG SRC="bigepee.gif" HEIGHT=189 WIDTH=249></DIV>

</BODY>
</HTML>
