<html>
<head>
<title>Raza Mexicana EZine 12 - Robin hood de la red</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body TopMargin=0 LeftMargin=1 bgcolor="#FFFFFF" text="#000000">
<table width="100%" border="0" cellpadding="0" cellspacing="0">
  <tr> 
    <td width="110" background="Fondo.jpg" height="57">&nbsp;</td>
    <td width="" height="57"><b><font size="+3">Robin hood de la red</font></b><br>
      <i><font size="-1">Por Vlad</font></i></td>
  </tr>
  <tr> 
    <td width="110" background="Fondo.jpg" height="149">&nbsp;</td>
    <td width="" height="149"> 
      <p>&nbsp;</p>
      <p><b><font color="#0000FF">Introducci&oacute;n.</font></b></p>
      <p align="justify">Tendr&aacute; poco mas de tres a&ntilde;os cuando me entere 
        del lanzamiento de una nueva herramienta de desarrollo de la entonces 
        borland international, la presentaci&oacute;n estuvo fant&aacute;stica, 
        y otorgaron algunos premios a los asistentes que contestaran algunas preguntas, 
        corr&iacute; con la suerte de no saber la respuesta correcta de ninguna 
        de las preguntas, as&iacute; que sal&iacute; de ah&iacute; con tan solo 
        la inquietud de aprender mas y un CD que conten&iacute;a la versi&oacute;n 
        de evaluaci&oacute;n de la herramienta en su versi&oacute;n est&aacute;ndar 
        por fabulosos 30 d&iacute;as, pues como se han de imaginar esos 30 d&iacute;as 
        no me dejaron ver todo el potencial ni me dejaron aprender bien el funcionamiento 
        de la herramienta (ya que por cuestiones escolares y de trabajo pues no 
        pod&iacute;a estar todo el tiempo que quer&iacute;a frente a la PC); para 
        eso entonces en cierta avenida muy conocida de la ciudad de M&eacute;xico 
        pod&iacute;a conseguir una copia de la herramienta por la fabulosa cantidad 
        de 150 Pesos (por ah&iacute; de 14Dlls), pero algo me dec&iacute;a que 
        no era muy correcto engordarle el caldo al wey que me vend&iacute;a los 
        CDS, as&iacute; que me quede en el rezago.<br>
        <br>
        Hace algunos meses me decid&iacute; a comprarla legalmente, mande un correo 
        electr&oacute;nico, la respuesta llego despu&eacute;s de dos d&iacute;as, 
        la licencia me sal&iacute;a en mas de 2000 Dlls, cantidad que no tengo 
        =( , estaba tan decepcionado que no intente buscar alguna versi&oacute;n 
        acad&eacute;mica ni nada por el estilo, un amigo la iba a comprar pero 
        pues no. Hoy, despu&eacute;s de tres a&ntilde;os la consegu&iacute; en 
        un lugar de warez y ya estoy programando en ella =).<br>
        <br>
        Se que todos se preguntaran el porque de esta historia, bueno, se que 
        como yo hay muchos estudiantes que no tienen el suficiente dinero para 
        comprar una licencia o una versi&oacute;n acad&eacute;mica o un CD pirata 
        (mala idea), pero para estos casos en donde los recursos son menores que 
        las necesidades pues contamos con la internet, y en especifico existen 
        esos seres llamados com&uacute;nmente wareros y crackers.<br>
        <br>
        <font color="#0000FF"><b>El Sheriff de Nottingham.</b></font><br>
        <br>
        Por ah&iacute; de 1988 un grupo de empresas preocupadas por proteger sus 
        programas de computo de la pirater&iacute;a se unieron formando la BSA 
        (Business Software Alliance) cuya funci&oacute;n principal es vigilar 
        el copyright del software. En la actualidad BSA esta presente en mas de 
        60 pa&iacute;ses y algunos de sus miembros mas importantes destacan : 
        Macromedia, Symantec, Adobe, Autodesk, Microsoft, Corel, IBM, Intel, Compaq, 
        Apple, Network Associates entre otros.<br>
        <br>
        <font color="#0000FF"><b>Los ricos son mas ricos y los pobres... que se 
        chinguen.</b></font><br>
        <br>
        El precio actual del software esta por las nubes y en ocasiones cuesta 
        mas el mismo software que el hardware, la mala o la deficiente calidad 
        en el, hace que en periodos muy cortos exista un parche o un servicepack 
        para remediar el problema y en ocasiones nuevas versiones se ven liberadas 
        antes que podamos acoplarnos en la totalidad a la herramienta. El precio 
        por upgrade (Actualizaci&oacute;n) es considerablemente inferior que si 
        lo compr&aacute;ramos por primera vez, pero aun as&iacute; el desembolso 
        que este representa solo es costeable para empresas y no para particulares 
        y menos cuando el particular es un estudiante de clase media-baja (que 
        en definitiva somos la mayor&iacute;a).<br>
        <br>
        <font color="#0000FF"><b>Atole con el dedo a los aldeanos.</b></font><br>
        <br>
        Las versiones acad&eacute;micas son la alternativa para el estudiante?, 
        pues depende del tipo de estudiante porque aun as&iacute; la licencia 
        es cara y digo que es cara porque al fin de cuentas como estudiantes que 
        somos deber&iacute;amos de tener acceso a los programas mas actuales que 
        al fin de cuentas el d&iacute;a de ma&ntilde;ana seremos los que propongamos 
        o los que trabajaremos con ellas. Aunque en definitiva, si mas gente comprara 
        software original, el precio de este se reducir&iacute;a, pero para que 
        pase eso pues yo creo que todav&iacute;a falta.<br>
        <br>
        <font color="#0000FF"><b>La corte del Rey.</b></font><br>
        <br>
        Detr&aacute;s de tu programa favorito existe una lista de personas que 
        intervienen para que tu puedas disfrutarlo en tu PC:<br>
        <br>
        -Vendedor minorista (tiendas de autoservicio, locales)<br>
        -Vendedor Mayorista (Grandes importadores, dir&iacute;a nombres pero no 
        lo har&eacute;)<br>
        -Exportadores (todav&iacute;a mas grandes que los mayoristas)<br>
        -Empresa de producci&oacute;n (donde se hacen los CDS, manuales, cajas)<br>
        -Codificadores(los que empujan las teclas)<br>
        -Programadores (los que hacen los sue&ntilde;os realidad)<br>
        -Dise&ntilde;adores (los que sue&ntilde;an)<br>
        -Lideres de proyecto (los que mandan)<br>
        -Director de proyectos (el que dice lo que se quiere hacer)<br>
        -Due&ntilde;o de la empresa (el que pone la cara, la lana y recoge mas 
        lana)<br>
        <br>
        Probablemente me salte algunos pero con estos son suficiente para que 
        te des una idea de la cantidad de personas que intervienen, y ahora te 
        hago la pregunta de los 64mil... quien deber&iacute;a ganar mas?? y quien 
        es el que gana mas??. OK, pues creo que todos son importantes, pero seg&uacute;n 
        esto de los derechos intelectuales, pues el que deber&iacute;a ganar mas 
        es el de la idea y el realizador de la misma, pero esto en la realidad 
        no es as&iacute;, como la vez?<br>
        <br>
        Actualmente muchas empresas est&aacute;n empezando a vender online las 
        licencias, quitando a los intermediarios y abaratando el precio del software 
        =). Buena idea y mala idea, buena porque le pegan al precio y nos ayudan 
        a conseguirlo de una manera mas r&aacute;pida y mala idea porque ellos 
        pueden perder dinero siendo timados por alguna persona XDDD (Un saludo 
        a los amantes del carding).<br>
        <br>
        <font color="#0000FF"><b>Quit&aacute;ndole a los ricos y d&aacute;ndoselo 
        a los pobres.</b></font><br>
        <br>
        Si tienes ganas de aprender pero por cuestiones econ&oacute;micas no puedes 
        adquirir una licencia pues ah&iacute; te van las alternativas:<br>
        <br>
        -software acad&eacute;mico, limitado en cuesti&oacute;n de funcionalidad. 
        <br>
        -Las versiones de evaluaci&oacute;n, las cuales en ocasiones limitan la 
        funcionalidad y en otras dejan que experimentes todo su potencial por 
        periodos de 15, 30 o mas d&iacute;as. <br>
        -La pirater&iacute;a de lucro, la llamo as&iacute;, porque existe un vendedor 
        y un comprador (P&eacute;sima idea).<br>
        -Freeware. Software que se puede utilizar sin licencias, algunas veces 
        no son tan espectaculares como los que hacen las grandes empresas , pero 
        son una excelente alternativa<br>
        -GNU. No aplica mucho para el Windows pero para los linuxeros si.<br>
        -La pirater&iacute;a de trueque y los cracks. he aqu&iacute; el tema de 
        este articulo =) <br>
        <br>
        <font color="#0000FF"><b>Esto si calienta.</b></font><br>
        <br>
        Las grandes empresas est&aacute;n tomando el control de todo el mercado, 
        los grandes monopolios controlan los est&aacute;ndares, de tal manera 
        que para poder estar en el juego debes de jugar con sus juguetes y si 
        usas un similar pues simplemente estas fuera o no eres compatible. Y para 
        estar dentro de la jugada tienes que pagar el precio que te imponen, lo 
        quieras o no, porque no hay un similar que cubra con tus necesidades y 
        si lo hay, es muy probable que los Gigantes lo absorban o lo destruyan. 
        He aqu&iacute; lo que me molesta, los ricos cada hora son mas ricos y 
        aun as&iacute; se ponen ro&ntilde;osos porque algunos de nosotros usamos 
        sus productos sin licencia, siendo que el d&iacute;a de ma&ntilde;ana 
        por el mismo monopolio que tienen pues tendremos que usar sus herramientas 
        en el mercado laboral.<br>
        <br>
        <font color="#0000FF"><b>La lucha.</b></font><br>
        <br>
        Ahora bien, existe la guerrilla inform&aacute;tica, la que lucha por la 
        libertad del software, porque mas personas tengan acceso a los programas, 
        porque j&oacute;venes estudiantes tengan la oportunidad de tener en sus 
        manos las ultimas versiones de herramientas, los wareros y los crackers, 
        ech&eacute;mosles un vistazo para ver quienes son:<br>
        <br>
        Wareros<br>
        - vive colgado a la red<br>
        - siempre esta al pendiente de las nuevas versiones<br>
        - guarda cualquier software que llega a sus manos aunque sean cosas in&uacute;tiles<br>
        - tiene cuentas de sistemas de almacenamiento masivo gratuito<br>
        <br>
        Crackers<br>
        - Alto nivel de conocimientos en lenguajes de programaci&oacute;n como 
        el c, C++ y el assambler<br>
        - Manejo de herramientas : debugers, desensambladores, editores hexadecimales, 
        logers, monitores de eventos, etc.<br>
        - Conocimiento del sistema operativo<br>
        <br>
        Esta es la guerrilla que lucha por repartir la riqueza o los robins hood 
        de la red como les llamo yo. Por una parte los wareros consiguen e intercambian 
        software, sin lucro, solo con el fin de ayudar y ayudarse, por el otro 
        lado los crackers quienes buscan software restringido en su funcionalidad 
        y como reto intelectual violan sus algoritmos para poder hacerlo funcional 
        en su totalidad y como bono adicional, distribuyen de manera gratuita 
        el llamado crack o parche.<br>
        <br>
        <font color="#0000FF"><b>Despedida.<br>
        </b></font><br>
        Ahora, si crees que este mundo es injusto, pues d&eacute;jame decirte 
        que no estas solo, yo te invito a que tomes tu teclado y te formes en 
        las filas, que te tomes unos minutos para difundir la cultura, desarrolla, 
        crea, comparte.<br>
        <br>
        Usa el software con responsabilidad, si estas de alguna manera generando 
        ingresos con su uso pues c&oacute;mpralo, sirve que te dan soporte t&eacute;cnico 
        y cosas as&iacute;, si estas vendiendo software ilegalmente pues pi&eacute;nsalo 
        mejor, si eres estudiante y quieres aprender pues en la red est&aacute;n 
        las respuestas y las herramientas, solo es cuesti&oacute;n de que busques. 
        Y finalmente: que tu hambre de conocimientos no la limite los monopolios 
        ni la situaci&oacute;n econ&oacute;mica.<br>
      </p>
      <table width="100%" border="0" cellspacing="0" cellpadding="0">
        <tr>
          <td>
            <div align="left"><a href="rm-12-02.htm"><img src="i.gif" width="88" height="30" border="0" alt="Fallas B&aacute;sicas NT4 y Win2000"></a></div>
          </td>
          <td>
            <div align="right"><a href="rm-12-04.htm"><img src="d.gif" width="88" height="30" border="0" alt="Violaci&oacute;n De La Privacidad"></a></div>
          </td>
        </tr>
      </table>
      <p><br>
      </p>
    </td>
  </tr>
  <tr>
    <td width="110" background="Fondoa.jpg" height="57">&nbsp;</td>
    <td width="" height="57">
      <div align="right"><font size="-1"><b>Comentarios a :<a href="mailto:%20vlad@raza-mexicana.org"> 
        vlad@raza-mexicana.org</a></b></font></div>
    </td>
  </tr>
</table>
</body>
</html>
