<html>
<head>
<title>Raza Mexicana EZine 12 - The Applet Password Wizard</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body TopMargin=0 LeftMargin=1 bgcolor="#FFFFFF" text="#000000">
<table width="100%" border="0" cellpadding="0" cellspacing="0">
  <tr> 
    <td width="110" background="Fondo.jpg" height="57">&nbsp;</td>
    <td width="" height="57"><b><font size="+3">The Applet Password Wizard</font></b><br>
      <i><font size="-1">Por Vlad</font></i></td>
  </tr>
  <tr> 
    <td width="110" background="Fondo.jpg" height="149">&nbsp;</td>
    <td width="" height="149"> 
      <p align="justify"><br>
        Reciban un saludo desde este lado del mundo. El d&iacute;a de hoy veremos 
        el tipo de basura que nos venden para restringir a los usuarios usando 
        applets, abran sus mentes, respiren profundo y ah&iacute; vamos:<br>
        <br>
        <font color="#0000FF"><b>&iquest;Que es un applet?</b></font><br>
        <br>
        Antes que me empiece a alucinar pong&aacute;monos de acuerdo de que es 
        un applet. Por ah&iacute; de 1995 sale al mercado un nuevo lenguaje llamado 
        java, el cual se basa bastante en el ya conocido C++ pero con algunas 
        limitantes que dizque para hacerlo mas seguro, bueno, pues java con el 
        fin de ser multiplataformas genera un bytecode (una especie de c&oacute;digo 
        ejecutable). Ahora bien, el applet es un programa java que se carga del 
        WWW y que es ejecutado mediante un navegador web con compatibilidad java 
        (Internet Explorer, NetScape, etc).<br>
        <br>
        <b><font color="#0000FF">Identificando a la victima</font></b><br>
        <br>
        THE APPLET PASSWORD WIZARD es un producto de WWW.COFFEECUP.COM el cual 
        nos da la opci&oacute;n de &quot;proteger&quot; algunos URLs para que 
        solo ciertos usuarios tengan acceso a el (Por ejemplo: compartir a solo 
        tus conocidos ciertos archivos). Pues aunque usted no lo crea hay gente 
        que si lo usa y este es un ejemplo:<br>
        <br>
        <img src="rm-12-07-00.jpg" width="201" height="194"> <br>
        <br>
        <font color="#0000FF"><b>Ahora veamos el c&oacute;digo fuente del .htm</b></font><br>
        <br>
        <img src="rm-12-07-0.jpg" width="535" height="230"> </p>
      <p align="justify"> <br>
        <br>
        Los par&aacute;metros que env&iacute;a no nos dicen mucha cosa, todo esta 
        cifrado, as&iacute; que iremos a obtener el applet : applet CODE=&quot;joylock.class&quot;, 
        el archivo joylock.class se encuentra en el mismo directorio as&iacute; 
        que solo lo bajamos. En algunas ocasiones el mismo archivo .class necesita 
        otros archivos y para estar seguros la manera mas f&aacute;cil es bajando 
        la pagina y ejecutarla localmente para ver si corre bien. En esta ocasi&oacute;n 
        solo este archivo es necesario, si no fuera as&iacute; hay dos formas 
        de saber cuales son los archivos que hacen falta, la primera es observando 
        el error que nos da, si te dice algo como que le falta una clase &quot;FulanitaX&quot; 
        pues lo que haces es buscar el archivo FulanitaX.class (tienes que estar 
        pendiente a las may&uacute;sculas y min&uacute;sculas, recuerda que se 
        basaron en C para hacer java) en la misma direcci&oacute;n, la segunda 
        es descompilando el .class, pero eso lo vemos adelante.<br>
        <br>
        <font color="#0000FF"><b>Tomando el control</b></font><br>
        <br>
        Ya que hemos reproducido el ambiente y que lo tenemos localmente pues 
        ya estamos del otro lado, de aqu&iacute; en adelante es lo mas sencillo 
        del mundo =). Existen programas com&uacute;nmente llamados descompiladores 
        o dissamblers, los cuales regresan los bytecodes a lenguaje java =), la 
        ventaja significativa con estos programas y en si con los bytecode es 
        que nos dan el c&oacute;digo en java y no en otro lenguaje como sucede 
        por ejemplo con los descompiladores de programas windows que estos regresan 
        c&oacute;digo ensamblador; podr&iacute;a dejar este articulo aqu&iacute; 
        mismo, porque se que ya saben lo que se tiene que hacer, pero mejor no 
        me arriesgo y le sigo por si alguien esta dormido y no se entero.<br>
        <br>
        Pues de los descompiladores que conozco son: Mocha y JAD, los cuales los 
        puedes encontrar f&aacute;cilmente en la red, en lo particular prefiero 
        a JAD ya que no necesita el interprete java para ejecutarse.<br>
        <br>
        <font size="-1" face="Courier New, Courier, mono">f:\joy-c&gt;jad joylock.class<br>
        Parsing joylock.class... Generating joylock.jad<br>
        f:\joy-c&gt;_</font><br>
        <br>
        Sin ning&uacute;n problema =) , y para asegurarnos lo que podemos hacer 
        es renombrar el archivo .jad por .java y compilarlo, JAD generalmente 
        no falla, si estas usando Mocha y te marca errores intenta cambiando de 
        versi&oacute;n de JDK. Existen algunas formas de proteger nuestros applets 
        de estos programas pero en el caso de este applet pues no fue as&iacute; 
        (mal hecho) y en alguna parte del c&oacute;digo encontramos algo as&iacute;:<br>
        <br>
        <font face="Courier New, Courier, mono" size="-1">final void decript(String 
        s, int i, int j, int k, int l, int i1, boolean flag)</font><br>
        <br>
        as&iacute; es, justo lo que se imaginan, tenemos el fuente de la funci&oacute;n 
        con la cual son encriptados los par&aacute;metros, hacemos algunas modificaciones 
        sencillas:<br>
        <br>
        <img src="rm-12-07-0000.jpg" width="454" height="92"> <br>
        Comentamos la linea que nos manda el error y en su lugar mandamos que 
        se muestre la variable linkURL que es la que tiene el valor del URL desencriptado, 
        ahora lo compilamos y lo ejecutamos dandole cualquier password y cualquier 
        usuario: <br>
        <br>
        <img src="rm-12-07-000.jpg" width="194" height="181"> <br>
        <br>
        Hurra, tenemos el URL secreto =)<br>
        <br>
        Como ver&aacute;n pues no fue la gran cosa saltarnos esta restricci&oacute;n 
        y como este applet hay mas, as&iacute; que para la pr&oacute;xima vez 
        que te encuentres con una restricci&oacute;n pues ya tienes algunos conocimiento 
        &uacute;tiles para salt&aacute;rtela sin mayor problema y si pensabas 
        comprar este producto o alguno por el estilo pues ya tienes una raz&oacute;n 
        para no hacerlo.<br>
      </p>
      
      <table width="100%" border="0" cellspacing="0" cellpadding="0">
        <tr>
          <td>
            <div align="left"><a href="rm-12-06.htm"><img src="i.gif" width="88" height="30" border="0" alt="Desde La Realidad"></a></div>
          </td>
          <td>
            <div align="right"><a href="rm-12-08.htm"><img src="d.gif" width="88" height="30" border="0" alt="RMHT en el WWW"></a></div>
          </td>
        </tr>
      </table>
      <p>&nbsp;</p>
      </td>
  </tr>
  <tr>
    <td width="110" background="Fondoa.jpg" height="57">&nbsp;</td>
    <td width="" height="57">
      <div align="right"><font size="-1"><b>Comentarios a : <a href="mailto:vlad@raza-mexicana.org">vlad@raza-mexicana.org</a></b></font></div>
    </td>
  </tr>
</table>
</body>
</html>
