<html>
<head>
<title>Raza Mexicana EZine 12 - Desde La Realidad...</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body TopMargin=0 LeftMargin=1 bgcolor="#FFFFFF" text="#000000">
<table width="100%" border="0" cellpadding="0" cellspacing="0">
  <tr> 
    <td width="110" background="Fondo.jpg" height="57">&nbsp;</td>
    <td width="" height="57"><b><font size="+3">Desde La Realidad...</font></b><br>
      <i><font size="-1">Por Fatal</font></i></td>
  </tr>
  <tr> 
    <td width="110" background="Fondo.jpg" height="149">&nbsp;</td>
    <td width="" height="149"> 
      <p align="justify"><br>
        Atendiendo un par de correos y comentarios que nos han hecho llegar a 
        esta benem&eacute;rita organizaci&oacute;n con respecto a nuestra posici&oacute;n 
        como equipo y como &quot;insurgentes&quot;, &quot;guerrilleros&quot;, 
        &quot;mercenarios&quot; y &quot;grupo extremista&quot; (As&iacute; nos 
        han calificado en reiteradas ocasiones) referente al EZLN, el sub-comandante 
        Marcos y todo lo que hemos vivido en estos &uacute;ltimos meses en M&eacute;xico.<br>
        <br>
        Por principio de cuentas he de aclarar que papel jugamos nosotros como 
        organizaci&oacute;n y como mexicanos:<br>
        <br>
        - Raza-Mexicana se desvincula totalmente de el movimiento armado del Ejercito 
        Zapatista de Liberaci&oacute;n Nacional tal como se comprende, ni los 
        apoyamos ni estamos en contra.<br>
        <br>
        - Algunos de nuestros integrantes han expresado abiertamente a los medios 
        su simpat&iacute;a por este grupo armado, lo cual no debe en ning&uacute;n 
        momento entenderse como la aceptaci&oacute;n total de esta simpat&iacute;a 
        por todos los integrantes de nuestra organizaci&oacute;n.<br>
        <br>
        - Si en un principio tuvimos a bien obrar en el &aacute;mbito pol&iacute;tico 
        por medio del hacktivismo, creemos prudente aclarar que el apoyo al EZLN 
        no es en base a su ideolog&iacute;a ni a lo que persigue.<br>
        <br>
        Despu&eacute;s de aclarar a grosso modo estos puntos explicare a nuestros 
        amigos que leen esta revista en M&eacute;xico y el extranjero que es el 
        movimiento zapatista.<br>
        <br>
        Te&oacute;ricamente, el zapatismo es un movimiento que surgi&oacute; para 
        reivindicar el lugar de los ind&iacute;genas en nuestro pa&iacute;s, lo 
        cual de cierto modo es cierto, pero el EZLN peca de errores muy graves 
        en el planteamiento de su ideolog&iacute;a, Chiapas no es el &uacute;nico 
        lugar con ind&iacute;genas, el EZLN se aboca principalmente a esta regi&oacute;n. 
        Si, estamos de acuerdo de la segregaci&oacute;n y las penurias que ha 
        pasado las diversas comunidades ind&iacute;genas de Chiapas han sido brutales, 
        tanto para su dignidad como para cualquier persona, pero no por ello debemos 
        voltear los ojos solo a Chiapas, las comunidades tarahumaras, mixtecas, 
        zapotecas y otros pueblos ind&iacute;genas han sufrido vejaciones tanto 
        o mas crueles a lo largo de siglos de la colonizaci&oacute;n.<br>
        <br>
        La madeja del EZLN es dif&iacute;cil de desmara&ntilde;ar, un d&iacute;a 
        se pintan como movimiento insurgente, otro como amigo de los ind&iacute;genas, 
        el otro lo usan como parapetos humanos y al siguiente tienden la mano 
        a sus amigos extranjeros los cuales en gran medida son los autores intelectuales 
        de la situaci&oacute;n actual de los pueblos ind&iacute;genas. Pero, quien 
        realmente dicta ordenes al EZLN? El sub-comandante Marcos? Seg&uacute;n 
        el, solo es sub-comandante y vocero del EZLN, incluso se ha dicho ombusdman 
        de todos los ind&iacute;genas, con esto entendemos que el solo habla y 
        los otroras 23 comandantes zapatistas son realmente los que dictan las 
        ordenes en el EZLN. Curioso es sin duda que el se el quien redacte la 
        gran parte de los comunicados del grupo zapatista incluyendo sus p&iacute;caros 
        y atinados comentarios con una tenue embarrada de su ideolog&iacute;a 
        pol&iacute;tica. Pues he de decir que es la &quot;Martha Sahagun&quot; 
        mas carism&aacute;tica que he visto. A ver quien mas podr&iacute;a ser, 
        el Comandante Tacho? El es un pati&ntilde;o muy simp&aacute;tico sin duda, 
        un activista pol&iacute;tico que vive a la sombra de su patr&oacute;n, 
        ha logrado ganar adeptos con su ocurrentes discursos izquierdistas, pero 
        no pasa de ser otro pe&oacute;n, entonces los Comandantes? Pero no... 
        ellos dijeron que sin el consenso de todos no se hace nada, como quien 
        dice el EZLN no tiene l&iacute;der...<br>
        <br>
        A todo esto; Quien es Marcos? Si ustedes en sus casitas respondieron &quot;Es 
        Rafael Sebasti&aacute;n Guillen&quot; pues est&aacute;n equivocados, recua 
        de brutos. Yo pregunte &quot;Quien es Marcos&quot; no &quot;Quien es el 
        Sub-comandante Marcos&quot;. Confundidos? Pues ag&aacute;rrense que esto 
        les va a interesar.<br>
        <br>
        Seg&uacute;n informes clasificados de la Presidencia de la Rep&uacute;blica, 
        MARCOS son las siglas de &quot;Movimiento Armado Revolucionario, Comandante 
        Obispo Samuel&quot; *Nota editorial. No, fume nada, no me met&iacute; 
        nada o lo invente, esta informaci&oacute;n es clasificada y tiene origen 
        desde que Emilio Rabasa era el Coordinador para el dialogo en Chiapas 
        junto con el Centro de Investigaci&oacute;n y Seguridad Nacional (CISEN), 
        por si alguien pensaba que el pobre idiota no hizo nada relevante, pues 
        resulto ser buen esp&iacute;a. El humilde Obispo Samuel Ruiz fue el fundador 
        del EZLN, pero... porque? F&aacute;cil. Samuel Ruiz uso diestramente a 
        los ind&iacute;genas discordes en Chiapas y los congrego para formar una 
        fuerza de resistencia civil, cosa que se hizo mas grande y esto provoco 
        reacciones en el Gobierno de Chiapas y no tardo en llegar a o&iacute;dos 
        de la Presidencia (Para esos d&iacute;as Carlos Salinas era el timonel 
        de la patria). Es bien sabido que la relaci&oacute;n Iglesia-Estado ha 
        sido complaciente por parte del Gobierno, pero ay de aquel hombre de fe 
        que ose hacer tocar las fibras de la pol&iacute;tica porque aparece panza 
        arriba en el R&iacute;o Tula, aunque en el presente nuestro actual presidente 
        tiene una inclinaci&oacute;n fuerte hacia la religi&oacute;n, por lo que 
        se espera que la Iglesia erogue leyes hasta por no persignarse frente 
        a una iglesia... en fin seguimos con lo nuestro. Samuel Ruiz sabia que 
        el no pod&iacute;a encabezar un futuro movimiento, ya sea armado, insurgente 
        o grillero, as&iacute; que puso las bases para que este movimiento fuera 
        encabezado por comandantes peones y por el h&aacute;bil alfil Rafael Sebasti&aacute;n 
        Guillen al cual bautizar&iacute;a como Marcos.<br>
        <br>
        Sale, ya esta conformado el EZLN, ya tiene su figura. Que sigue? Que se 
        expanda la noticia del movimiento, M&eacute;xico ya lo sabia o por lo 
        menos se las ol&iacute;a, pero no por eso iban a dejar el olor de la letrina 
        le llegara al resto del mundo... Pos que creen? Alfil y Samuel nada tontos 
        fueron a platicas de asociaciones civiles, entre ellas los masones, partidos 
        de izquierda, empresarios y hombres influyentes en las esferas socioecon&oacute;micas 
        de Europa. Pero esto no fue con el solo fin de dar a conocer el problema 
        ind&iacute;gena, su ideolog&iacute;a y el porque de su movimiento... no 
        se&ntilde;ores, eso va un poco mas all&aacute; de lo evidente. Chiapas 
        es un estado extremadamente rico, ustedes no se imaginan cuanto, es asquerosamente 
        rico tanto en potencial econ&oacute;mico como en fauna, flora, miner&iacute;a 
        y recursos naturales. A que pa&iacute;s europeo no le interesar&iacute;a 
        un permiso de explotaci&oacute;n forestal con las maderas preciosas de 
        la selva chiapaneca? claro, esta en un municipio aut&oacute;nomo chiapaneco. 
        A que europeo no le encantar&iacute;a tener su Quinta o su humilde finca 
        en miles de kil&oacute;metros cuadrados v&iacute;rgenes, a cambio de que? 
        De que a sus empleados les de unas hect&aacute;reas de cafetales y el 
        como cacique las comercialice. Inversi&oacute;n m&iacute;nima, ganancia 
        total. Pero lo que pocos saben es que Chiapas tiene algo mas que flora 
        y fauna, Chiapas es un estado con minas de uranio. Oh si, Uranio puro. 
        Ya no digamos que al poderoso Jean Phillipe Matrell, Fritz M&uuml;ller, 
        Abraham Zimmerman o Rico McPato le interese la exploraci&oacute;n de esas 
        minas, ya estamos hablando de pa&iacute;ses enteros, capital mundial que 
        bien podr&iacute;a invertir un par de miles de millones de euros en expropiar 
        Uranio puro. Digo, si ya antes despedazaron la ecolog&iacute;a de la selva 
        amaz&oacute;nica, talando cientos de hect&aacute;reas de frondosos &aacute;rboles, 
        plagando de mercurio el r&iacute;o amaz&oacute;nico y masacrando a cuanto 
        ind&iacute;gena yanomami se le cruzara al defender su tierra en contra 
        de los europeos, colonizadores y jud&iacute;os que en su codiciosa b&uacute;squeda 
        de oro y esmeraldas no repara en tomar cuanta medida terminal sea necesaria 
        y si Samuel Ruiz esta ofreciendo una tierra casi gratis con tratados comerciales 
        directos, y amnist&iacute;a ind&iacute;gena, puta, pues que chingado acaparador 
        no se va a animar a ponerle en la madre a un pa&iacute;s tercermundista 
        como M&eacute;xico? Todo sea en pro de hinchase los bolsillos y de darle 
        algunas migajas de su tierra a los nativos de la tierra... no me quise 
        meter en cuestiones globalifobicas porque luego me tildan de reaccionario.<br>
        <br>
        Ya con adeptos ganados en el extranjero y con el movimiento en marcha 
        el siguiente paso es desligarse de todo eso y hacerse el occiso. Lo que 
        sigue es para tirarse al suelo de la risa, Alfil dirig&iacute;a el movimiento, 
        c&aacute;maras y reflectores lo enfocaban, pero oh sorpresa, con la f&eacute;rrea 
        convicci&oacute;n de darle fin a este movimiento de ind&iacute;genas disidentes 
        aparecer&iacute;a un hombre que dar&iacute;a pie al dialogo entre el EZLN, 
        los ind&iacute;genas en municipios aut&oacute;nomos y el gobierno federal... 
        Si, adivinaron, Samuel Ruiz. El mismo que creo el movimiento seria el 
        que tratar&iacute;a de resolverlo con el &uacute;nico prop&oacute;sito 
        de pactar con la presidencia el que se le cedieran a los ind&iacute;genas 
        tierras que por derecho les pertenecen, claro que con ese mismo derecho 
        Samuel Ruiz iba a administrar, porque tanta tierra en la mano de esos 
        pobrecillos inditos pues no sabr&iacute;an que hacer con ella, mejor que 
        alguien con visi&oacute;n a futuro la capitalice. N'ombre, si Samuel Ruiz 
        no es ning&uacute;n pendejo.<br>
        <br>
        Todo esto paso en el ultimo a&ntilde;o de gobierno de Carlos Salinas, 
        entro Ernesto Zedillo al tim&oacute;n y trato de darle por su lado al 
        EZLN mientras al pueblo le doraba la p&iacute;ldora de que todo estaba 
        bien y esto se iba a resolver sin mayor problema. Claro que sus triqui&ntilde;uelas 
        napole&oacute;nicas nom&aacute;s no funcionaron, tropas del ejercito se 
        movilizaron a Chiapas, bases militares fueron instauradas, carreteras 
        fueron cerradas y centinelas armados fueron esparcidos en territorios 
        ocupados, seg&uacute;n para que no se mataran entre ellos mismos, la maquinaria 
        del gobierno entro en marcha, quisieron pintar a los ind&iacute;genas 
        como est&uacute;pidos, irracionales, volubles, izquierdistas e incivilizados. 
        Que tal si les quitamos los servicios de salud, agua y seguridad publica? 
        Que tal si metemos algunos priistas duros para que alivianen a esos ind&iacute;genas 
        a punta de pistola? Que tal si echamos buscapi&eacute;s en las comunidades 
        para que se maten entre ellos mismos? Y que tal si hacemos todo lo dem&aacute;s 
        y que nos ahorren el problema de venadearlos? Y as&iacute; fue, en reiteradas 
        ocasiones trataron de cortarle alguna cabeza a la hidra chiapaneca, pero 
        como dicen en mi pueblo &quot;A fuerzas, ni los huaraches entran&quot;, 
        Acteal fue lo que fue porque as&iacute; estuvo orquestado por el gobierno, 
        matanzas entre comunidades fueron planeadas desde el interior del gobierno 
        para desestabilizar sus comunidades independientes, todos los que pasaron 
        por la Cocopa y por grupos de dialogo eran priistas duros que no iban 
        a ceder, grillos con la menor intenci&oacute;n de hablar racionalmente 
        y que solo se sentaron para hacer una chingada. Para no hacerla mas larga, 
        el dialogo se cerro, el EZLN se incrusto en lo mas profundo de la selva, 
        los ind&iacute;genas no ten&iacute;an nada en claro y Alfil tomo mas fuerza, 
        mut&oacute; en un neo-che guevara.<br>
        <br>
        6 a&ntilde;os mas tuvieron que pasar, instaurado el gobierno de Vicente 
        Fox trato de resolver el problema, el dialogo se encaminaba a la reapertura, 
        pero no solo era la corriente zapatista contra el gobierno priista, ahora 
        era contra los panistas, priistas e incluso los propios perredistas, las 
        3 fracciones parlamentarias que ten&iacute;an la tarea de resolver el 
        dilema zapatista estaban enfrascadas en sus propios problemas, en divisiones, 
        en autoritarismos y en el problema de la desidia por quedar bien con su 
        partido o a vista de las ONG's, prensa y opini&oacute;n internacional, 
        porque a esas alturas del partido, todo el mundo sabia de la caravana 
        y lo que ella representar&iacute;a. Al final que paso? Los zapatistas 
        hablaron en el senado, no hubo un cambio realmente a conciencia, regresaron 
        a la selva y meses despu&eacute;s la ley ind&iacute;gena fue aprobada 
        por la mayor&iacute;a parlamentaria en el senado y en la c&aacute;mara 
        de diputados... todos felices y contentos, no? Pos no chingao. Aqu&iacute; 
        es donde muchos se confunden, creen que con la aprobaci&oacute;n de la 
        ley ind&iacute;gena se resuelve todo, tambi&eacute;n creen que si a futuro 
        se aprueban los puntos de la Cocopa tambi&eacute;n se resuelve y peor 
        aun, creen que si les dan tierras y todo lo que piden a los ind&iacute;genas 
        ya se est&aacute;n tranquilitos, pero por donde le miren, el futuro se 
        vislumbra denso y gris.<br>
        <br>
        Haciendo un par&eacute;ntesis, en el mes de la Zapatistamania se usaron 
        t&eacute;rminos que en principio no tienen raz&oacute;n de ser; &quot;Se 
        tiene que firmar la paz&quot;, &quot;Alfil viene a hablar para que se 
        termine la guerra&quot;, &quot;Con este concierto exhortamos a que se 
        resuelva el conflicto chiapaneco&quot;... Carajo! Que parte no entienden? 
        Sin enemigos no hay guerra, una guerra es bilateral o me van a salir que 
        los enemigos son los ind&iacute;genas? Ah que a toda madre, entonces porque 
        chingados no los aplastaron cual israel&iacute; contra palestino? El enemigo 
        es el gobierno? Pues no, el enemigo esta mas cerca de lo que ustedes creen... 
        lo que he de explicar tal vez no sea muy grato para algunos, pero es en 
        mi particular punto de vista algo que sucede en todos los estratos sociales 
        de nuestro pa&iacute;s:<br>
        - La ley ind&iacute;gena como tal, no debe ser erogada, eso es una arbitrariedad, 
        segrega tanto a los ind&iacute;genas y sus etnias como a los ind&iacute;genas 
        del resto de los mexicanos. Antes de que se quiebren la cabeza nuestros 
        gobernantes en hacer una ley o un articulo constitucional habr&iacute;a 
        que hacer conciencia en muchos millones de mexicanos racistas, si se&ntilde;or, 
        he dicho racistas, no se hagan pendejos que hasta yo soy racista. Este 
        es un ejemplo muy claro de muchos que he visto y vivido. Hace poco una 
        amiga m&iacute;a y yo platic&aacute;bamos de este tema, he de comentar 
        que ella es una mujer &quot;de sociedad&quot;, antes de que yo pudiera 
        emitir comentario alguno me explico su punto de vista ella comenz&oacute; 
        diciendo &quot;Pues mira, la verdad ya deber&iacute;an dejarse de fregaderas, 
        darle a los inditos su pinche ley y que se queden en sus comunidades sembrando 
        y viviendo y que nos dejen en paz a todos los mexicanos&quot;, may&uacute;scula 
        sorpresa me lleve, tanta que no pude hablar en 1 minuto para tranquilizarme 
        y mandarla al diablo. Como es posible que en este pa&iacute;s exista gente 
        con tal forma de pensar? Como es posible que nos expresemos as&iacute; 
        de Los Mexicanos? May&uacute;sculas? Si, porque los ind&iacute;genas son 
        los UNICOS que realmente son mexicanos de sangre pura, ellos como minor&iacute;a 
        son los &uacute;nicos que pueden llamarse Mexicanos y no tuvieron que 
        cantar las canciones de Lola Beltran, ni corear los goles de la Selecci&oacute;n 
        Mexicana, ni hacer compadre de nadie, ni ponerse de pie al escuchar nuestro 
        himno o ver la bandera de nuestra patria, ellos, grand&iacute;simos cabrones, 
        ellos tuvieron que sobrevivir las mas grandes chingaderas que la historia 
        de esta naci&oacute;n les haya puesto enfrente, ellos tuvieron los g&uuml;evos 
        para rajarse la madre contra los conquistadores, perdieron, si y que chingados? 
        Aun siguen de pie aun despu&eacute;s de 500 a&ntilde;os de que los humillen, 
        los traten como la peor escoria humana, que los pisoteen al pedir una 
        moneda para llevarle pan a su gente y aun siguen soportando a rega&ntilde;adientes 
        a la gente que dice ser mexicano solo cuando los ind&iacute;genas son 
        los verdaderos mexicanos, cuantos de ustedes tienen sangre espa&ntilde;ola, 
        francesa, gringa o africana en la sangre? Tu no? Que raro, o se hacen 
        pendejos o son unos cobardes sin g&uuml;evos. Por desgracia nuestra sangre 
        ya es una melcocha de castas gracias a la bendita colonizaci&oacute;n, 
        cosa que ninguno de nosotros podemos evitar, de haber querido todos hubi&eacute;ramos 
        optado por ser ind&iacute;genas de sangre pura, pero para estos tiempos 
        solo un selecto grupo de ind&iacute;genas apartados de toda civilizaci&oacute;n 
        y de la mano del hombre blanco son Mexicanos.<br>
        -Si siguen leyendo esto probablemente piensen que soy un Nazi extremista, 
        pero se&ntilde;ores, es una realidad que debemos afrontar, por mi me pueden 
        decir &quot;Ni madres, yo si soy Mexicano porque mis antepasados vivieron 
        aqu&iacute; desde hace chorrocientos a&ntilde;os&quot; Pues los m&iacute;os 
        tambi&eacute;n, mis antecesores vivieron en un pueblito alejado de la 
        civilizaci&oacute;n en el Estado de M&eacute;xico, pero mi abuela paterna 
        era francesa, con esa combinaci&oacute;n no creo ser un Mexicano... &quot;Pero 
        yo si soy Mexicano porque respeto los s&iacute;mbolos patrios&quot; Hijo 
        m&iacute;o, yo respeto a la bandera mas que a mi chingada madre, la veo 
        hondeando en lo mas alto del cielo y nom&aacute;s no chillo porque me 
        aguanto el coraje de que eso no me es suficiente para ser Mexicano... 
        &quot;Yo no nac&iacute; aqu&iacute;, pero M&eacute;xico me ha brindado 
        todo lo que soy y me nacionalice mexicano&quot; Te respeto y admiro por 
        el amor que le tienes a mi patria, por desgracia un papel no nos garantiza 
        ni a ti ni a mi el derecho de ser llamado Mexicano. Para que no se encabronen 
        y acabar pronto, somos mexicanos por nacionalidad, somos mexicanos por 
        amor a M&eacute;xico, somos mexicanos porque en esta patria encontramos 
        todo lo que solo a un mexicano podr&iacute;a hacer feliz; Patria, honor, 
        respeto, gente, tierra y todo lo que es M&eacute;xico, con sus pol&iacute;ticos 
        y corrupci&oacute;n y todas las chingaderas que tiene, pero es M&eacute;xico, 
        por eso somos mexicanos. Y por ello debemos afrontar una realidad. TODOS 
        somos M&eacute;xico. Los ind&iacute;genas son Mexicanos.<br>
        <br>
        -Porqu&eacute; entonces habr&iacute;a de hac&eacute;rseles una ley especial? 
        En tal caso hagan una ley para cada etnia porque cada comunidad ind&iacute;gena 
        tiene sus diferencias, no podemos promulgar una ley, ni ind&iacute;gena, 
        ni la Cocopa puesto que en ellas hay exclusiones y errores que no abarcan 
        a todas las comunidades y etnias del pa&iacute;s, un ejemplo: &quot;A 
        cada familia ind&iacute;gena le corresponde 1 hect&aacute;rea de tierra 
        para cultivar, para vivienda y para que hagan de su culo un papalote y 
        lo manden a volar muy lejos&quot; Pos no se si en Chiapas haya un chingo 
        de tierra, pero en Chihuahua tienen a los raramuris viviendo en una reserva 
        &iacute;nfima y con una hect&aacute;rea de rocas y desierto no creo que 
        crezca ni peyote. Es lo mismo que hicieron los Norteamericanos, que paso 
        con los indios? Est&aacute;n bien lejos en una reserva en casa de la tostada 
        donde no molestan a los blanquitos pidi&eacute;ndoles limosna en una patria 
        que fue arrebatada de sus manos. Y si a esas vamos, porque de una vez 
        no hacen una ley para los morenos para que no nos vean feo los blanquitos 
        en la calle? Y tambi&eacute;n para los pinches jud&iacute;os que a esos 
        como se los carga la chingada por narizones, blandengues, enfermizos, 
        feos y a sus espaldas les hacemos mofa. Eso estar&iacute;a a toda madre, 
        catalogamos a cada mexicano por su color, por su clase social y por su 
        religi&oacute;n y cada quien tiene su ley o su articulo constitucional 
        (Una comunidad en Ixmiquilpan, Hidalgo aprob&oacute; una ley que excluye 
        de servicios de agua, luz, saneamiento, inhumaci&oacute;n y en algunos 
        casos, puede expulsarse a toda una familia del pueblo por no profesar 
        la religi&oacute;n cat&oacute;lica). Entonces porque habr&iacute;a de 
        aprobarse una ley exclusiva para los ind&iacute;genas Mexicanos, siendo 
        que ellos tienen tantos o mas derechos que aquellos que los han hecho 
        ver como gente inferior, nosotros mismos. El cambio va mas all&aacute; 
        de unos tintazos, el cambio debe ser en todos nosotros.<br>
        <br>
        EPILOGO<br>
        Ya casi terminamos, pero no sin antes decirles que el problema ind&iacute;gena 
        no se podr&aacute; resolver de la noche a la ma&ntilde;ana, no se podr&aacute; 
        solucionar con voceros o achichincles como Alfil, creo que la forma mas 
        sana de que esto empiece a tomar rumbo es que sean realmente los ind&iacute;genas 
        los que opinen directamente sobre <br>
        este asunto, sin intermediarios, sin comisiones indigenistas presididas 
        por papanatas encorbatados, que por fin sea su voz una voz y no un eco 
        disipado en un voto al aire.<br>
        <br>
        -Si alguien tiene un comentario lo invito a enviar un correo y espero, 
        en nombre de la sant&iacute;sima chingada, que no sea alg&uacute;n mocoso 
        que ladre incoherencias a mi me gusta discutir las cosas largo y tendido.<br>
        <br>
        P.D. Ariel Sharon; Chinga tu madre, pendejo sefardita recalcitrante.<br>
      </p>
      <p><br>
      </p>
      <table width="100%" border="0" cellspacing="0" cellpadding="0">
        <tr>
          <td>
            <div align="left"><a href="rm-12-05.htm"><img src="i.gif" width="88" height="30" alt="Men&uacute;s y otras chucherias" border="0"></a></div>
          </td>
          <td>
            <div align="right"><a href="rm-12-07.htm"><img src="d.gif" width="88" height="30" border="0" alt="The Applet Password Wizard"></a></div>
          </td>
        </tr>
      </table>
      
    </td>
  </tr>
  <tr>
    <td width="110" background="Fondoa.jpg" height="57">&nbsp;</td>
    <td width="" height="57">
      <div align="right"><font size="-1"><b>Comentarios a : <a href="mailto:fatal@raza-mexicana.org">fatal@raza-mexicana.org</a></b></font></div>
    </td>
  </tr>
</table>
</body>
</html>
