<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>O filme Clube da Luta e o lado negro do hacking</TITLE>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Author" CONTENT="Derneval R.R. Cunha">
   <META NAME="GENERATOR" CONTENT="Mozilla/3.01Gold (WinNT; I) [Netscape]">
   <META NAME="Description" CONTENT="Comentando o filme e o vandalismo eletrônico, presente de forma sutil na propaganda de livros sobre hacking tão divulgados  por aí afora. Um pouco também de filosofia básica sobre o que não é ser hacker.">
   <META NAME="KeyWords" CONTENT="hacker, quero ser hacker, cyberativismo, dark side hacker, Mitnick, hacker preso, vandalismo virtual, crime por computador, cracker, defacer, hacking web page, invadindo computadores, invasão de computadores, vida alternativa, ética hacker, etica hacker">
</HEAD>
<BODY TEXT="#FFFF00" BGCOLOR="#400040" LINK="#0000EE" VLINK="#551A8B" ALINK="#FF0000">

<CENTER><P><A HREF="http://www.inf.ufsc.br/barata/index.html">Homepage</A>
<A HREF="http://barataeletrica.blogspot.com">Blog do Fanzine</A> <A HREF="http://www.inf.ufsc.br/barata/barata28.html">&Iacute;ndice
No 28</A> <A HREF="http://www.inf.ufsc.br/barata/ind.htm">&Iacute;ndice
N&uacute;meros Anteriores</A> <A HREF="http://www.inf.ufsc.br/barata/emai.htm">Contato</A>
<BR>
http://barataeletrica.cjb.net http://www.inf.ufsc.br/<BR>
Vers&atilde;o Txt <A HREF="http://www.barataeletrica.rg3.net">http://www.barataeletrica.rg3.net</A>
</P></CENTER>

<center><P>O FILME &nbsp;&quot;CLUBE DA LUTA&quot; E O LADO NEGRO DO &quot;HACKING&quot;</P>
</center>
<P>Derneval R.R. Cunha</P>

<P>Aqueles que n&atilde;o assistiram o filme podem perder um pouco da surpresa...
</P>

<P>Porqu&ecirc; o &nbsp;&quot;Clube da Luta&quot;?</P>

<P>O filme tem a reputa&ccedil;&atilde;o de trabalhar com temas muito comuns
ao &nbsp;&quot;American Way of Life&quot;, mas agora isso est&aacute; meio
que universal. Contando a hist&oacute;ria em poucas palavras, &eacute;
a de um sujeito alienado que se junta a uma sociedade secreta em busca
de sua identidade ou senso de realiza&ccedil;&atilde;o. At&eacute; que
descobre que o lugar onde se meteu, l&aacute; pelo final do filme. Como
o brasileiro comum pode se identificar com o filme? N&atilde;o tem nada
de brasileiro l&aacute;. O sujeito &eacute; um executivo cuja &uacute;nica
vida social s&atilde;o pessoas que ele encontra no trabalho ou quando viaja
de avi&atilde;o de um lugar para outros. Sem amigos, sem identidade. Come&ccedil;a
a freq&uuml;entar um grupo de auto-ajuda composto de gente que perdeu os
test&iacute;culos por conta do c&acirc;ncer. E para de ter ins&ocirc;nia,
se identifica com os caras.</P>

<P>Agora pensemos o adolescente padr&atilde;o. Chega a adolesc&ecirc;ncia,
pouco a pouco tem que se adequar a uma sociedade que vai lhe obrigar a
fazer coisas que n&atilde;o quer. A face mais vis&iacute;vel disso &eacute;
o medo de servir no ex&eacute;rcito. Sempre tem aqueles que tem a fantasia
que vai ser bom. Mas n&atilde;o tem muita gente sorrindo quando est&aacute;
pelado no exame m&eacute;dico. Dali em diante &eacute; submiss&atilde;o
quase total, ou pelo menos assim parece. Claro, aprende a ser homem mas
e da&iacute;? Essa &eacute; a grande d&uacute;vida, quando se &eacute;
jovem. Que que acontece depois que vc passa pelo exame m&eacute;dico. Como
ser&aacute; sua vida. </P>

<P>Acho um absoluta besteira falar &quot;o jovem isso, o jovem aquilo&quot;.
Mas dentro do exemplo acima, o mesmo acontece com a escolha de um curso
universit&aacute;rio. A pessoa n&atilde;o sabe o que vem depois. Fazer
o que se quer ou o que vai dar dinheiro? O que vai dar dinheiro hoje n&atilde;o
vai estar pagando uma mixaria depois que se termina o curso? &Eacute; a
mesma situa&ccedil;&atilde;o do servi&ccedil;o militar, vista de outra
forma. A pessoa estuda para ser algu&eacute;m que vai assumir um lugar
na sociedade.</P>

<P>Pensa ent&atilde;o na quest&atilde;o casamento. Ningu&eacute;m costuma
pensar muito na necessidade de se juntar &agrave; outra pessoa, hoje. Talvez
num s&aacute;bado solit&aacute;rio. Casar, para ter filhos, sendo que os
pr&oacute;prios pais muito provavelmente est&atilde;o separados e brigando?
Mas existe uma cobran&ccedil;a dos pais, que querem ver o filho parado
num lugar, produzindo netinhos que eles v&atilde;o poder &quot;ajudar a
criar&quot;, mas cujo choro n&atilde;o v&atilde;o ter que ouvir. </P>

<P>Enquanto isso, a vida continua. Adolesc&ecirc;ncia, emprego, cas&oacute;rio,
filhos.. e a felicidade? C&eacute;u ou inferno todo mundo acredita que
existe, mas cad&ecirc; a chamada &quot;realiza&ccedil;&atilde;o pessoal&quot;.
Existem regras. Todo mundo tem que cumprir as regras. Depois de cumprir
as regras &eacute; que a pessoa pode cumprir com a &quot;busca pela felicidade&quot;,
desde que n&atilde;o afete a felicidade alheia. Desde que a lei esteja
sendo cumprida. Que lei, ou que leis? Cada pessoal tem o livre arb&iacute;trio
Concordo ou discordo? Ser&aacute; que a pessoa pode discordar de alguma
coisa nesse mundo?</P>

<P>As regras come&ccedil;am quando voc&ecirc; nasce, cresce ouvindo &nbsp;&quot;n&atilde;o
fa&ccedil;a isso, n&atilde;o fa&ccedil;a aquilo&quot;. S&oacute; se &eacute;
dono do seu pr&oacute;prio nariz quando se tem seu pr&oacute;prio emprego,
posi&ccedil;&atilde;o social, fam&iacute;lia. S&atilde;o outras regras.
Tudo &eacute; mecanismo. Se a pessoa se &quot;encaixa&quot; &eacute; aprovada,
se n&atilde;o se &quot;encaixa&quot;, &eacute; rejeitada. Ent&atilde;o
a pessoa aceita as regras. Se dizem fica calado, ent&atilde;o para preservar
aquele &nbsp;&quot;encaixe&quot;, a pessoa emudece. O chefe fala que vestir
preto &eacute; legal, vamos comprar roupa de vel&oacute;rio. Ningu&eacute;m
est&aacute; satisfeito, mas n&atilde;o &eacute; para satisfa&ccedil;&atilde;o
pessoal que se faz isso ou aquilo. &Eacute; para se ter um sal&aacute;rio
no final do m&ecirc;s. </P>

<P>T&aacute; tudo dominado..</P>

<P>O que acontece com a pessoa, ent&atilde;o. Aos 30 ou 40, solteiro ou
casado (divorciado, na maioria das v&ecirc;zes), acaba abandonando todos
aqueles projetos da adolesc&ecirc;ncia e cantando &quot;Como os nossos
pais&quot; (Elis Regina). Isso quando nem entra nessa, engata numa de busca
da p&iacute;lula da felicidade, a &quot;grana&quot;, a &nbsp;&quot;bufunfa&quot;.
Quem tem dinheiro n&atilde;o precisa obedecer nenhuma regra. O dinheiro
&eacute; Deus. Torra tudo que ganha e fica sem nada. Se tem sucesso em
fazer dinheiro continuamente, talvez demore para entender que virou uma
pessoa dif&iacute;cil de ag&uuml;entar e sem gra&ccedil;a. &Eacute; um
inferno, ter dinheiro e n&atilde;o ter nada que preste para poder us&aacute;-lo.
A maioria gostaria de ter esse problema, mas eu te falo, conseguir dinheiro
a be&ccedil;a n&atilde;o &eacute; a solu&ccedil;&atilde;o. Exemplo: Adianta
ter dinheiro e ter que encarar uma sogra em casa?</P>

<P>Ainda est&aacute; lendo? Cad&ecirc; o &nbsp;&quot;Clube da Luta&quot;?
Cad&ecirc; o &nbsp;&quot;Hacking&quot;?</P>

<P>Voltando ent&atilde;o ao filme &nbsp;&quot;Clube da Luta&quot;. Ent&atilde;o,
o her&oacute;i fala em &quot;amizades descart&aacute;veis&quot;. Claro,
ele n&atilde;o tem amigos que falem a sua l&iacute;ngua. Bem aquela coisa
que pode acontecer com todo mundo, tanto faz se &eacute; cidade pequena
ou grande, vc muda de emprego ou vai estudar fora, perde sua antiga turma.
E a vida perde o gosto. No filme, o personagem acaba encontrando a turma
dele. Se identifica com o pessoal que perdeu os &quot;bagos&quot; (grupo
que extirpou os test&iacute;culos por conta de c&acirc;ncer). Coisa que
n&atilde;o aconteceu com ele, mas se identificou com as conversas. Ele
tamb&eacute;m se sente descart&aacute;vel e .. impotente. No meio das conversas,
aparece um pseudo-l&iacute;der, o Tyler. &Eacute; a&iacute; que come&ccedil;a
outro momento do filme. Muda a hist&oacute;ria. Come&ccedil;a o &quot;Clube
da Luta&quot;, um grupo de boxe clandestino devotado ao &nbsp;&quot;empowerment&quot;
(palavrinha boa, n&eacute;.. ). A pessoa freq&uuml;enta, faz umas sacanagens
e vandalismos por a&iacute;. Sente uma sensa&ccedil;&atilde;o de poder
no grupo. Tipo ser Pit-boy (g&iacute;ria paulistana para quem pratica Jiu-jitsu
e em alguns casos meio extremados e raros, sai por a&iacute;, socializando
frusta&ccedil;&atilde;o atrav&eacute;s de porrada). Atrav&eacute;s disso
come&ccedil;a a se sentir algu&eacute;m de novo. Algu&eacute;m diferente,
mais forte, acima da carne seca. </P>

<P>Discurso do Martelo e do prego</P>

<P>Saca s&oacute; o discurso do Tyler Durden, o &nbsp;&quot;chefe&quot;.</P>

<P><TT>&quot;(..)Nada &eacute; est&aacute;tico. Tudo &eacute; movimento.
E tudo esta desmoronando. Esta &eacute; sua vida. Melhor do que isso n&atilde;o
pode ficar. Esta &eacute; sua vida. E ela acaba um minuto por vez. Voc&ecirc;
n&atilde;o &eacute; um ser bonito e admir&aacute;vel. Voc&ecirc; &eacute;
igual &agrave; decad&ecirc;ncia refletida em tudo. Todos fazendo parte
da mesma podrid&atilde;o. Somos o &uacute;nico lixo que canta e dan&ccedil;a
no mundo. Voc&ecirc; n&atilde;o &eacute; sua conta banc&aacute;ria. Nem
as roupas que usa. Voc&ecirc; n&atilde;o &eacute; o conte&uacute;do de
sua carteira. Voc&ecirc; n&atilde;o &eacute; seu c&acirc;ncer de intestino.
Voc&ecirc; n&atilde;o &eacute; o carro que dirige. Voc&ecirc; n&atilde;o
&eacute; suas malditas cal&ccedil;as. Voc&ecirc; precisa desistir. Voc&ecirc;
precisa saber que vai morrer um dia. Antes disso voc&ecirc; &eacute; um
in&uacute;til. (..)A propaganda nos faz correr atr&aacute;s de coisas,
trabalhos que odiamos, para acabar comprando o que n&atilde;o precisamos&quot;.</TT></P>

<P>&Eacute; um discurso forte. Cheio de adrenalina. Parece que tem tudo
a ver com uma boa maioria da sociedade atual. Independente do fato que
nem todo mundo tem aquele emprego de executivo que o personagem principal
do filme tem. &Eacute; um discurso que at&eacute; certo ponto d&aacute;
a impress&atilde;o que existe um caminho fora de tudo isso. E em teoria,
&eacute; um caminho pode ser feito com as pr&oacute;prias m&atilde;os,
basta agir. &Eacute; a id&eacute;ia de que o mundo est&aacute; dividido
em martelos e pregos. O neg&oacute;cio &eacute; tratar toda a sociedade
como se fossem pregos.</P>

<P>A id&eacute;ia do Tyler aparenta ser substituir a adrenalina por conta
do medo de ser pego em flagrante pela adrenalina que acontece quando voc&ecirc;
faz algo totalmente radical. O que tem de errado nesse discurso? Pode ser
quem for. Uma hora, perde a gra&ccedil;a. O que ali&aacute;s acontece com
o personagem ao longo do filme. Mas a&iacute; o monstro j&aacute; foi criado.
Tudo caminha para a auto-destrui&ccedil;&atilde;o. Ao fugir do t&eacute;dio,
o her&oacute;i encontrou um pesadelo. E o final da hist&oacute;ria? O final,
se vc assistiu o filme, j&aacute; sabe. Bem sonho libert&aacute;rio. S&oacute;
para tua informa&ccedil;&atilde;o, no livro do Chuck Palahniuk, n&atilde;o
&eacute; aquela cena feliz. O projeto mayhem ou &quot;projeto destrui&ccedil;&atilde;o&quot;
n&atilde;o acontece. O cara vai para um sanat&oacute;rio. </P>

<P>&quot;Clube da Luta&quot; X &quot;dark-side-hacker&quot;</P>

<P>No filme &quot;O Clube da Luta&quot;, o caminho para n&atilde;o ser
&quot;prego&quot; &eacute; participar de uma sociedade secreta onde as
leis comuns n&atilde;o tem sentido. Essa &eacute; a fantasia que eu vejo
por a&iacute;, sendo ligada &agrave; &nbsp;&quot;hacking&quot;. As pessoas
realmente acreditam que se vc virar &quot;hacker&quot;, virou um &quot;martelo&quot;
e pode tratar todos como se fossem pregos. Todos agem como se os hackers
fossem membros de uma sociedade secreta, igualit&aacute;ria e que transcende
&agrave; lei. E a coisa est&aacute; um pouco al&eacute;m da realidade.
N&atilde;o existe nenhum l&iacute;der que vai conduzir ningu&eacute;m a
tornar o mundo melhor atrav&eacute;s de vandalismo sem sentido. Claro que
existem as brincadeiras, tipo Portland Cacophony Society <A HREF="http://portland.cacophony.org/">http://portland.cacophony.org/</A>
mas n&atilde;o &eacute; algo feito s&oacute; pelo prazer da coisa. H&aacute;
planejamento, h&aacute; um contexto.</P>

<P>Os &quot;hackers&quot; e a sociedade de consumo.</P>

<P><TT>&quot;Fomos criados pela televis&atilde;o para acreditar que um
dia ser&iacute;amos ricos, estrelas de cinema e do rock. Mas n&atilde;o
seremos. E estamos aos poucos aprendendo isso (..)&quot; (Filme Clube da
Luta)</TT></P>

<P>Quando eu leio em tudo quanto &eacute; lugar que os &nbsp;&quot;hackers&quot;
s&atilde;o respons&aacute;veis por isso e aquilo, vejo que usar este fanzine
para apagar o inc&ecirc;ndio de falsas interpreta&ccedil;&otilde;es da
palavra &nbsp;&quot;hacker&quot; equivale a usar um copo d'&aacute;gua
ao inv&eacute;s de uma mangueira. Agora mesmo uma revista soltou mais um
livro sobre o que &eacute; &nbsp;&quot;hacker&quot;. Artigos escritos por
gente que nem sempre entende porcaria nenhuma de hacking ou phreaking,
a n&atilde;o ser de ouvir falar, para um p&uacute;blico que &eacute; curioso
sobre vandalismos. V&aacute;rias pessoas me procuraram para dar dicas sobre
o assunto, mas sempre enfocando o lado &nbsp;&quot;negro&quot; da coisa.
As pessoas escrevem sobre o assunto &nbsp;&quot;hacking&quot; e abordam
textos americanos porqu&ecirc; neles existem coisas interessantes. Falam
sobre o vandalismo virtual que &eacute; vendido como se fosse &quot;ciberativismo&quot;.
E nem mesmo mencionam fanzines brasileiros sobre o assunto. Pode procurar.
V&ecirc; se vc encontra &nbsp;&quot;Barata El&eacute;trica&quot; em alguma
bibliografia de reportagem ou livro de autor brasileiro sobre hackers.
Do que acontece aqui no Brasil, s&oacute; se fala de gente que est&aacute;
longe ou an&ocirc;nima. Gente que n&atilde;o vai reclamar aparecer como
v&acirc;ndalo virtual. &Eacute; isso que a imprensa procura quando contata
algu&eacute;m. Um pichador virtual contando seu crime perfeito.</P>

<P>A imprensa lucra muito com esses livros do tipo &quot;seja um hacker
vc tamb&eacute;m&quot;. S&atilde;o dois tipos de propaganda:</P>

<UL>
<LI>Seja um hacker vc tamb&eacute;m (e economize dinheiro com provedor,
telefone, etc ser&aacute; que isso existe?)</LI>

<LI>Aprenda a se defender dos hackers (seja contratado e ganhe fortunas,
&ocirc; mentira, no m&aacute;ximo trabalhe muito e ganhe pouco)</LI>
</UL>

<P>A grande vantagem desse mercado &eacute; que ningu&eacute;m realmente
aprende a ser &quot;hacker&quot;. &Eacute; como ser &quot;cantor de rock&quot;.
Assim como ningu&eacute;m aprende a ser &quot;cantor de rock&quot;. Adianta
ser &quot;cantor de rock&quot; e n&atilde;o ter gravadora ou s&oacute;
seus amigos te ouvirem. Simplesmente porqu&ecirc; a busca do conhecimento
exige persist&ecirc;ncia e n&atilde;o uma grande biblioteca. Claro, os
livros nunca v&atilde;o vender o caminho das pedras. &Eacute; um caminho
que varia de acordo com a pessoa. Cada qual tem um. Mas lucram com a cren&ccedil;a
de que &eacute; um caminho que traz emo&ccedil;&atilde;o, lucro f&aacute;cil.
Mais interessante ainda &eacute; que os livros ficam desatualizados r&aacute;pido,
livrando os autores da responsabilidade de explicar porqu&ecirc; nada que
o livro fala deu certo. T&aacute; escrito em algum lugar. Claro, algumas
v&ecirc;zes nem s&atilde;o eles que escreveram, simplesmente copiaram textos
da internet e publicaram como se fossem deles, naquela cren&ccedil;a que
&quot;ladr&atilde;o que rouba ladr&atilde;o tem cem anos de perd&atilde;o&quot;.
S&atilde;o livros copiando livros. Disserta&ccedil;&otilde;es de mestrado
incompletas, que n&atilde;o comentam nem mesmo que existem fanzines brasileiros
de hackers, s&oacute; falam de atos de vandalismos que deram um bom resultado
na m&iacute;dia. </P>

<P>Qual o caminho certo?</P>

<P>Quem for atr&aacute;s desse tipo de publica&ccedil;&atilde;o procurando
uma dica, deveria primeiro se perguntar qual o seu objetivo. Pensar que
vc ser&aacute; &quot;hacker&quot; porqu&ecirc; comprou um livro ensinando
a ser &quot;hacker&quot; &eacute; o mesmo que comprar um bilhete de loteria
para ficar rico. </P>

<P>Todo mundo tem que pensar qual o caminho est&aacute; trilhando. Do contr&aacute;rio
vai cair num buraco e dependendo do tamanho do buraco em que cair, pode
n&atilde;o sair mais dele, se &eacute; que me entende. Ningu&eacute;m brinca
de pol&iacute;cia e ladr&atilde;o com arma de fogo verdadeira e carregada.
Quais s&atilde;o as op&ccedil;&otilde;es que vejo pelas propagandas de
livro:</P>

<UL>
<LI>Ganhar dinheiro com isso. Ha ha.. os que eu conhe&ccedil;o (brasileiros)
que ganham dinheiro com isso (in-seguran&ccedil;a inform&aacute;tica) para
come&ccedil;ar j&aacute; vieram de fam&iacute;lias muuuito bem remediadas
e j&aacute; usavam computadores quando tinham 8 anos de idade. Afora isso,
j&aacute; alguns &nbsp;&quot;marmiteiros&quot; que escreveram livros dando
a impress&atilde;o de que sabiam alguma coisa. Mas &eacute; um mercado
meio saturado. Se o seu rumo &eacute; esse, escrever livro ou ingressar
no lance de hacking para ganhar dinheiro, vc n&atilde;o &eacute; &quot;hacker&quot;,
&eacute; um mercen&aacute;rio, um parasita que quer se grudar em algu&eacute;m
da turma que sabe para montar uma empresa e depois despedir todo mundo
que queira uma parte do dinheiro. Lamer &eacute; elogio.</LI>

<LI>Se defender dos &nbsp;criminosos virtuais. Em outras palavras, voc&ecirc;
&eacute; um hipocondr&iacute;aco digital e quer saber o suficiente para
n&atilde;o ter que depender de regras comuns do bom senso. Ou.. quer ser
macaco velho para n&atilde;o enfiar a m&atilde;o na cumbuca nem cair em
conto do vig&aacute;rio. N&atilde;o ser enganado nem invadido. Razo&aacute;vel.
A&iacute; fica a pergunta: de que forma e at&eacute; que idade um pai (ou
m&atilde;e) consegue impedir que sua filha continue virgem e casta sem
torna-la uma incompetente para achar marido quando ficar velha? A maneira
mais simples de se prevenir &eacute; atrav&eacute;s da pr&aacute;tica,
da informa&ccedil;&atilde;o. O pre&ccedil;o da liberdade est&aacute; na
eterna vigil&acirc;ncia. Livrinho de &quot;hacker&quot; escrito por &quot;marmiteiro&quot;
n&atilde;o vai te ensinar isso. Mesmo que ensine, quantas coisas vc se
lembra do &uacute;ltimo livro que leu? Vai ter que abrir o olho sempre
e lembrar que &quot;macaco velho tamb&eacute;m cai do galho&quot;.</LI>

<LI>Profissional de seguran&ccedil;a. Ha ha.. vale as dicas acima e em
dobro. Est&atilde;o vendendo at&eacute; curso completo de &quot;hacker&quot;
como se isso fosse manual de seguran&ccedil;a. Qualquer curso desses est&aacute;
defasado antes que vc termine de ler. &Eacute; que nem comprar um carro
por cons&oacute;rcio. Quando terminou de pagar, o carro n&atilde;o vale
na revenda nem a metade do que se pagou. Com um adendo: parou de se atualizar
por 3 ou 6 meses, n&atilde;o vai se lembrar de mais nada que preste. O
verdadeiro profissional de seguran&ccedil;a come&ccedil;a segurando o pr&oacute;prio
micro. Procura sua informa&ccedil;&atilde;o sozinho atrav&eacute;s de grupos
de discuss&atilde;o ou p&aacute;ginas gratuitas na internet, tem um monte
delas alertando para tudo quanto &eacute; tipo de problema, inclusive seguran&ccedil;a
inform&aacute;tica. Se vc n&atilde;o tem iniciativa para aprender sozinho,
fazer cursos de seguran&ccedil;a inform&aacute;tica &eacute; um gasto de
dinheiro. Pode funcionar para arrumar um emprego. Mas na vida real, n&atilde;o
garante.</LI>

<LI>Quer aprender s&oacute; o suficiente para ser hacker. hahahhahahahaha.
&Eacute; um pregui&ccedil;oso que acredita em &quot;marmita hacker&quot;.
O tipo do cara que compra uma faixa preta numa loja e fala que &eacute;
mestre de karat&ecirc; ou jud&ocirc;. Vai ver, acredita em reprodu&ccedil;&atilde;o
sem necessidade de ato sexual. Se ver a namorada nua com outro cara, vai
acreditar que ele &eacute; m&eacute;dico, s&oacute; porque mostrou o diploma.</LI>

<LI>Pregar pe&ccedil;as em pessoas que nem conhece. Para isso n&atilde;o
&eacute; necess&aacute;rio gastar uma fortuna com computador. Fica acordado
a noite e assiste os filmes do Beavis e do Butthead que tem dicas incr&iacute;veis.
Falo s&eacute;rio. Quer zoar com gente que nem conhece, vai assistir Beavis
e Butthead. Ou assiste o filme &quot;anjo malvado&quot; (the good son),
estrelado pelo Macaulay Culkin. </LI>

<LI>Curiosidade. &Eacute; mais neg&oacute;cio procurar gratuitamente na
Internet. Todos os livros repetem o mesmo conte&uacute;do. No fundo &eacute;
o mesmo conte&uacute;do em todos.</LI>

<LI>Ciberativismo. Melhorou um pouco. Mas o buraco est&aacute; mais embaixo.
&Eacute; preciso uma causa que justifique, usar recursos extremos para
chamar a aten&ccedil;&atilde;o. Obrigar os servidores internet a enxergarem
as vantagens de usar Linux ou FreeBSD a meu ver n&atilde;o &eacute; uma
boa. &Eacute; capaz do delegado de pol&iacute;cia n&atilde;o entender muito
o seu ponto de vista (n&atilde;o esquecer que o Kevin Mitnick foi preso
sem acusa&ccedil;&atilde;o formal l&aacute; nos EUA).</LI>

<LI>Ajudar o mundo a se proteger. Bom, isso vc aprende usando Linux, software
GNU e se juntando a um grupo tipo Linux. Se vc divulgar o linux como alternativa
ao Windows, vai estar ajudando o mundo a se proteger. A ignor&acirc;ncia
provocada pelo ambiente Windows &eacute; o maior perigo.</LI>
</UL>

<P>A sociedade atual n&atilde;o &eacute; aquele mundo justo que pretende
ser. Mas foi o fruto de muito &quot;desenvolvimento&quot;. O objetivo &eacute;
o progresso de todos, mesmo dos exclu&iacute;dos. Aprender para melhorar
o mundo seria o ideal. O que adianta ficar conhecido por &quot;hacking&quot;
quando se est&aacute; na cadeia? Independente se vc leu esse texto pensando
em &quot;hacking&quot; ou n&atilde;o, o caminho certo depende do ponto
de vista. Para o editor de revista &quot;hacker&quot; ou escritor de livro
&quot;hacker&quot;, o certo ser&aacute; vc tirar o dinheiro do seu bolso
e comprar aquela revista cuja propaganda diz que tudo vai dar certo. </P>

</BODY>
</HTML>
