<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>Micos do Namoro via Internet</TITLE>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Author" CONTENT="Derneval R.R. Cunha">
   <META NAME="GENERATOR" CONTENT="Mozilla/3.01Gold (WinNT; I) [Netscape]">
   <META NAME="KeyWords" CONTENT="privacidade, big brother, bbb, invasão de privacidade, segurança, difamação, giovanna, 1984, direito a privacidade, noticias populares, ostracismo">
</HEAD>
<BODY TEXT="#FFFF00" BGCOLOR="#400040" LINK="#0000EE" VLINK="#551A8B" ALINK="#FF0000">

<CENTER><P><A HREF="http://www.inf.ufsc.br/barata/index.html">Homepage</A>
<A HREF="http://barataeletrica.blogspot.com">Blog do Fanzine</A> <A HREF="http://www.inf.ufsc.br/barata/barata28.html">&Iacute;ndice
No 28</A> <A HREF="http://www.inf.ufsc.br/barata/ind.htm">&Iacute;ndice
N&uacute;meros Anteriores</A> <A HREF="http://www.inf.ufsc.br/barata/emai.htm">Contato</A>
<BR>
http://barataeletrica.cjb.net http://www.inf.ufsc.br/<BR>
Vers&atilde;o Txt <A HREF="http://www.barataeletrica.rg3.net">http://www.barataeletrica.rg3.net</A>
</P></CENTER>
<center>

<P><B>MICOS DO NAMORO VIA INTERNET</B></P></center>

<P>Derneval R.R. Cunha</P>

<P>A grande moda atual &eacute; essa: esquece essa coisa de carro do ano,
esquece o &quot;point da galera&quot;, esquece aquela ida para o litoral
de S&atilde;o Paulo (ou Santa Catarina ou NE). Nenhuma necessidade de estar
vestindo a &uacute;ltima moda ou freq&uuml;entar bares. Basta se registrar
em algumas p&aacute;ginas respons&aacute;veis por namoro via internet e
pronto! Sem sair de casa, j&aacute; est&aacute; atr&aacute;s da sua outra
metade. Ou mesmo de companhia para uma noite ou duas. Tudo depende da sua
capacidade como pessoa. As grandes revistas, tipo VEJA, ISTO&Eacute;, falam
muito disso. Mas s&oacute; falam a parte boa. N&atilde;o falam do resto.
</P>

<P><B>Planejando - Fazendo o perfil</B></P>

<P>Mesmo que n&atilde;o se tenha a pretens&atilde;o de usar servi&ccedil;os
de namoro on-line (que fazem um monte perguntas e elaboram seu curriculum
vitae que fica exposto na rede junto com a sua foto, se vc deixar), &eacute;
necess&aacute;rio ter &agrave; m&atilde;o o que vc ir&aacute; falar e o
que n&atilde;o vale a pena ser falado. Por seguran&ccedil;a, &eacute; melhor
n&atilde;o falar que mora numa cobertura no Morumbi, por exemplo. Mas qualquer
relacionamento, &eacute; bom pensar de antem&atilde;o o que vai contar
e o que n&atilde;o vai, nem que seja p. evitar risadinhas dos colegas.</P>

<P>Para facilitar o trabalho, vc pode preencher um question&aacute;rio
num desses namoro-on-line da vida. Cada question&aacute;rio &eacute; diferente,
mas acaba perguntando a mesma coisa, &nbsp;&quot;quem vc &eacute;&quot;.
Tem uma quantidade enorme de mentiras que o pessoal conta. Veja as coisas
desse modo: se vc falar que &eacute; alto, instrutor de academia de muscula&ccedil;&atilde;o,
ganhando 5.000,00 e t&iacute;mido, parece que se pode ter mais sucesso,
mas nem tanto assim, j&aacute; que mulher desconfia. As que n&atilde;o
desconfiam provavelmente ir&atilde;o desconfiar por conta de alguma amiga.</P>

<P>A idade &eacute; um fator importante a se considerar. Botox &eacute;
um truque de maquiagem que realmente d&aacute; a impress&atilde;o de rejuvenescer
a pessoa. E est&aacute; virando moda. E realmente ajuda muito. S&oacute;
que &eacute; caro e uma hora acaba. &Eacute; poss&iacute;vel se advinhar
a idade atrav&eacute;s de v&aacute;rios truques. Exige uma vigil&acirc;ncia
sobre o que a pessoa fala. Como? Faz Cntrl-c Cntrl-v com os di&aacute;logos
do chat. Meio chato porqu&ecirc; &eacute; t&atilde;o bom acreditar que
se achou a pessoa ideal.</P>

<P>&Eacute; preciso ser educado. Por mais incr&iacute;vel que possa parecer,
existe chance de algum parente seu te abordar. Pior, esse parente pode
ser aquela tia-av&oacute;, que est&aacute; louca, desesperada por algu&eacute;m
que fale com ela. Ia at&eacute; comentar da chance de se encontrar a pr&oacute;pria
m&atilde;e no chat, mas (na teoria) m&atilde;e n&atilde;o faz dessas coisas.
Outro caso &eacute; adolescentes com menos de 18 anos (vulgo chave-de-cadeia).
</P>

<P>O mais f&aacute;cil &eacute; escolher um servi&ccedil;o. Gratuito, &oacute;bvio.
Tem v&aacute;rios. O problema &eacute; que em qualquer servi&ccedil;o gratuito
que voc&ecirc; escolher, est&aacute; assim de marmanjo. Outro problema
&eacute; a quest&atilde;o do perfil da mulher que voc&ecirc; quer e quais
as que vc topa. Logo de cara, para se registrar em algum lugar, vc tem
que responder essas perguntas. Quem voc&ecirc; &eacute; e o que voc&ecirc;
quer. </P>

<P>&Eacute; preciso ent&atilde;o responder um question&aacute;rio. Algumas
perguntas s&atilde;o b&aacute;sicas: idade, peso, altura, cor de pele,
profiss&atilde;o, etc Outras s&atilde;o mais elaboradas, tipo o que espera
da mulher ideal. Qual a altura dela, idade, peso (gorda ou magra), filhos,
religi&atilde;o. Essa parte d&aacute; o que pensar um pouco. Fiz essa parte
do artigo baseado no question&aacute;rio do Yahoo. Tem o do comovai, do
ig, do sei l&aacute;. Mas todo s&atilde;o mais ou menos iguais. </P>

<P>Cuidados b&aacute;sicos:</P>

<UL>
<LI>N&atilde;o d&ecirc; seu endere&ccedil;o logo de cara</LI>

<LI>Nem seu telefone, use um celular ou fone p&uacute;blico para telefonar
(lembre-se que existe servi&ccedil;o de localiza&ccedil;&atilde;o de chamadas)</LI>

<LI>&Eacute; bom saber que se vc chamar a pessoa a cobrar, o n&uacute;mero
do telefone aparece na conta de quem est&aacute; pagando a chamada.</LI>

<LI>Que banco vc usa, se tem cart&atilde;o de cr&eacute;dito, desconversa
e vai embora, ningu&eacute;m deveria perguntar isso.</LI>

<LI>&Eacute; meio paran&oacute;ico, mas enrolar sobre o local onde mora
evita problemas (quando ainda n&atilde;o se tem certeza).</LI>

<LI>Use email gratuito da Internet no in&iacute;cio. Vc n&atilde;o vai
querer que algu&eacute;m entupa o email do seu trabalho com declara&ccedil;&otilde;es
de amor.</LI>

<LI>N&atilde;o gostou da pessoa, n&atilde;o fala absolutamente nada.</LI>

<LI>V&ecirc; l&aacute; qual tipo de foto vc vai divulgar. Foto de dez anos
atr&aacute;s &eacute; dose.</LI>

<LI>O primeiro encontro tem que ser em lugar p&uacute;blico</LI>
</UL>

<P>De resto:</P>

<P>Quando se mora em uma cidade como S&atilde;o Paulo, de 16 milh&otilde;es
de habitantes, fica mais f&aacute;cil ter menos dinheiro. Ent&atilde;o
a oferta &eacute; grande. Escolher por conta da faixa monet&aacute;ria
da menina limita um pouco. </P>

<P>At&eacute; a&iacute; n&atilde;o tem nada muito diferente do que se pergunta
em 10 ou 20 minutos de bate-papo. Se fosse ao vivo, haveria a grande vantagem
de n&atilde;o ter que perguntar muita coisa (como tamb&eacute;m n&atilde;o
teria que responder). S&oacute; que ao vivo &eacute; aquela trabalheira,
ent&atilde;o voltamos ao que se quer da mulher e o que n&oacute;s somos.
</P>

<P>&Eacute; preciso tamb&eacute;m arrumar uma foto escaneada e tamb&eacute;m
um telefone (de prefer&ecirc;ncia) para contato. A&iacute; &eacute; que
come&ccedil;am os truques: n&atilde;o usar seu email principal (uma boa
id&eacute;ia, logo logo vc descobre porqu&ecirc;). E um local para o primeiro
encontro.</P>

<P>N&atilde;o &eacute; barato fazer namoro on-line. &Eacute; menos caro.
Gasta-se com o provedor, conta de telefone (quando se ligar para celular),
cart&otilde;es telef&ocirc;nicos (quando n&atilde;o se tem ou n&atilde;o
se quer usar o pr&oacute;prio telefone). Tamb&eacute;m pode-se gastar com
o servi&ccedil;o de namoro virtual, mas sou mais as op&ccedil;&otilde;es
gratuitas.</P>

<P><B>Os micos</B></P>

<P>Identidade falsa - <FONT COLOR="#FFFF80">Importante saber que h&aacute;
adolescentes em quantidade se fazendo passar por adultos. Ali&aacute;s,
n&atilde;o s&oacute; adolescentes se fazendo passar por adultos. Todo mundo
se fazendo passar por todo mundo. </FONT>A internet &eacute; o grande para&iacute;so
das gordinhas. Das feias. Das mulheres que j&aacute; perderam ou nunca
tiveram qualquer chance de &quot;desencalhar&quot;. Depois de uma determinada
idade, quase ningu&eacute;m olha para elas, a n&atilde;o ser o caixa do
banco ou a menina do supermercado. J&aacute; que &eacute; assim, porqu&ecirc;
n&atilde;o colocar a foto da Adriane Galisteu e tentar enrolar um garot&atilde;o
de praia? Elas fazem isso, te juro. </P>

<P>As adolescentes on-line s&atilde;o um problema legal (menor de 18 &eacute;
chave-de-cadeia). Muitas v&ecirc;zes est&atilde;o com tudo em cima. E est&atilde;o
afim de se divertir. Pegar namorado mais velho do que elas ganha pontos
entre as colegas. J&aacute; vi no J&ocirc; o caso de uma ga&uacute;cha,
famosa atriz de pornochanchada que se casou aos 14 anos, para sair da casa
dos pais. Claro que o c&oacute;digo civil mudou, mas ainda n&atilde;o li
at&eacute; que ponto transar com menina de menor &eacute; considerado ou
n&atilde;o estupro. </P>

<P>Se a id&eacute;ia &eacute; entrar numa dessas para se casar, lembre-se
que a dura&ccedil;&atilde;o m&eacute;dia de casamentos em S&atilde;o Paulo
&eacute; de 6 meses. Conhe&ccedil;o um casamento que durou uns 10 anos
e est&aacute; durando ainda. Mas &eacute; loteria. Lembre-se: vc s&oacute;
conhece realmente a pessoa com quem est&aacute; casado no dia do julgamento
do pedido de separa&ccedil;&atilde;o.</P>

<P><FONT COLOR="#FFFF80">Chato &eacute; quando vc tem o maior papo com
a menina na Internet, troca foto e depois quando vai procurar se encontrar
com a mo&ccedil;a e descobre que era trote. A dona do telefone nem sabe
o que &eacute; internet. Ou ent&atilde;o &eacute; amiga da menina com quem
vc conversou. Nesse caso, pode acontecer da menina conversar contigo pela
internet, conversar contigo pelo telefone e depois mandar a amiga se encontrar
contigo.</FONT></P>

<P><FONT COLOR="#FFFF80">Outra coisa &eacute; ela te mandar ir para algum
lugar e ficar de olho em vc, s&oacute; para ver a cara de trouxa, procurando
ela. </FONT></P>

<P><FONT COLOR="#FFFF80">Mas algumas v&ecirc;zes ela nem te manda para
algum lugar. Simplesmente usa um monte de subterf&uacute;gios (estou viajando,
estou ocupada) e n&atilde;o vai te encontrar nunca. </FONT></P>

<P><B><FONT COLOR="#FFFF80">Hist&oacute;rias Reais</FONT></B></P>

<P>Experi&ecirc;ncia pessoal</P>

<P>Algumas v&ecirc;zes tentei esse lance. Meio que besteira. Dentro de
universidade &eacute; muito mais f&aacute;cil do que na Internet. O problema
&eacute; quando se quer um tipo especial de mulher. Algo que dure um pouco.
H&aacute; tamb&eacute;m a ilus&atilde;o de que uma mulher conseguida via
internet vai te enrolar menos. Outra &eacute; que fico na frente do computador
direto. O motivo n&atilde;o importa. Arrumei um email s&oacute; para isso
e fui &agrave; luta.</P>

<P>Comecei via chat. Telefonei para a menina. Combinei um cineminha. Estabeleci
o vestu&aacute;rio que ia usar, ela me falou como estaria vestida. Cheguei
l&aacute;, tribuf&uacute;. Nem a voz que atendeu o telefone era dela, mas
de uma amiga dela. </P>

<P>Tomei a precau&ccedil;&atilde;o de semrpe exigir foto antes. At&eacute;
descobrir que sem telefone celular, &eacute; meio que besteira ficar paquerando
no chat. Precisa-se de algum telefone f&aacute;cil de ser acessado e que
n&atilde;o seja o telefone de casa (sen&atilde;o a pessoa te acha na lista
telef&ocirc;nica). Mas tudo bem, mesmo assim, consegui um encontro com
uma divorciada. N&atilde;o era l&aacute; essas coisas, mas no final ela
queria um amigo antes de um namorado. Deixei de lado.</P>

<P>Acabei entrando num servi&ccedil;o de namoro via internet. Cheio de
perguntas e respostas. Foi meio dif&iacute;cil para mim, colocar uma foto
on-line. Mas at&eacute; coloquei. Excelente. Podia come&ccedil;ar. Durante
algum tempo o servi&ccedil;o permitia que vc chamasse as pessoas on-line
e quanto correspond&ecirc;ncia quisesse (depois de um per&iacute;odo de
tempo, s&oacute; pagando). Mandei muitas, poucas responderam. Me identifiquei
com uma, j&aacute; que o per&iacute;odo de teste estava acabando. E vit&oacute;ria,
consegui arrancar dela um encontro numa lanchonete. Sem ter que gastar
cart&atilde;o telef&ocirc;nico (v&aacute;rios amigos meus gastam, telefonando
p. celular da mina). A mulher pediu para que eu vestisse algo que permitisse
o reconhecimento, mas n&atilde;o me falou como ia estar vestida. Acabei
topando, crente que estava ganhando. </P>

<P>Cheguei l&aacute;, dia de sol, meia hora esperando na lanchonete. Chegou
5 minutos depois do limite. Parecia minha av&oacute;, n&atilde;o tinha
absolutamente nada a ver com a foto. Na hora eu fiquei sem saber o que
fazer. Sentado l&aacute;, joguei as cartas na mesa &quot;vc n&atilde;o
tem 38 anos&quot;. N&atilde;o tinha, tava completando 39. Fazer o qu&ecirc;?
Bancar o mal educado e ir embora? Tentei conversar um pouco, para n&atilde;o
perder a viagem, ser educado. Fazer de conta que era alguma tia minha.
Ela foi no banheiro. Eu devia ter aproveitado e ido embora. Perdi a chance,
mas prossegui com o plano. Para n&atilde;o ficar com remorso de sacanear
algu&eacute;m assim &agrave; toa. Comecei a contar umas hist&oacute;rias
do CRUSP <A HREF="http://crusp.virtualave.net">http://crusp.virtualave.net</A>
. Depois de umas dez hist&oacute;rias minhas, a mulher resolveu contar
uma das dela, tipo piada de legista no IML, j&aacute; ouviu? </P>

<CENTER><TABLE BORDER=1 WIDTH="70%" >
<TR>
<TD>(*) Leia a piada no final da mat&eacute;ria. Antes de almo&ccedil;ar
ou bem depois do almo&ccedil;o.</TD>
</TR>
</TABLE></CENTER>

<P><FONT COLOR="#FFFF80">A hist&oacute;ria que ela me contou me deixou
muito pior que isso a&iacute;(*). Ali&aacute;s n&atilde;o era nem piada.
Ia me contando e comendo sandu&iacute;che. A mulher comia feito uma porca.
Ainda por cima. Dava nojo de ver ela com um sandu&iacute;che na m&atilde;o,
vai ver foi a conversa dela que me fez pensar assim. Ou era truque, joguinho
para me deixar com nojo de prop&oacute;sito e contar para as amigas que
j&aacute; &quot;testou&quot; o cara. Pois &eacute;. Larguei ela no &ocirc;nibus
e no dia seguinte falei que n&atilde;o tinha nada a ver. </FONT></P>

<P><FONT COLOR="#FFFF80">Achei que a hist&oacute;ria tinha acabado por
a&iacute;. Nada. Passaram-se uns dias. Encontrei uma menina on-line que
parecia legal. Comecei a desenvolver um papo. Pedi para ela mandar as fotos.
Era ela. Me mandou uma amiga me &nbsp;&quot;conquistar&quot;. Depois que
o papo desenvolveu, ela assumiu a identidade. Me mandou as fotos delas.
N&atilde;o aquela foto de atriz de &quot;malha&ccedil;&atilde;o&quot;,
mas as que ela tirou sei l&aacute;, antes de cortar o cabelo. Fotos atuais.
Mais um tempo, uma &quot;estudante de publicidade&quot; me procurou. N&atilde;o
recebia email dela havia mais de 6 meses. 3 emails depois, pelo papo descobri
que era a mesma pessoa. Um dia, fui jantar num lugar, quando terminei,
vi que a mulher estava sentada olhando para mim. S&oacute; que detalhe:
o botox tinha acabado o efeito. A cara dela parecia mais velha. Fazer o
qu&ecirc;?</FONT></P>

<P><FONT COLOR="#FFFF80">&quot;Golpe&quot; da sofredora</FONT></P>

<P><FONT COLOR="#FFFF80">Essa da&iacute; aconteceu com um amigo meu. Vou
chama-lo de Miguel. Ele freq&uuml;entava um grupo de discuss&atilde;o,
virou figura de destaque. A&iacute; foi abordado (em email privado) por
uma menina que parecia super legal, que gostava das falas dele. Come&ccedil;aram
a trocar emails fora da lista de discuss&atilde;o. Ela sempre falando que
estava sendo sincera. At&eacute; comentou que estava sentindo atra&ccedil;&atilde;o
por ele. O Miguel ficou doido quando leu. Antes que se recuperasse, dia
seguinte j&aacute; estava recebendo email mais ou menos assim:</FONT></P>

<CENTER><TABLE BORDER=1 WIDTH="60%" >
<TR>
<TD>Vc n&atilde;o vai estranhar, n&atilde;o sei nem se vc est&aacute; comprometido,
mas j&aacute; estou mandando minha foto. </TD>
</TR>
</TABLE></CENTER>

<P><FONT COLOR="#FFFF80">No atachado, a foto de uma &quot;patricinha&quot;
deslumbrante. O cara ficou doido. O papo continuou, sempre via email. Depois
por telefone. Interurbano, porqu&ecirc; a menina (em torno de 20 anos de
idade) morava l&aacute; longe. Ela sempre falando em ir para S&atilde;o
Paulo passar as f&eacute;rias. Ele, sem dinheiro nem para viajar para o
litoral. Mesmo assim, era aquela ansiedade. &nbsp;&quot;Beijos virtuais
de incenso e mel&quot;.</FONT></P>

<P><FONT COLOR="#FFFF80">Depois come&ccedil;ou a conhecer a hist&oacute;ria
dela. Triste. Saindo de uma paix&atilde;o por email. O cara trocou ela
por algu&eacute;m mais pr&oacute;ximo. Os pais dela sempre enchendo a paci&ecirc;ncia.
A cidade pequena onde morava, tremendamente chata e desinteressante. Conservadora
e sem perspectiva. A menina estava se abrindo, contando seus sentimentos.
Depois por um tempo, se fechava, ficava amarga. Mas apesar da tristeza
da hist&oacute;ria de vida dela, adorava o papo, dizia que meu amigo &nbsp;&quot;estava
vencendo as resist&ecirc;ncias dela&quot;. E que iria aparecer em S&atilde;o
Paulo. Tempos depois mudava de id&eacute;ia, falava que tinha medo. Noutros
dias, ficava p(*) da vida com coisinha a toa e falava um monte. Depois
pedia desculpa. Sempre esta altern&acirc;ncia, dando coice para depois
pedir desculpa. Nada de aparecer.</FONT></P>

<P><FONT COLOR="#FFFF80">Quase quatro meses, esta hist&oacute;ria. O sujeito
gastou uma fortuna em cart&otilde;es telef&ocirc;nicos, quase tanto quanto
uma passagem de &ocirc;nibus interestadual. Sem falar nas dores de cabe&ccedil;a,
pensando nas besteiras que tinha de ouvir da menina ou tentando entender
o que tinha feito de errado. Come&ccedil;ou a ir mal nos estudos. Tudo
isso por conta de uma mulher que ele nunca viu.</FONT></P>

<P><FONT COLOR="#FFFF80">Como a hist&oacute;ria acabou? Eu tive que escutar
boa parte dela, amigo &eacute; para essas coisas, n&eacute;? O cara n&atilde;o
acreditou. Ela estava &quot;ensaiando&quot; um adeus. E meu amigo finalmente
arrumou um emprego. Escreveu dando a not&iacute;cia, se despedindo e falando
que ia arrumar um apartamento. O inesperado ocorreu: ela escreveu interessada
por ele. Tentando voltar atr&aacute;s. Sem chance. </FONT></P>

<P><B><FONT COLOR="#FFFF80">Conhecimento que pode prevenir</FONT></B></P>

<P><FONT COLOR="#FFFF80">Que quem come&ccedil;a nisso vai acabar encontrando
muito do &oacute;bvio: mulheres sem dinheiro que querem um cara que sustente
a vida social delas. Mulheres que j&aacute; est&atilde;o vendo o rel&oacute;gio
biol&oacute;gico tocar o alarme e querem casar nem que seja para se separar
depois. Mulheres que resolveram largar o casamento de 10 ou 20 anos. Mulheres
que s&atilde;o insuport&aacute;veis no conv&iacute;vio social. Isso para
n&atilde;o mencionar mulheres que consomem drogas tarja-preta para poder
dormir, aguentar empregos horr&iacute;veis, fam&iacute;lias insuport&aacute;veis
ou problem&aacute;ticas. J&aacute; considerou namorar a irm&atilde; gostosa
de um viciado em drogas? Ou que tal uma mulher que &eacute; presidente
de multinacional e n&atilde;o sabe pedir por favor? Isso para n&atilde;o
falar de alguma doida (ou altamente hist&eacute;rica por conta de desilus&otilde;es
afetivas) como no filme &quot;Atra&ccedil;&atilde;o Fatal&quot;. H&aacute;
mulheres que at&eacute; querem ver se engravidam logo antes que seja tarde.
Feias tentando se passar por bonitas, etc, etc.. </FONT></P>

<P><FONT COLOR="#FFFF80">Era legal abrir os olhos para estes problemas
assistindo uns filmes do tipo:</FONT></P>

<UL>
<LI><FONT COLOR="#FFFF80">&quot;Um bonde chamado Desejo&quot; (A Street
car named Desire) - Baseado numa pe&ccedil;a de teatro, &eacute; um filma&ccedil;o
contando como &eacute; que &eacute; uma mulher problem&aacute;tica e &quot;encalhada&quot;
se virando para arrumar um trouxa.</FONT></LI>

<LI><FONT COLOR="#FFFF80">&quot;A Malvada&quot; (All about Eve) - Essa
da&iacute; eu nem vou contar. Mas &eacute; filme famoso.</FONT></LI>

<LI><FONT COLOR="#FFFF80">&quot;Bonitinha mas ordin&aacute;ria&quot; -
Muito bom, mas se vc puder esquecer as cenas de sexo vai poder entender
melhor a mensagem.</FONT></LI>

<LI><FONT COLOR="#FFFF80">&quot;8 mulheres&quot; (8 femmes) - &Eacute;
engra&ccedil;ado, mas pensa bem no &uacute;nico homem do filme.</FONT></LI>

<LI><FONT COLOR="#FFFF80">&quot;Atra&ccedil;&atilde;o Fatal&quot; (Fatal
Attraction) - O perigo da mulher aparentemente descart&aacute;vel</FONT></LI>

<LI><FONT COLOR="#FFFF80">&quot;Esse obscuro objeto do desejo&quot; (That
Obscure Object of Desire) - Este &eacute; bem importante.</FONT></LI>

<LI><FONT COLOR="#FFFF80">etc, etc..</FONT></LI>
</UL>

<P>OBS: Assistir uns filmes desse tipo at&eacute; desamina. Mas pagar mico
tamb&eacute;m. &Oacute;bvio, n&atilde;o estou escrevendo isso pensando
em esgotar o assunto. Tem alguns filmes espec&iacute;ficos sobre namoro
on-line, como &nbsp;&quot;Voc&ecirc; tem email&quot; que estou ignorando.
Mas o tema s&atilde;o os micos e n&atilde;o a parte t&eacute;cnica.</P>

<P><B><FONT COLOR="#FFFF80">Conclus&otilde;es</FONT></B></P>

<P><FONT COLOR="#FFFF80">S&oacute; na fantasia &eacute; que a Internet
&eacute; uma forma f&aacute;cil de resolver o problema do leitor t&iacute;pico
do fanzine (apesar que acho essa de leitor t&iacute;pico uma lenda urbana).
Para come&ccedil;ar muita mulher quer ser paquerada e s&oacute;. Levantou
o astral dela, dane-se o cara. Sabe que no mundo virtual tudo &eacute;
poss&iacute;vel. O videogame delas &eacute; exatamente esse faz-de-conta.
Para elas &eacute; um jogo. Se o cara tem alguma hist&oacute;ria ou truque
que interessa para as amigas, elas continuam enrolando o cara. Se n&atilde;o
tem, aguardam ele ficar bem doidinho e depois tchau. Nem se lembram mais
da figura. Isso porqu&ecirc; a grande maioria dos caras que entram nessa
n&atilde;o est&atilde;o afim de casar. Claro que o cara que entra nessa,
fica bobo, quer acreditar que a Giselle B&uuml;ndchen est&aacute; ali na
esquina com uma ferrari esperando por ele. </FONT></P>

<P><FONT COLOR="#FFFF80">Com o tempo at&eacute; descobre v&aacute;rios
truques, aprende que n&atilde;o h&aacute; muito o que escolher. Talvez
at&eacute; consiga alguma coisa, se ficar direto no micro, como um viciado,
pesquisando a internet atr&aacute;s de mulher. Porqu&ecirc; todo mundo
que tem perseveran&ccedil;a consegue alguma coisa. </FONT></P>

<P><FONT COLOR="#FFFF80">-----------------------------------</FONT></P>

<P><FONT COLOR="#FFFF80">(*) N&Atilde;O LEIA AP&Oacute;S O ALMO&Ccedil;O
- </FONT>Tavam os dois auxiliares num necrot&eacute;rio e pagamento atrasado
h&aacute; v&aacute;rios dias. Domingo, ambos morrendo de fome, aparece
o cad&aacute;ver (vulgo &quot;presunto) desovado no rio. Abrem o cad&aacute;ver
para diagnosticar a morte. O&nbsp;distinto estava com um espaghetti a bolonhesa
no est&ocirc;mago. Um deles olhou para o outro, aquela fome, perguntou:
<BR>
- Quer?<BR>
- N&atilde;o, n&atilde;o gosto de comer coisa fria.<BR>
O outro botou num prato e mandou ver. S&oacute; que aquela coisa meio podre
foi descendo pela garganta, bateu no est&ocirc;mago e .. voltou logo pro
prato. O outro falou:<BR>
- &Ocirc;pa, agora que est&aacute; quente eu quero.</P>

<P><FONT COLOR="#FFFF80">Parei com essa de namoro virtual. </FONT></P>

<P><FONT COLOR="#FFFF80">Alguns links legais:</FONT></P>

<P><FONT COLOR="#FFFF80">almas g&ecirc;meas <A HREF="http://www.terra.com.br/almas" target="_blank">www.terra.com.br/almas<BR>
</A>amigos virtuais <A HREF="http://www.uol.com.br/amigosvirtuais" target="_blank">www.uol.com.br/amigosvirtuais<BR>
</A>aol <A HREF="http://www.amor.americaonline.com.br" target="_blank">www.amor.americaonline.com.br<BR>
</A>cara-metade <A HREF="http://www.cara.gbl.com.br" target="_blank">cara.gbl.com.br<BR>
</A>como vai <A HREF="http://www.comovai.com.br" target="_blank">www.comovai.com.br<BR>
</A>feelings <A HREF="http://www.feelings.com.br" target="_blank">ww.feelings.com.br<BR>
</A>fulano <A HREF="http://www.fulano.com.br" target="_blank">www.fulano.com.br<BR>
</A>mr. cupido <A HREF="http://www.mrweb.com.br/cupido" target="_blank">www.mrweb.com.br/cupido<BR>
</A>par perfeito <A HREF="http://www.parperfeito.com.br" target="_blank">www.parperfeito.com.br<BR>
</A>agora vai <A HREF="http://www.agoravai.com.br" target="_blank">www.agoravai.com.br<BR>
</A>amor &amp; cia <A HREF="http://www.amorecia.com" target="_blank">www.amorecia.com<BR>
</A>namoro online <A HREF="http://www.namoroonline.com.br" target="_blank">www.namoroonline.com.br<BR>
</A>namoros <A HREF="http://www.namoros.com.br" target="_blank">www.namoros.com.br<BR>
</A>romance online <A HREF="http://www.romanceonline.com.br" target="_blank">www.romanceonline.com.br<BR>
</A>sozinho <A HREF="http://www.sozinho.com.br" target="_blank">www.sozinho.com.br</A></FONT></P>

<P><FONT COLOR="#000000"><FONT SIZE=-2><A HREF="http://www.bonecadetrapo.hpg.ig.com.br/paquera2.htm">(http://www.bonecadetrapo.hpg.ig.com.br/paquera2.htm)</A></FONT></FONT></P>

</BODY>
</HTML>
