<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>PRIVACIDADE &Agrave; VENDA</TITLE>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Author" CONTENT="Derneval R.R. Cunha">
   <META NAME="GENERATOR" CONTENT="Mozilla/3.01Gold (WinNT; I) [Netscape]">
   <META NAME="KeyWords" CONTENT="privacidade, big brother, bbb, invasão de privacidade, segurança, difamação, giovanna, 1984, direito a privacidade, noticias populares, ostracismo">
</HEAD>
<BODY TEXT="#FFFF00" BGCOLOR="#400040" LINK="#0000EE" VLINK="#551A8B" ALINK="#FF0000">

<CENTER><P><A HREF="http://www.inf.ufsc.br/barata/index.html">Homepage</A>
<A HREF="http://barataeletrica.blogspot.com">Blog do Fanzine</A> <A HREF="http://www.inf.ufsc.br/barata/barata28.html">&Iacute;ndice
No 28</A> <A HREF="http://www.inf.ufsc.br/barata/ind.htm">&Iacute;ndice
N&uacute;meros Anteriores</A> <A HREF="http://www.inf.ufsc.br/barata/emai.htm">Contato</A>
<BR>
http://barataeletrica.cjb.net http://www.inf.ufsc.br/<BR>
Vers&atilde;o Txt <A HREF="http://www.barataeletrica.rg3.net">http://www.barataeletrica.rg3.net</A>
</P></CENTER>

<P>PRIVACIDADE &Agrave; VENDA</P>

<P>Derneval R.R.&nbsp;Cunha</P>

<P>Descrever o mundo contempor&acirc;neo torna-se cada vez mais dif&iacute;cil.
Embora viva num mundo f&iacute;sico, onde as pessoas vivem, trabalham,
se divertem e isso pode ser descrito, repete-se de certa modo, a alegoria
da caverna de Plat&atilde;o: o homem contempor&acirc;neo &eacute; como
um prisioneiro numa caverna onde nenhuma luz do sol penetra. Nesta situa&ccedil;&atilde;o,
o prisioneiro n&atilde;o pode se lembrar um tempo quando n&atilde;o era
prisioneiro e nem sabe que &eacute; prisioneiro, tudo &eacute; uma situa&ccedil;&atilde;o
normal. Toda a cultura, conhecimento e significados v&ecirc;m de imagens
projetadas na parede. S&oacute; quando um prisioneiro escapa &eacute; que
pode entender a realidade da situa&ccedil;&atilde;o e n&atilde;o &eacute;
bem recebido pelos que n&atilde;o sa&iacute;ram da caverna.</P>

<P>A televis&atilde;o substitui o fogo que projeta as imagens na parede
e a sociedade, interagindo atrav&eacute;s dos chamados &iacute;ndices de
audi&ecirc;ncia, d&atilde;o o significado ao que quer que esteja sendo
exibido. E a grande sensa&ccedil;&atilde;o agora s&atilde;o os famosos
REALITY SHOWS, onde os integrantes s&atilde;o pessoas comuns, que devem
passar por algum tipo de experi&ecirc;ncia. E agir de forma natural e espont&acirc;nea,
se &eacute; que isso &eacute; poss&iacute;vel. Para o deleite do espectador,
sentado diante de sua TV, no conforto de sua casa. Tal como no romance
de ORWELL, &quot;1984&quot;, o espectador &eacute; o &quot;Grande Irm&atilde;o&quot;
e pode observar cada detalhe do cotidiano de um grupo de pessoas envolvidas
num objetivo qualquer, onde aquele que conseguir permanecer, ganhar&aacute;
um pr&ecirc;mio.</P>

<P>Mas quem &eacute; o &quot;Grande Irm&atilde;o&quot;, no final das contas?
No livro de ORWELL, era o ser supremo que como um deus, poderia ver a tudo
e a todos, controlar todos os passos, de todo o mundo. Quem controla o
show aqui seria o espectador, que em teoria, pode influir, atrav&eacute;s
de telefonemas, cartas e emails, na decis&atilde;o final sobre quem ser&aacute;
o finalista. Uma forma de controle, ainda que pequena, sobre a vida de
indiv&iacute;duos. Mas quem controla o qu&ecirc;? E quem participa do show?
Apesar de uma propaganda quanto &agrave; possibilidade de qualquer um poder
participar desses programas, v&aacute;rias entrevistas j&aacute; relataram
o &oacute;bvio: h&aacute; manipula&ccedil;&atilde;o quanto &agrave; escolha
dos integrantes e quanto ao seu destino durante o espet&aacute;culo. E
ao contr&aacute;rio do personagem Truman Burbank no filme &quot;Truman
Show&quot;, os integrantes devem obrigatoriamente cativar o p&uacute;blico
para garantir sua perman&ecirc;ncia.</P>

<P>Quem &eacute; o &quot;Grande Irm&atilde;o&quot;? Se o show &eacute;
organizado para ser de determinada forma, com determinadas regras, por
um grande emissora de TV, temos algu&eacute;m no topo de uma pir&acirc;mide
de poder, dirigindo tudo. A&iacute; podemos pensar novamente na &quot;teoria
do estabelecimento da agenda&quot;, segundo a qual a audi&ecirc;ncia consome
t&oacute;picos que s&atilde;o decididos pela imprensa. Tal como na novela
de ORWELL, temos a exist&ecirc;ncia de um Minist&eacute;rio da Verdade,
encarregado de decidir para qual assunto ser&aacute; focalizada a aten&ccedil;&atilde;o
do p&uacute;blico. Que &eacute; persuadido de que determinadas atitudes
s&atilde;o melhores para a sociedade, numa forma p&oacute;s-moderna de
exercer o controle de massas.</P>

<P>No filme &nbsp;&quot;THX1138&quot; podemos ver um pouco melhor, qual
o problema de uma sociedade totalmente planejada. Quando a pessoa resolve
que aquilo que est&aacute; dispon&iacute;vel para ela n&atilde;o representa
nenhuma forma de prazer. O&nbsp;filme coloca uma sociedade sem erros. A
pessoa &eacute; monitorada diariamente. Qualquer falha no trabalho ir&aacute;
para um computador. A religi&atilde;o &eacute; substitu&iacute;da por um
confession&aacute;rio virtual: a pessoa confessa as fraquezas e &eacute;
automaticamente perdoado. Para qualquer outro problema, h&aacute; as p&iacute;lulas
de todo tipo. Se elas n&atilde;o est&atilde;o dando resultado (tipo: vc
toma e sua esposa ou sogra ainda est&atilde;o te irritando), essas p&iacute;lulas
s&atilde;o substitu&iacute;das por outras p&iacute;lulas, que s&atilde;o
consumidas. Como se fosse sal na comida ou a pasta de dente. Ningu&eacute;m
escolhe realmente o que quer ouvir, mas o que repetem que &nbsp;&quot;&eacute;
a melhor coisa para se ouvir&quot;. A ditadura do bom senso onde se espera
que todos contribuam com atitudes para melhorar a sociedade.</P>

<P>Atitudes melhores para a sociedade. Todo mundo acaba repetindo isso.
Parece &oacute;bvio. Depois de assistir o Big Brother, parece mais f&aacute;cil
aceitar essa situa&ccedil;&atilde;o de &nbsp;&quot;exclu&iacute;da socialmente&quot;?
Sim, todo mundo no programa torce para que este ou aquele participante
consiga chegar at&eacute; o final. Se esse ou aquele participante que foi
exclu&iacute;do foi manipulado por algu&eacute;m que l&aacute; dentro,
n&atilde;o gostava dele, isso &eacute; secund&aacute;rio. Estamos interessados
&eacute; no resultado, ver aquele por quem n&oacute;s torcemos fora da
lista dos exclu&iacute;dos. Claro que n&atilde;o &eacute; t&atilde;o ruim
assim. Quem &eacute; um dos &uacute;ltimos a ser exclu&iacute;do fica com
uma fama que, em teoria, garante um modo de vida decente. E an&ocirc;nimo,
nunca mais! N&atilde;o, s&atilde;o todos pessoas que tiveram bem mais do
que 16 minutos de fama. Ent&atilde;o, ser exclu&iacute;do n&atilde;o &eacute;
o fim do mundo para estas pessoas. E talvez n&atilde;o seja o fim do mundo
para a pessoa que estamos excluindo. At&eacute; que acontece com a gente.</P>

<P>Voltando ao Big Brother, todo mundo, em nome do pr&ecirc;mio, est&aacute;
obrigado a participar e a ser socialmente aceit&aacute;vel. Mas a&iacute;
fica tamb&eacute;m a quest&atilde;o do poder. Se no Big Brother temos a
possibilidade de &nbsp;&quot;excluir&quot; a pessoa de um grupo, o que
determina essa exclus&atilde;o? Alguma trai&ccedil;&atilde;o? Alguma atitude
da pessoa, provavelmente. A pr&oacute;pria pessoa se condena ao fazer ou
deixar de fazer alguma coisa. &Eacute; interessante, porqu&ecirc; s&atilde;o
todos obrigados a fazer alguma coisa sempre, para permanecer em paz com
o resto do grupo. Sen&atilde;o, n&atilde;o s&atilde;o parte de um grupo,
s&atilde;o pessoas individuais. Sobram ent&atilde;o os esquemas tipo &quot;planos
do Cebolinha para vencer a M&ocirc;nica&quot;. Como fazer com que a pessoa
com quem vc convive seja exclu&iacute;da do grupo sem que vc seja responsabilizado
e portanto exclu&iacute;do do grupo.</P>

<P>Porqu&ecirc; ningu&eacute;m &eacute; perfeito. Todos n&oacute;s temos
nossos pequenos defeitos(*). Qualquer um de n&oacute;s pode ter um p&eacute;ssimo
dia. Um segredinho qualquer. E n&atilde;o existe nada que substitua, poder
bancar o homem invis&iacute;vel e estar a par das fraquezas alheias. Veja
por exemplo a quest&atilde;o da festa da GV, uma das grandes fofocas de
2002. Como aconteceu tudo? Uma festa, com recintos fechados (vulgo &nbsp;&quot;cafofos&quot;),
dispon&iacute;veis para quem quisesse, com um cartaz avisando &quot;sorria,
vc est&aacute; sendo filmado&quot;. Legal. Qual o problema? V&aacute;rias
meninas foram l&aacute; acompanhadas e fizeram v&aacute;rias coisas. O
problema &eacute; que realmente havia gente tirando fotos. Ningu&eacute;m
realmente acreditava que as fotos iriam chegar na Internet. Chegaram. Para
piorar a situa&ccedil;&atilde;o, havia um site que promovia a festa da
GV, ent&atilde;o mesmo que o rosto das pessoas que estavam transando nos
cafofos n&atilde;o aparecessem, havia a alternativa:&nbsp;ir no site que
promoveu a festa e pela fantasia descobrir quem estava no &quot;cafofo&quot;
com quem. O antes e o depois. O resto da hist&oacute;ria todo mundo sabe.
Todo mundo enviando as fotos via email para todo mundo. Ou o link do site.
A &uacute;ltima not&iacute;cia (ou boato) &eacute; que uma das meninas
envolvidas teria se suicidado por conta da press&atilde;o social (as meninas
envolvidas no incidente eram menores e cursavam col&eacute;gios chiques
de S&atilde;o Paulo).</P>

<P>Outro exemplo? As fotos da &quot;suruba que n&atilde;o houve&quot;,
em Ribeir&atilde;o Preto. Houve ou n&atilde;o houve? N&atilde;o sei. O
que contaram por a&iacute; &eacute; que um notebook (ou roubaram o carro
com v&aacute;rios disquetes), contendo fotos de uma festa de v&aacute;rias
&nbsp;&quot;personalidades&quot; da elite da cidade em posi&ccedil;&otilde;es
bastante &iacute;ntimas, esse notebook roubado foi objeto de uma tentativa
de extors&atilde;o contra as pessoas que estariam retratadas nas fotos.
Ent&atilde;o as fotos viraram CD e foram tamb&eacute;m divulgadas na Internet.
Virou mat&eacute;ria do Jornal da Globo <A HREF="http://redeglobo.globo.com/cgi-bin/jornaldaglobo/montar_texto.pl?controle=1257">http://redeglobo.globo.com/cgi-bin/jornaldaglobo/montar_texto.pl?controle=1257</A>
. A conclus&atilde;o da reportagem &eacute; que as fotos s&atilde;o montagem.
As fam&iacute;lias teriam contratado especialistas para comprovar a falsifica&ccedil;&atilde;o.
Mas cada um acredita no que quer. As fotos at&eacute; hoje podem ser encontradas
com facilidade no Google ou em sites. </P>

<P>Ah, claro, seria chato esquecer a lenda urbana de que em alguns dos
mot&eacute;is cariocas mais famosos haveriam c&acirc;meras filmando as
transas para revender depois. Mas o site que propaga essa &nbsp;&quot;not&iacute;cia&quot;,
o Cocadaboa.com pelo menos coloca a tarja &quot;Furos de verdade na m&iacute;dia
da mentira&quot;. H&aacute; outros que j&aacute; foram alterados ou &quot;sa&iacute;dos
do ar&quot;, como o famoso &nbsp;&quot;Juro por Deus&quot;, o &nbsp;&quot;O
site da vida dos estudantes universit&aacute;rios do Brasil&quot;, imitado
pelo &nbsp;&quot;Foda-se b&ecirc;bados&quot;. O site tinha uma cole&ccedil;&atilde;o
de fotos mais ou menos no estilo &nbsp;&quot;sua namorada te traiu? publica
as fotos dela aqui&quot;. Muitas fotos pareciam mais coisa retirada de
sites &nbsp;&quot;amateurs&quot; ou &quot;mardi gras&quot;, que publicam
todo tipo de adolescentes ou mesmo pessoas que poderiam ser vizinhos ou
colegas de classe fazendo coisas que dariam muita fofoca. Com nomes. A
foto era de algu&eacute;m, de determinada cidade, com uma hist&oacute;ria.
&Agrave;s v&ecirc;zes parece fabrica&ccedil;&atilde;o mesmo. Mas se algu&eacute;m
fala que &eacute; verdade, todo mundo vai atr&aacute;s acreditando. </P>

<P><B>Vendendo a imagem</B></P>

<P>Algu&eacute;m se lembra do casal que ia perder a virgindade transmitida
pela internet <A HREF="http://www.estado.estadao.com.br/jornal/98/07/17/news036.html">http://www.estado.estadao.com.br/jornal/98/07/17/news036.html</A>
? Foi por volta de julho de 1998.Foi cancelada dias depois, mas seria transmitido
num site, www.ourfirstime.com que at&eacute; existe ainda, mas com outro
conte&uacute;do. Acabou sendo um dos trotes mais famosos da Internet (
<A HREF="http://www.tabloid.net/1998/07/17/hoax_980717.html">http://www.tabloid.net/1998/07/17/hoax_980717.html</A>
). N&atilde;o s&oacute; nenhum dos 2 participantes, Mike e Diane, eram
virgens, como tamb&eacute;m iam cobrar para quem quisesse assistir. O que
n&atilde;o sei direito &eacute; o caso da Pamela Anderson e seu namorado,
Tommy Lee, cujo v&iacute;deo da lua de mel foi &nbsp;&quot;roubado&quot;,
gerando uma das maiores distribui&ccedil;&otilde;es pela internet. O div&oacute;rcio
veio pouco tempo depois. Na briga judicial pelos direitos do v&iacute;deo,
h&aacute; uma quest&atilde;o interessante: o v&iacute;deo tem cenas que
n&atilde;o foram realizadas dentro de casa, mas numa viagem pelo lago Meade
em Nevada. Se foi feito em local p&uacute;blico, ent&atilde;o os direitos
de propriedade (de acordo com a legisla&ccedil;&atilde;o americana) n&atilde;o
valem <A HREF="http://news.com.com/2100-1023-207479.html?legacy=cnet">http://news.com.com/2100-1023-207479.html?legacy=cnet</A>
.</P>

<P>Claro que h&aacute; outras formas de se vender a intimidade via internet.
</P>

<P><B>Arte</B></P>

<P>Conversei com gente que esteve no evento do Spencer Tunick <A HREF="http://www.spencertunick.com/">http://www.spencertunick.com/</A>.
O cara que fotografou os &nbsp;&quot;pelados no ibirapuera&quot;. Especificamente,
vi as fotos na Bienal de S&atilde;o Paulo e falei com a menina que ajudou
a organizar. Muita gente foi embora depois da primeira seq&uuml;&ecirc;ncia
de fotos, quando rep&oacute;rteres invadiram uma &aacute;rea que deveria
estar guardada. Houve outra quebra de privacidade, quando o endere&ccedil;o
de cerca de 800 participantes que se inscreveram para participar da performance
foram espalhados pela Internet (um caso de uso de To: ao inv&eacute;s de
Bcc: no email). Fizeram at&eacute; grupo de discuss&atilde;o em cima disso,
com fotos e tudo. Dizem que as pessoas que participaram receberam fotos
que podem ser vendidas pelos leil&otilde;es virtuais &agrave; mais ou menos
US$ 700,00, mas n&atilde;o sei. Foi uma chance de guardar a imagem para
a posteridade ou de ver gente nua. Claro que as pessoas que se dispuseram
a participar assinaram um termo autorizando o uso das fotos.</P>

<P><B>A Privacidade na legisla&ccedil;&atilde;o</B></P>

<P>&Eacute; interessante ter em mente o que o novo C&oacute;digo Civil
tem a dizer:</P>

<CENTER><TABLE CELLSPACING=0 CELLPADDING=0 WIDTH="70%" >
<TR>
<TD>Art. 11. Com exce&ccedil;&atilde;o dos casos previstos em lei, os direitos
da personalidade s&atilde;o intransmiss&iacute;veis e irrenunci&aacute;veis,
n&atilde;o podendo o seu exerc&iacute;cio sofrer limita&ccedil;&atilde;o
volunt&aacute;ria. 
<P>Art. 12. Pode-se exigir que cesse a amea&ccedil;a, ou a les&atilde;o,
a direito da personalidade, e reclamar perdas e danos, sem preju&iacute;zo
de outras san&ccedil;&otilde;es previstas em lei.</P>

<P>Par&aacute;grafo &uacute;nico. Em se tratando de morto, ter&aacute;
legitima&ccedil;&atilde;o para requerer a medida prevista neste artigo
o c&ocirc;njuge sobrevivente, ou qualquer parente em linha reta, ou colateral
at&eacute; o quarto grau.</P>

<P>Art. 15. Ningu&eacute;m pode ser constrangido a submeter-se, com risco
de vida, a tratamento m&eacute;dico ou a interven&ccedil;&atilde;o cir&uacute;rgica.</P>

<P>Art. 16. Toda pessoa tem direito ao nome, nele compreendidos o prenome
e o sobrenome.</P>

<P>Art. 17. O nome da pessoa n&atilde;o pode ser empregado por outrem em
publica&ccedil;&otilde;es ou representa&ccedil;&otilde;es que a exponham
ao desprezo p&uacute;blico, ainda quando n&atilde;o haja inten&ccedil;&atilde;o
difamat&oacute;ria.</P>

<P>Art. 18. Sem autoriza&ccedil;&atilde;o, n&atilde;o se pode usar o nome
alheio em propaganda comercial.</P>

<P>Art. 19. O pseud&ocirc;nimo adotado para atividades l&iacute;citas goza
da prote&ccedil;&atilde;o que se d&aacute; ao nome.</P>

<P>Art. 20. Salvo se autorizadas, ou se necess&aacute;rias &agrave; administra&ccedil;&atilde;o
da justi&ccedil;a ou &agrave; manuten&ccedil;&atilde;o da ordem p&uacute;blica,
a divulga&ccedil;&atilde;o de escritos, a transmiss&atilde;o da palavra,
ou a publica&ccedil;&atilde;o, a exposi&ccedil;&atilde;o ou a utiliza&ccedil;&atilde;o
da imagem de uma pessoa poder&atilde;o ser proibidas, a seu requerimento
e sem preju&iacute;zo da indeniza&ccedil;&atilde;o que couber, se lhe atingirem
a honra, a boa fama ou a respeitabilidade, ou se se destinarem a fins comerciais.</P>

<P>Par&aacute;grafo &uacute;nico. Em se tratando de morto ou de ausente,
s&atilde;o partes leg&iacute;timas para requerer essa prote&ccedil;&atilde;o
o c&ocirc;njuge, os ascendentes ou os descendentes.</P>

<P>Art. 21. A vida privada da pessoa natural &eacute; inviol&aacute;vel,
e o juiz, a requerimento do interessado, adotar&aacute; as provid&ecirc;ncias
necess&aacute;rias para impedir ou fazer cessar ato contr&aacute;rio a
esta norma.</P>

<P>Art. 229. Ningu&eacute;m pode ser obrigado a depor sobre fato:</P>

<P>I - a cujo respeito, por estado ou profiss&atilde;o, deva guardar segredo;</P>

<P>II - a que n&atilde;o possa responder sem desonra pr&oacute;pria, de
seu c&ocirc;njuge, parente em grau sucess&iacute;vel, ou amigo &iacute;ntimo;</P>

<P>III - que o exponha, ou &agrave;s pessoas referidas no inciso antecedente,
a perigo de vida, de demanda, ou de dano patrimonial imediato.</P>
</TD>
</TR>
</TABLE></CENTER>

<P><B>A difama&ccedil;&atilde;o pela Internet</B></P>

<P>Uma p&aacute;gina que faz gra&ccedil;a com a difama&ccedil;&atilde;o
&eacute; o &nbsp;&quot;Foi preso&nbsp;&quot;, um site que brinca com tal
situa&ccedil;&atilde;o: o sujeito recebe um email com o assunto &nbsp;&nbsp;&quot;Sua
privacidade est&aacute; na internet&quot;. Vai ler, aparece o texto que
o personagem (fict&iacute;cio) Madairoskazziz receberia:</P>

<CENTER><TABLE CELLSPACING=0 CELLPADDING=0 WIDTH="80%" >
<TR>
<TD><I>Oi Madairoskazziz</I> 
<P><I>Seu amigo/a ASKLDFJ encontrou na internet dados pessoais seus muito
interessantes. Pelo teor, achou que seria ideal voc&ecirc; verificar imediatamente
a veracidade dos fatos.</I></P>

<P><I>Para acessar seus dados, v&aacute; at&eacute; http://MADAIROSKAZZIZ.foipreso.com/
O MAIS BREVE POSS&Iacute;VEL!</I></P>

<P><I>PS.: Melhor visitar antes que o fato se torne mais p&uacute;blico.</I></P>
</TD>

<TD></TD>
</TR>

<TR>
<TD></TD>

<TD></TD>
</TR>
</TABLE></CENTER>

<P>Chegando na p&aacute;gina, tem um visual de primeira p&aacute;gina,
com a data do dia em que est&aacute; sendo acessada e a seguinte not&iacute;cia
(falsa):</P>

<CENTER><TABLE CELLSPACING=0 CELLPADDING=0 WIDTH="80%" >
<TR>
<TD><IMG SRC="falsanota.jpg" HEIGHT=386 WIDTH=481></TD>
</TR>
</TABLE></CENTER>

<P>Claro que o autor da p&aacute;gina tem uma verdadeira cole&ccedil;&atilde;o
de e-mails de advogados e gente que levou a brincadeira &agrave; s&eacute;rio.
O&nbsp;site tem um n&uacute;mero alto de visitas e visa at&eacute; a alugar
espa&ccedil;o de propaganda, aparentemente sem grande sucesso. De acordo
com as explica&ccedil;&otilde;es do site, n&atilde;o adianta muito ir atr&aacute;s
nem do autor da p&aacute;gina nem da pessoa que fez a brincadeira. N&atilde;o
h&aacute; chance de muita gente ler o conte&uacute;do, de qualquer forma.
Nem necessidade de se pedir que retire a p&aacute;gina. &Eacute; tempor&aacute;ria.
Mas e se n&atilde;o fosse brincadeira, se a p&aacute;gina retratasse algo
que aconteceu, como seria a situa&ccedil;&atilde;o? N&atilde;o se</P>

<P>Um artigo que encontrei sobre o assunto <A HREF="http://www.direitonaweb.adv.br/doutrina/dinfo/Itamar_A_Junior_(DINFO_0004).htm">http://www.direitonaweb.adv.br/doutrina/dinfo/Itamar_A_Junior_(DINFO_0004).htm</A>
dava como possibilidade 2 alternativas :</P>

<CENTER><TABLE CELLSPACING=0 CELLPADDING=0 WIDTH="70%" >
<TR>
<TD>Uma vez identificado o autor e, munida da imagem ou mensagem que atingiu
a sua honra, abre-se para a v&iacute;tima duas op&ccedil;&otilde;es, como
bem esclarece a ilustre Professora &Acirc;ngela Bittencourt Brasil: 
<P>a) O ingresso imediato com a a&ccedil;&atilde;o penal por inj&uacute;ria
e/ou difama&ccedil;&atilde;o (buscando a condena&ccedil;&atilde;o criminal
do agente), com posterior execu&ccedil;&atilde;o na esfera civil da senten&ccedil;a
criminal, para fins de indeniza&ccedil;&atilde;o.</P>

<P>ou</P>

<P>b) O ingresso, unicamente, com a a&ccedil;&atilde;o civil de indeniza&ccedil;&atilde;o
por danos morais, devendo, neste caso, ser provado a autoria e a materialidade
do fato, ressaltando-se, aqui, que ao optar por esta segunda alternativa,
a v&iacute;tima visa apenas o recebimento da indeniza&ccedil;&atilde;o
em dinheiro, abrindo m&atilde;o da condena&ccedil;&atilde;o criminal do
agente. </P>
</TD>
</TR>
</TABLE></CENTER>

<P>Foi colocado o exemplo onde o UOL teve que ser de ser acionado juridicamente
por conta de mensagens difamat&oacute;rias supostamente enviadas por um
advogado numa lista de discuss&atilde;o do site. O &uacute;nico problema
&eacute; que que qualquer coisa que fa&ccedil;a uso da justi&ccedil;a por
iniciativa do requerente (em casos espec&iacute;ficos como assassinato,
n&atilde;o h&aacute; necessidade de queixa, em outros casos, a&iacute;
s&atilde;o necess&aacute;rios registro de queixa da parte ofendida, advogado,
testemunhas, per&iacute;cia, etc). Sem falar nos custos. O caso da Escola
Base <A HREF="http://www.estado.estadao.com.br/jornal/02/11/24/news207.html">http://www.estado.estadao.com.br/jornal/02/11/24/news207.html</A>
, quando os funcion&aacute;rios e donos de uma escola foram injustamente
acusados de pedofilia por crian&ccedil;as e que at&eacute; receberam um
aumento de indeniza&ccedil;&atilde;o em dezembro de 2002 <A HREF="http://conjur.uol.com.br/view.cfm?id=14990&ad=b">http://conjur.uol.com.br/view.cfm?id=14990&amp;ad=b</A>
sem d&uacute;vida d&aacute; alguma id&eacute;ia de que pode haver compensa&ccedil;&atilde;o
financeira. Que n&atilde;o quer dizer muito, se o respons&aacute;vel pela
difama&ccedil;&atilde;o n&atilde;o puder arcar com o preju&iacute;zo ou
se a vida da parte ofendida for completamente destru&iacute;da no processo.
Ainda n&atilde;o se chegou a uma conclus&atilde;o (embora exista uma tend&ecirc;ncia)
de que os crimes de difama&ccedil;&atilde;o sejam tratados com base na
lei de Imprensa (vide por exemplo artigo <A HREF="http://www.servilex.com.pe/arbitraje/colaboraciones/crimes.html">http://www.servilex.com.pe/arbitraje/colaboraciones/crimes.html</A>
,<A HREF="http://www.estadao.com.br/tecnologia/internet/2001/dez/12/36.htm">http://www.estadao.com.br/tecnologia/internet/2001/dez/12/36.htm</A>
e <A HREF="http://www.consumidordigital.com/Difamacao%20e%20Injuria%20na%20Web.doc">http://www.consumidordigital.com/Difamacao%20e%20Injuria%20na%20Web.doc</A>
)</P>

<P><B>O porqu&ecirc; da privacidade</B></P>

<P>Como se pode ver no caso acima, a quest&atilde;o n&atilde;o &eacute;
apenas a privacidade. &Eacute; o dano que uma exposi&ccedil;&atilde;o indevida
pode trazer &agrave; reputa&ccedil;&atilde;o de um indiv&iacute;duo. A
pessoa pode ser apenas um registro num documento, mas a personalidade &eacute;
algo mais complexo. Ningu&eacute;m &eacute; apenas aquilo que pensa. A
pessoa est&aacute; inserida na sociedade. Freud foi um dos primeiros a
expor essa quest&atilde;o. Eu, vc, todos n&oacute;s somos compostos de
Ego, Alter-ego e Id (falei certo?). Que nem na religi&atilde;o cat&oacute;lica:
Pai, Filho e Esp&iacute;rito Santo. Existe ent&atilde;o aquela parte de
n&oacute;s que age como juiz, (est&aacute; sempre falando o que &eacute;
certo ou errado), a parte de n&oacute;s que &eacute; quase animal, (s&oacute;
comer porcaria e ver porcaria na TV) e o meio-termo, mais ou menos um subproduto
das duas. Claro que aquele juiz no fundo de todos n&oacute;s &eacute; conseq&uuml;&ecirc;ncia
de um contato com a sociedade. E a parte que quer ver mulher rebolando
na TV ou tomar uma cerveja &eacute; algo mais instinto. </P>

<P>A sociedade tamb&eacute;m segue esta linha. S&atilde;o 100 pessoas (ou
1000 ou 10.000), as pessoas tentam decidir que existe o bem e existe o
mal. A m&iacute;dia cria essa id&eacute;ia. Fumar cigarro provoca c&acirc;ncer,
por isso &eacute; mal. Comer fibras &eacute; bom para o intestino. A ci&ecirc;ncia
aprova ou condena. A religi&atilde;o aprova ou disaprova. &Eacute; complicado,
mas o que isso quer dizer? Que mesmo seja milhares de pessoas vivendo suas
vidas, a maioria tenta seguir um caminho. Os outros v&atilde;o atr&aacute;s.
O h&aacute;bito n&atilde;o faz o monge, mas para quem n&atilde;o te conhece,
o h&aacute;bito faz o monge. As pessoas muitas vezes vestem uma roupa porque
o emprego exige, n&atilde;o porque gostam. Nem sempre um homem ou uma mulher
se casam porqu&ecirc; se amam. E quem chora mais num funeral? A vi&uacute;va
ou uma pessoa contratada para chorar? O que os outros iriam falam nessas
situa&ccedil;&otilde;es?</P>

<P>O problema ent&atilde;o n&atilde;o &eacute; expor os detalhes da sua
vida para todo mundo, mas o contexto em que se faz uso destes detalhes.
Ser um fumante pode atrapalhar a vida da pessoa de v&aacute;rias formas.
Para o setor de Recursos Humanos numa empresa, significa algu&eacute;m
que pode ter problemas de sa&uacute;de e ter que ser substitu&iacute;do.
Outro exemplo: se o funcion&aacute;rio aceita o convite do patr&atilde;o
para ir &agrave; uma boite, &eacute; uma coisa. Se ele &eacute; casado
e sua esposa fica sabendo que ele podia ter se recusado o convite, &eacute;
outra coisa. Se a esposa souber disso e estiver com TPM &eacute; mais uma
coisa. Se al&eacute;m de estar com TPM, o casal recebe a visita da sogra,
oops, mais uma. Para coroar a situa&ccedil;&atilde;o, o cheque do marido
na boite foi passado adiante (muito comum, para evitar CPMF) usado por
algu&eacute;m num motel. &Eacute; uma situa&ccedil;&atilde;o que pode acontecer.
</P>

<P>Temos ent&atilde;o uma situa&ccedil;&atilde;o tendendo a vida solit&aacute;ria.
Excluimos as pessoas no Big Brother, baseados em crit&eacute;rios subjetivos.
Como na vida real, ningu&eacute;m se adapta ou precisa se adaptar &agrave;
pessoas indesej&aacute;veis. Podemos fazer como o sujeito do filme &nbsp;&quot;Thomas
est Amoureux&quot;, que s&oacute; se comunica com o mundo atrav&eacute;s
do computador.</P>

<P>O outro lado da hist&oacute;ria &eacute; como o programa estimula, indiretamente,
uma coisa que pode ser denominada de &nbsp;&quot;panelinha&quot;. O que
&eacute; uma panelinha. Suposi&ccedil;&atilde;o: eu tenho meu grupo de
amigos. N&oacute;s nos sentimos bem. N&atilde;o queremos mais ningu&eacute;m
no grupo. Nos divertimos muito. Para que aceitar gente nova? A panelinha
existe, est&aacute; formada. Se somos todos da mesma turma no col&eacute;gio,
na faculdade, no trabalho, isso &eacute; uma caracter&iacute;stica simples.
Ou vc faz parte de alguma turma ou vc fica em casa, se divertindo sozinho.
Legal. Super legal &eacute; como ser adolescente. Qualquer programa &eacute;
programa. Vc telefona para XXX, &nbsp;&quot;est&aacute; afim de um programa
de &iacute;ndio?&quot;, XXX fala: &nbsp;&quot;estou, quando, quem vai?&nbsp;&quot;.
&nbsp;&quot;Legal, vai YYY, ZZZ&nbsp;&quot;, &nbsp;&quot;T&ocirc; me arrumando
agorinha&quot;. Qualquer programa &eacute; programa, desde que a turma
v&aacute; toda junta. Depois do diploma, a vida muda bastante. YYY se casou,
ZZZ est&aacute; desempregado, WWW n&atilde;o curte filme polon&ecirc;s,
TTT quer compensar a noite que ficou sem dormir. Tudo muda, vc est&aacute;
exclu&iacute;do socialmente. Exclu&iacute;do porqu&ecirc; gosta de alguma
coisa que o resto do grupo n&atilde;o gosta. E o resto do grupo tamb&eacute;m
se exclui de vc porqu&ecirc; n&atilde;o se interessa pela mesmo tipo de
divers&atilde;o.</P>

<P>A&iacute; que vamos fazer para resolver o problema da falta de gente
nova? Fazer um curso de l&iacute;nguas, ir em casamentos, vel&oacute;rios,
batizados? Alguns fazem viagens, v&atilde;o para outros lugares. Imagina
uma viagem de navio ou uma excurs&atilde;o, por exemplo, montes de gente
com quem voc&ecirc; &eacute; obrigado a conviver. &Eacute; uma id&eacute;ia.
Pagar para conhecer e conviver com gente com quem normalmente n&atilde;o
se falaria nem bom dia(**) e depois voltar para casa, para economizar de
novo para um dia comprar esse tipo de conviv&ecirc;ncia for&ccedil;ada.
Bem vindo ao futuro.</P>

<P>(*) Freud, pai da psicologia, escapou de algo que poderia ter destru&iacute;da
sua possibilidade de apresentar suas teorias. Na &eacute;poca, fez uso
da coca&iacute;na e chegou a aventar a possibilidade de uso da subst&acirc;ncia
para acabar com o grande flagelo da &eacute;poca, o v&iacute;cio da morfina.
Chegou a publicar <B>&Uuml;ber Coca </B>em julho de 1884. Acreditava que
coca&iacute;na n&atilde;o viciava e seu uso era recomendado para desordens
digestivas, enj&ocirc;os a bordo, neurastenia, nevralgias faciais, asma
e impot&ecirc;ncia. Al&eacute;m disso, tamb&eacute;m era fumante inveterado
e teve canc&ecirc;r por conta disso. 33 cirurgias durante 16 anos. N&atilde;o
largou o charuto at&eacute; a morte, em 1939. </P>

<P>(**) Fico lembrando do filme Velocidade M&aacute;xima, com a Sandra
Bullock. O Jason Patrick faz um personagem que &eacute; namorado da Sandra
Bullock e a leva num cruseiro que sofre um atentado. O cara &eacute; da
SWAT mas acaba pedindo ajudar para um traficante de drogas que tamb&eacute;m
est&aacute; de f&eacute;rias.</P>

<P><B>Bibliografia:</B></P>

<P>BIG BROTHER BRASIL 3 - Dispon&iacute;vel em &lt;http://www.uol.com.br/radiosetvs/bbb3/&gt;
. Acesso em 2/02/2003.</P>

<P>FREUD e a COCA&Iacute;NA. Dispon&iacute;vel em: &lt;http://www.garamond.com.br/Arquivos/freud_ea_cocaina.htm&gt;
. Acesso em 2/02/2003.</P>

<P>FREUD. Dispon&iacute;vel em &lt;http://www.morasha.com.br/conteudo/ed29/sigmund3.htm&gt;
. Acesso em 2/02/2003.</P>

<P>JORD&Atilde;O, Claudia. &quot;Big Brother&quot; baixa na festa da FGV:
fotos de casais em cenas de namoro e sexo s&atilde;o divulgadas pela Internet.
In: Not&iacute;cias Gerais - &Uacute;ltimo Segundo. S&atilde;o Paulo, 2002.
Dispon&iacute;vel em: &lt;http://ultimosegundo.ig.com.br/useg/notgerais/artigo/0,,920373,00.html&gt;.
Acesso em 20/10/02. </P>

<P>JORD&Atilde;O, Claudia. &quot;Eu fiz sim. E fiz gostoso&quot;, declara
uma suposta estudante flagrada fazendo sexo em festa da FGV In: Not&iacute;cias
Gerais - &Uacute;ltimo Segundo. S&atilde;o Paulo, 2002. Dispon&iacute;vel
em: &lt;http://ultimosegundo.ig.com.br/useg/notgerais/artigo/0,,922528,00.html&gt;.
Acesso em 20/10/02.</P>

<P>JORD&Atilde;O, Claudia. Festa da FGV: Estudantes se dizem assustados
e contam o que viram In: Not&iacute;cias Gerais - &Uacute;ltimo Segundo.
S&atilde;o Paulo, 2002. Dispon&iacute;vel em: &lt;http://ultimosegundo.ig.com.br/useg/notgerais/artigo/0,,922580,00.html&gt;.
Acesso em 20/10/02. </P>

<P>JORD&Atilde;O, Claudia. Festa da FGV: Sob press&atilde;o, diret&oacute;rio
dos estudantes leva caso &agrave; Justi&ccedil;a In: Not&iacute;cias Gerais
- &Uacute;ltimo Segundo. S&atilde;o Paulo, 2002. Dispon&iacute;vel em:
&lt;http://ultimosegundo.ig.com.br/useg/notgerais/artigo/0,,926454,00.html&gt;.
Acesso em 20/10/02. </P>

<P>JORD&Atilde;O, Claudia. Revistas publicam fotos de alunos fazendo sexo
na festa da GV In: Not&iacute;cias Gerais - &Uacute;ltimo Segundo. S&atilde;o
Paulo, 2002. Dispon&iacute;vel em: &lt;http://ultimosegundo.ig.com.br/useg/notgerais/artigo/0,,925114,00.html&gt;.
Acesso em 20/10/02.</P>

<P>JORD&Atilde;O, Claudia. Revistas publicam fotos de alunos fazendo sexo
na festa da GV In: Not&iacute;cias Gerais - &Uacute;ltimo Segundo. S&atilde;o
Paulo, 2002. Dispon&iacute;vel em: &lt;http://ultimosegundo.ig.com.br/useg/notgerais/artigo/0,,925114,00.html&gt;.
Acesso em 20/10/02. </P>

<P>J&Uacute;NIOR, Itamar Arruda. INJ&Uacute;RIA E DIFAMA&Ccedil;&Atilde;O
EM MEIO VIRTUAL. DA TEORIA &Agrave; PR&Aacute;TICA Dispon&iacute;vel em
&lt;http://www.direitonaweb.adv.br/doutrina/dinfo/Itamar_A_Junior_(DINFO_0004).htm&gt;
. Acesso em 17/01/03.</P>

<P>MARTIN, Paulo San. Estudantes da GV processar&atilde;o respons&aacute;veis
por fotos em festa. In: Ag&ecirc;ncia Estado. S&atilde;o Paulo, 2002. Dispon&iacute;vel
em: &lt;http://www.estadao.com.br/agestado/noticias/2002/set/13/333.htm&gt;.
Acesso em 20/10/02.</P>

<P>PATR&Iacute;CIA. Fiz sim, e da&iacute;? Uma defesa de quem, como eu,
foi flagrada na festa Giovanna. S&atilde;o Paulo, 2002. Dispon&iacute;vel
em: &lt;http://www.festagiovanna.blogger.com.br/&gt;. Acesso em 20/10/02.</P>

<P>SILVA, Chico &amp; VANNUCHI, Camilo. Acabou a festa In: Isto &Eacute;
- online. S&atilde;o Paulo, 2002. Dispon&iacute;vel em: &lt;http://www.terra.com.br/istoe/1721/comportamento/1721_acabou_a_festa.htm&gt;.
Acesso em 20/10/02.</P>

<P>http://www.zuanddo.hpg.ig.com.br/carreira/41/index_int_10.html</P>

<P>http://redeglobo.globo.com/cgi-bin/jornaldaglobo/montar_texto.pl?controle=1257</P>

<P>http://www.computerbytesman.com/tia/</P>

<P>http://www.nytimes.com/2002/11/09/politics/09COMP.html?pagewanted=2</P>

<P>VILHENA, Junia &amp; MEDEIROS, S&eacute;rgio. M&iacute;dia e Pervers&atilde;o.
In: Revista Ci&ecirc;ncia Hoje. Dispon&iacute;vel em &lt;http://www.uol.com.br/cienciahoje/chmais/pass/ch183/reality.pdf&gt;
Acesso em 20/10/02.</P>

</BODY>
</HTML>
