<html>
<head>
<title>..:: The Virii Hacking Guide ::.. :: Numero 01</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#000000" text="#ffffff" style="font-family: Verdana, Arial, Helvetica, sans-serif">
<p align="center"> <font size="1" face="Verdana, Arial, Helvetica, sans-serif"><a href="viriihacking01.html"><font color="#FF9900">&Iacute;ndice 
  Virii Hacking Guide 01</font></a></font></p> 
<p align="center"><font face="Courier New, Courier, mono" color="#006600" size="4"><i><font size="5" color="#009933">== 
  Engenharia Social ==</font></i></font></p>
<p><font size="2" color="#FFFF00">Por: Inferninho</font></p>
<p>&nbsp;</p>
<p><font face="monospace" size="2">1 - Introducao<br>
  <br>
  2 - Mitnick: amea&ccedil;a &eacute; a engenharia social<br>
  <br>
  3 - Exemplo de Engenharia Social<br>
  <br>
  4 - Dicas para Engenharia Social</font></p>
<p><font face="monospace" size="2"> 4.1 - Metodos utilizados</font></p>
<p><font face="monospace" size="2">5 - Como se proteger</font></p>
<p><font face="monospace" size="2">6 - Link's e Referencias<br>
  </font></p>
<p>&nbsp;</p>
<p><font face="monospace" size="2"><br>
  -=[ 1 ]=-<br>
  .---------------.<br>
  | Introducao &nbsp;&nbsp;&nbsp;&nbsp;\___________________________________________________________<br>
  `----------------------------------------------------------------------------'<br>
  <br>
  Hoje em dia encontrar servidores bugados e muito comum, tornando o servico de 
  <br>
  &quot;hackers&quot; e &quot;pseudos-hackers&quot; muito trivial, na verdade 
  existem correcoes para<br>
  todas as falhas conhecidas (quando nao sao feitas rapidamente, bom quer dizer 
  <br>
  as vezes nao ;) o que ocorre e que os ditos administradores, nao corrigem essas 
  <br>
  falhas, sabe-se la porque. (se alguem souber pq, me de um toque, eu devo ser 
  <br>
  ingenuo demais pois nao consigo ver um bom motivo para alguem que recebe para 
  <br>
  fazer a seguranca de um servidor nao baixar patches para corrigir as falhas 
  do <br>
  mesmo). Bom mais existem alguns poucos administradores que o fazem, algumas 
  <br>
  empresas fazem grandes investimentos em cima da seguraca de seus sistemas,<br>
  mais enfim... Falhas na seguranca podem ser corrigidas, porem o ser humano pode<br>
  ser facilmente, no dito popular &quot;passado para tras&quot;, e eh em cima 
  disto que age<br>
  a Engenharia Social, fazendo com que pessoas inocentes facam todo o &quot;trabalho 
  <br>
  sujo&quot; dos &quot;hackers&quot;. <br>
  </font></p>
<p>&nbsp;</p>
<p><font face="monospace" size="2"><br>
  -=[ 2 ]=-<br>
  .------------------------------------------.<br>
  | Mitnick: amea&ccedil;a &eacute; a engenharia social &nbsp;&nbsp;&nbsp;&nbsp;\________________________________<br>
  `----------------------------------------------------------------------------'<br>
  <br>
  Fonte: Site da revista Info Exame</font></p>
<p><font face="monospace" size="2"> Kevin Mitnick, o mais famoso hacker do mundo, 
  deu o alerta esta semana de que <br>
  n&atilde;o adianta nada as empresas se preocuparem com seus sistemas de seguran&ccedil;a 
  e <br>
  deixarem de lado o principal perigo: a engenharia social.</font></p>
<p><font face="monospace" size="2"> Em uma entrevista ao site Infoconomy, Mitnick 
  declarou que as empresas ficam <br>
  expostas aos hackers porque n&atilde;o t&ecirc;m consci&ecirc;ncia das t&eacute;cnicas 
  de engenharia <br>
  social usadas pelos atacantes mais perigosos: a manipula&ccedil;&atilde;o. &quot;: 
  A maioria das <br>
  pessoas acha que, por n&atilde;o se considerarem ing&ecirc;nuas, n&atilde;o 
  podem ser manipuladas. </font></p>
<p> <font face="monospace" size="2">&quot;Mas nada est&aacute; mais longe da verdade 
  do que isto&quot;, disse. O hacker admitiu <br>
  que muitas vezes se valeu de truques de manipula&ccedil;&atilde;o que, aliados 
  ao seu know-how <br>
  em tecnologia, o levaram a quebrar diversos sistemas nos quinze anos em que 
  se <br>
  manteve nesta atividade. </font></p>
<p><font face="monospace" size="2"> Na opini&atilde;o de Mitnick, bastava s&oacute; 
  persuadir funcion&aacute;rios mais desavisados a <br>
  compartilharem informa&ccedil;&otilde;es vitais, como nomes de login e senhas 
  - foi assim que <br>
  ele afirma ter invadido a rede da Sprint, se passando por um engenheiro da <br>
  Nortel Networks para o qual os funcion&aacute;rios passaram dezenas de logins 
  e senhas <br>
  para o acesso aos switches. &quot;A amea&ccedil;a da engenharia social &eacute; 
  substancial&quot;, <br>
  declarou o hacker ao site. &quot;As pessoas deveriam saber que voc&ecirc; pode 
  comprar a <br>
  melhor tecnologia do mundo, mas isto n&atilde;o proteger&aacute; sua empresa 
  contra estas <br>
  t&eacute;cnicas&quot;.</font></p>
<p><font face="monospace" size="2"> O especialista tamb&eacute;m considera um 
  grave erro n&atilde;o treinar o pessoal da <br>
  empresa para este tipo de procedimento, porque o funcion&aacute;rio n&atilde;o 
  pode adivinhar <br>
  o qu&atilde;o perigoso &eacute; passar informa&ccedil;&otilde;es por telefone 
  a estranhos que se passam por <br>
  profissionais de outras companhias ou da pr&oacute;pria empresa.</font></p>
<p><font face="monospace" size="2"> Um dos complicadores, adiciona, &eacute; a 
  postura dos pr&oacute;prios superiores, que <br>
  ignoram procedimentos de seguran&ccedil;a quando querem que um de seus funcion&aacute;rios 
  <br>
  execute uma tarefa imediatamente. &quot;O funcion&aacute;rio nem vai questionar 
  se a pessoa <br>
  que ligou disser que quer algo a pedido do CEO da empresa&quot;, acredita. Mitnick 
  <br>
  ressalta que a t&eacute;cnica da manipula&ccedil;&atilde;o n&atilde;o &eacute; 
  apenas uma quest&atilde;o de sorte: <br>
  geralmente os &quot;engenheiros sociais&quot; pesquisam profundamente seu alvo 
  antes de <br>
  atacar, para descobrir as culturas da empresa, sua estrutura coporativa e quem 
  <br>
  tem acesso a que tipo de informa&ccedil;&atilde;o.</font></p>
<p><font face="monospace" size="2"> Isto sem contar com tudo o que pode ser descoberto 
  sobre uma empresa apenas <br>
  ao se examinar sua lata de lixo. Resumindo, a recomenda&ccedil;&atilde;o do 
  famoso hacker &eacute; a <br>
  seguinte: &quot;Treinem mais rigorosamente seus funcion&aacute;rios para que 
  eles estejam <br>
  alertas sobre o perigo da manipula&ccedil;&atilde;o&quot;. <br>
  </font></p>
<p>&nbsp;</p>
<p> <font face="monospace" size="2"><br>
  -=[ 3 ]=-<br>
  .---------------------------------.<br>
  | Exemplo de Engenharia Social &nbsp;&nbsp;&nbsp;&nbsp;\_________________________________________<br>
  `----------------------------------------------------------------------------'</font></p>
<p><font size="2"><br>
  <font face="monospace">Certa vez me interesei por um host de uma empresa de 
  medio porte (o q vc quer saber o nome?? <br>
  esquece naum vou contar ;) scaneei tudo pra ver quais portas estavam abertas 
  o q estava rodando <br>
  l&aacute; e se o mesmo possuia alguma falha conhecida, naum me lembro muito 
  bem do resultado (isso foi <br>
  a algum tempo atras) mais posso dizer q tinha poucas portas abertas uma q me 
  chamou a aten&ccedil;&atilde;o <br>
  foi a 5950 q mais tarde descobri se tratar de um servidor de VNC (Virtual Network 
  Computing) q <br>
  permite administra&ccedil;&atilde;o remota, tava rodando Conectiva Linux e pra 
  minha infelicidade nenhuma falha <br>
  conhecida foi encontrada pelo scan :(</font></font></p>
<p><font size="2" face="monospace"> O q eu fiz??? Bom observando q eu naum tinha 
  praticamente nada a fazer, quase desisti, mais <br>
  ai veio algo em minha mente o VNC. Bom naum custava nada tentar, ent&atilde;o 
  abri o I.E. mesmo, e tentei <br>
  conectar apareceu um tela pedindo a senha, tentei <br>
  algumas senhas sem sucesso, mais decidi q se eu realmente fosse invadir aquele 
  servidor o lugar <br>
  mais facil seria por ali, eu so precisava de uma senha, mais como eu faria para 
  descobrir a bendita<br>
  senha???</font></p>
<p><font size="2" face="monospace"> Comecei ent&atilde;o a fazer pesquisas sobre 
  a empresa alvo para descobrir nomes de funcionarios, <br>
  endere&ccedil;os de e-mail, telefones e qualquer outra coisa q me fosse util, 
  a primeira coisa q fiz <br>
  foi navegar pela home page da empresa em quest&atilde;o, facilmente consegui 
  alguns endere&ccedil;os de e-mail <br>
  inclusive do administrador do site e o telefone da empresa atraves da pesquisa 
  tanto no site <br>
  como no registro.br, o proximo passo foi dar uma olhada no codigo fonte da pagina, 
  e pra minha<br>
  surpressa no lugar onde fica a meta name e aquelas coisaradas todas, tava o 
  nome de outra<br>
  empressa e um nome provavelmete do responsavel pela page, estranho??? naum !!! 
  De <br>
  cara percebi doq se tratava, simplesmente a empresa q eu tentava<br>
  invadir (q a partir de agora chamarei de Tabajara) havia contratado outra empresa 
  (que chamarei <br>
  de Capivara, ah isso naum tem nada haver com o Casseta e Planeta :) pra fazer 
  seu web site !!!</font></p>
<p><font size="2" face="monospace"> Por dedu&ccedil;&atilde;o vi q o VNC deveria 
  esta sendo utilizado por Capivara para fazer a administra&ccedil;&atilde;o<br>
  do site de Tabajara pois o servidor devia se encotrar fisicamente no endere&ccedil;o 
  da mesma.</font></p>
<p><font size="2" face="monospace"> Mais isso era tudo dedu&ccedil;&atilde;o, 
  ent&atilde;o eu precisava de provas mais concretas e de mais informa&ccedil;&otilde;es 
  <br>
  q pudesem me ajudar a obter a senha, oq eu fiz?? Liguei pro<br>
  102 e perguntei o numero do telefone de Capivara (incompetentes naum colocaram 
  isso nas metas <br>
  tags :p Bom com o numero nas m&atilde;os planejei um roteiro de como deveria 
  ser meu dialogo :)</font></p>
<p><font size="2" face="monospace"> Com tudo planejado, precisaria so de um endere&ccedil;o 
  de e-mail decente caso fosse necessario, fui <br>
  no zzn.com e abri um<br>
  endere&ccedil;o como se eu fosse funcionario de uma empresa, tipo meunome@nomedaempresa.zzn.com 
  <br>
  (eh tem raz&atilde;o naum eh t&atilde;o decente assim, mais e melhor q nada), 
  <br>
  pronto ja tinha tudo q precisaria agora era so respirar fundo, pegar o tel e 
  ligar.</font></p>
<p><font size="2" face="monospace"> O dialogo a seguir dificilmente vai ficar 
  como o q foi usado, como eu ja disse isso foi ah algum<br>
  tempo, ah e os nomes usados abaixo tb s&atilde;o totalmente ficticios.</font></p>
<p><font size="2" color="#6699FF" face="monospace">Capivara - Capivara Gisele 
  Boa Tarde.</font></p>
<p><font size="2" color="#999999" face="monospace">Eu - Boa Tarde !!! Aki quem 
  fala eh o Claudio da Fulano Empreendimentos Imobiliarios</font></p>
<p><font size="2" color="#6699FF" face="monospace">Capivara - Posso ajuda-lo em 
  q Sr. ?</font></p>
<p><font size="2" color="#999999" face="monospace">Eu - Bom sou funcionario da 
  Imobiliaria Fulano de Tal e estou interessado em saber como <br>
  funciona o servi&ccedil;o de vcs, assim meu chefe quer colocar uma pagina no 
  ar para q nossos<br>
  clientes possam acessar e ver quais os imoveis estao disponiveis tanto para 
  loca&ccedil;&atilde;o <br>
  como para vendas esse tipo de coisa, e como aqui na firma naum tem um setor 
  adequado <br>
  para isso e como eu sou o q mais entende de informatica aqui acabou sobrando<br>
  pra mim arrumar isso, ent&atilde;o eu gostaria de tirar algumas duvidas sobre 
  o servi&ccedil;o <br>
  prestado por vcs.</font></p>
<p><font size="2" color="#6699FF" face="monospace">Capivara - Entendo vou passar 
  vc para o Valdir ele poder&aacute; atende-lo melhor. <br>
  (Sorte minha pois este era o mesmo nome q estava no codigo fonte do site de 
  Tabajara)</font></p>
<p><font size="2" color="#999999" face="monospace">Eu - ok, obrigado e tenha um 
  bom dia</font></p>
<p><font size="2" color="#6699FF" face="monospace">Capivara - Valdir Boa tarde 
  !!! em q posso ajuda-lo Sr. ?</font></p>
<p><font size="2" color="#999999" face="monospace">Eu - Boa tarde !!! Valdir aqui 
  quem fala e o Claudio... (ai eu repeti quase a mesma <br>
  conversa q tive com a atendente)</font></p>
<p><font size="2" color="#6699FF" face="monospace">Capivara - Pode ficar a vontande 
  para pergutar Sr. </font></p>
<p><font size="2" color="#999999" face="monospace">Eu - Bom tenho varia duvidas, 
  por exemplo aqui na firma temos o servidor q seria utilizado<br>
  para hospedar a pagina, como vcs fariam a atualiza&ccedil;&atilde;o? Vcs viriam 
  aqui sempre q preciso?<br>
  ou vcs usam algum tipo de conex&atilde;o remota para isso? </font></p>
<p><font size="2" color="#6699FF" face="monospace">Capivara - Sei mais primeiro 
  preciso saber qual a configura&ccedil;&atilde;o do seu servidor para saber se 
  ele<br>
  e adequado para hospedar um site</font></p>
<p><font size="2" color="#999999" face="monospace">Eu - Ent&atilde;o o servidor 
  ainda naum chegou aqui na firma ele foi comprado recentemente <br>
  ent&atilde;o nao estou muito certo da marca mais sei q ele ter&aacute; um HD 
  de 100GB e 3GB de <br>
  memoria RAM e tera acesso a Banda Larga</font></p>
<p><font size="2" color="#6699FF" face="monospace">Capivara - E o Sistema Operacional 
  vcs pretedem usar Windows?</font></p>
<p><font size="2" color="#999999" face="monospace">Eu - Olha naum tenho certeza 
  ainda, mais a tendencia e optarmos pelo Linux para<br>
  diminuir o custo com licen&ccedil;as, o problema e q ninguem aqui sabe usar<br>
  o Linux.</font></p>
<p><font size="2" color="#6699FF" face="monospace">Capivara - Fique tranquilo 
  nossa empresa pode cuidar do seu caso tranquilamente, temos varios<br>
  casos semelhantes ao seu e sempre obtivemos sucesso, trabalhamos da <br>
  seguinte forma: temos preferencia pelo Conectiva Linux a administra&ccedil;&atilde;o 
  e feita por<br>
  nos mesmo entao nao existe a necessidade do cliente ter conhecimento avan&ccedil;ado 
  em Linux, <br>
  so o basico para poder nos ajudar em caso de emergencias e com algumas rotinas, 
  <br>
  mais para isso nos fazemos <br>
  o treinamento do funcionario q ficara responsavel por isso, primeiro sera mandado 
  <br>
  um tecnico para fazer as configura&ccedil;&otilde;es necessarias em seu servidor, 
  a partir<br>
  de entao toda a manuten&ccedil;&atilde;o e atualiza&ccedil;&atilde;o ser&aacute; 
  feita atraves de conex&atilde;o remota.</font></p>
<p><font size="2" color="#999999" face="monospace">Eu - Interessante, mais oq 
  poderia ser esses casos de emergencias?</font></p>
<p><font size="2" color="#6699FF" face="monospace">Capivara - S&atilde;o raros 
  na verdade e quase impossivel de acontecer mas o mais comum se trata de <br>
  n&atilde;o conseguirmos logar usando a conex&atilde;o remota, geralmente isso<br>
  e ocasionado pelo proprio cliente, ent&atilde;o nos passamos um e-mail para 
  o funcionario<br>
  responsavel pelo servidor na empresa em quest&atilde;o, informando do problema 
  e de como <br>
  soluciona-lo.</font></p>
<p><font size="2" color="#999999" face="monospace">Eu - Valdir quantas pessoas 
  fazem parte da equipe q vai cuidar da administra&ccedil;&atilde;o do site?</font></p>
<p><font size="2" color="#6699FF" face="monospace">Capivara - A principio a equipe 
  e formada apenas por um funcionario da Capivara, so em alguns casos <br>
  a parte ocorre de ter mais de um funcionario envolvido no caso, esse funcionario<br>
  q sera responsavel por entrar em contato com a empresa cliente sempre q necessario 
  <br>
  e por fazer o gerenciamento do site.</font></p>
<p><font size="2" color="#999999" face="monospace">Eu - No caso como foi vc que 
  me atendeu voc&ecirc; seria o responsavel pela administra&ccedil;&atilde;o da 
  pagina?</font></p>
<p><font size="2" color="#6699FF" face="monospace">Capivara - Isso, todos os contatos 
  e administra&ccedil;&atilde;o seria feita por mim </font></p>
<p><font size="2" color="#999999" face="monospace">Eu - Valdir obrigado pela sua 
  aten&ccedil;&atilde;o, mais eu tenho q atender um cliente importante aqui <br>
  e vou ter q desligar, gostaria q vc me passase um e-mail explicando melhor o 
  servi&ccedil;o<br>
  e tambem uma tabela de pre&ccedil;o pra eu poder passar isso para o meu chefe</font></p>
<p><font size="2" color="#6699FF" face="monospace">Capivara - Certo qual e o seu 
  e-mail?</font></p>
<p><font size="2" color="#999999" face="monospace">Eu - Claudio@fulano.zzn.com 
  </font></p>
<p><font size="2" color="#6699FF" face="monospace">capivara - Estarei passando 
  o e-mail o mais breve possivel</font></p>
<p><font size="2" color="#999999" face="monospace">Eu - Obrigado Valdir, desculpa 
  o incomodo, e tenha uma Boa tarde !!!</font></p>
<p><font size="2" color="#6699FF" face="monospace">Capivara - Nos q agradecemos, 
  tenha uma boa tarde tb !!! </font></p>
<p><font size="2" face="monospace"><br>
  2 minutos depois quando eu consegui me recompor da tremedera e repor as ideias 
  fiz uma analize<br>
  em q essa conversa poderia me ajudar.</font></p>
<p><font size="2" face="monospace"> Essa conversa foi muito interessante para 
  mim pois pude confirmar o uso do VNC para administra&ccedil;&atilde;o<br>
  remota e aprendi um pouco da rotina utilizada por Capivara para com seus clientes, 
  ao receber o<br>
  mail de Valdir pude ver tb o padr&atilde;o de escrita e estilo utilizado nos 
  e-mails de Capivara, tinha<br>
  o enderen&ccedil;o de mail de Valdir sabia q se alguem de capivara tivesse q 
  mandar algum e-mail para <br>
  Tabajara seria o Valdir e ja tinha tb boas ideias para o meu ataque a Tabajara 
  :)</font></p>
<p><font size="2" face="monospace"> Abri outra conta de mail no zzn.com agora 
  como pedro@capivara.zzn.com <br>
  Passei um e-mail parecido com esse para Tabajara:</font></p>
<p><font size="2" color="#999999" face="monospace">To: contato@tabajara.com.br<br>
  from: pedro@capivara.zzn.com<br>
  Subject: Problema com conex&atilde;o remota</font></p>
<p><font size="2" color="#999999" face="monospace"> Capivara LTDA</font></p>
<p><font size="2" color="#999999" face="monospace"> Venho por meio deste avisar 
  que estamos tendo dificuldades para acessar o seu servidor atraves<br>
  do VNC, acredito que o problema esteja relacionado a senha q estamos utilizando, 
  como vossa empresa<br>
  pode observar, n&atilde;o &eacute; o Valdir Rocha q est&aacute; mandando o e-mail 
  como de costume e sim o Pedro da Silva<br>
  , o motivo &eacute; que o Valdir foi para um congresso em Santa Catarina.</font></p>
<p><font size="2" color="#999999" face="monospace"> Estou tentando logar utilizando 
  a senha: &quot;seucraison&quot; , da mesma forma como fui instruido por <br>
  Valdir mais a senha e recusada, provavelmente essa seja a senha de outro cliente, 
  a partir do <br>
  momento que ele me passou varios clientes de sua responsabilidade a troca de 
  senhas pode ter ocorrido<br>
  naturalmente.</font></p>
<p><font size="2" color="#999999" face="monospace"> Como so quem tem acesso a 
  essa senha e o Valdir, e n&atilde;o estamos conseguindo entrar em contato com 
  o mesmo, <br>
  gostaria de pedir gentilmente a vossa empressa que confirme a senha j&aacute; 
  citada.</font></p>
<p><font size="2" color="#999999" face="monospace"> Caso ela realmente esteja 
  incorreta mande-nos um e-mail com a senha correta urgentemente, pois precisamos 
  fazer<br>
  algumas atualiza&ccedil;&otilde;es de seguran&ccedil;a no seu servidor, e caso 
  a senha esteja correta avise-nos para que possamos<br>
  tomar as medidas adequadas para resolver a situa&ccedil;&atilde;o.</font></p>
<p><font size="2" color="#999999" face="monospace"> Pe&ccedil;o desculpas pelo 
  trantorno sem mais para o momento. <br>
  <br>
  agrade&ccedil;o desde j&aacute; vossa colabora&ccedil;&atilde;o,</font></p>
<p><font size="2" color="#999999" face="monospace"> Pedro da Silva</font></p>
<p><font size="2" face="monospace"><br>
  Em cerca de uns 20 minutos depois recebo o mail de Tabajara dizendo q a senha 
  realmente estava <br>
  errada e q a correta seria: &quot;pikachu&quot; ,aew foi so abrir o VNC cliente 
  e conectar no servidor com <br>
  a senha, e VOALA la estava o desktop de Tabajara inteirinho na tela de meu micro, 
  o resto eh<br>
  historia ;)</font></p>
<p>&nbsp;</p>
<p><font face="monospace" size="2">-=[ 4 ]=-<br>
  .--------------------------------.<br>
  | Dicas para Engenharia Social &nbsp;&nbsp;&nbsp;\__________________________________________<br>
  `----------------------------------------------------------------------------'</font></p>
<p><font face="monospace" size="2">*Qualquer ataque deve ser planejado com antecedencia, 
  detalhe por detalhe, para <br>
  isso fa&ccedil;a pesquisas sobre o alvo, colha tudo o q julgar util, como nomes, 
  <br>
  telefones, endere&ccedil;os de e-mail, estilo de escrita dos funcionarios, <br>
  nomenclaturas usadas na empresa vc pode conseguir isso usando tais fontes:<br>
  <br>
  -Pesquisa na propria home page da empresa visite pagina por pagina recolhendo 
  <br>
  o maior numero de endere&ccedil;os de e-mail, telefones, e as vezes e possivel 
  <br>
  encontrar nomes de funcionarios tb.</font></p>
<p><font face="monospace" size="2"> -Busque no Codigo Fonte da pagina por comentarios 
  q lhe possam ser uteis.</font></p>
<p><font face="monospace" size="2"> -Entre no site registro.br e fa&ccedil;a uma 
  busca sobre o seu alvo assim vc pode <br>
  descobrir quem e o administrador, endere&ccedil;o fisico da empresa, telefones, 
  <br>
  endere&ccedil;os de e-mail e mais algumas coisas.<br>
  <br>
  -Pesquisa em historicos de listas de discuss&atilde;o, &eacute; possivel encontrar 
  mensagens <br>
  muito atraentes para o atancante, algumas mensagens s&atilde;o t&atilde;o inocentes 
  q o <br>
  sujeito falta dizer &quot;me invadam por aki q eu deixo&quot; . Um jeito facil 
  de <br>
  pesquisar em historicos e utilizando o proprio www.google.com.br (como diz <br>
  Narcotic &quot;O Grande Oraculo&quot;) fa&ccedil;a assim com alguns endere&ccedil;os 
  de e-mail nas <br>
  m&atilde;os fa&ccedil;a uma busca usando esses endere&ccedil;os como palavra 
  chave, simples e <br>
  eficiente. Com isso tb vc pode observar estilos de escritas e assinaturas <br>
  usados pela pessoa q vc pretende personificar.</font></p>
<p><font face="monospace" size="2"> -Se vc naum tiver voz de crian&ccedil;a e 
  for um pouquinho corajoso, ligue para a <br>
  empresa e demostre interesse sobre os seus servi&ccedil;os, assim vc pode aprender 
  <br>
  sobre as nomenclaturas usadas na empresa e ainda, confirmar alguns nomes e <br>
  fun&ccedil;&otilde;es de funcionarios e oq mais sua mente insana conseguir imaginar. 
  Ah <br>
  aconselho naum fazer isso usando seu tel de casa pode acontecer do lugar ter 
  <br>
  Bina e se ficarem desconfiados de vc podem te localizar facilmente :(<br>
  <br>
  -Coleta de lixo !!! eh isso mesmo procure no lixao da empresa por anota&ccedil;&otilde;es 
  de <br>
  telefones, memorandos, manuais com polit&iacute;cas internas da empresa, cursos 
  ou <br>
  f&eacute;rias, manuais dos sistemas utilizados, qualquer coisa que contenha 
  nome de <br>
  usu&aacute;rios e senhas, Disquetes,CDs ou HDs aparentemente inutiliz&aacute;veis, 
  papel <br>
  timbrado da empresa. </font></p>
<p><font face="monospace" size="2">*Fakemail eh muito recomendado, use sua imagina&ccedil;&atilde;o 
  ;)<br>
  <br>
  *Sites clones tb sao bem vindos, vide os ultimos casos de sites clones, um da 
  <br>
  microsoft q pedia para fazer o download de um patche de seguranca, que na <br>
  verdade era um trojan, e outro do banco Itau q pedia para o cliente renovar 
  a <br>
  senha e o final da historia vc ja sabe.</font></p>
<p><font face="monospace" size="2"><br>
  4.1 - Metodos utilizados<br>
  -------------------------<br>
  <br>
  -Assuma a identidade de outra pessoa, q pode ser qualquer um na empresa desde 
  <br>
  um simples funcionario ate alguem com mais autoridade dependendo do q vc <br>
  planejou.<br>
  <br>
  -Use frases q d&ecirc; a impress&atilde;o q a pessoa precisa de vc um exemplo 
  retirado do <br>
  mail acima &quot; precisamos fazer algumas atualiza&ccedil;&otilde;es de seguran&ccedil;a 
  no seu <br>
  servidor&quot;. </font></p>
<p><font face="monospace" size="2"> -Fa&ccedil;a com q o sujeito se sinta bem 
  consigo mesmo (vide puxa-saco) assim fica <br>
  mais facil de manipula-lo.<br>
  <br>
  -Use frases q denotem q vc precisa dele assim ele se sente superior e vai <br>
  tentar se &quot; aparecer &quot; e acaba falando mais doq devia, ex retirado 
  do <br>
  telefonema: &quot; acabou sobrando pra mim ent&atilde;o eu gostaria de tirar 
  algumas <br>
  duvidas.&quot;<br>
  &quot;o problema e q ninguem aqui sabe usar o Linux.&quot;<br>
  </font></p>
<p><font face="monospace" size="2"> -Ocupa&ccedil;ao Furtiva !!! Q??? Isso mesmo!!! 
  E assim vc finge ser da companhia de <br>
  telefone, eletrica ou dependendo do caso vc pode fingir ser alguem da <br>
  manuten&ccedil;&atilde;o, um funcionario novo ou ate mesmo o entegador de leite 
  :p. Aew vc <br>
  pode andar livremente pelo local de trabalho da vitima, o limite desse metodo 
  <br>
  e a sua imagina&ccedil;&atilde;o e criatividade. Esse e o metodo mais dificil, 
  (ta na cara <br>
  n&eacute;? pq diabos eu to escrevendo isso entao???) pois e necessario muita 
  coragem <br>
  e boa interpreta&ccedil;&atilde;o. </font></p>
<p>&nbsp;</p>
<p></p>
<p><font face="monospace" size="2">-=[ 5 ]=-<br>
  .---------------------.<br>
  | Como se proteger &nbsp;&nbsp;&nbsp;&nbsp;\_____________________________________________________<br>
  `----------------------------------------------------------------------------'<br>
  <br>
  *Treinamento de funcionarios</font></p>
<p><font face="monospace" size="2">*Evite ao maximo dar informa&ccedil;&otilde;es 
  da estrutura da sua empresa.<br>
  <br>
  *Certifique-se de que a pessoa e realmente quem diz ser, no caso acima bastaria 
  <br>
  dar um simples telefonema para confirmar a procedencia do e-mail e acabar com 
  <br>
  todo meu plano. </font></p>
<p><font face="monospace" size="2">*Cuidado com o q joga no lixo, procure inutilizar 
  tudo.</font></p>
<p><font face="monospace" size="2">*Resumindo tudo numa unica frase &quot;desconfie 
  ate da sua m&atilde;e&quot; :p<br>
  </font></p>
<p>&nbsp;</p>
<p><font face="monospace" size="2"><br>
  -=[ 6 ]=-<br>
  .----------------.<br>
  | Finalizando&nbsp;&nbsp;&nbsp;&nbsp; \__________________________________________________________<br>
  `----------------------------------------------------------------------------'<br>
  <br>
  O grande lance da Engenharia Social e que ela vai ser sempre viavel e muito 
  <br>
  eficiente, haja visto que ate mesmo Adao e Eva foram enganados, e desde aquela<br>
  ate os dias atuais, varias pessoas sao &quot;feitas de bobo&quot; o dia inteiro, 
  baseado <br>
  nisso duvido muito que algum dia isso seja diferente, entao tome cuidado pois 
  o<br>
  pr</font><font face="monospace" size="2">oximo pode ser voce :P</font></p>
<p>&nbsp;</p>
<p> </p>
<p><font face="monospace" size="2">-=[ 7 ]=-<br>
  .-------------------------.<br>
  | Link's e Referencias &nbsp;&nbsp;&nbsp;&nbsp;\_________________________________________________<br>
  `----------------------------------------------------------------------------'</font></p>
<p><font face="monospace" size="2">Referencias<br>
  ------------</font></p>
<p><font face="monospace" size="2">Site da revista Info Exame --&gt; http://www.infoexame.com.br 
  </font></p>
<p><font face="monospace" size="2"><br>
  Link's Interessantes<br>
  ---------------------</font></p>
<p><font face="monospace" size="2">http://www.infoshack.cjb.net</font></p>
<p><font face="monospace" size="2">http://cdm.hacking.la</font></p>
<p><font face="monospace" size="2">http://www.infernoz.kit.net</font></p>
<p><font face="monospace" size="2">http://coracaodeleao.virtualave.net</font></p>
<p><font face="monospace" size="2">http://www2.dct.ufms.br/~hrhp</font></p>
<p><font face="monospace" size="2">http://jerryslater.host.sk/</font></p>
<p><font face="monospace" size="2"><br>
  *************************<br>
  The Virii Hacking Group<br>
  Writted by Inferninho <br>
  *************************<br>
  <br>
  |=[ EOF ]=---------------------------------------------------------------=|</font><br>
</p>
<p><font size="2"> </font></p>
</body>
</html>
