<html>
<head>
<title>..:: The Virii Hacking Guide ::.. :: Numero 01</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<BODY TEXT="#000000" BGCOLOR="#ffffff" style="font-family: Verdana, Arial, Helvetica, sans-serif">
<div align="center">
  <p><font size="1" face="Verdana, Arial, Helvetica, sans-serif"><a href="viriihacking01.html">&Iacute;ndice 
    Virii Hacking Guide 01</a></font></p>
  <p><font face="Courier New, Courier, mono" size="5"><i><font color="#006600">== 
    &Eacute;tica Hacker ==</font></i></font></p>
  <p align="left"><font size="2" color="#FF0000">Por: IP_FIX</font></p>
  <p align="left"> <font size="2">Vou falar sobre &eacute;tica hacker, mas quem 
    sou eu pra falar sobre isso??? Nem hacker sou!!! Mas creio q j&aacute; tenho 
    experiencia o suficiente de saber o q &eacute; certo e o q &eacute; errado. 
    Mas a&iacute; &eacute; q est&aacute; o problema, quando alguem posta uma &eacute;tica 
    hacker, todos tem uma opiniao diferente sobre ela, ou seja, cada um tem seu 
    jeito de pensar. Pe&ccedil;a para um Hacker, um Lamer e um ScriptKiddie definir 
    o q &eacute; ser hacker...<br>
    </font></p>
  <p align="left"><font size="2">Todos terao uma visao diferente sobre o q &eacute; 
    ser hacker, ou o q um hacker deve ou nao fazer, e se fossemos seguir essas 
    &eacute;ticas, provavelmente nao chegar&iacute;amos a lugar nenhum, ou entao: 
    &quot;- A &eacute;tica hacker falou q deface &eacute; mal e degrini a imagem 
    dos hackers, mas a kiddie falou q &eacute; bom pq isso serve pra os admin 
    tomarem vergonha na cara e melhorar sua seguran&ccedil;a, e a lamer falou 
    pra fazer o q a hacker e o kiddie sugeriram!!! Qual devo seguir???&quot;.<br>
    Isso acima q acontece com muita gente. Como eu sei? Oras, pq passei por isso, 
    nao sabia se seguia os caminhos dos lamers de invadir todo mundo e destruir 
    os HD's pra mostrar pros outros q sou perigoso e terem medo de mim; seguir 
    o caminho dos kiddies de pegar programinhas prontos (exploits principalmente) 
    para fazer deface e mostrar pros meus coleguinhas do grupo a index bonitinha 
    q fiz; ou os dos hackers mesmos, fazer tudo isso mas por conta propria, ou 
    seja, eu fazer todo o processo, conhececer como funciona, estudar, ler, saber 
    tudo pra chegar no resultado esperado, isso sim q &eacute; se superar.<br>
    </font></p>
  <p align="left"><font size="2">Eu escolhi a &uacute;ltima opcao, quem me conhece 
    sabe q passei pelas outras duas (pq sao as mais faceis :)), mas agora evito 
    de faze-las novamente. Minhas invasoes, scanners, trojans, exploits, sniffers, 
    todos esses SERAO desenvolvidos por mim, sempre pegos outros pra ver como 
    funcionam, fu&ccedil;o em tudo, se possivel pego o codigo-fonte para me espelhar 
    para criar o meu. Isso tudo pra mim &eacute; recopensador, e nao pegar um 
    monte de exploit sem saber seus riscos e sair por a&iacute; no google e digitar 
    &quot;.au, .uk, .org, ...&quot; :), quem nunca fez isso quando qeria fazer 
    defaces??? <br>
    </font></p>
  <p align="left"><font size="2">Mas agora pergunta pra um kiddie desses quais 
    sao as consequencias de usar um exploit. Qual ser&aacute; a resposta dele??? 
    Sei l&aacute;! Muitos acham q nao podem ser pegos, outros acham q &eacute; 
    s&oacute; usar um proxy ou anonimyzer e j&aacute; era, e a maioria nem sabe 
    q tem riscos de ser pego!!! Veja bem, uma pessoa q se informa (l&ecirc; muito) 
    sobre acesso remoto, sabe os riscos q pode correr, veja um exemplo de um exploit, 
    usarei o unicode.pl pq &eacute; muito conhecido: &quot;Vc acha um site bugado, 
    executa o programinha, tem acesso ao conteudo do site, vc muda a porra dakela 
    index (gracas a Deus tem admins q escondem elas ou mudam de nome), e depois 
    d mudar a index ele sai fora. No dia seguinte quando acorda escuta sua mae 
    falar q seu pai foi preso pq atraves dakela invasao besta, foi identificado 
    o telefone atraves do provedor e assim, como o kiddie &eacute; menor de idade, 
    o pai q paga o pato, O PAI entenderam??? PAI = Akele q geralmente sustenta 
    a casa e a familia, paga as contas e trabalha o dia inteiro pra ganhar uma 
    merreca o dia inteiro, enquanto sua mulher cuida da casa juntamente com seus 
    filhos. Moral da historia... Nao preciso nem falar...<br>
    </font></p>
  <p align="left"><font size="2">Para o kiddie ter se dado bem, ele teria q primeiramente 
    nao fazer isso ;), se fizesse, ele teria q usar outro computador (de preferencia 
    um publico), usar um proxy, se for experiente e dependendo do SO ele poderia 
    fazer um IP Spoofing, depois de ele se conectar no servidor, ele teria q primeiro 
    q modificar os LOG&acute;s (isso mesmo, MODIFICAR, pq se apagar o admin pode 
    te achar por outros meios, mas vc modificando colocando outro IP, ele nao 
    vai nem suspeitar), depois disso (e de fazer o deface), ele ter&aacute; q 
    sair o mais rapidamente o possivel, senao a bomba explode. E mesmo com esses 
    cuidados ele poderia ser pego no dia seguinte. Lembre-se, vc nunca sabe como 
    &eacute; o exploit por dentro, e se o unicode nao t deixa-se apagar ou modificar 
    os logs??? E se ele automaticamente (sem vc perceber) te conecta-se em outro 
    lugar q fizesse vc ser pego imediatamente??? Entenderam o porque de q muitos 
    adolescentes sao pegos por bobagens, tudo q parecia ser divertido (mostrando 
    pros seus amiguinhos como ficou bonitinha akela index q ele alterou :)), pode 
    vir por agua abaixo... E nao s&oacute; pra ele, pra familia inteira.<br>
    </font></p>
  <p align="left"><font size="2">Galera, nao sou contra lamer, nem kiddie. Se 
    eles acham q o q fazem &eacute; correto, deixa eles, vc nao deve nada a eles! 
    Existem muitos grupos &oacute;timos de deface, gente q sabe se prevenir, q 
    sabe se cuidar. Mas agora me fala, o q eles aprendem com isso? Quando eu fizer 
    um deface pode ter certeza q vai ser com um exploit feito por mim, EXPLOIT 
    BY IP_FIX, #VIRII, pode ter certeza disso.<br>
    </font></p>
  <p align="left"><font size="2">Escrevi essa &eacute;tica hacker por causa de 
    uma discusao da nossa lista yahoo do #virii, quando estavamos discutindo assuntos 
    sobre o clube dos mercenarios. Na lista tinha um mail q continha um log, um 
    log de uma conversa da ex #Unsekurity, definindo o q era etico ou nao. Na 
    verdade nao vi eles discutirem o q era e o q nao era ser etico, mas discutiram 
    se deixariam ou nao um defacer entrar. Junto com esse log, um sujeito (ele 
    &eacute; um defacer), falou sua opiniao sobre o q aconteceu com ele l&aacute;, 
    falou q tudo q Nash Leon dizia, era lei. L&iacute; varias vezes, refleti e 
    resolvi escrever algo sobre isso, sobre minha opiniao nisso tudo, e aki est&aacute; 
    ela (finalmente!!! :)):<br>
    NINGU&Eacute;M pode impor regras para todos (de seu grupo ou de outros) seguirem, 
    todos t&ecirc;m q ter suas opinioes proprias sobre o q &eacute; certo e o 
    q &eacute; errado;</font></p>
  <p align="left"><font size="2"> TODOS t&ecirc;m o direito de escutar, falar 
    e opinar sobre o q acha, se defender. Nao &eacute; s&oacute; porque um grupo 
    acha errado fazer deface, q por causa disso nao deve escutar quem faz. Escutar 
    os lamers e kiddies &eacute; uma forma de ve-lo como ele pensa sobre a etica 
    dele, e dependendo da situacao, at&eacute; pode-se mudar ele;<br>
    <br>
    GRUPO nao &eacute; feito s&oacute; de operadores (@), ou seja, muitas reunioes 
    sao feitas s&oacute; com os @, e isso nao &eacute; ser um grupo, um grupo 
    &eacute; onde todos podem opinar, discutir e contrariar sobre tal assunto. 
    ENFIM, se manifestar da forma q achar apropriado.</font></p>
  <p align="left"> <font size="2">&Eacute; isso galera, &eacute; isso q faz o 
    grupo #Virii da Brasnet, ser um grande grupo q esta crescendo cada vez mais, 
    q ultimamente est&aacute; tendo um enorme potencial ;). Nele todos podem falar 
    sobre o q kiser e ser&aacute; escutado, todos podem perguntar o q kiser e 
    ser&aacute; respondido, todos podem falar sua etica hacker e ser&aacute; entendido.<br>
    Finalizando galera (vcs devem estar loukos pra terminar isso :P), &quot;NAO 
    ESTOU PREGANDO NEM IMPONDO ESSA &Eacute;TICA HACKER A NINGU&Eacute;M&quot;, 
    isso &eacute; um meio meu de desabafo, onde exponho sobre minhas opinioes 
    sobre o grande assunto q &eacute; &quot;SER HACKER &Eacute;...&quot;. Nao 
    posso dizer o q &eacute; certo ou errado, nao sou hacker pra impor isso, e 
    acho q ninguem deve impor nada a ninguem. O que aconteceu na #unsekurity, 
    nao posso falar nada pq nunca pude participar de uma reuniao entre eles, mas 
    pra alguns ou todos seguirem o q Nash Leon dizia, &eacute; pq a &eacute;tica 
    dele batia com a &eacute;tica deles e como o mesmo tem muita experiencia (principalmente 
    em programacao), todos concordaram com ele. Nao sei, posso estar errado sobre 
    esse meu ponto de vista, mas &eacute;tica hacker vem de todos, de cada um, 
    cada um tem q criar sua propria etica para seguir. Eu mesmo leio varias eticas 
    de lames, kiddies, hackers...Mas sigo a minha, q foi essa q vcs leram. Nao 
    sei se to certo o errado, mas isso &eacute; tudo que acho sobre &quot;&Eacute;TICA 
    HACKER&quot;.</font></p>
  <p align="left"><font size="2"><br>
    *************************<br>
    * The Virii Hacker Group*<br>
    * Writted by IP_FIX *<br>
    *************************</font></p>
  <p align="left">&nbsp; </p>
  </div>
</body>
</html>
