<html>
<head>
<title>..:: The Virii Hacking Guide ::.. :: Numero 01</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<BODY TEXT="#000000" BGCOLOR="#ffffff" style="font-family: Verdana, Arial, Helvetica, sans-serif">
<div align="center">
  <p><font size="1" face="Verdana, Arial, Helvetica, sans-serif"><a href="viriihacking01.html">&Iacute;ndice 
    Virii Hacking Guide 01</a></font></p>
  <p><i><font face="Courier New, Courier, mono" size="5" color="#006600">== Filosofando 
    ==</font></i></p>
  <p align="left"><font size="2" color="#FF0000">Por: _LINE_SKOFF_</font></p>
  <p align="left"><font size="2">Aprender &agrave; Aprender:<br>
    </font></p>
  <p align="left"><font size="2">Hoje dia 28/02/03 tive uma aula de filosofia, 
    que me ajudou muito a aprender a pensar melhor e a<br>
    correr atraz de pesquisas, a aula teve uma grande descu&ccedil;&atilde;o, 
    sobre: Bom professor.<br>
    Muitos Dizem: Bom professor eh akele q explica tudo e depois cruza os bra&ccedil;os<br>
    Mal Professor: eh akele que explica e base e manda vc se virar.<br>
    hj eu vi que isso eh o contrario, pq percebi que todo brasileiro eh acostumado 
    a copiar.<br>
    Exemplo: vc aprende a fazer uma equa&ccedil;ao com a seguinte pergunta, &quot;Qual 
    o valor de X&quot;<br>
    a&iacute; vc elebora a formula e descobre, e depois mais para frente vc se 
    depara com a pergunta.<br>
    &quot;Qual o Valor da variavel?&quot;<br>
    a&iacute; vc fica meia hora penssando e nao descobre, simplimente pelo fato 
    que vc nao aprendeu de verdade<br>
    e sim aprendeu a copiar, pois a ambas as perguntas tem o mesmo significado.</font></p>
  <p align="left"><font size="2">Isto vale muito no mundo da informatica, ainda 
    mais em tutoriais &quot;PRONTOS&quot;. Em que te explica de tudo sobre<br>
    tal assunto, mas no fim quando vc acaba de ler um tutorial que traz tudo &quot;PRONTO&quot; 
    vc nao sabe nada mais<br>
    fazer o q ele diz, ou seja, vc nao consegue aprofundar o que aprendeu, isso 
    por qu&ecirc;?<br>
    Porque vc nao teve a coragem de pesquisar mais, e formular sua propria ideia 
    e conceito.</font></p>
  <p align="left"><font size="2">Imagine: Uma pessoa chega em voc&ecirc; e pede 
    para te enssinar a programar em C/C++, e dependendo de como vc &eacute;<br>
    vc come&ccedil;a a explica para a pessoas mas derrepente vc para e faz uma 
    pergunta para ela sobre o assunto,<br>
    Exemplo: Vc fala q C &eacute; Censetive Case, e depois de meia hora de explica&ccedil;ao 
    onde esta na parte de<br>
    fun&ccedil;&otilde;es j&aacute; expliacando a pessoa, vc para e pergunta: 
    Vc sabe o q &eacute; Censetive Case?<br>
    ela responde N&Atilde;O, a&iacute; vc come&ccedil;a a refletir o q expliquei 
    nao adiantou nada...</font></p>
  <p align="left"><font size="2">Te garanto que se a pessoa fosse pesquisar sobre 
    C/C++ ela e vc iria sair ganhando mais, primeiro que<br>
    vc nao iria perder seu tempo e segundo que ela iria aprender realmente detalhadamente. 
    <br>
    Gostaria que depois que vc lesse a zine do virii pesquisasse mais sobre os 
    de mais assuntos tratados nela<br>
    ---------------------------------------------------------------------------------------------------------<br>
    Refletinfo:<br>
    Ja reparou que as escolas hoje em dia mesmo nao fazem mais o aluno penssar...<br>
    A maioria das escolas s&oacute; fazem decorar, formulas, regras, macetes e 
    talz...<br>
    E depois voc&ecirc; tem que expressar tudo que voc&ecirc; decorou em uma simples 
    folha!!!</font></p>
</div>
</body>
</html>
