<html>
<head>
<title>..:: The Virii Hacking Guide ::.. :: Numero 01</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<BODY TEXT="#000000" BGCOLOR="#ffffff" style="font-family: Verdana, Arial, Helvetica, sans-serif">
<div align="center">
  <p><font size="1" face="Verdana, Arial, Helvetica, sans-serif"><a href="viriihacking01.html">&Iacute;ndice 
    Virii Hacking Guide 01</a></font></p>
  <p><font face="Courier New, Courier, mono" size="5"><i><font color="#006600">== 
    Hardware - No&ccedil;&atilde;o B&aacute;sica ==</font></i></font></p>
  <p align="left"> <font size="2" color="#FF0000">Por: Vo5</font></p>
  <p align="left"><font size="2">Ol&aacute;. Seja bem vindo &agrave; 2a parte 
    da nossa E-Zine. Bom, vou deixar a apresenta&ccedil;&atilde;o para outro fazer. 
    Antes de qualquer coisa, se voc&ecirc; n&atilde;o viu a nossa E-Zine edi&ccedil;&atilde;o 
    n&deg; 00 (beta), pegue-a aqui: <a href="http://www.txt.org">txt.org</a>.</font></p>
  <p align="left"><font size="2">Vamos agora ao que interessa de verdade. O que 
    &eacute; Hardware?<br>
    J&aacute; ouvi muitas defini&ccedil;&otilde;es de hardware, mas s&oacute; 
    utilizarei duas que considero primordiais:</font></p>
  <p align="left"><font size="2">1. <font color="#0000FF">Hardware</font> corresponde 
    a toda parte f&iacute;sica que engloba o computador. Desde componentes microsc&oacute;picos 
    at&eacute; o gabinete inteiro.<br>
    2. <font color="#0000FF">Hardware</font> corresponde a qualquer pe&ccedil;a 
    que voc&ecirc; possa QUEBRAR.</font></p>
  <p align="left"><font size="2">O hardware &eacute; mais citado como as pe&ccedil;as 
    que ficam dentro do gabinete, mas temos que levar em conta todo o resto. A 
    no&ccedil;&atilde;o &eacute; mais complicada que isso, pois mesmo os componentes 
    de uma televis&atilde;o s&atilde;o hardware.</font></p>
  <p align="left"><font size="2">Para aqueles que n&atilde;o entenderam ainda, 
    posso citar como exemplos aquelas placas verdes que encontram-se dentro de 
    aparelhos de som, r&aacute;dios, tv&acute;s, computadores, etc... S&atilde;o 
    componentes que incluem pe&ccedil;as eletr&ocirc;nicas, que tamb&eacute;m 
    s&atilde;o hardware. V&aacute; a uma loja de eletr&ocirc;nica. Todos os componentes 
    e pe&ccedil;as que voc&ecirc; ver l&aacute; s&atilde;o hardware. Caso voc&ecirc; 
    possua um radinho de pilha ou um walkman, desmonte-o e veja (isso para aqueles 
    que ainda n&atilde;o entenderam a no&ccedil;&atilde;o), todas as pe&ccedil;as 
    retiradas do interior s&atilde;o hardwares. Enfim, viajei muito e &eacute; 
    melhor firmar o p&eacute; no ch&atilde;o por enquanto.</font></p>
  <p align="left"><font size="2">O hardware corresponde em seu todo &agrave; quase 
    toda a eletr&ocirc;nica, e, eu infelizmente desconhe&ccedil;o essa &aacute;rea, 
    assim, n&atilde;o poderei ajudar muito nesse sentido.</font></p>
  <p align="left"><font size="2">Entre o hardware do computador, os mais conhecidos 
    s&atilde;o os chamados perif&eacute;ricos. Os perif&eacute;ricos correspondem 
    a quase todo hardware que est&aacute; em torno do processador, mas, este n&atilde;o 
    &eacute; considerado perif&eacute;rico. Os mais conhecidos s&atilde;o: (perif&eacute;rico 
    interno) HD&acute;s, mem&oacute;rias, placas, CD-Rom, DVD, etc...; (externos) 
    mouse, monitor, caixas de som, etc. &Eacute; importante ressaltar que os perif&eacute;ricos 
    s&atilde;o tamb&eacute;m divididos em perif&eacute;rico de entrada e de sa&iacute;da.<br>
    O reconhecimento de tais tipos depende da experi&ecirc;ncia que o usu&aacute;rio 
    possui com o computador. Tentarei amenizar isso. Um perif&eacute;rico &eacute; 
    perif&eacute;rico de entrada quando este envia dados para o computador, como 
    um mouse, e, &eacute; um perif&eacute;rico de sa&iacute;da quando recebe dados 
    do computador e os torna percept&iacute;vel ao usu&aacute;rio.<br>
    Uma explica&ccedil;&atilde;o mais simples funciona da seguinte maneira: sendo 
    perif&eacute;ricos de entrada o mouse, o teclado ou o scanner, a fun&ccedil;&atilde;o 
    deles &eacute; enviar dados para que o computador interprete, ou seja, ele 
    s&atilde;o utilizados com intuito de somente o computador &#147;perceber&#148; 
    o que est&atilde;o fazendo. Quando voc&ecirc; digita uma tecla, sem o monitor, 
    voc&ecirc; n&atilde;o ter&aacute; certeza se ela passou pelos processos corretos 
    para que seja interpretada como a tecla correta, ou, quando voc&ecirc; move 
    o mouse, sem o monitor, voc&ecirc; n&atilde;o pode dizer com precis&atilde;o 
    em que ponto da tela o mouse est&aacute; localizado. Os perif&eacute;ricos 
    de sa&iacute;da encaixam-se nessa posi&ccedil;&atilde;o. Sua fun&ccedil;&atilde;o 
    &eacute; tornar os dados percept&iacute;veis ao usu&aacute;rio. Entre os mais 
    comuns destacam-se: o monitor (claro n&eacute; =P), a impressora (&#147;transforma&#148; 
    dados de maneira que possam ser impressos em uma folha de papel), as caixas 
    de som (transformam dados em vibra&ccedil;&otilde;es sonoras), e muitos mais.</font></p>
  <p align="left"><font size="2" color="#0000FF">Nota:</font><font size="2"> o 
    &#147;transforma&#148; est&aacute; entre aspas porque a impressora n&atilde;o 
    transforma os dados, somente os recebe e interpreta, mas isso fica mais para 
    a frente quando estudarmos I/O.</font></p>
  <p align="left"><font size="2">Espero que tenha entendido o que s&atilde;o perif&eacute;ricos, 
    mas, apesar disso, n&atilde;o &eacute; uma termologia muito usada e talvez 
    eu nem a cite aqui, mas &eacute; bom pra saber n&eacute; ;)</font></p>
  <p align="left"><font size="2">Agora, &eacute; importante que voc&ecirc; aprenda 
    alguns conceitos, como medidas de informa&ccedil;&atilde;o que usarei aqui. 
    Caso j&aacute; conhe&ccedil;a-os, pule para a outra li&ccedil;&atilde;o.</font></p>
  <p align="center"><font size="4" color="#0000FF">Medindo Dados</font></p>
  <p align="left"><font size="2">N&atilde;o se pode usar medidas comuns para se 
    medir quanta informa&ccedil;&atilde;o pode-se armazenar em um computador. 
    Pensando nisso, foram criadas medidas espec&iacute;ficas para se medir as 
    informa&ccedil;&otilde;es contidas em um computador. Os principais conceitos 
    ficam pelo Bit e Byte. O resto &eacute; hist&oacute;ria.</font></p>
  <p align="left"><font size="2" color="#0000FF">O Bit</font><font size="2"> - 
    O bit corresponde a menor unidade de informa&ccedil;&atilde;o que pode ser 
    armazenada em um computador. O bit prov&eacute;m da jun&ccedil;&atilde;o de 
    duas palavras (em ingl&ecirc;s =/) <font color="#0000FF">BI</font>nary Digi<font color="#0000FF">T</font>. 
    A tradu&ccedil;&atilde;o: D&iacute;gito Bin&aacute;rio (ent&atilde;o se fosse 
    em portugu&ecirc;s, seria DIB? Que feio... ainda bem que n&atilde;o traduziram). 
    O bit pode armazenar somente 2 valores: 0 ou 1. Pensando assim fica meio confuso, 
    pois, como um computador pode reconhecer tantas letras e s&iacute;mbolos se 
    ele pode somente reconhecer 2 valores? Simples meu caro: foi montada uma tabela 
    utilizando um conjunto de bits para interpretar um caractere. Essa tabela 
    (conhecida como tabela Ansi) foi criada a fim de possibilitar que o computador 
    reconhecesse, a partir de um n&uacute;mero de combina&ccedil;&otilde;es, v&aacute;rios 
    caracteres. Assim, utilizam-se 8 bits para nos mostrar determinado caractere. 
    Abaixo temos exemplos de ASCII.</font></p>
  <p align="left"><font size="2">Combina&ccedil;&atilde;o de Bits Caractere produzido 
    <br>
    00000000 (espa&ccedil;o) <br>
    00000001 . (ponto) <br>
    00100100 $ <br>
    00110010 2 <br>
    01000001 A <br>
    01010001 a <br>
    11100111 &ccedil; </font></p>
  <p align="left"><font size="2">A tabela ASCII completa est&aacute; no meu tutorial 
    de c++.</font></p>
  <p align="left"><font size="2" color="#0000FF">Curiosidade:</font><font size="2"> 
    Um governador do Nordeste (n&atilde;o lembro qual estado) queria traduzir 
    InterNet, assim, l&aacute;, InterNet seria InterTeia. Ainda bem que a id&eacute;ia 
    n&atilde;o pegou...</font></p>
  <p align="left"><font size="2" color="#0000FF">Curiosidade 2:</font><font size="2"> 
    Os valores 0 e 1 do bit tamb&eacute;m s&atilde;o eventualmente interpretados 
    como sim (1) ou n&atilde;o (0) e verdadeiro (1) ou falso (0).</font></p>
  <p align="left"><font size="2" color="#0000FF">Nota:</font><font size="2"> As 
    combina&ccedil;&otilde;es ASCII s&atilde;o um conjunto de 256 combina&ccedil;&otilde;es 
    diferentes. Talvez como uma 3a curiosidade, fica a forma de se obter este 
    valor:</font></p>
  <p align="left"><font size="2">Valor total das combina&ccedil;&otilde;es = n&deg; 
    de valor max (2) elevado ao n&deg; total da combina&ccedil;&atilde;o (8)</font></p>
  <p align="left"><font size="2">Logo 28 = 256 combina&ccedil;&otilde;es diferentes</font></p>
  <p align="left"><font size="2">O mesmo pode ser usado em placas de autom&oacute;veis:</font></p>
  <p align="left"><font size="2">Exemplo: ABX 9032</font></p>
  <p align="left"><font size="2">Usa-se a mesma f&oacute;rmula: 26*26*26*10*10*10*10</font></p>
  <p align="left"><font size="2">Logo o n&deg; de combina&ccedil;&otilde;es dispon&iacute;veis 
    para placas de autom&oacute;veis &eacute; 121.670.000</font></p>
  <p align="left"><font size="2">Bom, j&aacute; fugi muito do assunto.</font></p>
  <p align="left"><font size="2">O Byte - O byte &eacute; o resultado da combina&ccedil;&atilde;o 
    dos 8 bits. O byte &eacute; uma medida capaz de armazenar um &uacute;nico 
    caractere. O byte &eacute; casualmente interpretado por n&uacute;mero hexadecimais 
    que n&atilde;o explicarei aqui, e sim em meu artigo sobre c++. O byte &eacute;, 
    na verdade, a menor unidade com a qual um usu&aacute;rio (fora experts e programadores) 
    ir&aacute; se relacionar, pois, um bit casualmente n&atilde;o &eacute; grande 
    o suficiente para armazenar dados relativamente &uacute;teis ao usu&aacute;rio. 
    Como dito antes, o byte &eacute; 28 de um bit.</font></p>
  <p align="left"><font size="2" color="#0000FF">Outras medidas:</font></p>
  <p align="left"><font size="2">Utilizadas mais amplamente est&atilde;o o kilobyte, 
    o megabyte, o gigabyte e o petabyte. O kilobyte corresponde &aacute; 1024 
    bytes ou 210 bytes. O megabyte &agrave; 220 bytes, o gigabyte a 230 bytes 
    e o petabyte &agrave; 240 bytes, sendo assim, cada um deles corresponde &agrave; 
    1024 vezes o seu antecessor. Seus s&iacute;mbolos s&atilde;o mostrados a seguir 
    respectivamente: KB,MB,GB,PB.</font></p>
  <p align="left"><font size="2" color="#0000FF">Curiosidade:</font><font size="2"> 
    h&aacute; muito tempo atr&aacute;s eu estava lendo sobre mem&oacute;rias e 
    me deparei com um fato engra&ccedil;ado: o sujeito que escreveu o artigo dizia 
    que a partir do MegaByte, a multiplica&ccedil;&atilde;o era feita por 1000 
    e n&atilde;o 1024. Cuidado a&iacute;. Se voc&ecirc;s v&atilde;o escrever artigos, 
    antes se informem para verificar se est&aacute; tudo correto. Algu&eacute;m 
    desavisado, pode tomar esse tipo de informa&ccedil;&atilde;o como verdadeira. 
    As medidas s&atilde;o sempre feitas com m&uacute;ltiplos de 8, mas a maneira 
    mais f&aacute;cil de encontrar o valor &eacute; elevando 2 &agrave; um n&uacute;mero 
    inteiro divis&iacute;vel por 10, conforme aumentar o padr&atilde;o.</font></p>
  <p align="left"><font size="2">Aprendeu essas medidas? N&atilde;o? Ent&atilde;o 
    volte e releia todas elas at&eacute; aprender. N&atilde;o &eacute; t&atilde;o 
    dif&iacute;cil, mas n&atilde;o se deixe levar tanto pelas porcarias que eu 
    coloquei no meio e enfoque seus significados.</font></p>
  <p align="center"><font size="4" color="#0000FF">O Processador</font></p>
  <p align="left"><font size="2">Vamos come&ccedil;ar pela pe&ccedil;a mais importante 
    do computador: o processador.<br>
    Voc&ecirc; provavelmente j&aacute; ouviu falar deles. Se n&atilde;o ouviu, 
    &eacute; porque voc&ecirc; morou sua vida toda embaixo de uma pedra, porqu&ecirc; 
    &eacute; imposs&iacute;vel n&atilde;o ter ouvido sequer uma vez sobre os processadores.<br>
    Para que voc&ecirc; entenda melhor as fun&ccedil;&otilde;es que um processador 
    exerce, vamos imagin&aacute;-lo as seguinte forma:<br>
    Imagine uma ponte que, em suas extremidades, hajam 2 estradas. A da extremidade 
    esquerda vem da cidade A e a da direita vai para as cidades B, C e D com um 
    trifurca&ccedil;&atilde;o (existe essa palavra?). na extremidade direita vamos 
    encontrar um fiscal. Imaginemos que n&atilde;o haja mapas ali, ent&atilde;o, 
    o trabalho do fiscal ser&aacute; orientar a todos os carros que passam como 
    chegar em seu destino. Esse &eacute; um dos trabalhos do processador: enviar 
    os dados &agrave; seu destino correto. Ele tamb&eacute;m organiza o acesso 
    perif&eacute;ricos - mem&oacute;rias, transforma os dados quando necess&aacute;rio, 
    execu&ccedil;&atilde;o de instru&ccedil;&otilde;es, etc...<br>
    Por realizar quase todas as fun&ccedil;&otilde;es que permite que voc&ecirc; 
    interaja com o computador, o computador &eacute; considerado como o c&eacute;rebro 
    do &#145;computador&#148;, o que na minha opini&atilde;o &eacute; uma termologia 
    completamente err&ocirc;nea.</font></p>
  <p align="left"><font size="2">N&atilde;o quero explicar a hist&oacute;ria dos 
    componentes aqui porque isso &eacute; um assunto muito extenso e chato para 
    estudar, mas vou enfocar algumas caracter&iacute;sticas marcantes em rela&ccedil;&atilde;o 
    aos processadores e sua evolu&ccedil;&atilde;o:</font></p>
  <p align="left"><font size="2" color="#0000FF">Largura de Dados:</font><font size="2"> 
    Trata-se da quantidade de dados que o processador recebe de uma s&oacute; 
    vez. Para se ter uma id&eacute;ia, &eacute; necess&aacute;rio um processador 
    de 16 bit&acute;s para que o MS-DOS n&atilde;o fique lento. Hoje em dia h&aacute; 
    processadores de at&eacute; 128 bit&acute;s. Exagero? Sim. Os OS costumeiros 
    s&atilde;o de 32 bit&acute;s, mas, o futuro est&aacute; a&iacute;. Talvez 
    logo tenhamos um Os de 128 bit&acute;s. (Que legal =)</font></p>
  <p align="left"><font size="2" color="#0000FF">Clocks:</font><font size="2"> 
    O processador trabalha a uma certa velocidade. Essa velocidade &eacute; chamada 
    de clock interno (ou simplesmente clock). O clock &eacute; medido em megahertz 
    (MHz) que definem a quantidade de impulsos el&eacute;tricos produzidos pelo 
    processador em um segundo. H&aacute; ainda um outro clock, o clock externo. 
    Esse tipo de clock define a velocidade com que o processador dever&aacute; 
    passar os dados para a placa-m&atilde;e. Os clocks internos variam desde 66 
    MHz at&eacute; 3.0 GHz (3000 MHz), e os clocks externos, se n&atilde;o me 
    engano, v&atilde;o de 33 MHz at&eacute; 266 MHz.</font></p>
  <p align="left"><font size="2" color="#0000FF">Nota:</font><font size="2"> Existe 
    um procedimento chamado OverClock, que consiste na configura&ccedil;&atilde;o 
    err&ocirc;nea do clock interno do processador na placa-m&atilde;e, for&ccedil;ando-o 
    a trabalhar mais r&aacute;pido. Funciona, mas voc&ecirc; precisa possuir um 
    cooler melhor do que o que &eacute; normalmente utilizado no tal processador.</font></p>
  <p align="left"><font size="2" color="#0000FF">Nota 2:</font><font size="2"> 
    Cooler &eacute; uma esp&eacute;cie de &#147;ventilador&#148; que se posiciona 
    acima do processador para esfria-lo, caso contr&aacute;rio este pode queimar. 
    Os Pentium 4 e K7 queimam em 3 seg sem o cooler. Felizmente, um sistema interno 
    permite que, ao ultrapassar certa temperatura, o processador trave para evitar 
    que o mesmo queime.</font></p>
  <p align="left"><font size="2" color="#0000FF">Mem&oacute;rias Internas:</font><font size="2"> 
    Conhecidas como mem&oacute;ria cach&ecirc; interna L1 e L2. S&atilde;o utilizadas 
    para armazenar dados tempor&aacute;rios sobre as tarefas que o processador 
    necessita realizar.</font></p>
  <p align="left"><font size="2" color="#0000FF">Tecnologias:</font><font size="2"> 
    S&atilde;o artif&iacute;cios utilizados pelos fabricantes para melhorar o 
    desempenho de seus processadores. Tratam-se de programas e/ou instru&ccedil;&otilde;es 
    dentro do processador que auxiliam em certas tarefas. As mais conhecidas s&atilde;o 
    a 3D Now! Da AMD e a MMX da Intel.</font></p>
  <p align="left"><font size="2" color="#0000FF">Fabricantes:</font><font size="2"> 
    S&oacute; me lembro de 3: Intel, AMD e Cyrix, sendo a &uacute;ltima n&atilde;o-vista 
    j&aacute; &aacute; muito tempo.<br>
    A Intel &eacute; imposs&iacute;vel n&atilde;o conhecer com tanta propaganda 
    idiota na TV, j&aacute; a AMD eu respeito e muito, porque eles n&atilde;o 
    caem matando no marketing e possuem produtos excelentes, com bastante reconhecimento 
    do mercado, e, depois, gostei mais do site da AMD do que o da Intel.</font></p>
  <p align="left"><font size="2" color="#0000FF">Nota:</font><font size="2"> (Monop&oacute;lio?!?!) 
    Estou escrevendo esse texto no MS Word 2000. O dicion&aacute;rio dele reconhece 
    o que &eacute; Intel, Microsoft, IBM, mas n&atilde;o reconhece AMD, Cyrix 
    ou mesmo Linux. Tsc tsc.</font></p>
  <p align="left"><font size="2">Vamos agora ver como o processador funciona internamente:</font></p>
  <p align="center"><font size="4" color="#0000FF">Funcionamento interno</font></p>
  <p align="left"><font size="2">O processador funciona com impulsos el&eacute;tricos, 
    por isso, os bits utilizados por ele s&atilde;o medidos como eletricidade, 
    assim sendo, o valor de um bit &eacute; 0 quando a corrente el&eacute;trica 
    que passa por ele &eacute; nula e o bit vale 1 quando a corrente equivaler 
    &aacute; 5 volts. Os dados passam por transistores nos quais s&atilde;o adicionados 
    e ent&atilde;o, se obt&eacute;m o valor. Os transistores utilizam 2 bits para 
    gerar o terceiro.</font></p>
  <p align="left"><font size="2">Um exemplo pode ser a adi&ccedil;&atilde;o 1+2=3. 
    Pegaremos os valores dos bits de 1 e 2. Estes correspondem &agrave; 1 = 0000001 
    e 2 = 00000010. Os zeros &agrave; esquerda podem ser descartados. O resultado 
    ser&aacute; 00000011, que equivale &agrave; 3 em bin&aacute;rio. O esquema 
    utilizado fica por conta desse padr&atilde;o, utilizando 2 bits em 9 circuitos:</font></p>
  <p align="left"><font size="2">Exemplo com bits 0 (bit1) e 1 (bit2):</font></p>
  <p align="left"><font size="2">1. O bit 0 e 1 s&atilde;o analisados. O resultado 
    &eacute; 0 porque no primeiro circuito &eacute; necess&aacute;rio que ambos 
    sejam 1 para que o valor retornado seja 1. Qualquer outra combina&ccedil;&atilde;o 
    resultar&aacute; em 0. Ent&atilde;o: 0+1=0.</font></p>
  <p align="left"><font size="2">2. O bit 0 e 1 s&atilde;o novamente analisados. 
    O resultado &eacute; 1 porque neste circuito &eacute; necess&aacute;rio que 
    somente um bit equivalha a 1 para retornar valor 1. Ent&atilde;o, aqui o valor 
    seria 0 somente se o bit1 e o bit2 fossem 0. 0+1=1.</font></p>
  <p align="left"><font size="2">3. O bit resultante do circuito 1 &eacute; invertido, 
    tornando-se assim 1 e &eacute; utilizado junto com o bit do segundo circuito, 
    tamb&eacute;m 1. Aqui o retorno &eacute; 1, pois aqui a regra &eacute; a mesma 
    do primeiro circuito. Se os bits fossem qualquer outra combina&ccedil;&atilde;o, 
    o resultado seria 0. 1+1=1.</font></p>
  <p align="left"><font size="2">4. Utiliza-se o resultado do primeiro circuito 
    e conjunto com o do terceiro em um conjunto de circuitos que refaz toda essa 
    opera&ccedil;&atilde;o.</font></p>
  <p align="left"><font size="2">5. Utiliza-se o resultado do primeiro circuito 
    com o do quarto circuito que refez a opera&ccedil;&atilde;o. Se qualquer um 
    deles for 1, o resultado final &eacute; 1. Caso contr&aacute;rio &eacute; 
    0.</font></p>
  <p align="left"><font size="2">Resultados:<br>
    0 e 0 = 1<br>
    0 e 1 = 0<br>
    1 e 0 = 0<br>
    1 e 1 = 1</font></p>
  <p align="left"><font size="2">Em sistemas de oito bits isso funciona at&eacute; 
    o 7&deg; bit. No 8&deg; circuito a opera&ccedil;&atilde;o ocorre at&eacute; 
    a metade, assim sendo, no 8&deg; bit:</font></p>
  <p align="left"><font size="2">0 e 0 = 0<br>
    0 e 1 = 1<br>
    1 e 0 = 1<br>
    1 e 1 = 0</font></p>
  <p align="left"><font size="2">Um exemplo claro ocorre na soma de 5 e 3. 5 equivale 
    &aacute; 00000101 e 3 &aacute; 00000011. Os n&uacute;meros &agrave; esquerda 
    s&atilde;o sempre desconsiderados quando in&uacute;teis, assim sendo:<br>
    5 = 101<br>
    3 = 011</font></p>
  <p align="left"><font size="2">Seguindo a regra (sempre da direita pra esquerda):</font></p>
  <p align="left"><font size="2">1+1=0<br>
    0+1=0<br>
    1+0=0</font></p>
  <p align="left"><font size="2">Resultado: 000 = 0<br>
    Confundiu porque deu 0? Calma. Na verdade, &eacute; uma simples quest&atilde;o 
    de l&oacute;gica: imagine a soma de 101 com 10. O resultado seria 111. A conta 
    em quest&atilde;o apresentou um resultado maior do que o poss&iacute;vel para 
    a combina&ccedil;&atilde;o (101+11=112). Quando isso acontece, colocamos um 
    1 na frente, logo: 101+011=1000.<br>
    A maneira mais simples &eacute; utilizar o vai-um para fazer esses c&aacute;lculos:</font></p>
  <p align="left"><font size="2">101+011 = 112 - muda-se 2 para 0 - 110 e leva 
    o 1 para a segunda casa, assim sendo fica: 110+10=120 - refaz-se o processo 
    200 + 100 = 300. para 3 usamos duas casas = 300 = 1000.</font></p>
  <p align="left"><font size="2">Isso &eacute; somente estrutura interna. &Eacute; 
    necess&aacute;rio possuir somente uma no&ccedil;&atilde;o disso, j&aacute; 
    que n&atilde;o &eacute; um assunto muito f&aacute;cil de se entender (at&eacute; 
    eu ainda tenho d&uacute;vidas), mas, se voc&ecirc; quer impressionar seus 
    amigos, procure mais sobre isso =)</font></p>
  <p align="left"><font size="2">Ent&atilde;o, como resumo, o processador &eacute; 
    um conjunto de circuitos integrados que utilizam transistores para realizarem 
    opera&ccedil;&otilde;es matem&aacute;ticas, que s&atilde;o a fonte de toda 
    e qualquer coisa que voc&ecirc; realiza (em termos de software) em seu computador. 
    Caso nunca tenha visto um processador, olhe esse aqui:</font></p>
  <p align="left"><font size="2"><br>
    Pentium III</font></p>
  <p align="left"><font size="2">S&oacute; tenho esta foto. Pesquisem na net e 
    procurem outras.<br>
    Bom, acho que aqui acaba essa parte sobre os processadores. Enfatizarei sua 
    hist&oacute;ria e evolu&ccedil;&atilde;o mais tarde. Eu ia explicar os slots, 
    mas vou deixar isso para a parte sobre placas-m&atilde;e.</font></p>
  <p align="center"><font size="4" color="#0000FF">Placas - M&atilde;e</font></p>
  <p align="left"><font size="2">As placas m&atilde;e s&atilde;o as segundas na 
    escala de import&acirc;ncia em termos do hardware do gabinete, talvez at&eacute; 
    no mesmo n&iacute;vel que o processador.<br>
    A fun&ccedil;&atilde;o mais b&aacute;sica da placa-m&atilde;e &eacute; integrar 
    todo o hardware necess&aacute;rio em torno do processador e permitir a comunica&ccedil;&atilde;o 
    entre os mesmos. Olha duas placas-m&atilde;e a&iacute;:</font></p>
  <p align="left"></p>
  <p align="left"><font size="2">Agora, o que &eacute; AT e ATX?<br>
    Simples. As placas - m&atilde;e possuem um certo tipo de conector no qual 
    se encaixa o fio da fonte, respons&aacute;vel por levar energia para todos 
    os componentes conectados &agrave; placa, direta ou indiretamente.<br>
    Nas placas mais antigas, esse conector &eacute; conhecido como AT. Esse conector 
    &eacute; composto por pinos, nos quais s&atilde;o encaixados dois conectores 
    que vem da fonte. A ordem de encaixe &eacute; feita a partir dos fios nesses 
    2 conectores. Para evitar a invers&atilde;o destes, o encaixe deve ser feito 
    com os fios pretos da extremidade de cada conector sempre ao lado do outro. 
    Exemplo:</font></p>
  <p align="left"><font size="2">Conector 1:<br>
    /-------\<br>
    |<font color="#FF0000">||</font>||||</font></p>
  <p align="left"><font size="2">Conector 2:<br>
    /-------\<br>
    |<font color="#FF0000">||</font>||||</font></p>
  <p align="left"><font size="2">Resultado:<br>
    /--------\/-------\<br>
    |<font color="#FF0000">||</font>|||||||<font color="#FF0000">||</font>||</font></p>
  <p align="left"><font size="2">Esse tipo de conector &eacute; usado em placas 
    mais antigas, mas, ainda hoje h&aacute; muitas placas novas que ainda utilizam-se 
    desse conector. &Eacute; necess&aacute;rio, antes de qualquer coisa, verificar 
    se a fonte de seu gabinete tamb&eacute;m &eacute; AT, pois, o conector vem 
    do gabinete e se voc&ecirc; comprar um gabinete ATX para uma placa AT...</font></p>
  <p align="left"><font size="2">Os ATX possuem grandes vantagens sobre AT. A 
    primeira &eacute; o conector: um conector ATX nunca poder&aacute; ser colocado 
    de maneira errada, pois, &eacute; apenas um conector, mas desta vez, os pinos 
    n&atilde;o ficam na placa e sim no pr&oacute;prio conector. Al&eacute;m disso, 
    o conector ATX possui um certo n&uacute;mero de encaixes, cada um com uma 
    respectiva forma, e, se por acaso voc&ecirc; coloc&aacute;-lo ao contr&aacute;rio, 
    ele simplesmente n&atilde;o vai entrar no encaixe.<br>
    Outra vantagem &eacute; a do bot&atilde;o usado para ligar o computador. Localizado 
    no gabinete, seu encaixe ocorre na placa-m&atilde;e, diferente do AT, cujo 
    encaixe &eacute; direto na fonte do gabinete. O que ocorre? No AT, quando 
    o bot&atilde;o &eacute; ligado, a corrente que vem da fonte &eacute; fechada 
    e pode prosseguir de volta para a fonte e em seguida para a placa. Esse bot&atilde;o 
    &eacute; do tipo interruptor, se voc&ecirc; desliga-lo, a corrente n&atilde;o 
    pode avan&ccedil;ar para a fonte e o fornecimento de energia &eacute; cortado, 
    causando o desligamento.<br>
    Nos ATX, o bot&atilde;o &eacute; do tipo campainha. Voc&ecirc; o aperta e 
    ele fecha uma corrente na placa-m&atilde;e, assim que essa corrente se fecha, 
    o computador come&ccedil;a a receber energia para funcionar, mas, diferentemente 
    do ATX, esse bot&atilde;o n&atilde;o ir&aacute; deslig&aacute;-lo se voc&ecirc; 
    o pressionar. Em alguns OS, quando se aperta o bot&atilde;o novamente, ele 
    coloca o OS em modo de espera. Um segredo que alguns n&atilde;o conhecem &eacute; 
    que quando se aperta e segura o bot&atilde;o do gabinete ATX, este &eacute; 
    desligado. Geralmente o tempo &eacute; de 5 seg.</font></p>
  <p align="left"><font size="2">Al&eacute;m disso o ATX possui um sistema interno 
    que permite que os softwares possam deslig&aacute;-lo, assim, n&atilde;o &eacute; 
    necess&aacute;rio esperar at&eacute; que seja exibida uma confirma&ccedil;&atilde;o 
    de que seu computador pode ser desligado =D. H&aacute; tamb&eacute;m as placas 
    Mini-ATX, que s&atilde;o placas ATX com tamanho reduzido (de).</font></p>
  <p align="left"><font size="2" color="#0000FF">Nota:</font><font size="2"> falei 
    sobre gabinete e me esqueci! Para quem n&atilde;o sabe o que &eacute; gabinete, 
    d&ecirc; uma olhada nessa caixa onde tem o bot&atilde;o onde voc&ecirc; liga 
    o computador. A&iacute; &eacute; o gabinete. Ele corresponde &agrave; essa 
    &#147;caixa&#148; vazia.</font></p>
  <p align="left"><font size="2">As placas-m&atilde;e tamb&eacute;m possui uma 
    segunda classifica&ccedil;&atilde;o: OnBoard e OffBoard.</font></p>
  <p align="left"><font size="2">As placas-m&atilde;e onboard s&atilde;o aquelas 
    nas quais se obt&eacute;m a vantagem de n&atilde;o ser necess&aacute;rio comprar 
    outras placas para realizarem determinadas tarefas.<br>
    Quando se compra uma placa-m&atilde;e offboard, &eacute; necess&aacute;rio 
    comprar outras placas para instalar nesta. Um exemplo pode ser a placa de 
    v&iacute;deo, respons&aacute;vel por enviar os dados visuais ao monitor. Temos 
    tamb&eacute;m a placa de som, respons&aacute;vel por enviar os dados para 
    as caixas de som, a fim de produzir efeitos sonoros.<br>
    Pensando nesse inc&ocirc;modo, foram-se criadas as placas onboard. As placas 
    onboard possuem, geralmente, a placa de v&iacute;deo, de som (placa multim&iacute;dia) 
    e de rede integradas. Nas placas offboard, &eacute; necess&aacute;rio compr&aacute;-las 
    separadamente. A vantagem da placa onboard est&aacute; em seu pre&ccedil;o, 
    pois &eacute; muito mais barato comprar uma placa onboard do que comprar uma 
    offboard e as outras j&aacute; mencionadas separadamente. A desvantagem fica 
    por conta da velocidade, pois leva-se muitas vezes mais tempo na transfer&ecirc;ncia 
    de dados onboard do que na offboard, al&eacute;m disso, geralmente as placas 
    de som, de v&iacute;deo, etc onboard n&atilde;o s&atilde;o muito boas e possuem 
    pouca mem&oacute;ria, assim sendo, s&atilde;o, em resumo, muito podres. Logicamente, 
    h&aacute; muitas placas onboard com boas placas integradas, al&eacute;m disso, 
    pode-se tamb&eacute;m comprar as outras placas separadamente e instal&aacute;-las 
    em uma placa onboard, mas esta possui bem menos conectores para outras placas 
    do que as offboard.<br>
    Depende do crit&eacute;rio. Claro que h&aacute; placas onboard boas, mas pergunte 
    a um t&eacute;cnico entendido se ele prefere montar (para si mesmo) um computador 
    com placa - m&atilde;e onboard ou offboard. &Eacute; quase un&acirc;nime, 
    a maioria prefere offboard. Geralmente, computadores de loja, possuem todos 
    placa-m&atilde;e onboard.</font></p>
  <p align="left"><font size="2">Na placa-m&atilde;e s&atilde;o conectados v&aacute;rios 
    tipos diferentes de perif&eacute;ricos. H&aacute;, ainda, v&aacute;rios tipos 
    de conectores diferentes para estes. Para as placas, esses conectores s&atilde;o 
    conhecidos como slots:</font></p>
  <p align="left"><font size="2" color="#0000FF">Slot ISA</font><font size="2"> 
    (<font color="#0000FF">Industry Standard Architeture</font>): S&atilde;o os 
    conectores de placas mais antigos que ainda est&atilde;o em uso. Os ISA possuem 
    barramento de 8 ou 16 bits. Os slots ISA s&atilde;o pretos.</font></p>
  <p align="left"><font size="2"><br>
    <font color="#0000FF">Slots ISA</font>. O menor acima possui barramento de 
    8 bits enquanto que os maiores possuem barramento de 16 bits.</font></p>
  <p align="left"><font size="2">Os ISA foram abandonados a muito tempo por terem 
    sido substitu&iacute;dos pelos PCI. Os ISA trabalham &agrave; 8 MHz e podem 
    acessar no m&aacute;ximo 16 MB de mem&oacute;ria RAM.</font></p>
  <p align="left"><font size="2" color="#0000FF">Slots de extens&atilde;o ISA:</font><font size="2"> 
    Com o decorrer do tempo, foram criados mais dois slots que funcionavam em 
    conjunto com o ISA. O primeiro foi o EISA (Extended ISA) e o VLB (Vesa Local 
    Bus). Ambos de 32 bits. O EISA trabalhava com 8 MHz e acessava 32 MB de RAM, 
    o VLB trabalhava na velocidade do clock externo (com limite de 33 MHz), sendo 
    assim, um slot muito r&aacute;pido (para aquela &eacute;poca).</font></p>
  <p align="left"><font size="2" color="#0000FF">Slot PCI (Peripheral Component 
    Interconect)</font><font size="2">: Os slots PCI surgiram para derrubar os 
    ISA, pois eles j&aacute; estavam ficando lento em rela&ccedil;&atilde;o ao 
    software. Os PCI possuem barramento de 32 bit&acute;s, com uma freq&uuml;&ecirc;ncia 
    de no m&aacute;ximo 33 MHz. Apesar de se assemelhar em muito ao VLB, o PCI 
    possui suporte para Plug-and-Play, n&atilde;o suportado pelo VLB. Al&eacute;m 
    disso, ele n&atilde;o utiliza o processador para ser controlado, como o VLB, 
    e sim um circuito no chipset da placa-m&atilde;e. Esse slot &eacute; o mais 
    comum e utilizado hoje em dia:</font></p>
  <p align="left"><font size="2"><br>
    Slots PCI. Os PCI s&atilde;o brancos e podem receber at&eacute; 133 MB/s.</font></p>
  <p align="left"><font size="2" color="#0000FF">Slot AGP (Accelerated Graphics 
    Port)</font><font size="2">: O slot AGP possui barramento de 32 bit&acute;s, 
    assim como o PCI, mas, utiliza 66 MHz de velocidade. Por esta raz&atilde;o, 
    &eacute; utilizado como slot para placas 3D. O AGP pode comunicar-se diretamente 
    com a mem&oacute;ria e armazenar dados nela, livrando assim a mem&oacute;ria 
    de v&iacute;deo de trabalhos penosos que levariam uma eternidade para serem 
    conclu&iacute;dos sem esse tipo de placa. A velocidade do slot AGP varia. 
    Os AGP de 1x recebem e transmitem dados em at&eacute; 266 MB/s, o 2x em 533 
    Mb/s e o 4x em 1,066 GB/s. Logicamente, a placa deve seguir a velocidade desejada. 
    Para utilizar transmiss&atilde;o &aacute; 4x, &eacute; necess&aacute;rio utilizar 
    uma placa 3D que suporte 4x de velocidade, caso contrario, a transmiss&atilde;o 
    ser&aacute; efetuada pela velocidade padr&atilde;o da placa.<br>
    Os AGP podem utilizar uma placa de v&iacute;deo convencional (2D), mas a performance 
    ser&aacute; a mesma que o usu&aacute;rio teria se a utilizasse em um slot 
    PCI.<br>
    Temos tamb&eacute;m o AGP Pro, que &eacute; um slot AGP de 4x, com um n&uacute;mero 
    maior de conectores para que o fornecimento de energia para a placa seja maior, 
    possibilitando-se assim placas muito mais r&aacute;pidas.</font></p>
  <p align="left"><font size="2"><br>
    AGP</font></p>
  <p align="left"><font size="2"><br>
    AGP Pro</font></p>
  <p align="left"><font size="2">Voc&ecirc; j&aacute; deve ter notado: os slots 
    AGP s&atilde;o marrons.</font></p>
  <p align="left"><font size="2" color="#0000FF">Cuidado:</font><font size="2"> 
    N&atilde;o confunda os slots AGP com os de extens&atilde;o ISA. Os agps se 
    localizam longe de qualquer slot enquanto que os de extens&atilde;o ISA se 
    encontram &agrave; frente do slot ISA.</font></p>
  <p align="left"><font size="2">Isso foi o b&aacute;sico de placa-m&atilde;e. 
    Acho que ja deu para ter uma id&eacute;ia. Agora vamos &agrave; minha parte 
    preferida do Hardware: as mem&oacute;rias.</font></p>
  <p align="center"><font size="4" color="#0000FF">Mem&oacute;rias</font></p>
  <p align="left"><font size="2">Ahhh. As mem&oacute;rias =)<br>
    A fun&ccedil;&atilde;o da mem&oacute;ria de um computador n&atilde;o &eacute; 
    muito diferente da sua, ela serve, em primeiro plano para lembrar.<br>
    Um programa, quando executado, &eacute; enviado para a mem&oacute;ria. Na 
    mem&oacute;ria ele armazena vari&aacute;veis, fun&ccedil;&otilde;es e todo 
    seu c&oacute;digo para que este possa ser acessado &agrave; qualquer hora. 
    Isso ocorre na mem&oacute;ria RAM. H&aacute; outros tipos de mem&oacute;ria, 
    como a ROM ou a cache.</font></p>
  <p align="left"><font size="2" color="#0000FF">A Mem&oacute;ria RAM (Random 
    Access Memory)</font><font size="2">:</font></p>
  <p align="left"><font size="2">A mem&oacute;ria RAM tem a fun&ccedil;&atilde;o 
    que eu citei acima, ela ainda &eacute; respons&aacute;vel por manter os dados 
    enquanto estes n&atilde;o s&atilde;o transportados para outros lugares, como 
    o disco r&iacute;gido por exemplo. Para que voc&ecirc; entenda melhor eu vou 
    dar-lhe um exemplo:<br>
    Um programa chamado ProgramaX que realiza determinada tarefa. Quando voc&ecirc; 
    executa esse programa, os dados dele s&atilde;o transferidos para a mem&oacute;ria 
    e executados. Sem a mem&oacute;ria, os programas teriam que ser executados 
    no HD, o que traz in&uacute;meras desvantagens, como: lentid&atilde;o, problemas 
    de desalocamento, problemas de instancia&ccedil;&atilde;o, etc...<br>
    A mem&oacute;ria se torna muito necess&aacute;ria, os jogadores de plant&atilde;o 
    que o digam, j&aacute; que n&atilde;o viveriam sem suas plaquinhas 3D hehe!<br>
    A mem&oacute;ria armazena valores temporariamente tamb&eacute;m, como, quando 
    voc&ecirc; recebe dados de um scanner. Esses dados s&atilde;o alocados na 
    mem&oacute;ria e o programa s&oacute; ter&aacute; o trabalho de verificar 
    onde est&atilde;o esses dados e 'arranjar&quot; um meio de disponibilizar 
    esses dados de maneira percept&iacute;vel ao usu&aacute;rio. Da&iacute; &eacute; 
    crit&eacute;rio do usu&aacute;rio se ele ir&aacute; salv&aacute;-los no seu 
    HD ou simplesmente descart&aacute;-los. Esse tipo de mem&oacute;ria possui 
    baixo custo relacionamdo-a &agrave; outras mem&oacute;rias como a cache, &eacute; 
    r&aacute;pida, mas em rela&ccedil;&atilde;o &agrave;s outras mem&oacute;rias 
    deicha a desejar. H&aacute; v&aacute;rios tipos de mem&oacute;ria RAM: SDRAM 
    (ou DIMM), SIMM 30, SIMM 72, Flash, etc...<br>
    A Mem&oacute;ria SIMM foi largamente utilizada, mas est&aacute; sendo substiu&iacute;da 
    pela DIMM. A mem&oacute;ria SIMM ainda recebeu uma modifica&ccedil;&atilde;o, 
    por isso possu&iacute;mos a SIMM de 30 vias e a SIMM de 72 vias:</font></p>
  <p align="left"><font size="2">SIMM 30 vias</font></p>
  <p align="left"><font size="2">SIMM 72 vias</font></p>
  <p align="left"><font size="2">A SIMM 30 vias trabalha &agrave; 16 bit&acute;s. 
    Foi utilizada desde os 386 at&eacute; os 486 e n&atilde;o s&atilde;o mais 
    utilizadas hoje em dia.<br>
    A SIMM 72 vias trabalha &agrave; 32 bit&acute;s. Iniciou-se sua utiliza&ccedil;&atilde;o 
    com os 486 e foi at&eacute; o K6 e o Pentium II. Ainda existem mas est&atilde;o 
    &quot;sumidas&quot;. S&atilde;o necess&aacute;rios 2 pentes para a utiliza&ccedil;&atilde;o 
    de processadores de 64 bit&acute;s. Esse tipo de mem&oacute;ria &eacute; encontrada 
    de 8 MB &agrave; 64 MB.<br>
    A mem&oacute;ria DIMM trabalham &agrave; 64 bit&acute;s, mas se n&atilde;o 
    me engano h&aacute; DIMM&acute;s de 128 bit&acute;s tamb&eacute;m. Esse tipo 
    de mem&oacute;ria se encontra em tamanhos que variam desde 32 MB at&eacute; 
    4 GB.</font></p>
  <p align="left"><font size="2">DIMM</font></p>
  <p align="left"><font size="2">A instala&ccedil;&atilde;o dessas mem&oacute;rias 
    &eacute; feita na placa-m&atilde;e. A SIMM deve ser colocada num conector 
    que possui 2 travas em cada extremo. Deve-se abrir estas travas e colocar 
    a mem&oacute;ria. Cuidado para n&atilde;o coloc&aacute;-la de ponta cabe&ccedil;a, 
    eu mesmo ja fiz isso muitas vezes. A posi&ccedil;&atilde;o correta &eacute; 
    localizada com a ajuda do pino1. O pino1 &eacute; uma parte diferente da pe&ccedil;a 
    para evitar esse tipo de deslize. Os processadores possuem pino1, e, nestes, 
    geralmente &eacute; um pino faltando ou um pino de forma deiferente em rela&ccedil;&atilde;o 
    aos outros. Na placa-m&atilde;e, deve-se localizar o pino1 no conector do 
    processador. Com a mem&oacute;ria funciona da mesma maneira. A DIMM &eacute; 
    colocada de maneira diferente. Deve-se posicion&aacute;-la no conector e pressionar 
    com &quot;for&ccedil;a&quot; para que ela &quot;deslize&quot; e encaixe nos 
    conectores. N&atilde;o h&aacute; como colocar uma DIMM ao contr&aacute;rio 
    a n&atilde;o ser que voc&ecirc; quebre o conector ou a mem&oacute;ria!</font></p>
  <p align="left"><font size="2" color="#0000FF">Curiosidade:</font><font size="2"> 
    um amigo meu tinha um 486 com 44 MB de mem&oacute;ria, um pente SIMM 72 de 
    32 MB, outro SIMM 72 de 8 MB e 4 pentes SIMM 30 de 1 MB =)</font></p>
  <p align="left"><font size="2" color="#0000FF">A Mem&oacute;ria ROM (Read Only 
    Memory)</font><font size="2">:</font></p>
  <p align="left"><font size="2">Esse tipo de mem&oacute;ria fica armazenada na 
    placa-m&atilde;e ou em outras placas. Seu objetivo &eacute; guardar informa&ccedil;&otilde;es 
    para que esta n&atilde;o se perca, pois, como eu esqueci de dizer, na mem&oacute;ria 
    RAM os dados s&atilde;o totalmente perdidos quando voc&ecirc; desliga seu 
    computador. Esse tipo de mem&oacute;ria fica a cargo de armazenar dados importantes 
    como configura&ccedil;&otilde;es. Assim, n&atilde;o &eacute; necess&aacute;rio 
    que voc&ecirc; reconfigure sua placa-m&atilde;e toda vez que voc&ecirc; reinicie 
    seu computador.<br>
    Essa mem&oacute;ria &eacute; alimentada por uma pequena bateria de 3 volts 
    que dura geralmente 10-15 anos. Quando essa bateria queima &eacute; necess&aacute;rio 
    troc&aacute;-la. Eu achei uma na papelaria por R$ 0,50.</font></p>
  <p align="left"><font size="2" color="#0000FF">A Mem&oacute;ria Cache:</font></p>
  <p align="left"><font size="2">A mem&oacute;ria cache &eacute; respons&aacute;vel 
    por armazenar dados convenientes ao processador. Esse tipo de mem&oacute;ria 
    &eacute; mais r&aacute;pida que a RAM, por&eacute;m mais cara. S&atilde;o 
    divididas em L1, L2 e L3, sendo as 2 primeiras no processador e a &uacute;ltima 
    na placa-m&atilde;e. As mem&oacute;rias cache tamb&eacute;m s&atilde;o est&aacute;ticas, 
    isto &eacute;, seu conte&uacute;do &eacute; perdido quando se desliga o computador.</font></p>
  <p align="left"><font size="2">N&atilde;o tive tempo para estudar mem&oacute;ria 
    flash pois esqueci quase tudo que sabia dela!</font></p>
  <p align="left"><font size="2">Outro tipo de mem&oacute;ria tamb&eacute;m &eacute; 
    o HD, ou Hard Disk ou, ainda, o Disco R&iacute;gido. Nele s&atilde;o gravadas 
    as informa&ccedil;&otilde;es que ser&atilde;o utilizadas mais tarde. Sua capacide 
    de armazenamento varia desde os primeiros de 10 MB at&eacute; os de 120 GB 
    que existem hoje em dia. H&aacute; dois tipos: os IDE e os SCSI (l&ecirc;-se 
    isc&acirc;si). Os IDE s&atilde;o os mais utilizados, pois s&atilde;o mais 
    baratos, mas os SCSI representam performance at&eacute; 150% superior &agrave; 
    dos IDE, por&eacute;m eu fiquei sabendo que um HD SCSI de 4 GB tava uns R$ 
    6.000. Os SCSI possuem uma interface que permite at&eacute; 32 HDs em um &uacute;nico 
    computador, enquanto que os IDE possuem um limite de 4 HDs em um computador.</font></p>
  <p align="left"><font size="2" color="#0000FF">Curiosidade:</font><font size="2"> 
    ouvi dizer que a NASA possui um computador com interface SCSI e que seus HDs 
    possuem no total 2 TB!!!</font></p>
  <p align="left"><font size="2">N&atilde;o vou explicar configura&ccedil;&atilde;o 
    de BIOS porque sempre que eu explico para os meus amigos eles nunca entendem 
    nada. Sou um professor horr&iacute;vel!</font></p>
  <p align="left"><font size="2">Bom, acho que j&aacute; t&aacute; bom. Voc&ecirc; 
    que leu tudo isso, parab&eacute;ns! Que coragem! Se for menina merece um beijo 
    na boca: =*, se for menino um aperto de m&atilde;o &eacute; mais do que suficiente!</font></p>
  <p align="left"><font size="2">Me desculpem qualquer coisa, pois &eacute; meu 
    primeiro tutorial e eu n&atilde;o sou g&ecirc;nio em Hardware, sou mais da 
    &aacute;rea de programa&ccedil;&atilde;o. Bom elogios e tomates &agrave; vo5@programmer.net, 
    tbm estou no mirc como Vo5, Vo5_Programmer, ColdPlay_er e mais uns nick a&iacute;. 
    Tow sempre nos canal #oym ou #visualprog. T&eacute;+!</font></p>
</div>
</body>
</html>
