<html>
<head>
<title>..:: The Virii Hacking Guide ::.. :: Numero 01</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<BODY TEXT="#000000" BGCOLOR="#ffffff" style="font-family: Verdana, Arial, Helvetica, sans-serif">
<div align="center">
  <p><font size="1" face="Verdana, Arial, Helvetica, sans-serif"><a href="viriihacking01.html">&Iacute;ndice 
    Virii Hacking Guide 01</a></font></p>
  <p><font face="Courier New, Courier, mono" size="5"><i><font color="#006600">== 
    IP Spoof ==</font></i></font></p>
  <p align="left"> <font size="2" color="#FF0000">Por: Nash Leon</font></p>
  <p align="left"><font size="2">IP Spoof consiste basicamente em alterar o endre&ccedil;o 
    origem em um cabe&ccedil;alho IP. Simples programa&ccedil;&atilde;o em Sockets 
    pode nos ensinar como fazer isso. No entanto, em cima disso existem v&aacute;rias 
    t&eacute;cnicas, e eu enumerarei apenas algumas b&aacute;sicas:</font></p>
  <p align="left"><font size="2">- Blind Spoof;<br>
    - Non Blind Spoof;<br>
    - DNS Spoof;<br>
    - ARP Spoof;</font></p>
  <p align="left"><font size="2">Todas estas t&eacute;cnicas se utilizam das fraquezas 
    fornecidas na suite TCP/IP(Internet). De modo que um bom conhecimento de TCP/IP 
    se faz nencess&aacute;rio para entender plenamente osesquemas de exploita&ccedil;&atilde;o.</font></p>
  <p align="left"><font size="2" color="#003300">- Blind Spoof</font></p>
  <p align="left"><font size="2">Em 1985, Steve Belovin tornou manifesto em um 
    documento conhecido como &quot;Be Dragons&quot; alguns problemas que o TCP/IP 
    possui. Robert Morris (o pai, n&atilde;o o criador do primeiro Worm) tamb&eacute;m 
    j&aacute; havia descrito o problema de se &quot;forjar&quot;(spoofar) endere&ccedil;os 
    de origem em TCP/IP.<br>
    </font></p>
  <p align="left"><font size="2">Mas foi somente em janeiro de 1995 que a Comunidade 
    de Seguran&ccedil;a abriu os olhos para este problema. Tsotumo Shimomura, 
    um Analista de Seguran&ccedil;a, havia cometido uma s&eacute;rie de erros 
    na configura&ccedil;&atilde;o de um dos seus ervidores de Internet, dentre 
    os quais, eles havia deixado os servi&ccedil;os r* (rlogind, rshd, rexecd) 
    habilitados bem como o fingerd, algo que muitos analistas de seguran&ccedil;a 
    j&aacute; haviam banido de seus hosts. Se aproveitando desta configura&ccedil;&atilde;o, 
    no Natal de 1994, Kevin David Mitnick invadiu a rede de Tsutomu Shimomura. 
    </font></p>
  <p align="left"><font size="2">Tsutomu s&oacute; foi tomar conhecimento dias 
    depois, analisando um log gerado pelo tcpdump(<a href="http://www.tcpdump.org/">http://www.tcpdump.org/</a>). 
    Mas que t&eacute;cnica Mitnick usou? </font><font size="2">A t&eacute;cnica 
    de Blind Spoof. Consiste basicamente em se<br>
    predizer os n&uacute;meros de sequ&ecirc;ncia(ISN) e utiliz&aacute;-los na 
    exploita&ccedil;&atilde;o de servi&ccedil;os r*.</font></p>
  <p align="left"><font size="2">Vamos avan&ccedil;ar um pouco. No TCP/IP, sempre 
    que uma conex&atilde;o &eacute; criada ocorre um processo semelhante ao descrito<br>
    abaixo:</font></p>
  <p align="left"><font size="2">I - Host A -----&gt; Envia Pacote SYN ---&gt; 
    Host B</font></p>
  <p align="left"><font size="2">Host A envia um pacote com a flag SYN ativa dizendo 
    que quer criar uma conex&atilde;o com Host B.</font></p>
  <p align="left"><font size="2">II - Hosta A &lt;---- Recebe pacote SYN+ACK + 
    ISN ---- Host B</font></p>
  <p align="left"><font size="2">Host B responde para Host A enviando um pacote 
    com as flags SYN+ACK ativas e enviando junto um n&uacute;mero de sequ&ecirc;ncia 
    (Internet Sequencial Number)ISN responsavel depois por &quot;gerir&quot; a 
    troca de mensagens. &Eacute; atraves deste numero que o Host B vai saber de 
    quem eh o pacote e etc.</font></p>
  <p align="left"><font size="2">III - Host A ---&gt; Envia pacote com ACK + ISN 
    ---&gt; Host B</font></p>
  <p align="left"><font size="2">Depois do recebimento do pacote, o Host A envia 
    ent&atilde;o um pacote com ACK + ISN+1(Note aqui. Se ISN = 123456 entao Host 
    A tem que enviar um ISN = 123457, deste modo o Host B saberah </font><font size="2">que 
    Host A quer interagir).</font></p>
  <p align="left"><font size="2">O nome que se d&aacute; a este processo &eacute; 
    Handshake ou TriWayHandshake (Aperto de M&atilde;os em 3 vias).</font></p>
  <p align="left"><font size="2">O problema se encontra que se n&oacute;s pudermos 
    predizer o n&uacute;mero de sequ&ecirc;ncia gerado por Host B, n&oacute;s 
    poderemos nos<br>
    passar por algum host que tem permiss&atilde;o aos servi&ccedil;os r* e enviar 
    um pacote como se fosse tal host de modo que o Host B executaria. Neste caso, 
    n&atilde;o precisar&iacute;amos ter uma conta v&aacute;lida no sistema alvo.</font></p>
  <p align="left"><font size="2">Nota: Os servi&ccedil;os r*(rlogin, rexec, rsh) 
    foram criado pra facilitar o envio de dados e comandos entre duas redes, sendo 
    que estas redes deveriam &quot;confiar&quot; uma na outra. Qualquer informa&ccedil;&atilde;o 
    a mais, executem em seus linux(man logind).</font></p>
  <p align="left"><font size="2">Ent&atilde;o. Se a rede alvo possui os servi&ccedil;os 
    r* e hosts de confian&ccedil;a, n&oacute;s poder&iacute;amos nos passar por 
    tais hosts e enviar um comando para nos abrir uma porta para acesso de qualquer 
    lugar.<br>
    Por exemplo: echo + + &gt;&gt; /root/.rhosts</font></p>
  <p align="left"><font size="2">Isso permitiria acesso via rsh no host alvo como 
    root sem necessitar de senha(Os sistemas mais atuais n&atilde;o<br>
    permitem que a conta root seja usada em acessos via rlogind).</font></p>
  <p align="left"><font size="2">Para ser efetivo, deve-se ainda derrubar o host 
    de confian&ccedil;a pra que ele n&atilde;o reponda ap&oacute;s o in&iacute;cio 
    da Conex&atilde;o. Para isso, pode-se utilizar um ataque de denial of service 
    qualquer na m&aacute;quina de Confian&ccedil;a.</font></p>
  <p align="left"><font size="2">E foi isso que ocorreu em 1994. Mintinck conseguiu 
    com sucesso implementar este ataque. Hoje em dia existem<br>
    ferramentas que demonstram como este ataque ocorre.</font></p>
  <p align="left"><font size="2"><a href="http://packetstorm.linuxsecurity.com/groups/ADM/ADM-SPOOF/">http://packetstorm.linuxsecurity.com/groups/ADM/ADM-SPOOF/</a></font></p>
  <p align="left"><font size="2">Um texto descrevendo em pormenores pode ser visto 
    em:</font></p>
  <p align="left"><font size="2"><a href="http://www.phrack-dont-give-a-shit-about-dmca.org/phrack/48/P48-14">http://www.phrack-dont-give-a-shit-about-dmca.org/phrack/48/P48-14</a><br>
    Project Sp00fed - threx -<br>
    <a href="http://www.legions.org/kv/kv10.txt">http://www.legions.org/kv/kv10.txt</a></font></p>
  <p align="left"><font size="2"><br>
    Bom, atualizando as informa&ccedil;&otilde;es para os nossos dias. Hoje este 
    tipo de ataque &eacute; e n&atilde;o &eacute; t&atilde;o simples. As opini&otilde;es<br>
    variam de Analista pra analista. Por qu&ecirc;?</font></p>
  <p align="left"><font size="2">A &quot;solu&ccedil;&atilde;o&quot; criada pelo 
    pessoal da seguran&ccedil;a foi fazer com que o n&uacute;mero de sequ&ecirc;ncia 
    se tornasse &quot;pseudo-aleat&oacute;rio&quot;, ou seja.</font></p>
  <p align="left"><font size="2">Antigamente, se fulano se conectava em rede A 
    e recebesse o n&uacute;mero de sequ&ecirc;ncia X, o beltrano(pr&oacute;ximo 
    a se conectar) receberia um ISN, por exemplo, de n&uacute;mero X + 1000, o 
    pr&oacute;ximo X + 1000 + 1000. E assim<br>
    por diante, de modo que se n&oacute;s soubessemos quanto &eacute; X, poder&iacute;amos 
    prever os ISN seguinte e gerar o Blind Spoof.</font></p>
  <p align="left"><font size="2">Mas a solu&ccedil;&atilde;o foi pseudo randomizar(tornar 
    &quot;pseudo-aleat&oacute;rio&quot;) o ISN. <br>
    Agora, ao inv&eacute;s de X+1000, ter&iacute;amos algo tipo X+1000+alguma 
    outra coisa.</font></p>
  <p align="left"><font size="2">S&oacute; que no mundo virtual, n&atilde;o existe 
    aleatoriza&ccedil;&atilde;o, ou seja, tudo que um computador fizer, poder&aacute; 
    de algum modo ser predito se pudermos simular as condi&ccedil;&otilde;es e/ou 
    conhecermos as implementa&ccedil;&otilde;es de pseudo-randomiza&ccedil;&atilde;o. 
    E foi o que ocorreu. Por exemplo, os sistemas operacionais Linux com kernel 
    2.2.X onde X eh menor que 7 possuiam<br>
    uma p&eacute;ssima randomiza&ccedil;&atilde;o, de modo que Blind Spoof era 
    poss&iacute;vel nestes casos. O grupo de hacking/security alem&atilde;o TESO 
    criou uma ferramenta para exploitar isso:</font></p>
  <p align="left"><font size="2"><a href="http://teso.scene.at/advisories/teso-advisory-001.tar.gz">http://teso.scene.at/advisories/teso-advisory-001.tar.gz</a></font></p>
  <p align="left"><font size="2">Atualmente, os sistemas de pseudo-randomiza&ccedil;&atilde;o 
    s&atilde;o mais complexos, no entanto, n&atilde;o existe nenhuma solu&ccedil;&atilde;o 
    realmente eficaz contra a t&eacute;cnica de Blind Spoof. Apenas se pode dificultar 
    removendo servi&ccedil;os<br>
    como r*, colocando tais esquemas de randomiza&ccedil;&atilde;o(/dev/urandom, 
    por exemplo)<br>
    e etc.</font></p>
  <p align="left"><font size="2">Existe um documento de Michal Zaliensky que aborda 
    esquemas de randomiza&ccedil;&atilde;o em muitos sistemas operacionais:</font></p>
  <p align="left"><font size="2"><a href="http://razor.bindview.com/publish/papers/tcpseq.html">http://razor.bindview.com/publish/papers/tcpseq.html</a></font></p>
  <p align="left"><font size="2" color="#003300">- Non Blind Spoof</font></p>
  <p align="left"><font size="2">Aqui &eacute; semelhante ao processo acima, s&oacute; 
    que n&atilde;o &eacute; feito &quot;&aacute;s cegas&quot;(Blind). Como assim? 
    Aqui o atacante j&aacute; obteve acesso a um sistema no meio das conex&otilde;es 
    alvos(hosts de confian&ccedil;a) e ele passa a<br>
    analisar o tr&aacute;fego e com base na an&aacute;lise feita atrav&eacute;s 
    de um sniffer, ele &eacute; capaz de &quot;sequestrar&quot;<br>
    a conex&atilde;o. Esta t&eacute;cnica tamb&eacute;m recebe nomes variados 
    como IP Hijacking, e tamb&eacute;m costumam se referir a ela com Man-in-the-middle, 
    pois ela &eacute; uma esp&eacute;cie de man-in-the-middle.</font></p>
  <p align="left"><font size="2">Maiores informa&ccedil;&otilde;es:</font></p>
  <p align="left"><font size="2"><br>
    Uma ferramenta que executa esta t&eacute;cnica:</font></p>
  <p align="left"><font size="2"><a href="http://packetstormsecurity.org/sniffers/hunt/hunt-1.5.tgz">http://packetstormsecurity.org/sniffers/hunt/hunt-1.5.tgz</a></font></p>
  <p align="left"><font size="2">Solu&ccedil;&otilde;es contra esta t&eacute;cnica?</font></p>
  <p align="left"><font size="2">Este &eacute; um dos grandes problemas que afetam 
    a Internet na atualidade. J&aacute; que se formos analisar, os ataques de<br>
    Man-in-the-Middle s&atilde;o capazes de inutilizar esquemas de PKI(Public 
    Key Infrastructure) usados em<br>
    servi&ccedil;os de e-commerce, ssh, ssl, essas coisas.</font></p>
  <p align="left"><font size="2">Mas na pr&aacute;tica, tamb&eacute;m n&atilde;o 
    possui solu&ccedil;&atilde;o.</font></p>
  <p align="left"><font size="2">- DNS Spoof</font></p>
  <p align="left"><font size="2">Um servidor de DNS(Domain Name Server) &eacute; 
    o respons&aacute;vel por associar um determinado IP a um determinado nome 
    de host. Por exemplo, quando digitamos www.infoshack.cjb.net o servidor de 
    DNS da cjb ir&aacute; processar<br>
    a informa&ccedil;&atilde;o recebida e associar este endere&ccedil;o a uma 
    tabela de endere&ccedil;os previamente definida pelo administrador num arquivo 
    de configura&ccedil;&atilde;o (algo como named.conf).</font></p>
  <p align="left"><font size="2">Um atacante pode se utilizar disso de v&aacute;rias 
    formas, desde usar t&eacute;cnicas de man-in-the-middle(invadindo um server 
    no meio do caminho) at&eacute; mesmo utilizando problemas no protocolo DNS(udp/53). 
    Existe um campo no<br>
    cabe&ccedil;alho DNS respons&aacute;vel pela ID que pode ser atacado como 
    se ataca um cache, enviando m&uacute;ltiplas requisi&ccedil;&otilde;es at&eacute; 
    entupir a pilha.</font></p>
  <p align="left"><font size="2">Este tipo de ataque tamb&eacute;m &eacute; conhecido 
    como DNS Cache Spoof.<br>
    </font></p>
  <p align="left"><font size="2">Maiores informa&ccedil;oes em:</font></p>
  <p align="left"><font size="2"><a href="http://packetstorm.linuxsecurity.com/groups/ADM/ADM-DNS-SPOOF/">http://packetstorm.linuxsecurity.com/groups/ADM/ADM-DNS-SPOOF/</a></font></p>
  <p align="left"><font size="2">Solu&ccedil;&atilde;o contra estes problemas?</font></p>
  <p align="left"><font size="2">Existem &quot;defesas&quot; contra ID Spoof. 
    As vers&otilde;es mais atuais de Nameds dificultam isso. Mas nada em definitivo, 
    n&atilde;o sei bem a respeito disso. Quanto a Man-in-the-middle em DNS, n&atilde;o 
    existe nada.</font></p>
  <p align="left"><font size="2" color="#003300">- ARP Spoof</font></p>
  <p align="left"><font size="2">O protocolo ARP(Adress Response Protocol) &eacute; 
    o respons&aacute;vel por &quot;associar&quot; endere&ccedil;o IP(nota&ccedil;&atilde;o: 
    192.168.0.1) a seu MAC correspondente(00:23:B5:76:44:D8) que nada mais &eacute; 
    que o endere&ccedil;o f&iacute;sico de uma placa de<br>
    rede em uma rede local.</font></p>
  <p align="left"><font size="2">Em 1998, Yuri boloye tornou a t&eacute;cnica 
    de ARP Spoof massificada. O protocolo ARP possui uma tabela que associa um 
    endere&ccedil;o MAC a um IP. Esta tabela pode ser envenenada com in&uacute;meras 
    requisi&ccedil;&otilde;es capazes de<br>
    fazer com que um host alvo pense que um IP de um host Y esteja associa a um 
    Host Z, onde<br>
    este host Z pode ter sido previamente comprometido pelo atacante.</font></p>
  <p align="left"><font size="2">Este tipo de ataque &eacute; bastante &uacute;til 
    em redes segmentadas. Sim!! Talvez alguns de voc&ecirc;s tenham ouvido algu&eacute;m 
    dizer que para se proteger contra sniffers basta compra um switch de 1000 
    reais, no entanto, este ataque<br>
    &eacute; capaz de fazer com que o switch seja inutilizado contra sniffers.</font></p>
  <p align="left"><font size="2">ARP Spoof tamb&eacute;m recebe v&aacute;rios 
    nomes como ARP Cache e o famoso nome ARP Poison. Tamb&eacute;m &eacute; conhecida 
    como ARP Poisoning.</font></p>
  <p align="left"><font size="2">Maiores informa&ccedil;&otilde;es em:</font></p>
  <p align="left"><font size="2"><a href="http://packetstormsecurity.org/papers/protocols/intro_to_arp_spoofing.pdf">http://packetstormsecurity.org/papers/protocols/intro_to_arp_spoofing.pdf</a><br>
    Yuri Boloev - Redir games with ARP and ICMP -<br>
    <a href="http://www.legions.org/kv/kv7.txt">http://www.legions.org/kv/kv7.txt</a></font></p>
  <p align="left"><font size="2">Ferramentas que executam este ataque:<br>
    <a href="http://teso.scene.at/releases/arpmim-0.2.tar.gz">http://teso.scene.at/releases/arpmim-0.2.tar.gz</a><br>
    <a href="http://teso.scene.at/releases/arpmitm-0.1.tar.gz">http://teso.scene.at/releases/arpmitm-0.1.tar.gz</a><br>
    <a href="http://teso.scene.at/releases/arptool-0.0.1.tar.gz">http://teso.scene.at/releases/arptool-0.0.1.tar.gz</a><br>
    <a href="http://packetstorm.linuxsecurity.com/sniffers/ettercap/ettercap-0.6.9.tar.gz">http://packetstorm.linuxsecurity.com/sniffers/ettercap/ettercap-0.6.9.tar.gz</a></font></p>
  <p align="left"><font size="2"><br>
    Solu&ccedil;&atilde;o contra isso?</font></p>
  <p align="left"><font size="2">Alguns softwares tentam detectar, mas nada 100%.</font></p>
  <p align="left"><font size="2"><br>
    UfA!:)</font></p>
  <p align="left"><font size="2">Tou enferrujado, mas t&aacute; a&iacute; pessoal. 
    O b&aacute;sico sobre alguns tipos de SPOOF. Existem muitos pormenores ainda 
    que o tempo n&atilde;o me permite especificar. Os softwares de Remote Denial 
    of Services tamb&eacute;m utilizam IP Spoof no<br>
    cabe&ccedil;alho para forjar os endere&ccedil;os origens (geralmente uma ferramenta 
    de DoS usa v&aacute;rios endere&ccedil;os<br>
    forjados).</font></p>
  <p align="left"><font size="2">A vers&atilde;o 6 do IP vem com alguns campos 
    de seguran&ccedil;a que ir&atilde;o tentar dificultar este tipo de ataque.</font></p>
  <p align="left"><font size="2">Em portugu&ecirc;s existem bons documentos falando 
    disso teoricamente, a tese de Suzana Strauch &eacute; bem informativa:</font></p>
  <p align="left"><font size="2"><a href="http://www.modulo.com.br/pdf/mo7e001p.pdf">http://www.modulo.com.br/pdf/mo7e001p.pdf</a></font></p>
  <p align="left"><font size="2">Enfim pessoal. Por enquanto isso &eacute; tudo. 
    Se n&atilde;o compreenderam, deem uma olhada nos links e busquem maiores infos 
    a respeito disso em sites do g&ecirc;nero. Spoof &eacute; um problema que 
    ainda deve vitimar muita gente.</font></p>
  <p align="left"><font size="2"><br>
    Um Cordial Abra&ccedil;o a Todos,</font></p>
  <p align="left"><font size="2">Nash Leon / <br>
    Clube dos Mercen&aacute;rios.</font></p>
  <p align="left"></p>
  <p align="left"></p>
  <p align="left"></p>
  <p align="left"></p>
  <p align="left"><font size="2"><br>
    </font></p>
  <p align="left">&nbsp; </p>
  </div>
</body>
</html>
