<html>
<head>
<title>..:: The Virii Hacking Guide ::.. :: Numero 01</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<BODY TEXT="#000000" BGCOLOR="#ffffff" style="font-family: Verdana, Arial, Helvetica, sans-serif">
<div align="center">
  <p><font size="1" face="Verdana, Arial, Helvetica, sans-serif"><a href="viriihacking01.html">&Iacute;ndice 
    Virii Hacking Guide 01</a></font></p>
  <p><font face="Courier New, Courier, mono" size="5"><i><font color="#006600">== 
    Otimizando a conex&atilde;o no Win98 ==</font></i></font></p>
  <p align="left"> <font size="2" color="#FF0000">Por: CoDEX</font></p>
  <p align="left"><font size="2">Para quem n&atilde;o sabe o que &eacute; otimizar 
    &eacute; aproveitar o m&aacute;ximo de alguma coisa, <br>
    nesse caso o modem.<br>
    O Windows vem com uma configura&ccedil;&atilde;o padr&atilde;o que n&atilde;o 
    permite o aproveitamento m&aacute;ximo do modem,<br>
    ele funciona bem claro, mas n&atilde;o tanto como poderia.</font></p>
  <p align="left"><font size="2">Para voc&ecirc; mudar estes valores, ou voc&ecirc; 
    pega algum desses programas que nunca sabe se s&atilde;o confi&aacute;veis<br>
    ou vai no registro do Windows, coisa que n&atilde;o &eacute; aconselh&aacute;vel 
    'fu&ccedil;ar' sem saber o que est&aacute; <br>
    fazendo, resumindo nenhum modo &eacute; confi&aacute;vel afinal o OS &eacute; 
    Windows. :P</font></p>
  <p align="left"><font size="2">Bom, ent&atilde;o m&atilde;o a massa e vamos 
    otimizar o modem.</font></p>
  <p align="left"><font size="2">Primeiro vamos especificar algumas coisas que 
    devem saber antes de come&ccedil;ar as mudan&ccedil;as.</font></p>
  <p align="left"><font size="2" color="#0000FF">***Introdu&ccedil;&atilde;o***</font></p>
  <p align="left"><font size="2">Os dados que viajam pela internet s&atilde;o 
    os chamados de 'pacotes', cada pacote de TCP(Protocolo de Controle de Transfer&ecirc;ncia)<br>
    cont&eacute;m 40 bytes que cont&eacute;m todas as informa&ccedil;&otilde;es 
    necess&aacute;rias como o endere&ccedil;o da fonte, do destinatario etc. e 
    o arquivos <br>
    de dados que cont&eacute;m as informa&ccedil;oes da atual tranferencia. Este 
    pacote em sua longa viajem passa por varios hosts chamados<br>
    de 'roteadores', isso quer dizer que se dois pacotes do mesmo enviador para 
    o mesmo destinat&aacute;rio n&atilde;o precisam fazer o mesmo<br>
    percurso. Vamos prosseguir.</font></p>
  <p align="left"><font size="2" color="#0000FF">***MTU e MSS***</font></p>
  <p align="left"><font size="2">Cada host tem um valor de MTU e MSS. O MTU significa 
    unidade m&aacute;xima de transmi&ccedil;&atilde;o, para otimizar sua conex&atilde;o 
    este &eacute; um dos<br>
    valores que ter&aacute; que mudar. Quando dois computadores abrem uma se&ccedil;&atilde;o 
    de TCP um envia um ou v&aacute;rios pacotes para o outro e <br>
    estes tem que concordar com a unidade m&aacute;xima de transmi&ccedil;&atilde;o. 
    Cada host tem um MTU pr&oacute;prio e o compara com o valor do outro <br>
    host, se os valores dos hosts forem identicos ent&atilde;o ambos concordar&atilde;o 
    com o valor. Caso eles forem diferentes o valor mais<br>
    baixo ser&aacute; usado para esta se&ccedil;&atilde;o. O MTU &eacute; o n&uacute;mero 
    m&aacute;ximo de bytes que um pacote pode conter. O Windows tem como padr&atilde;o<br>
    o valor 1500 para o MTU, este valor &eacute; muito bom para LAN, por&eacute;m 
    para Dial-Up, tsc tsc.<br>
    Por exemplo:<br>
    Faz de conta de voc&ecirc; concorde que um MTu &eacute; de 1500, voc&ecirc; 
    vai mandar esses 1500 bytes em pacotes de dados, estes ir&atilde;o passar<br>
    pelos roteadores, e se o roteador tiver um MTu de 576? A&iacute; o seu pacote 
    teria que ser dividido por 576, cada um com seu <br>
    pr&oacute;prio l&iacute;der. 1500 n&atilde;o &eacute; divisivel por 576 ent&atilde;o, 
    o &uacute;ltimo pacote conter&aacute; o &uacute;ltimo fragmento dos original 
    1500.<br>
    Depois disso cada pacote precisa ser reconhecido pelo receptor, isso ir&aacute; 
    levar um pouco mais de tempo.</font></p>
  <p align="left"><font size="2">O MSS &eacute; quase a mesma coisa que MTU, significa 
    tamanho m&aacute;ximo do segmento, o que ele faz? Quando uma se&ccedil;&atilde;o 
    TCP &eacute; estabele<br>
    cidade os enviador e o receptor negociam o tamanho m&aacute;ximo do valor 
    de um segmento que ser&aacute; aceito pelos hosts. Ele define o <br>
    quanto de dados ser&atilde;o colocados dentro do pacote, ent&atilde;o este 
    valor ter&aacute; que ser um pouco menor do que o MTU. Se cada segmento<br>
    de valor n&atilde;o exceder o menor MTU, ent&atilde;o este n&atilde;o ser&aacute; 
    fragmentado. Ent&atilde;o por causa do valor do pacote TCP ser 40 bytes, o 
    MSS<br>
    &eacute; calculado como MTU menos 40.</font></p>
  <p align="left"><font size="2" color="#0000FF">***RWIN e TTL***</font></p>
  <p align="left"><font size="2">O MSS determina o o tamanho da janela receptora(RWIN), 
    que &eacute; o n&uacute;mero m&aacute;ximo de bytes do valor que podem ser 
    chocados at&eacute; a<br>
    recep&ccedil;&atilde;o de um reconhecido pacote enviado de volta pelo receptor. 
    Geralmente o valor RWIN &eacute; o valor MSS multiplicado por 2-10<br>
    se voc&ecirc; n&atilde;o sabe qual escolher, use o valor do MSS vezes 4.<br>
    Por exemplo:<br>
    Com um sistema com MTU 576 e MSS de 536 um valor bom para RWIN seria 2144(536x4)<br>
    O valor padr&atilde;o do Windows &eacute; de 8192 que n&atilde;o deveria ser 
    usado por que n&atilde;o &eacute; divis&iacute;vel com o MSS, ent&atilde;o 
    isso faria com que o<br>
    pacote fosse reenviado repentinamente quando o buffer est&aacute; cheio.</font></p>
  <p align="left"><font size="2">O TTL especifica o tempo de vidad e um pacote. 
    Pense comigo o que aconteceria com um pacote que fosse por v&aacute;ros hosts 
    e se<br>
    perdesse da rota? Iria ficar passando de hosts em hosts para sempre?<br>
    Cada pacote tem um valor TTL, e por cada host que ele passa ele perde 1, quando 
    esse valor chegar a 0, puff j&aacute; eras o pacote,<br>
    ele morre. Quando isto acontece &eacute; enviada uma mensagem de erro pelo 
    enviador que far&aacute; com que o pacote seja enviado novamente<br>
    por&eacute;m agora com um valor TTL mais alto.</font></p>
  <p align="left"><font size="2" color="#0000FF">***Pratica***</font></p>
  <p align="left"><font size="2">Agora chegou a hora de por tudo que vimos em 
    pr&aacute;tica, vou ensinar a fazer isto pelo registro.</font></p>
  <p align="left"><font size="2">--MTU e MSS--</font></p>
  <p align="left"><font size="2">Bem, primeiro entre no regedit(va em executar 
    e digite regedit.exe). Feito isso v&aacute; at&eacute; a chave: <br>
    HKEY_LOCAL_MACHINE\Enum\Root\Net, nesta chave ter&atilde;o v&aacute;rias sub-chaves 
    como 0000, 0001 ... 000x, abra todas essassub-chaves<br>
    e procure uma que possui o valor 'DeviceDesc' igual a 'Dial-up Adapter'.<br>
    Nesta chave voc&ecirc; encontrar&aacute; tamb&eacute;m uma chamada 'Bindings',abra-a 
    e voc&ecirc; achar&aacute; um valor chamado 'MSTCP\0000'. Lembre-se dos<br>
    ultimos quatro n&uacute;meros(nesse caso 0000), eles ser&atilde;o importantes 
    para o pr&oacute;ximo passo.<br>
    Agora v&aacute; em HKEY_LOCAL_MACHINE\Enum\Network\MSTCP e abra a sub-chave 
    que tenha o mesmo n&uacute;mero que voc&ecirc; viu antes.<br>
    Nesta chave voc&ecirc; vai encontrar um valor chamado 'Driver' e ele vai ser 
    igual a algo similiar a 'NetTrans\0002', novamente<br>
    lembre-se do ultimo n&uacute;mero deste valor(nesse caso 0002). E v&aacute; 
    para o pr&oacute;ximo passo.<br>
    Agora abra a chave HKEY_LOCAL_MACHINE\System\CurrentControlSet\Services\Class\NetTrans 
    a&iacute; vai ter uma ou mais sub-chaves<br>
    abra a sub-chave que tenha o mesmo valor do passo anterior.<br>
    Agora dentro desta sub-chave crie dois novos Valores da Sequencia com o nome 
    de 'MaxMTU' e 'MaxMSS' e coloque os valores<br>
    abaixo:<br>
    MaxMTU = 576<br>
    MaxMSS = 536<br>
    Reinicie seu computador para as altera&ccedil;&otilde;es fazerem efeito.</font></p>
  <p align="left"><font size="2">--RWIN e TTL--</font></p>
  <p align="left"><font size="2">Novamente abra o regedit e procure a seguinte 
    chave HKEY_LOCAL_MACHINE\System\CurrentControlSet\Services\VxD\MSTCP.<br>
    Nesta chave crie dois novos Valores da Sequencia: 'DefaultRcvWindow' e 'DefaultTTL' 
    e os coloque os valores abaixo:<br>
    DefaultRcvWindow = 2144<br>
    DefaultTTL = 64</font></p>
  <p align="left"><font size="2"><br>
    Pronto!! Agora seu modem est&aacute; otimizado, use-o a vontade. &Eacute; 
    claro que as diferen&ccedil;as n&atilde;o v&atilde;o ser AQUELAS diferen&ccedil;as 
    mas d&aacute; <br>
    pra notar diferen&ccedil;a sim. :)<br>
    N&atilde;o me responsabilizo se voc&ecirc; fizer cagada no registro. Fa&ccedil;a 
    exatamente o que est&aacute; descrito e qualquer d&uacute;vida entre em #virii<br>
    na Brasnet que ser&aacute; um prazer ajuda-los.</font></p>
  <p align="left"><font size="2">Fontes: Win Optimization Guide feito pela Hacker2k 
    e www.regedit.com</font></p>
</div>
</body>
</html>
