<html>
<head>
<title>..:: The Virii Hacking Guide ::.. :: Numero 01</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<BODY TEXT="#000000" BGCOLOR="#ffffff" style="font-family: Verdana, Arial, Helvetica, sans-serif">
<div align="center">
  <p><font size="1" face="Verdana, Arial, Helvetica, sans-serif"><a href="viriihacking01.html">&Iacute;ndice 
    Virii Hacking Guide 01</a></font></p>
  <p><font face="Courier New, Courier, mono" size="5"><i><font color="#006600">== 
    Tutorial Phreaker - TP ==</font></i></font></p>
  <p align="left"> <font size="2" color="#FF0000">Por: Devil_Red</font></p>
  <p align="left"><font size="2">Iai Cambada blz? Bem eu me chamo Devil_Red e 
    trabalho com seguran&ccedil;a em redes. no come&ccedil;o desse ano estava 
    &quot;estagiando&quot; na Telemar.<br>
    Bem l&aacute; alguns amiguinhos meus com id&eacute;ais parecidos me ensinaram 
    uns macetezinhos pra burlar nosso lindo sistema de telefonia.<br>
    Eu vou falar de 3 met&oacute;dos pouco citados em outros tutorias phackers 
    (n&atilde;o t&aacute; gostando? ent&atilde;o se foda).<br>
    OBS: TOdos os Met&oacute;dos Citados aqui d&atilde;o &quot;CADEIA&quot;<br>
    OBS1: Voc&ecirc; precisa das chaves de orelh&atilde;o pra executar esses macetes 
    (Mail-Me para arrumar uma por um pre&ccedil;o acess&iacute;vel)<br>
    OBS2: N&atilde;o me Responsabilizo Por Nada Citado nesse Tutorial <br>
    OBS3: Esses met&oacute;dos foram descobertos no meio do ano passado(2002). 
    <br>
    Larga de Enrola&ccedil;&atilde;o e vamos ao que interessa...</font></p>
  <p align="left"><font size="2"><br>
    1&deg;M&eacute;todo - Liga&ccedil;&atilde;o de Gra&ccedil;a Atrav&eacute;s 
    do TP<br>
    Material Necess&aacute;rio<br>
    1 Celular (Prefer&ecirc;ncia Pr&eacute;-Pago)<br>
    1 TP Um pouco afastado<br>
    Bem isso funciona assim, voc&ecirc; disca acobrar para o TP,espere ele chamar 
    umas 3 vezes.... Ent&atilde;o desligue o celular e tire o TP do gancho, Note 
    ki no visor do TP &eacute; mostrado como &quot;CHAMADA RECEBIDA&quot; voc&ecirc; 
    pega o seu lindo celular e coloca a parte de ouvir dele na parte de falar 
    do TP, disque o num&eacute;ro e agora &eacute; s&oacute; alegria heheheh<br>
    Obs*: Seu celular precisa ter DTMF(Digital Tone Multi Frequency) ativado para 
    discagem. Esse met&oacute;do foi descoberto em Junho de 2002 em alguns Estados 
    como Bahia, ele n&atilde;o funciona mais :)</font></p>
  <p align="left"><font size="2"><br>
    2&deg;M&eacute;todo - Liga&ccedil;&atilde;o de Gra&ccedil;a Atrav&eacute;s 
    do TP 2003<br>
    Material Necess&aacute;rio<br>
    1 Celular (Prefer&ecirc;ncia Pr&eacute;-Pago)<br>
    1 TP Um pouco afastado<br>
    1 Chave de TP<br>
    Hehehhe Esse &eacute; o metodo ki eu mais curto :P meus patr&otilde;es da 
    Telemar se fuderam nessa.<br>
    Bem ele &eacute; parecido com o outro, mas &eacute; necessario uma chave de 
    TP.<br>
    Primeiro abra o orelh&atilde;o, procure por um botaozinho em cima do telefone 
    perto do vizor(ele neh facil de achar nao, mas relaxi depois vc pega a manha 
    :p)<br>
    Muito Bem Voce entrou no menu de acesso do TP bem vai apertando a tecla * 
    at&eacute; vc chegar a op&ccedil;ao Auto Teste, ent&atilde;o aperte a tecla 
    # para selecionar essa op&ccedil;&acirc;o.<br>
    O TP Far&aacute; uns testes idiotas e vai liberar voc&ecirc; pra discar pelo 
    nosso celular. Agora he soh alegria<br>
    Obs*: Seu celular precisa ter DTMF(Digital Tone Multi Frequency) ativado para 
    discagem</font></p>
  <p align="left"><font size="2"><br>
    3&deg;Met&oacute;do - Liga&ccedil;&atilde;o de Gra&ccedil;a Atrav&eacute;s 
    do TP 2003 (2)<br>
    Material Necess&aacute;rio<br>
    1 TP Um pouco afastado<br>
    1 Chave de TP<br>
    Rpz se voc&ecirc; for um preto fudido que n&atilde;o tem nem um celular esse 
    met&oacute;do he pra vc :P<br>
    Bem leia a porra do metodo acima, em vez de selecionar a op&ccedil;ao auto 
    teste procure por Comunica&ccedil;&atilde;o e aperte a tecla # para seleciona-l&aacute; 
    procure por numero de central(Isso depende da tua operadora mas sempre vai 
    ter esse n&uacute;mero) vai ter um n&uacute;mero mais ou menos assim 00801233443 
    voce muda esse numero e coloca por exemplo assim 012345678(COloke sempre o 
    DDD) Pronto... HEHeh Tuh tah Falando J&aacute; :P<br>
    Obs*: Desprograme ele pois quando puxarem o TP do gancho sempre ir&aacute; 
    discar para aquele n&uacute;mero (Imagina se for o tel da casa de sua namorada, 
    vai tocar mais ki o kraio lah)<br>
    Obs1*: Mude akele numero pra um n&uacute;mero ale&aacute;torio pois pode ser 
    que voc&ecirc; seja pego por uma merda como essa Pense nisso FIu :P</font></p>
  <p align="left"></p>
  <p align="left"><font size="2"> BEIJOS NA BUNDA do Teu Amigo Devil_Red #carder 
    Irc.bitsnet.com.br - devilred@kernel.net</font></p>
  <p align="left"><br>
  </p>
  <p align="left">&nbsp; </p>
  </div>
</body>
</html>
