<html>
<head>
<title>..:: The Virii Hacking Guide ::.. :: Numero 01</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<BODY TEXT="#000000" BGCOLOR="#ffffff" style="font-family: Verdana, Arial, Helvetica, sans-serif">
<div align="center">
  <p><font size="1" face="Verdana, Arial, Helvetica, sans-serif"><a href="viriihacking01.html">&Iacute;ndice 
    Virii Hacking Guide 01</a></font></p>
  <p><font face="Courier New, Courier, mono" size="5"><i><font color="#006600">== 
    Consultoria de Seguran&ccedil;a da Informa&ccedil;&atilde;o==</font></i></font></p>
  <p align="left">&nbsp;</p>
  <p align="left"><font size="2" color="#FF0000">Por: vH_ (ak1947@bk.ru)<br>
    http://hudson.hackernews.com.br</font></p>
  <p align="left"><font size="2"><br>
    <font color="#006600">.::Notas do Autor::.</font></font></p>
  <p align="left"><font size="2"> Enfim, resolvi escrever este documento para 
    auxiliar pessoas interessadas em iniciar uma carreira na &aacute;rea de seguran&ccedil;a 
    da informa&ccedil;&atilde;o. Lembrando que voc&ecirc; n&atilde;o se torna 
    um consultor de seguran&ccedil;a apenas por ler um simples documento escrito 
    por algu&eacute;m e lan&ccedil;ado na rede, existe um processo um tanto quanto 
    longo at&eacute; que voc&ecirc; consiga conhecimento a n&iacute;vel de receber 
    o t&iacute;tulo de Consultor de Seguran&ccedil;a da Informa&ccedil;&atilde;o. 
    Este documento &eacute; para ajudar o m&iacute;nimo na integra&ccedil;&atilde;o 
    de profissionais de seguran&ccedil;a no mercado, pode n&atilde;o ser um documento 
    perfeito mas j&aacute; encaminha voc&ecirc; para o rumo certo. Acredito que 
    o mercado precisa de mais profissionais de seguran&ccedil;a da informa&ccedil;&atilde;o 
    dispon&iacute;veis e j&aacute; me sinto um pouco melhor sabendo que talvez 
    eu estou contribuindo para a integra&ccedil;&atilde;o de pessoas interessadas. 
    Tenha uma boa leitura e boa sorte.</font></p>
  <p align="left"></p>
  <p align="left"><font size="2"> vH_<br>
    (Autodidata em Seguran&ccedil;a da Informa&ccedil;&atilde;o)</font></p>
  <p align="left"></p>
  <p align="left"></p>
  <p align="left"><font size="2" color="#006600">.::Introdu&ccedil;&atilde;o::.</font></p>
  <p align="left"><font size="2"> Este documento descreve um processo de Consultoria 
    de Seguran&ccedil;a da Informa&ccedil;&atilde;o bastante detalhado, por isso, 
    os processos s&atilde;o chatos e, talvez, muitos deles, ser&atilde;o considerados 
    in&uacute;teis. Qualquer tipo de informa&ccedil;&atilde;o adquirida por estes 
    processos ser&atilde;o indispensavelmente &uacute;teis durante a aplica&ccedil;&atilde;o 
    d politicas e t&eacute;cnicas de seguran&ccedil;a da informa&ccedil;&atilde;o 
    constida na rede ou sistema em quest&atilde;o. Voc&ecirc; pode utilizar este 
    documento como quiser, n&atilde;o vou recomendar nada porque se voc&ecirc; 
    for um cabe&ccedil;a dura como a maioria dos pseudo-administradores de redes 
    espalhados pelo mundo, n&atilde;o vai adiantar, portanto, o documento est&aacute; 
    descrevendo os processos, siga-os de acordo com sua pregui&ccedil;a.</font></p>
  <p align="left"><font size="2"><br>
    <font color="#006600">.::Reunir Informa&ccedil;&otilde;es::.</font></font></p>
  <p align="left"><font size="2"> Este procedimento pode ser um pouco chato, principalmente 
    se a rede em quest&atilde;o for composta por um n&uacute;mero significativo 
    de esta&ccedil;&otilde;es. Voc&ecirc; dever&aacute; reunir o maior n&uacute;mero 
    de informa&ccedil;&otilde;es referentes ao ambiente a ser aplicado regras 
    de seguran&ccedil;a. Voc&ecirc; dever&aacute; reunir informa&ccedil;&otilde;es 
    sobre Hardware, Topologia, Protocolos, Software e outras informa&ccedil;&otilde;es 
    que julgar necess&aacute;rias referentes a rede. Um exemplo de informa&ccedil;&atilde;o 
    referente &agrave; rede &eacute; se o operador do servidor, ou administrador, 
    &eacute; distra&iacute;do e tem problemas intestinais... Seria um problema 
    de seguran&ccedil;a ir passar um faz e deixar o servidor com super usu&aacute;rio 
    logado. Os m&iacute;nutos de gl&oacute;ria que ele passaria fora poderiam 
    corresponder a dias de dor de cabe&ccedil;a se algu&eacute;m aproveitasse 
    deste momento, ou n&atilde;o, se o algu&eacute;m fosse inteligente o bastante 
    de se ocultar, se bem que n&atilde;o &eacute; preciso muita t&eacute;cnica 
    pra se esconder de um administrador que esquece o servidor logado ;) .</font></p>
  <p align="left"><font size="2">- Hardware: Voc&ecirc; dever&aacute; identificar 
    a marca, modelo , fabricante, s&eacute;rie, idade, cor, etc., de cada esta&ccedil;&atilde;o 
    de trabalho, hub, roteador, e qualquer dispositivo utilizado na rede. Voc&ecirc; 
    deve incluir at&eacute; mesmo recursos do sistema como mem&oacute;ria das 
    esta&ccedil;&otilde;es, capacidade de disco etc. <br>
    - Topologia: Recolha informa&ccedil;&otilde;es de localiza&ccedil;&atilde;o 
    das esta&ccedil;&otilde;es e onde passa qualquwr segmnto de rede, anote tudo 
    o quer for poss&iacute;vel ser alterado (reduzido ou aumentado), recolha tamb;em 
    qualquer informa&ccedil;&atilde;o que julgar relevante. <br>
    - Protocolos: Informa&ccedil;&otilde;es sobre os protocolos utilizados na 
    rede tamb&eacute;m ser&aacute; bastante &uacute;til. Organize as informa&ccedil;&otilde;es 
    por m&aacute;quina pois o algumas poder&atilde;o receber tratamento especial.<br>
    - Software: Os software utilizados nas esta&ccedil;&otilde;es e servidores 
    s&atilde;o, na maioria das vezes, os respons&aacute;veis por furos na seguran&ccedil;a. 
    Voc&ecirc; dever&aacute; identificar *todos* os aplicativos e sistemas utilizados 
    em cada esta&ccedil;&atilde;o. No caso dos servidores, identifique o servi&ccedil;o 
    tamb&eacute;m. Um acompanhamento das notas do fabricante poder&aacute; ser 
    necess&aacute;rio durante a utiliza&ccedil;&atilde;o do software.</font></p>
  <p align="left"><font size="2"><br>
    <font color="#006600">.::Servi&ccedil;o::.</font></font></p>
  <p align="left"><font size="2"> Com as informa&ccedil;&otilde;es em m&atilde;os, 
    voc&ecirc; j&aacute; &eacute; capaz de apresentar um projeto de seguran&ccedil;a 
    da informa&ccedil;&atilde;o decente. Voc&ecirc; n&atilde;o dever&aacute; reduzir 
    recursos pois fazendo isso, voc&ecirc; corre o risco de fazer um servi&ccedil;o 
    ruim onde um outro profissional de seguran&ccedil;a poder&aacute; ocupar sua 
    vaga, sujando seu nome. Inclua os seguintes itens na sua lista de prioridades 
    do projeto:<br>
    - Software Anti-V&iacute;rus: Instala&ccedil;&atilde;o de um anti-v&iacute;rus 
    respeitado com uma dedica&ccedil;&atilde;o consider&aacute;vel nas atualiza&ccedil;&otilde;es 
    de vacinas. Lembrando que um anti-v&iacute;rus n&atilde;o serve para limpar 
    v&iacute;rus, mas sim para evitar v&iacute;rus. N&atilde;o adianta colocar 
    grade depois que o ladr&atilde;o entrou.<br>
    - Firewall de rede: Voc&ecirc; dever&aacute; barrar os pacotes desnecess&aacute;rios 
    vindos de fora da rede para evitar constrangimentos. Se a rede n&atilde;o 
    &eacute; p&uacute;blica, n&atilde;o tem porque deix&aacute;-la disponivel 
    para todos.<br>
    - Servi&ccedil;os de Seguran&ccedil;a de servidores: De acordo com sua(s) 
    especialidade(s) voc&ecirc; dever&aacute; adicionar um servi&ccedil;o de dedica&ccedil;&atilde;o 
    ao sistema utilizado no servidor (Macintosh, Solaris, Unix, OS/2, Lunix, Bsd, 
    etc. [sendo que etc n&atilde;o &eacute; sistema, pelo menos ate o momento]).<br>
    - Teste de penetra&ccedil;&atilde;o: Se possivel, apresente ao dono da rede 
    ou empresa um teste de penetra&ccedil;&atilde;o antes e depois da aplica&ccedil;&atilde;o 
    das politicas e t&eacute;cnicas de seguran&ccedil;a. Isso abate a lenda de 
    que a seguran&ccedil;a da informa&ccedil;&atilde;o &eacute; um produto invis&iacute;vel.<br>
    - Avalia&ccedil;&atilde;o de Risco: Apresente ao administrador ou respons&aacute;vel 
    uma avalia&ccedil;&atilde;o dos riscos de furos na seguran&ccedil;a existentes 
    na rede antes da aplica&ccedil;&atilde;o de novas regras e t&eacute;cnicas.<br>
    - Pol&iacute;tica de seguran&ccedil;a: Apresente a pol&iacute;tica de seguran&ccedil;a 
    sugerida para a rede e discriminada por esta&ccedil;&atilde;o e seus respectivos 
    usu&aacute;rios. Lembrando que voc&ecirc; n&atilde;o dever&aacute; impor regras 
    absurdas como indisponibilizar o note pad ou o vi.<br>
    - Detec&ccedil;&atilde;o de invas&atilde;o de rede: Utilize no projeto um 
    sistema de detec&ccedil;&atilde;o de invas&atilde;o de rede, caso voc&ecirc; 
    seja um profissional dedicado, voc&ecirc; n&atilde;o utilizar&aacute; muito 
    este dispositivo, o que n&atilde;o pode ocorrer &eacute; de um furo ser explorado 
    e n&atilde;o identificado. :/</font></p>
  <p align="left"><font size="2"><br>
    <font color="#006600">.::Custo::.</font></font></p>
  <p align="left"><font size="2"> Este ponto varia de acordo com a necessidades 
    de cada sistema ou rede,. V&aacute;rios pontos influenciam, tais como:<br>
    - Arquitetura da rede: Se a rede utiliza um padr&atilde;o de aplicativos, 
    a manuten&ccedil;&atilde;o da seguran&ccedil;a poder&aacute; ser mais barata 
    pois a mesma pol&iacute;tica e dedica&ccedil;&atilde;o poder&aacute; ser aplicada 
    para todas as esta&ccedil;&otilde;es. Se a rede disp&otilde;es de v&aacute;rios 
    sistemas operacionais diferentes, voc&ecirc; poder&aacute; n&atilde;o dominar 
    a seguran&ccedil;a de todos, ent&atilde;o , ser&aacute; necess&aacute;rio 
    a contrata&ccedil;&atilde;o de profissionais que se encarregar&atilde;o de 
    tratar de acordo com as necessidades, as esta&ccedil;&otilde;es em qust&atilde;o. 
    Isto, certamente, aumentar&aacute; os custos do servi&ccedil;o.<br>
    - Confian&ccedil;a em solu&ccedil;&otilde;es propiet&aacute;rias: Se a rede 
    em quest&atilde;o, depende de solu&ccedil;&otilde;es incompat&iacute;veis 
    com a seguran&ccedil;a que voc&ecirc; sugere, ser&aacute; necess&aacute;rio 
    um custo maior na migra&ccedil;&atilde;o desta solu&ccedil;&atilde;o para 
    outra plataforma. <br>
    - Como as informa&ccedil;&otilde;es sobre a rede est&atilde;o organizadas: 
    Se n&atilde;o existe nenhum tipo de informa&ccedil;&atilde;o sobre a rede 
    (conforme o descrito no in&iacute;cio do documento), o custo ser&aacute; maior 
    pois adiquirir este tipo de informa&ccedil;&atilde;o &eacute; um processo 
    bastante trabalhoso e, de acordo com o tamanho da rede, bastante demorado. 
    Levando em conta que &eacute; importannte manter um padr&atilde;o na organiza&ccedil;&atilde;o 
    das informa&otilde;es para conferir com informa&ccedil;&otilde;es detidas 
    pelo administrador (caso ele tenha esse tipo de informa&ccedil;&atilde;o em 
    m&atilde;os). Fique esperto com isso, pois pode ser que a empresa queira avaliar 
    seu n&iacute;vel de profissionalismo.<br>
    - Nota: todos os fatores descritos acima influenciar&atilde;o nos custos, 
    e deve-se lembrar de que n&atilde;o existe nenhum padr&atilde;o industrial 
    para um trabalho particular relacionado &agrave; Seguran&ccedil;a da Informa&ccedil;&atilde;o.</font></p>
  <p align="left"></p>
  <p align="left"><font size="2" color="#006600">.::Notas Finais::.</font></p>
  <p align="left"><font size="2"> A utiliza&ccedil;&atilde;o deste documento &eacute; 
    de acordo com sua &eacute;tica. N&atilde;o vou ficar implorando para voc&ecirc; 
    manter os direitos autorais porque se voc&ecirc; tem dignidade, este recado 
    nem precisa ser transmitido. Caso tenha alguma contribui&ccedil;&atilde;o, 
    d&uacute;vida ou queira simplesmente reclamar alguma coisa, utilize o endere&ccedil;o 
    de e-mail descrito no final deste documento. Espero que isto tenha enriquecido 
    pelo menos qualquer porcentagem em seu conhecimento, caso n&atilde;o, fico 
    feliz por meu documento ser lido por um verdadeiro profissional. Estou pensando 
    em desenvolver um documento que trata da Autidoria de Seguran&ccedil;a da 
    Informa&ccedil;&atilde;o, isto ainda n&atilde;o &eacute; certo, vai depender 
    do retorno que este documento causar. Caso o desenvolvimento seja finalizado, 
    ser&aacute; disponibilizado no mesmo website que voc&ecirc; conseguiu este. 
    </font></p>
  <p align="left"></p>
  <p align="left"><font size="2">vH_ (ak1947@bk.ru)<br>
    http://hudson.hackernews.com.br<br>
    Sabedoria &eacute; saber o que fazer, habilidade &eacute; saber como fazer, 
    virtude &eacute; fazer!</font></p>
  <p align="left">&nbsp; </p>
  </div>
</body>
</html>
