<html>
<head>
<title>..:: The Virii Hacking Guide ::.. :: Numero 01</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<BODY TEXT="#000000" BGCOLOR="#ffffff" style="font-family: Verdana, Arial, Helvetica, sans-serif">
<div align="center">
  <p><font size="1" face="Verdana, Arial, Helvetica, sans-serif"><a href="viriihacking01.html">&Iacute;ndice 
    Virii Hacking Guide 01</a></font></p>
  <p><font face="Courier New, Courier, mono" size="5"><i><font color="#006600">== 
    TELNET - Como Funciona ==</font></i></font></p>
  <p align="left"> <font size="2" color="#FF0000">Por: Hallucination</font></p>
  <p align="left"><font size="2" color="#0000FF">Introdu&ccedil;&atilde;o</font></p>
  <p align="left"><font size="2">O Telnet &eacute; um protocolo de aplica&ccedil;&atilde;o 
    que segue o modelo Cliente/Servidor<br>
    e permite que uma m&aacute;quina cliente conecte-se num servidor de uma rede<br>
    qualquer e manipule-o como se o usu&aacute;rio estivesse em frente ao servidor,<br>
    ou seja, tudo que o usu&aacute;rio faz num terminal telnet, estar&aacute; 
    acontecendo<br>
    no servidor, e n&atilde;o no seu computador.<br>
    A porta padr&atilde;o do telnet &eacute; a 23, e o protocolo de transporte 
    utilizado<br>
    &eacute; o TCP. Os dados s&atilde;o trasmitidos em c&oacute;digo ASCII.</font></p>
  <p align="left"><font size="2"><br>
    <font color="#0000FF">NVT</font></font></p>
  <p align="left"><font size="2">Numa conex&atilde;o utilizando o protocolo Telnet, 
    tanto servidor como o cliente<br>
    utilizam um NVT (Network Virtual Terminal) para a comunica&ccedil;&atilde;o. 
    Cada NVT <br>
    possui um &quot;teclado&quot; e uma &quot;impressora&quot; virtual. Quando 
    voc&ecirc; digita no<br>
    seu computador, est&aacute; usando o teclado NVT; j&aacute; a impressora NVT 
    &eacute; utilizada<br>
    para imprimir os dados na tela do seu computador. A vantagem do NVT &eacute; 
    que<br>
    tanto o cliente como o servidor n&atilde;o precisam armazenar informa&ccedil;&otilde;es 
    sobre<br>
    as caracter&iacute;sticas do terminal um do outro, o que simplifica muito 
    o<br>
    processo.</font></p>
  <p align="left"><font size="2"><br>
    <font color="#0000FF">Funcionamento</font></font></p>
  <p align="left"><font size="2">Em linhas gerais, o funcionamento do telnet &eacute; 
    o seguinte:</font></p>
  <p align="left"><font size="2">1. O servidor &eacute; contactado e o computador 
    cliente e o servidor decidem<br>
    qual emula&ccedil;&atilde;o de terminal ser&aacute; utilizada, ou seja, qual 
    o padr&atilde;o ser&aacute;<br>
    adotado para a transmiss&atilde;o das informa&ccedil;&otilde;es. Isso assegura 
    que as <br>
    informa&ccedil;&otilde;es sejam corretamente exibidas na tela. A emula&ccedil;&atilde;o 
    mais comum<br>
    &eacute; a VT-100.</font></p>
  <p align="left"><font size="2">2. O texto que voc&ecirc; digita &eacute; &quot;empacotado&quot; 
    e enviado. Tamb&eacute;m podem ser<br>
    enviados comandos espec&iacute;ficos do telnet, que o outro NVT (o do servidor)<br>
    usar&aacute; para saber o que fazer com os dados ou ainda como respond&ecirc;-los.<br>
    Como exemplos desses comandos temos o CR (Carriage Return), que move<br>
    a &quot;impressora&quot; para o canto esquerdo da linha; LF (Line Feed), move 
    a <br>
    &quot;impressora&quot; para a pr&oacute;xima linha e AYT (Are You There), 
    serve para<br>
    verificar se o sistema ainda est&aacute; ativo.</font></p>
  <p align="left"><font size="2">3. O servidor recebe os dados que voc&ecirc; 
    enviou, os processa, e os envia<br>
    de volta. Ent&atilde;o a sua impressora NVT imprime o resultado na sua tela.</font></p>
  <p align="left"><font size="2">Um grande problema do telnet &eacute; a seguran&ccedil;a; 
    os dados s&atilde;o enviados em<br>
    formato texto puro, portanto se um sniffer for instalado entre o<br>
    cliente e o servidor, informa&ccedil;&otilde;es valiosas (incluindo logins 
    e senhas)<br>
    podem ser facilmente capturadas. Uma alternativa ao telnet &eacute; o SSH, 
    que<br>
    fornece uma conex&atilde;o segura, utilizando criptografia.</font></p>
  <p align="left"></p>
  <p align="left"><font size="2" color="#0000FF">Gloss&aacute;rio</font></p>
  <p align="left"><font size="2">Protocolo - &Eacute; um conjunto de regras que 
    define como ser&aacute; realizado<br>
    o transporte de dados. Pode ser considerado o &quot;idioma&quot; que os <br>
    computadores de uma rede usam para se comunicar.</font></p>
  <p align="left"><font size="2">Protocolo de Aplica&ccedil;&atilde;o - &Eacute; 
    a demonima&ccedil;&atilde;o dada a um protocolo que utiliza <br>
    os protocolos de transporte (TCP e UDP, no caso de redes TCP/IP) para <br>
    realizar o envio e recebimento de dados atrav&eacute;s da rede.</font></p>
  <p align="left"><font size="2">ASCII - American Standard Code for Information 
    Interchange - &Eacute; um c&oacute;digo<br>
    padr&atilde;o utilizado para representa&ccedil;&atilde;o e transmiss&atilde;o 
    de texto.</font></p>
  <p align="left"><font size="2">-EOF-</font></p>
  <p></p>
  <p></p>
  <p><br>
  </p>
</div>
</body>
</html>
