<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.5 [es] (Win98; I) [Netscape]">
   <title>A debate.</title>
</head>
<body text="#FFFFFF" bgcolor="#000000">

<center><img SRC="up'dn.gif" height=18 width=623><img SRC="debate.jpg" height=100 width=300></center>

<p><font face="Tahoma"><font color="#C0C0C0"><font size=-1>Por fin han
llegado las participaciones a esta secci&oacute;n. Como recordareis (o
deber&iacute;as recordar), las preguntas eran las siguientes:</font></font></font>
<p><b><font face="Tahoma"><font size=-1><font color="#FF0000"><u>Internet
en Espa&ntilde;a:</u> </font><u><font color="#3366FF">&iquest;un negocio
o una nueva v&iacute;a de comunicaci&oacute;n?</font></u></font></font></b>
<p><font face="Tahoma"><font size=-1><font color="#C0C0C0">Antes de empezar
a exponer las opiniones de los lectores, debo pensar un nuevo tema para
el numero siguiente... el tema ser&aacute;... &iexcl;Ah!, ya se. </font><b><font color="#FFCC00">LINUX,
&iquest;EL SUCESOR DEL S.O. WINDOWS?</font></b></font></font>
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<table BORDER >
<tr>
<td><font face="Tahoma">Bueno, internet tiene sus cosas buenas, ha hecho
que el mundo parezca un poco m&aacute;s peque&ntilde;o, me acuerdo cuando
me conect&eacute; en casa de un amigo y entre en una p&aacute;gina Web
de Australia, me parec&iacute;a algo increible.</font>
<br><font face="Tahoma">De negocio, creo que tan solo para Timof&oacute;nica,
porque como ya sabes Internet no es de nadie, asi que mucho dinero no podr&aacute;s
ganar, directamente, poniendo una p&aacute;gina Web, si lo puedes ganar
poniendo en ella publicidad, haciendo que entren poniendo su n&uacute;mero
de la cuenta corriente, etc.</font>
<br><font face="Tahoma">Asi que en definitiva Internet es sobre todo una
nueva y buena via de comunicaci&oacute;n y que si yo lo tendria, para mi
ser&iacute;a practicamente la &uacute;nica que existir&iacute;a.</font></td>
</tr>

<tr>
<td><b><font face="Tahoma"><font color="#FFFF00"><font size=-1>Oscar Montes
D&iacute;az</font></font></font></b>
<br><b><font face="Tahoma"><font color="#FFFF00"><font size=-1>Torrelavega
(CANTABRIA)</font></font></font></b></td>
</tr>
</table>

<p><b><u><font face="Tahoma"><font size=-1><font color="#FF0000">Carmageddon,
Resident Evil 2...</font></font></font></u><font face="Tahoma"><font size=-1><font color="#FF0000">
</font><u><font color="#3366FF">&iquest;De verdad son tan prejudiciales
para los menores o es que hay mucho soplapo...por el mundo?</font></u></font></font></b>
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<table BORDER >
<tr>
<td><font face="Tahoma"><font color="#FFFFFF"><font size=+0>Lo del Carmageddon
y Resident Evil, etc es un debate ya antiguo, el problema que tienen estos
juegos es que son demasiado buenos y se ve demasiado bien lo que es la
sangre, etc, porque si dicen que son perjudiciales para los menores porque
matan gente, entonces habria que censurar a la mitad de los juegos, Quake,
Street Fighter, etc.</font></font></font>
<br><font face="Tahoma"><font color="#FFFFFF"><font size=+0>Yo creo que
es mas perjuducial para un menor ver el Telediario, el otro dia estaba
viendolo y aparecieron un monton de gente apaleando a una joven porque
habia aparcado el coche delante de la casa del alcalde o algo asi, &iexcl;que
verguenza!, y todavia dicen que el Carmageddon es violento, tan solo es
un videojuego, y creo que "los menores" no son tontos y saben distinguir
lo que es un simple juego y lo que es la vida real.</font></font></font></td>
</tr>

<tr>
<td><b><font face="Tahoma"><font color="#FFFF00"><font size=-1>Oscar Montes
D&iacute;az</font></font></font></b>
<br><b><font face="Tahoma"><font color="#FFFF00"><font size=-1>Torrelavega
(CANTABRIA)</font></font></font></b></td>
</tr>
</table>

<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<table BORDER >
<tr>
<td><font face="Tahoma">Mi opinion respecto a los juegos de sangre (v&eacute;ase
Resident evil 2, carmagedon) es esta: si a unos pocos les parece violencia
ya nos privan de juegos tan buenos en cuanto a calidad y est&aacute;n pidiendo
la eliminaci&oacute;n de &eacute;stos, rompiendo as&iacute; la libertad
de elecci&oacute;n, dado que somos libres de eleguir, con lo que si alguien
elige por nosotros lo que debemos y lo que no debemos escoger, entonces
ya no somos libre.</font>
<br><font face="Tahoma">En mi opini&oacute;n &eacute;stos juegos no son
nada m&aacute;s que puras ni&ntilde;erias en comparacion con otras producciones
en otros terrenos, nadie dice que deban eliminarse las pel&iacute;culas
del viernes noche del plus, ni nadie dice lo que es malo en cuanto a pornograf&iacute;a
se refiere. En fin &eacute;stos juegos deber&iacute;an de ser de libre
elecci&oacute;n, a quien les guste que los compre y a quien no, que no
los compre.</font></td>
</tr>

<tr>
<td><b><font face="Tahoma"><font color="#FFFF00"><font size=-1>Miguel Caso
Nava</font></font></font></b>
<br><b><font face="Tahoma"><font color="#FFFF00"><font size=-1>Gijon (ASTURIAS)</font></font></font></b></td>
</tr>
</table>

</body>
</html>
