<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.5 [es] (Win98; I) [Netscape]">
   <title>Direcciones de internet</title>
</head>
<body text="#FFFFFF" bgcolor="#000000" link="#0080FF">

<center><b><u><font color="#8080FF"><font size=+2>INTERNET</font></font></u></b>
<p><img SRC="irfan.jpg" HSPACE=2 VSPACE=2 height=215 width=300 align=LEFT><font face="Tahoma"><font size=-1><font color="#FFFFFF">Como
primera web recomendada, tenemos la pagina del visualizador y a la vez
conversor de im&aacute;genes llamado
</font><font color="#FF0000">IrfanView32.</font><font color="#FFFFFF">
Para los que no lo sepan aun, este programa es uno de los mejores y mas
r&aacute;pidos visualizadores que se pueden encontrar, pero con algo a
su favor que le diferencia de los dem&aacute;s, es totalmente gratuito.
Desde esta pagina se puede descargar este fant&aacute;stico programa en
dos versiones, ingles y alem&aacute;n. Ademas de la opci&oacute;n de bajar
el programa desde internet, podemos usar un motor de b&uacute;squeda que
localiza un lugar mas cercano y mas r&aacute;pido para bajar el programa
lo mas r&aacute;pido posible y ganar tiempo y no perder dinero :). En resumen,
una buena pagina para un muy buen programa.</font></font></font>
<p><font face="Tahoma"><font color="#0000FF"><font size=-1><a href="http://stud1.tuwien.ac.at/~e9227474/">http://stud1.tuwien.ac.at/~e9227474/</a></font></font></font>
<p><br>
<br>&nbsp;
<p><img SRC="sandra.jpg" height=215 width=300 align=RIGHT><font face="Tahoma"><font size=-1>Si
sois admiradores de la fant&aacute;stica Sandra Bullock no dej&eacute;is
de navegar por esta pagina web donde encontraras las mejores im&aacute;genes
de esta maravillosa actriz. El mayor punto negro de esta pagina son las
pocas im&aacute;genes que se pueden encontrar y no incluye ning&uacute;n
enlace a otras paginas del mismo tipo, pero siempre se puede acceder a
la pagina web <a href="http://www.sandra.com">http://www.sandra.com</a>
donde tambi&eacute;n encontrareis mas im&aacute;genes, incluidas fotos
del 1982 de cuando estudiaba en el instituto y tambi&eacute;n de sus ultimas
pel&iacute;culas. Ademas pod&eacute;is encontrar mucha informaci&oacute;n
sobre la actriz y sobre su carrera cinematogr&aacute;fica. Si dese&aacute;is
mas direcciones visitar el portal yahoo.com donde encontrareis much&iacute;simos
links a paginas sobre Sandra Bullock.</font></font>
<p><font face="Tahoma"><font size=-1><a href="http://olympia.fortunecity.com/louganis/80/sandra.html">http://olympia.fortunecity.com/louganis/80/sandra.html</a></font></font>
<p><br>
<br>&nbsp;
<p><img SRC="mod.jpg" height=215 width=300 align=LEFT><font face="Tahoma"><font size=-1>Esta
es la fant&aacute;stica web del fant&aacute;stico programa :) ModPlug Player.
Una web muy bien elaborada y con algo que no se puede dejar de mencionar,
la velocidad de carga. A pesar de tener tantos gr&aacute;ficos la pagina
se carga a una velocidad incre&iacute;ble, algo que hay que aplaudir. Desde
esta pagina se pueden bajar las ultimas versiones del modplug player, modplug
plug-in y de su fant&aacute;stico tracker... Modplug Tracker. Estos tres
programas son completamente gratuitos, y este ultimo que he mencionado,
es muy recomendable. Como suele ocurrir en este tipo de paginas, podemos
seleccionar varios lugares diferentes de donde vamos a descargar el programa,
buscando as&iacute; el lugar mas r&aacute;pido y fiable. En resumen, si
te gusta este programa o deseas probar alguno de los tres disponibles...
no dudes en pasar de vez en cuando por esta web, ya que los programas son
actualizados cada poco tiempo.</font></font>
<p><font face="Tahoma"><font size=-1><a href="http://www.castlex.com/modplug">http://www.castlex.com/modplug</a></font></font>
<br>&nbsp;
<br>&nbsp;
<p><img SRC="all.jpg" height=215 width=300 align=RIGHT><font face="Tahoma"><font size=-1>&iquest;Que
te parecer&iacute;a que alguien te ayudase a pagar las desorbitadas tarifas
de timofonica? (ademas de tus padres :) Ahora tienes esa oportunidad gracias
a la empresa AllAdvantage. Esta empresa por raro que te pueda parecer te
paga dinero solamente por tener una peque&ntilde;a barra de publicidad
en tu navegador de internet mientras navegas, pero aunque no llega para
pagarte todo el gasto telef&oacute;nico... te ayuda. Lo &uacute;nico que
debes hacer es apuntarte rellenando un sencillo formulario, y al momento
recibir&aacute;s un e-mail donde te dan las gracias por apuntarte, pero
lo mas importante... te dicen que en un plazo de 5 a 8 semanas recibir&aacute;s
tu viewbar. &iquest;Y que es esto? La barra de publicidad que te he dicho
antes. As&iacute; de sencillo ya que luego el dinero te lo env&iacute;an
directamente a casa. Como ves es una oportunidad que no debes perder, yo
ya me he dado de alta:)</font></font>
<p><font face="Tahoma"><font size=-1><a href="http://www.alladvantage.com/go.asp?refid=DKO051">http://www.alladvantage.com/go.asp?refid=DKO051</a></font></font></center>

<br><font face="Tahoma"><font size=-1><a href="http://www.alladvantage.com/go.asp?refid=DKO051"></a></font></font>&nbsp;<font face="Tahoma"><font size=-1><a href="http://www.alladvantage.com/go.asp?refid=DKO051"></a></font></font>
<div align=right>
<p><img SRC="Punish07.gif" height=224 width=384></div>

</body>
</html>
