<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Clad Strife">
   <meta name="GENERATOR" content="Mozilla/4.61 [en] (Win98; I) [Netscape]">
   <title>base de registre sous Windows98</title>
</head>
<body text="#000000" bgcolor="#FFF5F0" link="#0000EE" vlink="#551A8B" alink="#FF0000">

<center><b><tt><font color="#000000"><font size=+2>La base de registre</font></font></tt></b></center>

<p><br>
<br>
<br>
<br>
<br>
<p><font color="#000000">&nbsp;&nbsp;&nbsp; La Base de registre (BDR),
c'est ce sur quoi se base windows pour fonctionner. Dans la BDR sont stock&eacute;es
diverses informations comme des configurations variables (comme la configuration
de l'&eacute;cran de veille par exemple), des informations variables (programmes
qui se lancent au d&eacute;marrage de windows, associations des formats,
informations sur Windows et son utilisateur...). La BDR est assez complexe
&agrave; exploiter et l'on ne va s'int&eacute;resser qu'&agrave; quelques
petites choses int&eacute;ressantes.</font>
<br><font color="#000000">&nbsp;&nbsp; Avant de commencer les applications
pratiques il faut savoir que la base de registre est &eacute;ditable depuis
regedit.exe, ou bien &agrave; l'aide de fichiers .REG dont la construction
sera vue plus bas.</font>
<p><font color="#000000">ATTENTION: Les travaux sur la BDR peuvent &ecirc;tre
dangereux et n&eacute;cessite la plus extr&ecirc;me prudence. Dans le cas
ou vous voudriez recouvrir vos informations de BDR voici un petit tableau
qui peut vous aider, &agrave; faire imprimer de pr&eacute;f&eacute;rence:</font>
<br>&nbsp;
<br>&nbsp;
<table BORDER COLS=2 WIDTH="100%" BGCOLOR="#64BED9" >
<tr>
<td><b>V&eacute;rifier le registre</b></td>

<td><u>Remplacement de votre Registre par la copie de sauvegarde</u>
<p>Votre syst&egrave;me conserve toujours une copie de sauvegarde de la
configuration de votre Registre (y compris les informations relatives au
compte d'utilisateur, les liens de protocole, les param&egrave;tres des
applications et les pr&eacute;f&eacute;rences de l'utilisateur). En cas
de probl&egrave;me avec votre Registre actuel, vous pouvez utiliser la
copie de sauvegarde. Chaque fois que vous red&eacute;marrez votre ordinateur,
la V&eacute;rification du Registre parcourt automatiquement votre Registre.
Si elle rencontre un probl&egrave;me, elle remplace automatiquement le
Registre par la copie de sauvegarde.
<br>&nbsp;
<br>&nbsp;
<p>Vous pouvez d&eacute;marrer la V&eacute;rification du Registre en proc&eacute;dant
comme suit : cliquez sur D&eacute;marrer, pointez sur Programmes, sur Accessoires,
sur Outils syst&egrave;me, puis cliquez sur Informations syst&egrave;me,
puis sur le menu Outils et sur V&eacute;rification du Registre.&nbsp;
<p>C:\WINDOWS\SCANREGW.EXE
<p>Si votre Registre contient une entr&eacute;e faisant r&eacute;f&eacute;rence
&agrave; un fichier qui n'existe plus (notamment un fichier .vxd), la V&eacute;rification
du Registre ne la r&eacute;sout pas.</td>
</tr>

<tr>
<td><b>Pour obtenir une sauvegarde du Registre ex&eacute;cut&eacute;e par
l'Agent ARCserve</b></td>

<td>Ouvrez la bo&icirc;te de dialogue R&eacute;seau en proc&eacute;dant
comme suit : cliquez sur D&eacute;marrer, pointez sur Param&egrave;tres,
cliquez sur Panneau de configuration, puis double-cliquez sur R&eacute;seau.&nbsp;
<br>Dans la liste des composants r&eacute;seau, cliquez sur Agent ARCserve,
puis sur Propri&eacute;t&eacute;s.&nbsp;
<br>Sous l'onglet G&eacute;n&eacute;ral, d&eacute;sactivez la case &agrave;
cocher Ne pas restaurer le Registre.&nbsp;
<br>Vous sp&eacute;cifiez ainsi que vous souhaitez que le&nbsp; soit restaur&eacute;
en m&ecirc;me temps que l'ensemble du syst&egrave;me.
<p>Avant de pouvoir restaurer votre syst&egrave;me &agrave; l'aide d'un
agent de sauvegarde, vous devez r&eacute;installer Windows 98 sur votre
ordinateur. Suivez ensuite la proc&eacute;dure permettant de sp&eacute;cifier
l'option Registre.&nbsp;</td>
</tr>

<tr>
<td><b>Pour obtenir une sauvegarde du Registre ex&eacute;cut&eacute;e par
l'Agent Backup Exec&nbsp;</b></td>

<td>Sous la boite de dialogue R&eacute;seau:
<br>Dans la liste des composants r&eacute;seau, cliquez sur Agent Backup
Exec, puis sur Propri&eacute;t&eacute;s.
<br>Sous l'onglet G&eacute;n&eacute;ral, cliquez sur Autoriser la restauration
du Registre pour sp&eacute;cifier que le&nbsp; doit &ecirc;tre restaur&eacute;
en m&ecirc;me temps que l'ensemble du syst&egrave;me.</td>
</tr>
</table>

<br>&nbsp;
<p><u><font color="#000000">Cr&eacute;er de nouveaux formats de fichiers:</font></u>
<p><font color="#000000">&nbsp;&nbsp; Dans la base de registre, les formats
de fichiers associ&eacute;s aux diff&eacute;rentes applications se trouvent
dans:</font>
<br><font color="#008080">[HKEY_CLASSES-ROOT]</font>
<br><font color="#000000">de m&ecirc;me que les informations sur les applications
utilis&eacute;es.</font>
<br><font color="#000000">Pour cr&eacute;er un nouveau format de fichier,
comme .azerty par exemple (il n'y a pas de limitations sp&eacute;cifiques
&agrave; un format), vous n'avez qu'&agrave; cr&eacute;er une nouvelle
cl&eacute; </font><font color="#008080">.azerty</font><font color="#000000">
dans </font><font color="#008080">[HKEY_CLASSES-ROOT]</font><font color="#000000">.
Pour ensuite d&eacute;terminer si c'est un &eacute;x&eacute;cutable, ou
un autre fichier sp&eacute;cifique windows, le plus simple est de copier
les chaines d&eacute;j&agrave; d&eacute;finies. Vous pouvez sinon faire
un .reg qui fera tout automatiquement:</font>
<br><font color="#FF0000">REGEDIT4</font>
<br><font color="#FF0000">[HKEY_CLASSES_ROOT\.azerty]</font>
<br><font color="#FF0000">@="exefile"</font>
<br><font color="#FF0000">"Content Type"="application/x-msdownload"</font>
<p><font color="#000000">(Les d&eacute;compositions des .reg que je vais
faire devraient vous permettre d'apprendre &agrave; en construire)</font>
<br><i><font color="#000000">D&eacute;composition du .reg:</font></i>
<br><font color="#008080">REGEDIT4</font><font color="#000000"> => &agrave;
mettre au d&eacute;but de tous vos .reg</font>
<br><font color="#008080">[HKEY_CLASSES_ROOT\.azerty]</font><font color="#000000">
=> sp&eacute;cifie dans quel r&eacute;pertoire le .reg devra travailler.
Si le r&eacute;pertoire n'existe pas, il le cr&eacute;&eacute;ra automatiquement.</font>
<br><font color="#008080">"Content Type"="application/x-msdownload" </font><font color="#000000">=>
sp&eacute;cifie qu'une valeur aura pour nom "Content Type" et pour donn&eacute;e
"application/x-msdownload". Les noms et donn&eacute;es apparaitront sans
guillemets dans la BDR.</font>
<br><font color="#008080">@="exefile"</font><font color="#000000"> => Sp&eacute;cifie
que la valeur "D&eacute;faut" (=@) aura pour donn&eacute;e "exefile". Ici,
le "@" est attach&eacute; &agrave; la valeur "D&eacute;faut". Remplacer
"@" par "D&eacute;faut" n'aurait cependant pas la m&ecirc;me signification.</font>
<table BORDER COLS=1 WIDTH="79%" BGCOLOR="#FFFFFF" >
<tr>
<td><b><font color="#000000">Faites un retour &agrave; la ligne &agrave;
la fin, avec ENTER, sinon la commande ne sera pas valid&eacute;e!</font></b></td>
</tr>
</table>

<table BORDER COLS=1 WIDTH="100%" BGCOLOR="#FFCCCC" >
<tr>
<td><b><i>Note:</i></b> le respect des majuscules est primordial pour le
bon fonctionnement de vos fichiers .reg.
<br><b><i>Note:</i></b> le .reg vu ci-dessus vous permet de nommer un &eacute;x&eacute;cutable
de type .exe en .azerty sans en alt&eacute;rer son fonctionnement. Vous
pouvez cr&eacute;er d'autres extensions s'associant &agrave; des fichiers
connus en recopiant bien les valeurs de l'extension initiale dans la BDR.
<br><b><i>Note:</i></b> un &eacute;x&eacute;cutable ouvert mais qui n'est
pas au format .exe apparait ensuite dans le menu documents pouvant &ecirc;tre
ensuite ouvert par un autre utilisateur du m&ecirc;me PC.</td>
</tr>
</table>

<p><font color="#000000">&nbsp;&nbsp; Vous pouvez aussi faire des .reg
qui peuvent poser de gros probl&egrave;mes. Par exemple si vous modifiez
les donn&eacute;es des valeurs dans </font><font color="#008080">[HKEY_CLASSES_ROOT\.exe]</font><font color="#000000">,
en mettant n'importe quoi, plus aucun &eacute;x&eacute;cutable ne pourra
s'ouvrir sous Windows. Cependant les .com, .bat,... eux pourront toujours
l'&ecirc;tre. Il suffit de faire un .reg sur le mod&egrave;le pr&eacute;c&eacute;dent
qui modifiera les valeurs.</font>
<br><font color="#FF0000">REGEDIT4</font>
<br><font color="#FF0000">[HKEY_CLASSES_ROOT\.exe]</font>
<br><font color="#FF0000">@="modified"</font>
<br><font color="#FF0000">"Content Type"="modified"</font>
<br><font color="#000000">Par pr&eacute;caution je vous conseille de faire
un .reg suivant le mod&egrave;le du premier vu, qui vous permettra de r&eacute;cup&eacute;rer
les bonnes donn&eacute;es dans </font><font color="#008080">[HKEY_CLASSES_ROOT\.exe]</font><font color="#000000">.</font>
<br>&nbsp;
<br>&nbsp;
<center><table BORDER COLS=1 WIDTH="100%" BGCOLOR="#FFCCCC" >
<tr>
<td><b><i>Note: </i></b>nous venons d'&eacute;tudier les commandes permettant
la modification des donn&eacute;es de valeurs. Vous pouvez aussi supprimer
des cl&eacute;s en cas de n&eacute;cessit&eacute;. Supprimer des cl&eacute;s
importantes peut poser de graves probl&egrave;mes: vous pouvez donc utiliser
cette m&eacute;thode de mani&egrave;re nocive. Pour vous y prendre vous
devez tapez l'adresse de la cl&eacute; &agrave; effacer avec un tiret devant.
Exemple: <font color="#008080">[-HKEY_CLASSES_ROOT\.TEST]</font> effacera
la cl&eacute; <b>TEST</b> dans <b>HKEY_CLASSES_ROOT</b> &agrave; condition
qu'elle existe sinon il ne se passera rien au niveau de cette commande.
Vous n'&ecirc;tes pas oblig&eacute; de vous limiter &agrave; une seule
commande de ce type par fichier .reg. Exemple de fichier .reg effa&ccedil;ant
les cl&eacute;s <b>TESTS</b> et
<b>TESTS2
</b>dans<b> <font color="#000000">HKEY_CLASSES_ROOT</font>:</b>
<br><font color="#3366FF">REGEDIT4</font>
<br><font color="#3366FF">[-HKEY_CLASSES_ROOT\.TESTS]</font>
<br><font color="#3366FF">[-HKEY_CLASSES_ROOT\.TESTS2]</font>
<p>N'oubliez pas de "valider" la derni&egrave;re ligne de commande en faisant
un retour &agrave; la ligne avec ENTER.</td>
</tr>
</table></center>

<p><font color="#000000">&nbsp;&nbsp; Vous pouvez cr&eacute;er des extensions
invisibles. La cl&eacute; pour l'extension doit &ecirc;tre tap&eacute;e
de la mani&egrave;re suivante: .+alt0160 ce qui donnera un point et un
espace. Validez: &ccedil;a marche. vous pouvez ainsi faire d'un fichier
un "espace-point-espace" soit " . " ce qui le rend presque irrecherchable.
Il suffit de renommer le fichier en "alt0160.alt0160". Il est &eacute;vident
que alt0160 n'est pas &agrave; taper en clair mais est &agrave; taper sur
le clavier pour afficher l'espace. Vous pouvez vous r&eacute;f&eacute;rer
&agrave; la "Table des Caract&egrave;res" de Windows pour mieux comprendre.</font>
<br><font color="#000000">&nbsp;&nbsp; Vous pouvez mettre vos .reg dans
le menu de D&eacute;marrage au m&ecirc;me titre que les .exe.</font>
<br><font color="#000000">&nbsp;&nbsp; Sous Windows95 aucune demande de
confirmation ne sera demand&eacute;e lors de l'ouverture d'un .reg, ce
qui rend le syst&egrave;me tr&egrave;s vuln&eacute;rable.</font>
<br><font color="#000000">&nbsp;&nbsp; Vous pouvez faire un .reg qui ajoute
les fichiers voulus dans la cl&eacute; de BDR correspondant aux applications
qui s'ouvrent au lancement de Windows. Donc on ne peut emp&ecirc;cher le
lancement de l'application qu'en supprimant les valeurs qui s'y rattachent.
Voici l'emplacement de la cl&eacute; sp&eacute;cifique &agrave; ces applications:</font>
<br><font color="#008080">[HKEY_LOCAL_MACHINE\Software\Microsoft\Windows\CurrentVersion\Run]</font>
<p><font color="#008080">&nbsp;</font><font color="#000000">&nbsp; La BDR
permet de faire d'autres choses. Par exemple si vous avez un programme
&agrave; date d'expiration limite. Au lieu de tout le temps remonter votre
Horloge pour continuer &agrave; l'utiliser, cherchez les valeurs qui s'y
rattachent dans la BDR. Examinez-les et quand il s'agit bien des cl&eacute;s
se rattachant au programme qui vous pose probl&egrave;me, effacez les l&eacute;s.
Si le programme n'est pas tr&egrave;s d&eacute;velopp&eacute; (et c'est
tr&egrave;s souvent le cas!) c&ocirc;t&eacute; s&eacute;curit&eacute;,
le compteur se r&eacute;initialisera. Vous n'aurez qu'&agrave; effacez
les cl&eacute;s ou valeurs voulues lors de l'expiration du d&eacute;lai.
Faites attention &agrave; ne pas effacer n'importe quoi : je vous conseille
donc d'aller faire&nbsp; d'abord un tour du c&ocirc;t&eacute; de </font><font color="#008080">[HKEY_CURRENT_USER\Software]
</font><font color="#000000">avant
de chercher ailleurs.</font>
<p><font color="#000000">&nbsp;&nbsp; Dans la BDR vous pouvez aussi trouver
des serials. Certains sont introuvables, mais d'autres (comme le num&eacute;ro
de s&eacute;rie de Windows), sont inscrits en clair dans la BDR:</font>
<br><font color="#008080">[HKEY_LOCAL_MACHINE\Software\Microsoft\Windows\CurrentVersion\]</font>
<br><font color="#000000">Il s'agit de la donn&eacute;e "ProductKey". Dans
ce m&ecirc;me r&eacute;pertoire vous pouvez aussi modifier diff&eacute;rentes
informations vous concernant vous ou votre syst&egrave;me.</font>
<p><font color="#000000">&nbsp;&nbsp; Si vous souhaitez faire des applications
qui s'occuperont de tout g&eacute;rer (cr&eacute;ation de .reg, placement
de ceux-ci dans les r&eacute;pertoires de d&eacute;marrage de windows,
etc...), vous pouvez suivre le mod&egrave;le de ce .bat que je vous propose:</font>
<br><font color="#FF0000">echo off</font>
<br><font color="#FF0000">echo REGEDIT4 >> c:\windows\registre.reg</font>
<br><font color="#FF0000">echo [HKEY_CLASSES_ROOT\.azerty] >> c:\windows\registre.reg</font>
<br><font color="#FF0000">echo @="exefile" >> c:\windows\registre.reg</font>
<br><font color="#FF0000">echo "Content Type"="application/x-msdownload"
>> c:\windows\registre.reg</font>
<br><font color="#FF0000">copy c:\windows\registre.reg c:\windows\menud&eacute;~1\progra~1\d&eacute;marr~1\registre.reg</font>
<br><font color="#FF0000">del c:\windows\registre.reg</font>
<br><font color="#000000">Vous pourrez toujours d&eacute;veloppez ce fichier,
mais faites attention &agrave; une chose: sous DOS et sous windows les
accents ne sont pas transcrits de la m&ecirc;me mani&egrave;re. C'est pourquoi
vous devez r&eacute;&eacute;crire le .bat avec l'EDIT.COM pour que les
accents passent bien dans le cas o&ugrave; vous auriez &agrave; y mettre
des accents. Autre chose: n'oubliez pas de faire un retour &agrave; la
ligne (ENTER) &agrave; la derni&egrave;re ligne du .bat.</font>
<br>&nbsp;
<br>&nbsp;
<table BORDER COLS=1 WIDTH="100%" BGCOLOR="#FFCCCC" >
<tr>
<td><b><i>Note:</i></b> pour toutes vos commandes de type <font color="#008080">copy</font>
sous DOS, sachez que la commande <font color="#008080">copy/y</font> permet
l'&eacute;crasement du fichier cible s'il existe d&eacute;j&agrave;, sans
demande de confimation.</td>
</tr>
</table>

<p><b><i>Clad Strife</i></b>
</body>
</html>
