<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Clad Strife">
   <meta name="GENERATOR" content="Mozilla/4.61 [en] (Win98; I) [Netscape]">
   <title>Firewalls</title>
</head>
<body text="#000000" bgcolor="#FFF5F0" link="#0000EE" vlink="#551A8B" alink="#FF0000">
<body>

<center><b><tt><font size=+2>S&eacute;curit&eacute; r&eacute;seau : firewalls</font></tt></b>
<br><b><font face="Verdana"><font size=-2>(Source guill.net)</font></font></b></center>

<p><br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<p><b>Qu'est-ce qu'un firewall?</b><b></b>
<p>Un firewall est un syst&egrave;me ou un groupe de syst&egrave;me qui
g&egrave;re les contr&ocirc;les d’acc&egrave;s entre deux r&eacute;seaux.
Plusieurs m&eacute;thodes sont utilis&eacute;es &agrave; l’heure actuelle.
Deux m&eacute;canismes sont utilis&eacute;s : le premier consiste &agrave;
interdire le trafic, et le deuxi&egrave;me &agrave; l’autoriser.
<p>Certains firewalls mettent beaucoup d’&eacute;nergie &agrave; emp&ecirc;cher
quiconque de passer alors d’autres tendent &agrave; tout laisser passer.
La chose la plus importante &agrave; comprendre est qu’il repr&eacute;sente
une politique de contr&ocirc;le d’acc&egrave;s. Vous devez avoir une id&eacute;e
pr&eacute;cise de cette politique dans son ensemble pour savoir ce que
vous devez autoriser ou interdire.<b></b>
<p><b>De quoi prot&egrave;ge un firewall?</b>
<p>Certains firewalls laissent uniquement passer le courrier &eacute;lectronique.
De cette mani&egrave;re, ils interdisent toute autre attaque qu’une attaque
bas&eacute; sur le service de courrier. D’autres firewalls, moins strictes,
bloquent uniquement les services reconnus comme &eacute;tant des services
dangereux.
<p>G&eacute;n&eacute;ralement, les firewalls sont configur&eacute;s pour
prot&eacute;ger contre les acc&egrave;s non authentifier du r&eacute;seau
externe. Ceci, plus qu’autre chose, emp&ecirc;che les vandales de se logger
sur des machines de votre r&eacute;seau interne, mais autorise les utilisateurs
de communiquer librement avec l’ext&eacute;rieur.
<p>Les firewalls sont &eacute;galement int&eacute;ressants dans le sens
o&ugrave; ils constituent un point unique o&ugrave; l’audit et la s&eacute;curit&eacute;
peuvent &ecirc;tre impos&eacute;s. Tous les &eacute;changes passeront par
lui. Il pourra donner des r&eacute;sum&eacute;s de trafic, des statistiques
sur ce trafic, ou encore toutes les connexions entre les deux r&eacute;seaux.
<p><b>De quoi ne prot&egrave;ge pas un firewall?</b>
<p>Un firewall ne prot&egrave;ge pas des attaques qui ne passe pas par
lui… Certaines entreprises ach&egrave;tent des firewalls &agrave; des prix
incroyables alors que certains de leurs employ&eacute;s sont parfois connect&eacute;s
par modem au monde ext&eacute;rieur. Il est important de noter qu’un firewall
doit &ecirc;tre &agrave; la mesure de la politique de s&eacute;curit&eacute;
globale du r&eacute;seau. Il ne sert &agrave; rien de mettre une porte
blind&eacute;e sur une maison en bois… Par exemple, un site contenant des
documents top-secret n’a pas besoin d’un firewall : il ne devrait tout
simplement pas &ecirc;tre connect&eacute; &agrave; Internet, et devrait
&ecirc;tre isol&eacute; du reste du r&eacute;seau !
<p>Une autre chose contre laquelle un firewall ne peut vous prot&eacute;ger
est les traitres et les idiots qui sont &agrave; l’int&eacute;rieur de
l’entreprise… Si un espion industriel d&eacute;cide de faire sortir des
donn&eacute;es, il y arrivera, surtout sur disquette… Il vaut mieux v&eacute;rifier
qui a acc&egrave;s aux informations que de mettre un firewall dans ce cas
!
<p><b>Que dire des virus?</b>
<p>Les firewalls ne prot&egrave;ge pas tr&egrave;s bien des virus. Il y
a trop de mani&egrave;res diff&eacute;rentes de coder des fichiers pour
les transf&eacute;rer. En d’autres termes, un firewall ne pourra pas remplacer
l’attention et la conscience des utilisateurs qui doivent respecter un
certain nombre de r&egrave;gles pour &eacute;viter les probl&egrave;me…
La premi&egrave;re &eacute;tant bien &eacute;videmment de ne jamais ouvrir
un fichier attach&eacute; &agrave; un mail sans &ecirc;tre s&ucirc;r de
sa provenance.
<p>Il faut prendre des mesures globales et importantes contre les virus.
Avant de traquer les virus &agrave; l’entr&eacute;e du r&eacute;seau, il
faut s’assurer que chaque poste de travail dispose d’un anti-virus. Les
virus passe &eacute;galement tr&egrave;s facilement par disquette… Les
virus sur Internet son bien moins important que les virus sur disquette.
<p>Quoiqu’il en soit, de plus en plus de vendeurs de firewalls vous offrent
des firewalls qui d&eacute;tectent les virus. Ils permettent probablement
d’arr&ecirc;ter les virus simples. Ne comptez pas sur leur protection !
<p><b>Quelles sont les adresses sur Internet &agrave; proposer des firewalls?</b>
<p><a href="ftp://ftp.greatcircle.com/pub/firewalls/index.html">ftp://ftp.greatcircle.com/pub/firewalls/index.html</a>
<br><a href="http://sunsite.unc.edu/LDP/HOWTO/Firewall-HOWTO.html">http://sunsite.unc.edu/LDP/HOWTO/Firewall-HOWTO.html</a>
<br><a href="ftp://ftp.tis.com/pub/firewalls/">ftp://ftp.tis.com/pub/firewalls/</a>
<br><a href="http://www.clark.net/pub/mjr/pubs/index.shtml">http://www.clark.net/pub/mjr/pubs/index.shtml</a>
<br><a href="ftp://ftp.research.att.com/dist/internet_security/">ftp://ftp.research.att.com/dist/internet_security/</a>
<br><a href="ftp://net.tamu.edu/pub/security/TAMU/">ftp://net.tamu.edu/pub/security/TAMU/</a>
<br><a href="http://www.cs.purdue.edu/coast/firewalls/">http://www.cs.purdue.edu/coast/firewalls/</a>
<br>&nbsp;
<p><b>Quelles sont les points &agrave; prendre en compte pour un firewall?</b>
<p>Il y a un certain nombre de r&egrave;gles qui doivent &ecirc;tre prise
par le chanceux qui a re&ccedil;u la responsabilit&eacute; de configurer
et de g&eacute;rer le firewall.
<p>Le plus important est de refl&eacute;ter la politique de s&eacute;curit&eacute;
choisit par l’organisation. Entre tout interdire et tout autoriser, il
y a diff&eacute;rent degr&eacute;s de parano&iuml;a. Le choix final doit
&ecirc;tre le r&eacute;sultat d’une politique globale de s&eacute;curit&eacute;
plus que d’une d&eacute;cision d’un ing&eacute;nieur…
<p>La deuxi&egrave;me est de savoir le degr&eacute; de contr&ocirc;le que
vous voulez. Apr&egrave;s avoir analys&eacute;s les risques, il faut d&eacute;finir
ce qui doit &ecirc;tre autoris&eacute; et interdit.
<p>Le troisi&egrave;me point est financier : c’est de savoir le busget
que vous allouez au firewall. Un firewall complet peut &ecirc;tre gratuit,
ou co&ucirc;ter 100 000 dollars. La solution gratuite, comme la configuration
d’un routeur, ne co&ucirc;te rien sinon beaucoup de temps et de caf&eacute;.
D’autres solutions co&ucirc;teront cher au d&eacute;part et peu ensuite…
Il est important de consid&eacute;rer le prix de d&eacute;part, mais aussi
celui du support.
<p>Un firewall co&ucirc;te cher et prend beaucoup de temps &agrave; administrer…
V&eacute;rifiez que vous avez des bijoux avant d’acheter un coffre-fort
hi-tech !
<br>&nbsp;
</body>
</html>
