<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Clad Strife">
   <meta name="GENERATOR" content="Mozilla/4.61 [en] (Win98; I) [Netscape]">
   <title>Glossaire des r&eacute;seaux</title>
</head>
<body text="#000000" bgcolor="#FFF5F0" link="#0000EE" vlink="#551A8B" alink="#FF0000">

<center><b><tt><font size=+2>Glossaire sur la terminologie des r&eacute;seaux</font></tt></b>
<p><br>
<br>&nbsp;
<br>&nbsp;
<p><a href="##">#</a>-<a href="#A">A</a>-<a href="#B">B</a>-<a href="#C">C</a>-<a href="#D">D</a>-<a href="#E">E</a>-<a href="#F">F</a>-<a href="#G">G</a>-<a href="#H">H</a>-<a href="#I">I</a>-<a href="#J">J</a>-<a href="#K">K</a>-<a href="#L">L</a>-<a href="#M">M</a>-<a href="#N">N</a>-<a href="#O">O</a>-<a href="#P">P</a>-Q-<a href="#R">R</a>-<a href="#S">S</a>-<a href="#T">T</a>-<a href="#U">U</a>-V-<a href="#W">W</a>-<a href="#X">X</a>-Y-Z
<p><a href="#prot">Protocoles</a>
<p><a href="#RL">References - Liens</a></center>

<br><a href="#RL"></a>&nbsp;
<p><br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<p><font color="#000000">&nbsp;&nbsp; Ce glossaire regroupe de nombreux
termes techniques et abr&eacute;viations concernant les r&eacute;seaux,
dont la courte d&eacute;finition devrait vous &eacute;clairer. Les termes
ont &eacute;t&eacute; pris sur internet ou sur des livres. Ce glossaire
inclus un mini glossaire des protocoles.</font>
<p><font color="#000000">&nbsp;&nbsp; Ce glossaire n'est pas exhaustif
pour la simple raison qu'on ne peut en faire si l'on consid&egrave;re la
vitesse d'&eacute;volution des technologies. Ce glossaire ne regroupe pas,
en premier lieu, les protocoles. Ceux-ci se trouvent en fin de page et
sont trait&eacute;s &agrave; part, dans l'ordre alphab&eacute;tique.</font>
<p><font color="#000000">&nbsp;&nbsp; De m&ecirc;me les c&acirc;bles ne
sont pas trait&eacute;s dans le glossaire.</font>
<p><font color="#000000">&nbsp;&nbsp; Toutes les donn&eacute;es r&eacute;unies
dans ce glossaire sont des sources de livres, d'internet ou de moi-m&ecirc;me.
Cet assemblage est le fruit d'un travail laborieux r&eacute;alis&eacute;
sur une longue p&eacute;riode, esp&eacute;rons que vous saurez en tirer
partie.</font>
<br>&nbsp;
<p><a name="#"><font color="#000000"><b>100VG-AnyLAN:</b> technologie de
r&eacute;seau &agrave; 100 Mbps comportant une topologie en &eacute;toile
et combinant le support de trames Ethernet et de paquets Token Ring.</font>
<p><font color="#000000"><b>3COM:</b> Computers, Communications, Compatibility.
Logo de la soci&eacute;t&eacute; 3COM de Santa Clara, Californie, fabricant
de mat&eacute;riels de r&eacute;seau.</font>
<p><a name="A"><font color="#000000"><b>Acc&egrave;s &agrave; distance:</b>
processus consistant &agrave; &eacute;tablir des connexions &agrave; un
r&eacute;seau ou &agrave; une station de travail &agrave; partir d'appareils
distants en utilisant des lignes du r&eacute;seau commut&eacute;, ou des
lignes t&eacute;l&eacute;phoniques d&eacute;di&eacute;es. Le terme anglais
s'y rapportant est "Remote access".</font>
<p><font color="#000000"><b>Acc&egrave;s direct:</b> technologie de r&eacute;seau
longue distance utilisant une ligne t&eacute;l&eacute;phonique lou&eacute;e
pour &eacute;tablir les liaisons n&eacute;cessaires.</font>
<p><font color="#000000"><b>Administrateur de bases de donn&eacute;es:</b>
personne responsable de la programmation et de la maintenance de multiples
bases de donn&eacute;es relationnelles dans un environnement de r&eacute;seau,
et charg&eacute;e de faciliter l'acc&egrave;s des utilisateurs du r&eacute;seau
&agrave; ces bases de donn&eacute;es.</font>
<p><font color="#000000"><b>Administrateur de r&eacute;seau: </b>on dit
aussi plus couramment "administrateur r&eacute;seau". Il s'agit de la personne
responsable de l'exploitation et de la maintenance quotidienne d'un r&eacute;seau
d'ordinateurs.</font>
<p><font color="#000000"><b>Administrateur de site Web: </b>on dit aussi
"webmaster". C'est une personne responsable de la mise en oeuvre et de
la maintenance d'un site Internet, son r&ocirc;le est de veiller &agrave;
ce que les informations offertes par le site soient exactes, &agrave; jour
et int&eacute;ressantes.</font>
<p><font color="#000000"><b>Adresse de port:</b> nombre h&eacute;xad&eacute;cimal
utilis&eacute; par une station de travail pour s&eacute;lectionner un circuit
&eacute;lectronique local &agrave; travers lequel doivent transiter les
donn&eacute;es re&ccedil;ues ou &eacute;mises par la carte r&eacute;seau.</font>
<p><font color="#000000"><b>Alimentation continue:</b> dispositif mat&eacute;riel
qui fournit au serveur une source continue d'alimentation &eacute;lectrique,
g&eacute;n&eacute;ralement pendant une courte dur&eacute;e, dans l'&eacute;ventualit&eacute;
d'une d&eacute;faillance de la source externe de courant &eacute;lectrique.</font>
<p><font color="#000000"><b>Alimentation &eacute;lectrique: </b>dispositif
&eacute;lectrique qui sert de transformateur entre une source standard
de courant &eacute;lectrique et un appareil informatique.</font>
<p><font color="#000000"><b>Alimentation redondante: </b>alimentation &eacute;lectrique
suppl&eacute;mentaire qui prend le relais en cas de d&eacute;faillance
de l'alimentation &eacute;lectrique principale. En anglais, RPS, "Redundant
Power Supply".</font>
<p><font color="#000000"><b>Analogique: </b>m&eacute;thode de communication
qui repr&eacute;sente les signaux en modifiant de mani&egrave;re continue
certaines propri&eacute;t&eacute;s telles que le voltage ou l'amplitude.
Voir &eacute;galement <i>Num&eacute;rique</i>.</font>
<p><font color="#000000"><b>Anneau d'&eacute;toiles:</b> deux ou plusieurs
topologies en &eacute;toiles reli&eacute;es les unes aux autres, auxquelles
on peut acc&eacute;der en s&eacute;quence &agrave; partir d'un hub central.
A premi&egrave;re vue, cette topologie ressemble &agrave; une topologie
en &eacute;toile int&eacute;gr&eacute;e dans une topologie en &eacute;toile
plus vaste.</font>
<p><font color="#000000"><b>AOL: </b>America Online. Fournisseur de services
en ligne (OSP, "on-line service provider") proposant l'acc&egrave;s &agrave;
des banques de donn&eacute;es, &agrave; Internet, et des communications
directes entre utilisateurs. Voir &eacute;galement <i>CIS, OSP</i>.</font>
<p><font color="#000000"><b>API:</b> Application Programming Interface.
M&eacute;canisme logiciel servant &agrave; d&eacute;velopper des instructions
en langage machine.</font>
<p><font color="#000000"><b>Appareil distant:</b> ordinateur qui initialise
une connexion par l'appel d'un autre ordinateur.</font>
<p><font color="#000000"><b>AppleTalk: </b>suite de protocoles de communication
pour les syst&egrave;mes Macintosh.</font>
<p><font color="#000000"><b>Applet:</b> petite application, souvent &eacute;x&eacute;cut&eacute;e
&agrave; partir d'un navigateur, &eacute;x&eacute;cutant normalement une
fonction unique ou un ensemble limit&eacute; de fonctions.</font>
<p><font color="#000000"><b>ARCNet: </b>Attached Ressource Computer Network.
Syst&egrave;me de r&eacute;seau peu co&ucirc;teux pour des ordinateurs
de bureau, utilisant des hubs pour connecter des stations de travail et
des imprimantes.</font>
<p><font color="#000000"><b>AS: </b>Administrateur Syst&egrave;me. Personne
qui g&egrave;re au quotidien l'exploitation d'un r&eacute;seau d'ordinateurs.
Voir &eacute;galement <i>CNA<b>.</b></i></font>
<p><font color="#000000"><b>Attribut:</b> Code associ&eacute; &agrave;
un fichier de donn&eacute;es pour d&eacute;crire dans quelles limites les
utilisateurs peuvent acc&eacute;der &agrave; ce fichier ou le modifier.</font>
<p><a name="B"><font color="#000000"><b>Base de donn&eacute;es:</b> ensemble
de donn&eacute;es &eacute;l&eacute;mentaires r&eacute;parties sur les lignes
et les colonnes dans les tables qui d&eacute;finissent des propri&eacute;t&eacute;s
communes, et auxquelles un ou plusieurs utilisateurs peuvent acc&eacute;der
pour les modifier et produire des informations utiles. Voir &eacute;galement
<i>SGBD</i>,
<i>SGBD
de r&eacute;seau</i>,<i> SGBDOO</i>, <i>SGBDR</i>.</font>
<ul>
<li>
<font color="#000000"><b>Base de donn&eacute;es distribu&eacute;e:</b>
ensemble de tables de donn&eacute;es situ&eacute;es sur diff&eacute;rents
serveurs d'un r&eacute;seau, qui sont g&eacute;r&eacute;es et auxquelles
on acc&egrave;de comme s'il s'agissait d'un syst&egrave;me unique non distribu&eacute;.</font></li>

<li>
<font color="#000000"><b>Base de donn&eacute;es en r&eacute;seau:</b> base
de donn&eacute;es comportant des tables multiples dans lesquelles toute
table peut &ecirc;tre reli&eacute;e &agrave; n'importe quelle autre table.</font></li>

<li>
<font color="#000000"><b>Base de donn&eacute;es fichier plat:</b> "Flat-File
Database". base de donn&eacute;es comportant une seule table.</font></li>

<li>
<font color="#000000"><b>Base de donn&eacute;es hi&eacute;rarchique:</b>
ensemble de tables reli&eacute;es entre elles selon une relation lin&eacute;aire,
en une seule direction.</font></li>

<li>
<font color="#000000"><b>Base de donn&eacute;es orient&eacute;e objet:</b>
base de donn&eacute;es stockant des informations et associ&eacute;e au
code de programmation qui agit sur ces donn&eacute;es lorsqu'on y acc&egrave;de.
Abr&eacute;viation: BDOO.</font></li>

<li>
<font color="#000000"><b>Base de donn&eacute;es relationnelle:</b> technique
de stockage des donn&eacute;es qui les fragmente en unit&eacute;s de base
et les organise en lignes et en colonnes en fonctions d'attributs communs
au sein d'entit&eacute;s appel&eacute;s tables, et qui forme des relations
entre les tables &agrave; partir des liens qui existent entre les diff&eacute;rents
attributs.</font></li>
</ul>

<p><br><font color="#000000"><b>BBS: </b>Bulletin Board System. Syst&egrave;me
de tableau d'affichage. Syst&egrave;me g&eacute;n&eacute;ralement informel
dans lequel un ordinateur unique &eacute;quip&eacute; d'un ou de plusieurs
modems g&egrave;re des communications et des &eacute;changes de fichiers
entre des utilisateurs qui se connecetent au moyen de modems.</font>
<p><font color="#000000"><b>BDOO:</b> Base de donn&eacute;es orient&eacute;e
objet. Base de donn&eacute;es qui relie directement du code de traitement
&agrave; des donn&eacute;es stock&eacute;es. Voir &eacute;galement <i>SGBD</i>,<i>
SGBD de r&eacute;seau</i>, <i>SGBDR</i>.</font>
<p><font color="#000000"><b>Bit: </b>Binary digit. La plus petite quantit&eacute;
d'information qu'un ordinateur peut traiter.</font>
<p><font color="#000000"><b>Bit de stop:</b> d&eacute;lai d'attente apr&egrave;s
l'envoi d'un caract&egrave;re, pour indiquer au modem r&eacute;cepteur
que la transmission d'un caract&egrave;re a &eacute;t&eacute; effectu&eacute;e
en entier.</font>
<p><font color="#000000"><b>Bloc:</b> une paire d'octets. Voir &eacute;galement
<i>Octet</i>.</font>
<p><font color="#000000"><b>BNC:</b> Bayonet Connector Connecteur &agrave;
bayonnette. Cylindre m&eacute;tallique servant &agrave; connecter des c&acirc;bles
&agrave; des cartes r&eacute;seaux ou &agrave; d'autres noeuds du r&eacute;seau.</font>
<p><font color="#000000"><b>Bouchon:</b> en anglais "tap". Il s'agit d'un
dispositif servant &agrave; connecter un c&acirc;ble de station de travail
&agrave; un c&acirc;ble principal ou &agrave; un c&acirc;ble de backbone
(&eacute;pine dorsale). On dit aussi "Vampire tap" (bouchon vampire).</font>
<p><font color="#000000"><b>Bureau de poste:</b> base de donn&eacute;es
centrale contenant les adresses &eacute;lectroniques des &eacute;metteurs
et des destinataires des messages.</font>
<p><font color="#000000"><b>Bus lin&eacute;aire:</b> topologie de r&eacute;seau
courante dans laquelle les noeuds sont connect&eacute;s par une simple
longueur de c&acirc;ble.</font>
<p><font color="#000000"><b>Bus master:</b> p&eacute;riph&eacute;rique,
tel qu'une carte r&eacute;seau, susceptible de transf&eacute;rer des donn&eacute;es
sans recourir &agrave; l'UC de l'ordinateur.</font>
<p><a name="C"><font color="#000000"><b>C/S:</b> Client/serveur. Un syst&egrave;me
de r&eacute;seau dans lequel un ou plusieurs ordinateurs (appel&eacute;s
serveurs) sont affect&eacute;s &agrave; l'envoi, &agrave; la r&eacute;ception
et au stockage de fichiers ainsi qu'&agrave; la gestion du syst&egrave;me,
tandis que d'autres ordinateurs (appel&eacute;s clients) sont affect&eacute;s
&agrave; la r&eacute;ception et au traitement des donn&eacute;es &eacute;manant
des serveurs.</font>
<p><font color="#000000"><b>Cache:</b> m&eacute;moire d'ordinateur r&eacute;serv&eacute;e
au stockage des instructions les plus fr&eacute;quemment utilis&eacute;es,
de mani&egrave;re &agrave; rendre leur acc&egrave;s le plus rapide possible.</font>
<p><font color="#000000"><b>Call back distant:</b> technique de s&eacute;curit&eacute;
par laquelle un serveur v&eacute;rifie un mot de passe, met fin &agrave;
une connexion &eacute;tablie par le r&eacute;seau commut&eacute;, puis
rappelle l'appelant au moyen d'un num&eacute;ro de t&eacute;l&eacute;phone
pr&eacute;alablement enregistr&eacute;.</font>
<p><font color="#000000"><b>Carte r&eacute;seau: </b>dispositif mat&eacute;riel
ins&eacute;r&eacute; dans un emplacement de carte sur l'ordinateur, pour
g&eacute;rer le flux de donn&eacute;es entre l'ordinateur et le reste du
r&eacute;seau. En anglais NAC ("Network Adapter Card"), ou NIC ("Network
Interface Card").</font>
<p><font color="#000000"><b>Cat&eacute;gorie sup&eacute;rieure:</b> s&eacute;rie
de caract&egrave;res au d&eacute;but d'un nom de domaine ou de newsgroup
pour indiquer un type de site sp&eacute;cifique. Par exemple, www. est
une cat&eacute;gorie sup&eacute;rieure indiquant que le site fait partie
du World Wide Web.</font>
<p><font color="#000000"><b>CGI: </b>Common Gateway Interface. Standard
de programmation pour des instructions qui permet aux programmeurs d&eacute;tablir
un pont entre les serveurs de base de donn&eacute;es classiques des r&eacute;seaux
locaux et les navigateurs Web.</font>
<p><font color="#000000"><b>Challenge handshaking: </b>syst&egrave;me de
s&eacute;curit&eacute; dans lequel un serveur teste un ordinateur client
de fa&ccedil;on continue tant que la connexion est active, pour s'assurer
que le client est bien un utilisateur autoris&eacute;;</font>
<p><font color="#000000"><b>Circuit virtuel: </b>fonction qui &eacute;tablit
une connexion directe entre deux ordinateurs sur un r&eacute;seau, sans
passer par les m&eacute;canismes d'adressages du syst&egrave;me d'exploitation.</font>
<p><font color="#000000"><b>CIS: </b>CompuServe Information Service. Entreprise
commerciale offrant l'acc&egrave;s &agrave; de multiples bases de donn&eacute;es
et de services de communication entre utilisateurs, incluant l'acc&egrave;s
&agrave; Internet. Voir &eacute;galement <i>AOL</i>, <i>OSP</i>.</font>
<p><font color="#000000"><b>CISC: </b>Complete Instruction Set Computer.
Terme utilis&eacute; pour d&eacute;crire une puce comportant une architecture
de processeur qui fournit de multiples fonctions. Voir &eacute;galement
<i>RISC</i>.</font>
<p><font color="#000000"><b>Cl&eacute;: </b>suite complexe de caract&egrave;res
ou formule math&eacute;matique servant &agrave; crypter des messages &eacute;lectroniques,
pour les rendre illisibles tant qu'ils n'ont pas &eacute;t&eacute; d&eacute;crypt&eacute;s
au moyen d'une cl&eacute; de d&eacute;cryptage.</font>
<ul>
<li>
<font color="#000000"><b>Cl&eacute; priv&eacute;e: </b>suite complexe de
caract&egrave;res, ou formule math&eacute;matique, connue seulement du
destinataire d'un message, et qui sert &agrave; d&eacute;crypter des messages
&eacute;lectroniques crypt&eacute;s au moyen d'une cl&eacute; publique
correspondant &agrave; cette cl&eacute; priv&eacute;e.</font></li>

<li>
<font color="#000000"><b>Cl&eacute; publique:</b> s&eacute;quence complexe
de caract&egrave;res, ou formule math&eacute;matique, distribu&eacute;e
publiquement et utilis&eacute;e pour le cryptage de messages &eacute;lectroniques.
Les messages crypt&eacute;s qui en r&eacute;sultent ne peuvent &ecirc;tre
d&eacute;crypt&eacute;s qu'au moyen d'une cl&eacute; priv&eacute;e, connue
seulement des destinataires autoris&eacute;s.</font></li>
</ul>

<p><br><font color="#000000"><b>Client: </b>Ordinateur configur&eacute;
pour recevoir des donn&eacute;es sur un r&eacute;seau.</font>
<p><font color="#000000"><b>Client/Serveur: </b>voir <i>C/S</i>.</font>
<p><font color="#000000"><b>CNA:&nbsp;</b> Certified NetWare Administrator.
Personne qui a suivi avec succ&egrave;s une formation sur la gestion courante
d'un r&eacute;seau NetWare de Novell.</font>
<p><font color="#000000"><b>CNE: </b>Certified Network Engineer. Une personne
qui a suivi avec succ&egrave;s une formation sur la conception, l'installation
et la maintenance technique d'un r&eacute;seau NetWare de Novell.</font>
<p><font color="#000000"><b>COM:</b> prot de communication. Acronyme utilis&eacute;
pour d&eacute;signer, sur des ordinateurs, des ports p&eacute;riph&eacute;riques
pour l'&eacute;mission et la r&eacute;ception de donn&eacute;es en format
s&eacute;rie (un bit &agrave; la fois).</font>
<p><font color="#000000"><b>Conf&eacute;rence avec tableau blanc: </b>technique
permettant d'afficher simultan&eacute;ment des donn&eacute;es partag&eacute;es
sur de multiples noeuds d'un r&eacute;seau, et de les mettre &agrave; jour
en temps r&eacute;el.</font>
<p><font color="#000000"><b>Connecteur en T:</b> petit dispositif servant
&agrave; joindre des stations de travail dans une topologie en anneau ou
en marguerite.</font>
<p><font color="#000000"><b>Connecteur RJ:</b> broshe utilis&eacute;e pour
relier un c&acirc;blage paire torsad&eacute;e &agrave; des mat&eacute;riels
informatiques.</font>
<p><font color="#000000"><b>Connexion directe par c&acirc;ble: </b>en anglais,
DCC, "Direct Cable Connection". Liaison de donn&eacute;es qui utilise un
c&acirc;bme parall&egrave;le ou s&eacute;rie pour connecter deux ordinateurs
de configurations similaires par leurs ports de communication standard.</font>
<p><font color="#000000"><b>Connexion par appel t&eacute;l&eacute;phonique:</b>
en anglais "dial-up connection". Processus d'&eacute;tablissement d'une
connexion de donn&eacute;es &agrave; distance au moyen des technologies
de communication courantes (par exemple des modems et des lignes t&eacute;l&eacute;phonique).</font>
<p><font color="#000000"><b>Contrainte:</b> sp&eacute;cification qui rejette
des donn&eacute;es manifestement non conformes destin&eacute;es &agrave;
l'entr&eacute;e dans un champ de donn&eacute;es.</font>
<p><font color="#000000"><b>Couche de pr&eacute;sentation: </b>troisi&egrave;me
couche du mod&egrave;le OSI/RM, fixant les r&egrave;gles de formatage des
transmissions de donn&eacute;es.</font>
<p><font color="#000000"><b>Couche liaison de donn&eacute;es: </b>deuxi&egrave;me
couche du mod&egrave;le OSI/RM, d&eacute;crivant les processus de d&eacute;tection
et de correction d'erreur de bas niveau qui se produisent au cours du transfert
de donn&eacute;es entre la couche physique et les couches situ&eacute;es
au-dessus de la couche physique.</font>
<p><font color="#000000"><b>Couche physique: </b>premi&egrave;re couche
du mod&egrave;le OSI/RM, d&eacute;crivant les sp&eacute;cifications &eacute;lectriques,
m&eacute;caniques et fonctionnelles pour la manipulation des donn&eacute;es
de r&eacute;seau.</font>
<p><font color="#000000"><b>Couche r&eacute;seau: </b>troisi&egrave;me
couche du mod&egrave;le de r&eacute;seau OSI/RM, d&eacute;crivant les processus
pour le routage des donn&eacute;es entre les adresses du r&eacute;seau
et la v&eacute;rification de l'envoi complet et correct des messages.</font>
<p><font color="#000000"><b>Couche session: </b>cinqui&egrave;me couche
du mod&egrave;le de r&eacute;seau OSI/RM, pour le contr&ocirc;le du transfert
des donn&eacute;es, le traitement des erreurs de transmission et de transport,
et la gestion des enregistrements d'informations envoy&eacute;s.</font>
<p><font color="#000000"><b>Couche transport:</b> quatri&egrave;me couche
du mod&egrave;le de r&eacute;seau OSI/RM, incluant les fonctions qui servent
&agrave; &eacute;tablir les connexions appropri&eacute;s, initialiser la
transmission des donn&eacute;es, et lib&eacute;rer la connexion une fois
la transmission effectu&eacute;e.</font>
<p><font color="#000000"><b>Courrier &eacute;lectronique: </b>E-mail. Syst&egrave;me
de communication en r&eacute;seau pour le transfert de messages entre utilisateurs.</font>
<p><font color="#000000"><b>Cryptage: </b>syst&egrave;me pour la traduction
de messages en caract&egrave;re apparemment al&eacute;atoires et inintelligibles,
sur la base d'une cl&eacute; num&eacute;rique secr&egrave;te. Voir &eacute;galement
<i>Cl&eacute;</i>.</font>
<ul>
<li>
<font color="#000000"><b>Cryptage asym&eacute;trique:</b> syst&egrave;me
&agrave; deux cl&eacute;s pour le cryptage de messages en utilisant une
paire de cl&eacute;s associ&eacute;es: les messages sont crypt&eacute;s
en utilisant une des deux cl&eacute;s (la cl&eacute; publique) et ne peuvent
&ecirc;tre d&eacute;crypt&eacute;s qu'au moyen de lautre (la cl&eacute;
priv&eacute;e).</font></li>

<li>
<font color="#000000"><b>Cryptage sym&eacute;trique: </b>technique de s&eacute;curit&eacute;
dans laquelle les messages sont crypt&eacute;s et d&eacute;crypt&eacute;s
en utilisant la m&ecirc;me cl&eacute;.</font></li>
</ul>

<p><br><font color="#000000"><b>CSU/DSU: </b>Channel Service Unit/Data
Service Unit. Dispositif mat&eacute;riel sp&eacute;cial pour connecter
le routeur Internet d'un r&eacute;seau &agrave; la terminaison d'une ligne
lou&eacute;e, convertir le signal de donn&eacute;es s&eacute;rie du r&eacute;seau
&agrave; la terminaison d'une ligne lou&eacute;e, convertir le signal de
donn&eacute;es s&eacute;rie du r&eacute;seau dans le signal num&eacute;rique
de la ligne, et vice versa.</font>
<p><font color="#000000"><b>CU-See-Me:</b> application de vid&eacute;oconf&eacute;rence
tournant sur des stations de travail &eacute;quip&eacute;es de cam&eacute;ras
vid&eacute;os et de microphones.</font>
<p><font color="#000000"><b>CVP: </b>Circuit Virtuel Permanent. Connexion
de r&eacute;seau longue distance dont la capacit&eacute; de traitement
est allou&eacute;e au fur et &agrave; mesure des besoins effectifs.</font>
<p><a name="D"><font color="#000000"><b>Datagramme:</b> petit segment de
donn&eacute;es, pas plus long que 1500 caract&egrave;res, transf&eacute;r&eacute;
d'un ordinateur &agrave; un autre et faisant l'objet d'une v&eacute;rification
individuelle &agrave; sa destination.</font>
<p><font color="#000000"><b>D&eacute;pendance multivalente: </b>relation
de type plusieurs-&agrave;-plusieurs entre des colonnes de donn&eacute;es
d'une table.</font>
<p><font color="#000000"><b>Digest du message: </b>nombre, similaire &agrave;
un total de contr&ocirc;le, retourn&eacute; par une fonction hash et utilis&eacute;
pour v&eacute;rifier qu'un message crypt&eacute; n'a pas &eacute;t&eacute;
accidentellement ou volontairement alt&eacute;r&eacute; durant sa transmission.</font>
<p><font color="#000000"><b>Disques miroirs: </b>processus par lequel les
disques durs doubl&eacute;s sont g&eacute;r&eacute;s par un m&ecirc;me
controleur, et les donn&eacute;es, sont copi&eacute;es simultan&eacute;ment
sur les deux disques.</font>
<p><font color="#000000"><b>DMA:</b> Direct memory Access. Circuits sp&eacute;ciaux
de certains composants mat&eacute;riels permettant aux utilisateurs d'effectuer
certaines op&eacute;rations de transfert de donn&eacute;es sans utiliser
le microprocesseur.</font>
<p><font color="#000000"><b>DNS: </b>Domain Name System. Syst&egrave;me
des noms de domaine, permettant de substituer aux adresses num&eacute;riques
IP des noms &agrave; base de caract&egrave;res, plus faciles &agrave; m&eacute;moriser.</font>
<p><font color="#000000"><b>Domaine (WindowsNT):</b> un groupe d'ordinateurs
op&eacute;rant au sein d'un grand r&eacute;seau comme un groupe de travail
unique, et auquel on peut acc&eacute;der en tant que groupe au moyen d'un
nom d'idetification propre au groupe.</font>
<p><font color="#000000"><b>DRAM: </b>Dynamic Random Access Memory. Puce
m&eacute;moire utilisant de minuscules condensateurs pour stocker des charges
&eacute;lectriques repr&eacute;sentant des donn&eacute;es en format binaire.</font>
<p><font color="#000000"><b>DRDA: </b>Distributed Relational Database Architecture.
Standard d&eacute;velopp&eacute; par IBM et permettant &agrave; diff&eacute;rentes
applications d'acc&eacute;der &agrave; la base de donn&eacute;es IBM DB2,
ainsi qu'&agrave; d'autres types de bases de donn&eacute;es compatibles
avec ce standard DRDA.</font>
<p><b><font color="#000000">Drive Mapping:</font></b><font color="#000000">
processus consistant &agrave; assigner des lettres de disques &agrave;
des noeuds de r&eacute;seau afin de faciliter et d'acc&eacute;l&eacute;rer
l'acc&egrave;s &agrave; ces noeuds.</font>
<p><font color="#000000"><b>Droits d'acc&egrave;s:</b> limites fix&eacute;es
par un administrateur de r&eacute;seau aux pouvoirs des utilisateurs sur
les fichiers de donn&eacute;es du r&eacute;seau (localisation, lecture,
modification).</font>
<p><font color="#000000"><b>DSI: </b>Direction des syst&egrave;mes d'information.
Service responsable de la gestion des communications des informations de
gestion. terme &eacute;galement utilis&eacute; pour l'ensemble des activit&eacute;s
li&eacute;es aux ordinateurs centraux. En anglais MIS ou IS.</font>
<p><font color="#000000"><b>DSS: </b>Directory Services Server. Machine
qui tient &agrave; jour l'emplacement des fichiers stock&eacute;s sur des
syst&egrave;mes de grande dimension.</font>
<p><font color="#000000"><b>Duplex: </b>r&eacute;glage pour l'affichage
des caract&egrave;res transmis, sur le moniteur de l'&eacute;metteur, de
ces caract&egrave;res.</font>
<p><a name="E"><font color="#000000"><b>EDC: </b>Error Detection and Correction.
Dispositif d'une m&eacute;moire &agrave; acc&egrave;s al&eacute;atoire,
pour v&eacute;rifier les donn&eacute;es &eacute;mises par la m&eacute;moire
et provoquer une nouvelle &eacute;mission en cas d'erreur.</font>
<p><font color="#000000"><b>EDO RAM:</b> Extended Data-Out Random Access
Memory. Puces m&eacute;moires con&ccedil;ues pour tirer parti de cartes
m&egrave;res plus rapides, telles que celles qui &eacute;quipent les syst&egrave;mes
Pentium &agrave; haute performance.</font>
<p><font color="#000000"><b>EISA: </b>Extanded Industry Standard Architecture.
Architecture de bus 32 bits, am&eacute;lior&eacute;e par rapport &agrave;
l'architecture ISA.</font>
<p><font color="#000000"><b>E-mail: </b>courrier &eacute;lectronique. Syst&egrave;me
de communication en r&eacute;seau pour le transfert de messages entre utilisateurs.</font>
<p><font color="#000000"><b>Enterprise computing: </b>se r&eacute;f&egrave;re,
dans le jargon informatique am&eacute;ricain, &agrave; un ensemble complexe
d'ordinateurs en r&eacute;seau, pouvant inclure plusieurs r&eacute;seaux,
et datagramme avant sa transmission &agrave; travers un r&eacute;seau.</font>
<p><font color="#000000"><b>En-t&ecirc;te:</b> information d'identification
plac&eacute;e au d&eacute;but d'un paquet ou d'un datagramme avant sa transmission
&agrave; travers un r&eacute;seau.</font>
<p><font color="#000000"><b>Enveloppe num&eacute;rique:</b> cl&eacute;
de cryptage de fa&ccedil;on al&eacute;atoire, elle m&ecirc;me crytp&eacute;e
au moyen d'une cl&eacute; publique, puis ajout&eacute;e &agrave; une transmission
de donn&eacute;es s&eacute;curis&eacute;e.</font>
<p><a name="D"><font color="#000000"><b>Droits ou Droits d'acc&egrave;s:</b>
limites fix&eacute;es par un administrateur de r&eacute;seau aux pouvoirs
des utilisateurs sur les fichiers de donn&eacute;es d'un r&eacute;seau
(localisation, lecture, modification...)</font>
<p><font color="#000000"><b>DSI:</b> Direction des Syst&egrave;mes d'Information.
Service responsable de la gestion des communications des informations de
gestion. Terme &eacute;galement utilis&eacute; pour l'ensemble des activit&eacute;s
li&eacute;es aux ordinateurs centraux. En anglais MIS ou IS.</font>
<p><font color="#000000"><b>DSS:</b> Directory Services Server. Machine
qui tient &agrave; jour l'emplacement des fichiers stock&eacute;s sur des
syst&egrave;mes de grande dimension.</font>
<p><a name="E"><font color="#000000"><b>ELAP: </b>voir <i>EtherTalk</i>.</font>
<p><font color="#000000"><b>E-mail:</b> courrier &eacute;lectronique. Syst&egrave;me
de communication en r&eacute;seau pour le transfert de messages entre utilisateurs.
L'e-mail est tr&egrave;s couramment utilis&eacute; sur Internet.</font>
<p><font color="#000000"><b>Entreprise computing:</b> se r&eacute;f&egrave;re,
dans le jargon informatique am&eacute;ricain, &agrave; un ensemble complexe
d'ordinateurs en r&eacute;seau, pouvant inclure plusieurs r&eacute;seaux,
et utilis&eacute;s dans un but commun</font>
<p><font color="#000000"><b>En-t&ecirc;te:</b> information d'identification
plac&eacute;e au d&eacute;but d'un paquet ou d'un datagramme avant sa transmisson
&agrave; travers un r&eacute;seau.</font>
<p><font color="#000000"><b>Enveloppe num&eacute;rique: </b>cl&eacute;
de cryptage g&eacute;n&eacute;r&eacute;e de fa&ccedil;on al&eacute;atoire,
elle-m&ecirc;me crypt&eacute;e au moyen d'une cl&eacute; publique, puis
aout&eacute;e &agrave; une transmission de donn&eacute;es s&eacute;curis&eacute;e.</font>
<p><font color="#000000"><b>Ethernet:</b> syst&egrave;me de c&acirc;blage
et de protocoles extr&ecirc;mement r&eacute;pandu, d&eacute;velopp&eacute;
par Xerox en 1976, et sur lequel sont bas&eacute;s divers types de r&eacute;seaux
d'ordinateurs.</font>
<p><font color="#000000"><b>EtherTalk: </b>sp&eacute;cification pour l'exploitation
de protocoles AppleTalk au-dessus de la couche physique et de la couche
lien entre les donn&eacute;es d'un syst&egrave;me Ethernet.</font>
<p><a name="F"><font color="#000000"><b>FDDI: </b>Fiber Distributed Data
Interface. Topologie de r&eacute;seau &agrave; base delumi&egrave;re laser
utilisant un c&acirc;blage de fibres optiques et des mat&eacute;riels de
communication sp&eacute;cialis&eacute;s.</font>
<p><font color="#000000"><b>Fiber line driver: </b>dispositif mat&eacute;riel
permettant d'&eacute;tablir des connexions entre des c&acirc;bles en fibre
optique et les autres types e c&acirc;ble.</font>
<p><font color="#000000"><b>File d'attente d'impression: </b>utilitaire
pour le stockage des demandes de travaux d'impression et leur envoi dans
l'ordre d'arriv&eacute;e vers le serveur d'impression.</font>
<p><font color="#000000"><b>Filtrage:</b> processus tendant &agrave; am&eacute;liorer
l'efficacit&eacute; des transferts de donn&eacute;es en r&eacute;duisant
les &eacute;changes de donn&eacute;es inutiles entre deux r&eacute;seaux.</font>
<p><font color="#000000"><b>Firewall:</b> Syst&egrave;me mat&eacute;riel
ou logiciel (ou encore les deux) visant &agrave; emp&ecirc;cher l'acc&egrave;s
non autoris&eacute; &agrave; un intranet depuis Internet, tout en permettant
aux utilisateurs autoris&eacute;s de l'intranet de se connecter &agrave;
Internet.</font>
<p><font color="#000000"><b>Fonction hash:</b> algorithme de s&eacute;curit&eacute;
pour prot&eacute;ger l'int&eacute;grit&eacute; d'un message crypt&eacute;.</font>
<p><font color="#000000"><b>Forme normale:</b> r&egrave;gle d&eacute;crivant
la structure d'un ensemble efficace de tables dans une base de donn&eacute;es.
Il existe cinq formes normales.</font>
<p><a name="G"><font color="#000000"><b>Gopher:</b> application qui simplifie
l'acc&egrave;s &agrave; Internet en pr&eacute;sentant les fonctions courantes
d'Internet sous la forme d'une s&eacute;rie de menus sur l'&eacute;cran.</font>
<p><font color="#000000"><b>Groupe de travail:</b> ensemble de personnes
qui collaborent, habituellement &agrave; travers un r&eacute;seau, &agrave;
l'accomplissement d'une mission donn&eacute;e.</font>
<p><font color="#000000"><b>Groupware: </b>logiciel de r&eacute;seau pour
g&eacute;rer les communications et faciliter la coop&eacute;ration au sein
de groupes de travail (planification, messages, partage de donn&eacute;es...)</font>
<p><a name="H"><font color="#000000"><b>Handshaking: </b>processus par
lequel deux dispositifs informatiques d&eacute;terminent un protocole de
communication commun et un d&eacute;bit de transmission en vue d'&eacute;changer
des donn&eacute;es.</font>
<p><font color="#000000"><b>H&ocirc;te:</b> machine qui accepte une connexion
d'une autre machine.</font>
<p><b>H&ocirc;te Bastion:</b> serveur mat&eacute;riel plac&eacute; entreun
serveur proxy et une connexion Internet, servant de bouclier de s&eacute;curit&eacute;
pouremp&ecirc;cher des acc&egrave;s non autoris&eacute;s &agrave; un r&eacute;seau.
<p><b>Hub (ou concentrateur):</b> appareil qui re&ccedil;oit des signaux
d'un noeud de r&eacute;seau auquel il est reli&eacute; et les retransmet
&agrave; un autre noeud auquel il est aussi reli&eacute;.
<ul>
<li>
<b>Hub actif:</b> appareil qui accepte, amplifie et retransmet des donn&eacute;es
das un r&eacute;seau.</li>

<li>
<b>Hub passif:</b> appareil servant &agrave; &eacute;tablir des connexions
entre des noeuds de r&eacute;seau, mais sans agir en aucune mani&egrave;re
sur les signaux.</li>
</ul>
<a name="I"><b>IAC: </b>InterApplicationCommunication. Communication interapplication.
Processus permettant &agrave; des applications d'acc&eacute;der &agrave;
des donn&eacute;es d'autres applications.
<p><b>ISA:</b> Industry Standard Architecture. Standard 16 bits pour le
transfert de donn&eacute;es &agrave; l'int&eacute;rieur d'une station de
travail.
<p><b>ISP:</b> Internet Service Provider. Terme am&eacute;ricain pour d&eacute;signer
les fournisseurs de services Internet, procurant aux utilisateurs des connexions
&agrave; Internet.
<p><a name="J"><b>Java:</b> langage de programmation des plates-formes,
d&eacute;velopp&eacute; par Sun Microsystems, et qui est rapidement devenu
le langage de pr&eacute;dilection des d&eacute;veloppeurs pour Internet
ou pour des r&eacute;seaux intranet.
<p><b>JVM: </b>Java Virtual Machine. Conteneur d'une zone de m&eacute;moire
RAM allou&eacute;e dynamiquement, servant &agrave; l'&eacute;x&eacute;cution
de programmes Java.
<p><a name="L"><b>Largeur de bande:</b> aptitude d'un r&eacute;seau &agrave;
traiter des transmissions de donn&eacute;es simultan&eacute;ment. Plus
le nombre de transmissions simultan&eacute;es est &eacute;lev&eacute;,
plus grande est la largeur de bande du r&eacute;seau.
<ul>
<li>
<b>Largeur de bande dynamiqe:</b> technologie d'otimisation pour les connexions
en RNIS, dans laquelle le serveur du noeud distant surveille le d&eacute;bit
de transfert de divers types de donn&eacute;es. S'il y a beaucoup de donn&eacute;es
&agrave; transmettre et si la vitesse de transfert tombe au-dessous d'un
seuil pr&eacute;d&eacute;termin&eacute;, un autre canal de communication
est ouvert pour augmenter la capacit&eacute; de transmission de donn&eacute;es
&agrave; la vitesse du transfert.</li>
</ul>
<b>Ligne d'abon&eacute; num&eacute;rique:</b> en anglais DSL, "Digital
Suscriber Line". Connexion &agrave; distance d&eacute;di&eacute;e, semblable
&agrave; une ligne lou&eacute;e, &eacute;tablie &agrave; travers une liaison
de haute qualit&eacute; sur fil de cuivre, install&eacute;e par l'entreprise
de t&eacute;l&eacute;phone.
<p><b>Ligne lou&eacute;e:</b> ligne de communication d&eacute;di&eacute;e,
utilis&eacute;e pour le transfert de donn&eacute;es dans les deux sens
entre un r&eacute;seau et un frounisseur de services Internet.
<p><b>Login:</b> op&eacute;ration consistant &agrave; se connecter en tant
qu'utilisateur sur un r&eacute;seau.
<p><b>Logout:</b> op&eacute;ration consistant &agrave; se d&eacute;connecter
en tant qu'utilisateur sur un r&eacute;seau.
<p><b>LPT:</b> abr&eacute;viation de Line Printer utilis&eacute;e pour
d&eacute;signer des ports de p&eacute;riph&eacute;rique qui envoient et
re&ccedil;oivent des donn&eacute;es en format parall&egrave;le (8 bits).
<p><a name="M"><b>MAPI:</b> Messaging Application Programmer's Interface.
Standard pour le formatage et l'affichage de messages &eacute;lectroniques,
d&eacute;velopp&eacute; par Microsoft.
<p><b>MAU:</b> Media Attachment Unit. Un dispositif utilis&eacute; pour
connecter des ordinateurs &agrave; un c&acirc;blage partag&eacute;.
<p><b>MDA:</b> Mail Delivery Agent. Logiciel de serveur de r&eacute;seau
qui transf&egrave;re des mssages aux stations destinataires.
<p><b>Message thread:</b> ensemble de messages de newsgroup ou de groupware
ayant des affinit&eacute;s et reli&eacute;s entre eux pour &ecirc;tre lus
plus facilement en s&eacute;quence.
<p><b>MHS:</b> Message Handling System. Application de messagerie et de
courrier &eacute;lectronique d&eacute;velopp&eacute; par Novell.
<p><b>MIME:</b> Multipurpose Internet Mail Extension. Syst&egrave;me de
codage permettant l'envoi d'informations binaires &agrave; travers des
r&eacute;seaux tels qu'Internet, qui normalement n'acceptent que des donn&eacute;es
ASCII.
<p><b>Mod&eacute;lisation des donn&eacute;es:</b> processus d'analyse et
de d&eacute;finition des structures et de sproc&eacute;dures pour le traitement
des informations.
<p><b>Modem:</b> dispositif mat&eacute;riel qui traduit des signaux num&eacute;riques
en signaux analogiques, et vice versa, pour permettre des communications
&agrave; travers des lignes t&eacute;l&eacute;phoniques analogiques.
<ul>
<li>
<b>Modem c&acirc;ble:</b> modem con&ccedil;u pour transporter des signaux
de donn&eacute;es &agrave; travers une infrastructure c&acirc;bl&eacute;e,
d&eacute;di&eacute;e, &agrave; longue distance.</li>
</ul>
<b>Montage en rack:</b> technique de stockage permettant d'empiler et de
connecter du mat&eacute;riel r&eacute;seau dans un espace physique limit&eacute;.
<p><b>MSAU:</b> MultiStation Access Unit. Concentrateur sp&eacute;cial
sur un r&eacute;seau Token Ring, utilis&eacute; pour connecter des stations
de travail.
<p><b>MTA: </b>Mail Transfer Agent. Logiciel de serveur pour la v&eacute;rification
d'adresses de messages de courrier &eacute;lectronique et leur retransmission
&agrave; une adresse locale du r&eacute;seau ou sur Internet.
<p><b>MUA:</b> Mail User Agent. Logiciel client pour la composition et
l'envoi de messages de courrier &eacute;lectronique.
<p><b>Multimedia reflector: </b>Dispositif qui transmet des donn&eacute;es
depuis une seule source &agrave; de multiples destinataires.
<p><b>Multitraitement/Multiprocessing:</b> aptitude mat&eacute;riel &agrave;
&eacute;x&eacute;cuter simultan&eacute;ment plusieurs processus.
<p><a name="N"><b>NCB:</b> Network Control Block. Instructions envoy&eacute;es
par le logiciel de r&eacute;seau au syst&egrave;me d'exploitation orient&eacute;
r&eacute;seau d'un ordinateur.
<p><b>NDS:</b> NetWare Directory Services. Syst&egrave;me pour l'organisation
des emplacements d'un r&eacute;seau en une hi&eacute;rarchie, utilis&eacute;
dans NetWare version 4.
<p><b>NetBIOS:</b> Network Basic Input/Output System. Standard d&eacute;velopp&eacute;
par IBM pour l'acc&egrave;s aux services de r&eacute;seau par l'interm&eacute;diaire
du syst&egrave;me d'exploitation de l'ordinateur.
<p><b>NetPC:</b> terminal ayant acc&egrave;s &agrave; des applications
distantes et qui traite des donn&eacute;es distantes &agrave; travers des
protocoles Internet ou intranet.
<p><b>NIAS:</b> NetWare Internet Access Server. Passerelle TCP/IP propri&eacute;taire,
pour NetWare 4.11 de Novell.
<p><b>NLM:</b> NetWare Loadable Module. Application NetWare con&ccedil;ue
pour tourner en arri&egrave;re-plan tandis que le syst&egrave;me d'exploitation
est actif.
<p><b>Noeud:</b> point de connexion au r&eacute;seau repr&eacute;sent&eacute;
par tout type d'appareil (station de travail, imprimantes partag&eacute;es,
modems, etc.).
<p><b>Normalisation:</b> processus visant &agrave; &eacute;liminer des
redondances et &agrave; augmenter l'efficacit&eacute; en ce qui concerne
les relations entre les tables d'une base de donn&eacute;es.
<p><b>NOS:</b> Network Operating System. Syst&egrave;me d'exploitation
r&eacute;seau. Logiciel qui pilote le trafic des donn&eacute;es &agrave;
travers un r&eacute;seau, g&egrave;re la s&eacute;curit&eacute; et traite
les demandes de services de r&eacute;seau.
<p><a name="O"><b>ODBC:</b> Open Database Connectivity. Standard d&eacute;velopp&eacute;
par Microsoft pour transf&eacute;rer des donn&eacute;es de mani&egrave;re
fiable entre des programmes entre des programmes d'application et des bases
de donn&eacute;es.
<p><b>ODI:</b> Open Datalink Interface. Standard logiciel pour permettre
&agrave; des mat&eacute;riels compatibles d'accepter des donn&eacute;es
en utilisant plus d'un protocole.
<p><b>Ordinateur Central:</b> en Anglais "mainframe": syst&egrave;me de
traitement de grande dimension, multiprocesseur, con&ccedil;u pour permettre
l'acc&egrave;s &agrave; un tr&egrave;s grand nombre d'utilisateurs et traiter
des volumes de donn&eacute;es consid&eacute;rables.
<p><b>OSI/RM:</b> Open Systems Interconnection Reference Model. Standard
en sept couches d&eacute;velopp&eacute; par l'ISO, International Standards
organization, un organisme international d'experts qui d&eacute;finit diff&eacute;rents
standards techniques pour le compte de gouvernements. Le but d'OSI/RM est
de montrer la mani&egrave;re dont les diff&eacute;rentes parties d'un syst&egrave;me
de communication en r&eacute;seau doivent coop&eacute;rer.
<p><a name="P"><b>Paquet:</b> bloc de donn&eacute;es envoy&eacute;s &agrave;
travers un r&eacute;seau, incluant &agrave; la fois les informations brutes
et des codes sp&eacute;cifiques du protocole utilis&eacute;, qui servent
&agrave; identifier et &agrave; traiter le bloc.
<p><b>Parit&eacute;:</b> forme de v&eacute;rification des erreurs bas&eacute;es
sur des bits de donn&eacute;es, et contribuant &agrave; la synchronisation
des communications entre ordinateurs.
<p><b>Passerelle:</b> en anglais "gateway". Dispositif mat&eacute;riel
pourvu de son propre processeur et de sa propre m&eacute;moire pour connecter
des r&eacute;seaux &agrave; des syst&egrave;mes plus complexes utilisant
des protocoles de communication diff&eacute;rents.
<p><b>Pont:</b> dispositif mat&eacute;riel servant &agrave; relier deux
r&eacute;seaux locaux ou plus et &agrave; &eacute;galer le flux des signaux
de communication entre ces r&eacute;seaux.
<p><b>Poste &agrave; poste: </b>en anglais "peer-to-peer", d'&eacute;gal
&agrave; &eacute;gal. Organisation de r&eacute;seau entre ordinateurs dans
laquelle les stations de travail peuvent jouer &agrave; la fois le r&ocirc;le
de client et celui de serveur.
<p><b>Protocole:</b> r&egrave;gle ou ensemblede r&egrave;gles d&eacute;finissant
la mani&egrave;re dont des ordinateurs transmettent et re&ccedil;oivent
des donn&eacute;es, assurent la coh&eacute;rence des temps et d&eacute;tectent
les erreurs.
<p><a name="R"><b>RAS:</b> Remote Acess Server. Dispositif mat&eacute;riel
sur un r&eacute;seau, g&eacute;rant la connexion &agrave; un PC distant
de telle mani&egrave;re que ce PC distant se comporte comme n'importe quel
autre noeud du r&eacute;seau.
<p><b>Redirector:</b> logiciel qui contr&ocirc;le le flux de donn&eacute;es
entre divers noeuds du r&eacute;seau.
<p><b>Relais de trame:</b> en anglais "frame relay". Technologie &agrave;
grande vitesse, applicable aux r&eacute;seaux longue distance et bas&eacute;e
sur la transmission de donn&eacute;es sous forme de paquets v&eacute;rifiables,
de faible dimension.
<p><b>Relation de confiance:</b> liaison de communication entre deux domaines
Windows NT. Lorsqu'une relation de confiance est &eacute;tablie, les premiers
domaines (appel&eacute; le domaine confiant) accorde un acc&egrave;s aux
utilisateurs du second domaine (appel&eacute; domaine digne de confiance).
<p><b>R&eacute;p&eacute;teur:</b> dispositif mat&eacute;riel, semblable
&agrave; un hub, qui amplifie les signaux du trafic de donn&eacute;es d'un
r&eacute;seau et r&eacute;duit les interf&eacute;rences &eacute;lectriques.
<p><b>R&eacute;plication:</b> technique de s&eacute;curit&eacute; consistant
&agrave; copier els donn&eacute;es &agrave; plusieurs points du r&eacute;seau
pendant que le traitement s'effectue.
<p><b>Requ&ecirc;te:</b> processus d'extraction d'informations d'une base
de donn&eacute;es.
<p><b>R&eacute;seau &agrave; sandales: </b>en anglais "sneaker net". Transfert
de donn&eacute;es entre des activit&eacute;s non reli&eacute;es par un
r&eacute;seau, consistant &agrave; transporter des donn&eacute;es d'une
machine &agrave; l'autre au moyen de disquettes.
<p><b>R&eacute;seau en anneau:</b> topologie de r&eacute;seau dans laquelle
les stations de travail sont reli&eacute;es les unes aux autres par des
c&acirc;bles, en cercle ferm&eacute;.
<p><b>R&eacute;seau en &eacute;toile:</b> topologie de r&eacute;seau dans
laquelle les stations de travail sont connect&eacute;es ind&eacute;pendamment
les unes aux autres &agrave; un hub ou un serveur central.
<p><b>R&eacute;seau local:</b> plusieurs ordinateurs pouvant &eacute;changer
des donn&eacute;es &agrave; travers des c&acirc;bles ou des liaisons hertziennes.
le terme "local" est relatif ; il veut dire que les ordinateurs du r&eacute;seau
sont relativement proches les uns des autres. En anglais "LAN", Local Area
Network.
<p><b>R&eacute;seau longue distance: </b>en anglais "WAN", Wide Area Network.
Plusieurs ordinateurs qui peuvent &eacute;changer des donn&eacute;es &agrave;
travers des liaisons c&acirc;bl&eacute;es ou hertziennes. L'expression
"longue distance" a une valeur relative, signifiant que les ordinateurs
du r&eacute;seau ne sont pas suffisamment proches les uns des autres peut
&ecirc;tre consid&eacute;r&eacute;s comme appartenant &agrave; un r&eacute;seau
classique.
<p><b>R&eacute;seau Token Ring:</b> topologie de r&eacute;seau dans laquelle
le trafic des donn&eacute;es est r&eacute;gl&eacute; par l'envoi, d'un
noeud &agrave; l'autre, d'un signal &eacute;lectronique sp&eacute;cial
appel&eacute; jeton ("token").
<p><b>RNIS:</b> R&eacute;seau Num&eacute;rique &agrave; Int&eacute;gration
de Services. En anglais "ISDN", Integrated Services Digital Network. Ensemble
de technologies permettant &agrave; des canaux de donn&eacute;es sp&eacute;cialis&eacute;s
de coexister avec des canaux pour la transmission de la voix.
<p><b>Routeur:</b> dispositif mat&eacute;riel qui peut envoyer et recevoir
des donn&eacute;es depuis et vers de multiples r&eacute;seaux reli&eacute;s
entre eux.
<p><b>Routeur d'appels:</b> dispositif mat&eacute;riel, install&eacute;
sur un noeud d'un r&eacute;seau, sp&eacute;cialis&eacute; dans l'&eacute;tablissement
de connexions par appel. Par exemple l'&eacute;tablissement d'une connexion
&agrave; Internet.
<p><b>Routeur filtrant:</b> dispositif de s&eacute;curit&eacute; install&eacute;
entre un serveur Internet et un intranet. Il v&eacute;rifie les adresses
IP source et destination des datagrammes et jette ceux qui ne figurent
pas dans sa table de filtrage.
<p><a name="S"><b>Satellite data service:</b> m&eacute;thode de communication
permettant de recevoir des donn&eacute;es sur un PC &agrave; la plus grande
vitesse possible.
<p><b>Script de login ou script de logon:</b> s&eacute;rie de commandes
stock&eacute;es dans un fichier de donn&eacute;es et utilis&eacute;es par
un syst&egrave;me d'exploitation r&eacute;seau pour &eacute;tablir les
param&egrave;tres d'environnement de stations de travail qui se connectent
sur le r&eacute;seau.
<p><b>Serveur:</b> ordinateur d&eacute;di&eacute; au stockage de donn&eacute;es
ainsi qu'au traitement des demandes d'acc&egrave;s aux donn&eacute;es et
d'envoi de donn&eacute;es.
<ul>
<li>
<b>Serveur d'applications:</b> machine qui g&egrave;re l'acc&egrave;s &agrave;
un logiciel central d'application, par exemple une base de donn&eacute;es
partag&eacute;e.</li>

<li>
<b>Serveur de courrier &eacute;lectronique:</b> machine d&eacute;di&eacute;e
&agrave; la gestion du courrier &eacute;lectronique sur un r&eacute;seau.</li>

<li>
<b>Serveur de fichiers:</b> ordinateur sur un r&eacute;seau dont le r&ocirc;le
est de stocker des fichiers de donn&eacute;es et de les transmettre &agrave;
d'autres noeuds du r&eacute;seau.</li>

<li>
<b>Serveur de fichiers en miroir:</b> syst&egrave;me am&eacute;liorant
la performance et la protection des donn&eacute;es, dans lequel les donn&eacute;es
stock&eacute;es sur un serveur de fichiers primaire sont imm&eacute;diatement
transf&eacute;r&eacute;s &agrave; haute vitesse &agrave; un serveur de
fichiers secondaires.</li>

<li>
<b>Serveur de noms:</b> machine qui stocke et g&egrave;re une base de domaines
de noms et les adresses IP associ&eacute;es.</li>

<li>
<b>Serveur de noms racine:</b> serveur contenant des domaines de noms et
des adresses IP bas&eacute;ses sur le type de domaine de nom, tel que .com.
Les serveurs de noms racine sont situ&eacute;s en diff&eacute;rents points
des Etats-Unis et sont tenus &agrave; jour par InterNIC.</li>

<li>
<b>Serveur d'impression: </b>ordinateur d&eacute;di&eacute; au traitement
des demandes d'impression au sein d'un r&eacute;seau.</li>

<li>
<b>Serveur fax:</b> machine sp&eacute;cialis&eacute;e dans la gestion de
transmissions "fac simile" (fax) &agrave; travers un r&eacute;seau d'ordinateurs.</li>

<li>
<b>Serveur Web:</b> ordinateur qui g&egrave;re les connexions &agrave;
Internet et &agrave; lintranet sur un r&eacute;seau, stocke les pages Web
et les affiche &agrave; la demande des navigateurs clients.</li>

<li>
<b>Serveur proxy:</b> dispositif de s&eacute;curit&eacute; qui g&egrave;re
et v&eacute;rifie le flux de donn&eacute;es entre un r&eacute;seau d'ordinateurs
et Internet.</li>
</ul>
<b>SFT:</b> System Fault Tolerance. Sst&egrave;me de protection des donn&eacute;es
&agrave; trois niveaux, fournissant des garanties variables pour des donn&eacute;es
stock&eacute;es sur un r&eacute;seau NetWare.
<p><b>SGBD:</b> Syst&egrave;me de gestion de base de donn&eacute;es (en
anglais "DBMS", Database Management System). Application qui organise les
donn&eacute;es dans un cadre structur&eacute; compos&eacute; de tables
comportant des lignes et des colonnes, et qui utilise cette structure pour
fournir un acc&egrave;s aux donn&eacute;es ainsi que des moyens pour les
traiter.
<ul>
<li>
<b>SGBD de r&eacute;seau:</b> application qui synchronise l'acc&egrave;s
de multiples utilisateurs &agrave; des bases de donn&eacute;es centralis&eacute;es.</li>

<li>
<b>SGBDR:</b> syst&egrave;me de gestion de base de donn&eacute;es relationnel.
Application qui organise les donn&eacute;es selon une structure de tables
de tables form&eacute;es de lignes et de colonnes, et &eacute;tablit des
relations entre ces tables.</li>
</ul>
<b>Signature d'objet:</b> technique de s&eacute;curit&eacute; permettant
de limiter les emplacements d'un disque dur pouvant accepter des applets
t&eacute;l&eacute;charg&eacute;ses.
<p><b>Signature num&eacute;rique:</b> code d'identification implant&eacute;
dans une transmission de donn&eacute;es s&eacute;curis&eacute;e. C'est
aussi un code d'identification enregistr&eacute;e, implant&eacute; dans
un applet transmise &agrave; travers Internet, et qui sert &agrave; v&eacute;rifier
l'auteur de l'applet.
<p><b>SMP:</b> Symmetrical Multiprocessing. Multiprocessing sym&eacute;trique,
c'est une architecture de serveur dans laquelle plusieurs processeurs sont
int&eacute;gr&eacute;s pour faire le travail d'un m&ecirc;me serveur.
<p><b>SQL:</b> Structured Query Language. Langage standard pour la gestion
de bases de donn&eacute;es client/serveur.
<p><b>STDA: </b>StreetTalk Directory Assistance. Fonction de VINES qui
liste les noms des noeuds sur le r&eacute;seau.
<p><b>Subnet Masking:</b> processus consistant &agrave; manipuler des adresses
de r&eacute;seau avec des nombres binaires.
<p><a name="T"><b>Table de filtrage:</b> liste d'adresses IP autoris&eacute;es
stock&eacute;e sur un routeur filtrant, lui-m&ecirc;me utilis&eacute; pour
s&eacute;curiser l'acc&egrave;s &agrave; distance &agrave; un intranet.
<p><b>Telecommuting:</b> processus par lequel des utilisateurs effectuent
leurs travaux de routine &agrave; partir de leur domicile, gr&acirc;ce
&agrave; une liaison &agrave; distance, au lieu de se rendre en personne
sur le site de leur station de travail.
<p><b>Topologie:</b> structure d'un r&eacute;seau;
<ul>
<li>
<b>Topologie logique:</b> description du comportement des ordinateurs d'un
r&eacute;seau, du point de vue de ses op&eacute;rateurs humains.</li>

<li>
<b>Topologie physique:</b> structure mat&eacute;rielle des ordinateurs
d'un r&eacute;seau.</li>
</ul>
<b>Traitement distribu&eacute;:</b> syst&egrave;me dans lequel diff&eacute;rents
utilisateurs d'un r&eacute;seau effectuent des t&acirc;ches distinctes
mais qui, prises dans leur ensemble, repr&eacute;sentant un processus unique
et unifi&eacute; mettant en jeu des donn&eacute;es partag&eacute;es sur
le r&eacute;seau.
<p><b>Traitement transationnel:</b> gestion de bases de donn&eacute;es
utilisant des tables pour stocker des instructions de traitement. Si n&eacute;cessaire,
ces tables peuvent &ecirc;tre utilis&eacute;es pour remettre les donn&eacute;es
dans un &eacute;tat ant&eacute;rieur d&eacute;termin&eacute;.
<p><b>Trame:</b> en anglais "frame". Donn&eacute;es combin&eacute;es avec
des en-t&ecirc;tes et des indications de fin, pour pr&eacute;server ces
donn&eacute;es de toute modification lors du passage &agrave; travers une
liaison r&eacute;seau longue distance.
<p><b>Transmission asynchrone: </b>m&eacute;thode de transmission de donn&eacute;es
utilisant des bits de donn&eacute;es sp&eacute;ciaux, appel&eacute;s "bit
start" et "bit stop", pour contr&ocirc;ler le flux de donn&eacute;es sans
tenir compte du temps &eacute;coul&eacute;.
<p><b>TTS:</b> Transaction Tracking System. Syst&egrave;me NetWare qui
garde la trace des processus du r&eacute;seau et peut effectuer un retour
&agrave; l'&eacute;tat ant&eacute;rieur dans l'&eacute;ventualit&eacute;
d'un plantage du syst&egrave;me affectant l'int&eacute;grit&eacute; des
donn&eacute;es sur le r&eacute;seau.
<p><a name="U"><b>URL:</b> Uniform Resource Locator. Syst&egrave;me d'adresses
IP qui transforme les noms de domaines en adresses IP.
<p><b>Usenet:</b> base de donn&eacute;es mondiale de groupes de discussion
du type newsgroups.
<p><b>UUENCODE/UUDECODE:</b> syst&egrave;me de codification ancien d&eacute;velopp&eacute;
initialement pour UNIX et port&eacute; sur d'autres plates-formes. Ce syst&egrave;me
est utilis&eacute; de nos jours par des syst&egrave;mes de messageries
ne disposant pas en propre d'un syst&egrave;me de codage int&eacute;gr&eacute;.
<p><a name="V"><b>Verrou:</b> marque num&eacute;rique associ&eacute;e &agrave;
des donn&eacute;es (telles qu'un enregistrement d'une base de donn&eacute;es,
un fichier ou un r&eacute;pertoire), et qui sert &agrave; signaler aux
autres utilisateurs que les donn&eacute;es sont actuellement en cours d'utilisation
et &agrave; les emp&ecirc;cher de les modifier jusqu'&agrave; ce que le
premier utilisateur ait fini de s'en servir.
<p><b>VIM:</b> Vendor-Independent Messaging. Messagerie ind&eacute;pendante
des fournisseurs. Standard pour le formatage des messages &eacute;lectroniques,
d&eacute;velopp&eacute; par Lotus.
<p><b>VINES:</b> Virtual Network System. Syst&egrave;me d'exploitation
r&eacute;seau &agrave; base de serveurs de fichiers, con&ccedil;u comme
une extension d'UNIX, et d&eacute;velopp&eacute; par Banyan.
<p><b>VLM:</b> Virtual Loadable Module. Logiciel qui contr&ocirc;le un
ensemble limit&eacute; de processus sur un r&eacute;seau NetWare.
<p><a name="W"><b>Whiteboard conferencing:</b> technique permettant d'afficher
simultan&eacute;ment des donn&eacute;es partag&eacute;es sur de multiples
noeuds d'un r&eacute;seau, et de les mettre &agrave; jour en temps r&eacute;el.
<p><b>World Wide Web:</b> syst&egrave;me de pages de texte en format HTML,
stock&eacute;es sur des millions d'ordinateurs dans le monde entier, et
auxquelles les utilisateurs d'Internet peuvent acc&eacute;der pour les
afficher.
<p><a name="X"><b>X 400:</b> standard international pour le formatage de
message &eacute;lectroniques, d&eacute;velopp&eacute; par l'International
Consulative Committee of Telephony and Telegraphy, et qui d&eacute;finit
les composants standard des adresses de courrier &eacute;lectronique.
<br>&nbsp;
<p>&nbsp;&nbsp; Voil&agrave; maintenant la partie d&eacute;di&eacute;e
aux protocoles, qui pourrait rentrer dans le glossaire sur les r&eacute;seaux
mais que j'ai trouv&eacute;e plus int&eacute;ressante de traiter &agrave;
part.
<br>&nbsp;
<br>&nbsp;
<br>
<br>
<center>
<p><a name="prot"><b><tt><font size=+2>Protocoles</font></tt></b></center>

<p><b>ADSP: </b>AppleTalk Data Stream Porotocol. Protocole AppleTalk qui
supervise et contr&ocirc;le le flux de donn&eacute;es entre
<br>ordinateurs.
<p><b>AFP: </b>AppleTalk File Protocol. Un protocole AplleTalk qui traite
les demandes de fichiers de donn&eacute;es et g&egrave;re la s&eacute;curit&eacute;
des
<br>fichiers.
<p><b>ARP:</b> Les adresses IP sont attribu&eacute;es ind&eacute;pendamment
des adresses mat&eacute;rielles des machines. Pour envoyer un datagramme
dans l'internet, le logiciel r&eacute;seau doit convertir&nbsp; l'adresse
IP en une adresse physique qui est utilis&eacute;e pour transmettre la
trame. Si&nbsp; l'adresse physique est un entier court, elle peut &ecirc;tre
facilement modifi&eacute;e pour lui faire correspondre l'adresse machine
IP. Sinon, la traduction doit &ecirc;tre effectu&eacute;e dynamiquement.
C'est le protocole ARP qui effectue cette traduction en s'appuyant sur
le r&eacute;seau physique. ARP permet aux machines de r&eacute;soudre les
adresses sans utiliser de table statique. Une machine utilise ARP pour
d&eacute;terminer l'adresse physique destinataire en diffusant (broadcast),
sur le sous r&eacute;seau, une requ&ecirc;te ARP qui contient l'adresse
IP &agrave; traduire. La machine poss&eacute;dant l'adresse IP concern&eacute;e
r&eacute;pond en renvoyant son adresse physique. Pour rendre ARP plus performant,
chaque machine tient &agrave; jour, en m&eacute;moire, une table des adresses
r&eacute;solues et r&eacute;duit ainsi le nombre d'&eacute;missions en
mode broadcast.
<p><b>ASP: </b>AppleTalk Session Protocol. Protocole AppleTalk pour v&eacute;rifier
les messages envoy&eacute;s par sections &agrave; travers le r&eacute;seau.
<p><b>ATP: </b>AppleTalk Transaction Protocol. protocole AppleTalk qui
v&eacute;rifie l'exactitude des messages du r&eacute;seau.
<p><b>BCAST (Novell): </b>BCAST sert &agrave; diffuser les annonces du
r&eacute;seau informant l'utilisateur qu'il a bien re&ccedil;u un message.
<p><b>BMP (Novell): </b>le BMP est en fait un type de paquet NCP ( Request
type=7777H). BMP a &eacute;t&eacute; cr&eacute;&eacute; afin de permettre
de multiple r&eacute;ponses pour une seule requ&ecirc;te et donc transf&eacute;rer
jusqu'&agrave; 64 ko de donn&eacute;es pour une seule requ&ecirc;te en
lecture de fichiers.
<p><b>CHAP: </b>Challenge Handshake Authentication Protocol. Protocole
standard Internet pour la v&eacute;rification des mots de passe
<br>crypt&eacute;s.
<p><b>CLI: </b>Call Line Identification. Protocole pour l'identification
du num&eacute;ro appelant et son rapprochement avec une liste
<br>d'appelants autoris&eacute;s avant d'&eacute;tablir la liaison avec
un ordinateur.
<p><b>DDP: </b>Datagram Delivery Protocol. Protocole de traitement des
donn&eacute;es au coeur de la suite de protocoles AppleTalk.
<p><b>DIAG (Novell):</b> DIAGnostic reponder est tr&egrave;s utilis&eacute;
pour analyser les LAN Netware. DIAG peut &ecirc;tre utilis&eacute; pour
tester les connexions et les configurations.
<p><b>DLC:</b> Data Link Control. Protocole d'usage limit&eacute;, con&ccedil;u
pour connecter des r&eacute;seaux locaux et des ordinateurs centraux IBM.
<p><b>FTP: </b>File Transfer Protocol. Protole decommunication utilis&eacute;
pour le traitement de messages complexes et defichiers de
<br>donn&eacute;es &agrave; travers un r&eacute;seau et &agrave; automatiser
le traitement des messages
<blockquote>
<li>
<b>FTP anonyme: </b>(Anonymous FTP). c'est une m&eacute;thode de t&eacute;l&eacute;chargement
de fichiers disponibles pour lepublic depuis des sites Internet, appel&eacute;e
anonyme parce qu'elle n'exige pas un compte utilisateur sur le serveur.</li>
</blockquote>

<p><br><b>EP: </b>Echo Protocol. Protocole AppleTalk renvoyant les messages
re&ccedil;us vers le noeud &eacute;metteur pour en v&eacute;rifier l'int&eacute;grit&eacute;.
<p><b>HTTP: </b>HyperText Transfer Protocol. Protocole standard pour l&eacute;tablissement
de liens &agrave; des pages Web sur Internet ou sur un
<br>intranet.
<p><b><font color="#000000">ICMP:</font></b><font color="#CCCCCC"> </font><font color="#000000">Internet
Control Message Protocol. Occasionnellement, un routeur ou un h&ocirc;te
destinataire peut avoir &agrave; communiquer vers l'&eacute;metteur du
datagramme, par exemple, pour signaler une erreur de traitement du datagramme.
C'est dans cette perspective qu'a &eacute;t&eacute; mis en place le protocole
Internet Control Message Protocol (ICMP). Il s'appuie sur le support de
base fourni par IP comme s'il s'agissait d'un protocole d'une couche sup&eacute;rieure.
ICMP n'en reste pas moins une partie int&eacute;grante du protocole IP,
et doit de ce fait &ecirc;tre impl&eacute;ment&eacute; dans chaque module
IP. </font><font color="#CCCCCC"></font>
<p><b>IDP:</b> Internet Datagram Protocol. Le protocole de base de XNS,
semblable &agrave; TCP/IP, pour la v&eacute;rification des donn&eacute;es
et le
<br>traitement des responsabilit&eacute;s d'adressage entre NetWare et
d'autres r&eacute;seaux.
<p><b>IPX (Novell): </b>IPX est l'impl&eacute;mentation Novell du Internet
Datagram Protocol (IDP) d&eacute;velopp&eacute; par
<br>Xerox. IPX est un protocole datagramme sans connexion qui transmet
des paquets
<br>&agrave; travers Internet et fournit aux stations Netware et aux serveurs
de fichiers des
<br>services d'adressage et de routage inter r&eacute;seaux.<b></b>
<p><b>LAPB:</b> le protocole X25 d&eacute;finit l'interface entre un ETTD
( Equipement Terminal de Traitement des Donn&eacute;es ) et un ETCD ( Equipement
Terminal de Circuit de Donn&eacute;es ). Il a &eacute;t&eacute; adopt&eacute;
par le CCITT en septembre 1976. On entend souvent par X25 l'ensemble des
protocoles li&eacute;s &agrave; X25 et qui couvre les couches 1 &agrave;
3 du mod&egrave;le OSI. Pourtant, le terme X25 d&eacute;signe uniquement
le niveau 3 ou niveau paquet transport&eacute; entre les champs d'information
des trames LAPB.<b></b>
<p><b><font color="#000000">LDAP:</font></b><font color="#CCCCCC"> </font><font color="#000000">Lightweight
Directory Access Protocol. Le protocole LAPB est le protocole de niveau
2 (liaison) qui transporte les paquets X25.</font><b></b>
<p><b>NBP: </b>Name Binding Protocol. Protocole AppleTalk pour traduire
des noms de noeuds d&eacute;finis par l'utilisateur en adresses de
<br>noeud de r&eacute;seau.
<p><b>NCP (Novell): </b>NetWare Core Protocol. Protocole NetWare pour la
gestion optimale du flux de donn&eacute;es entre les clients NetWare et
<br>les serveurs de fichiers.
<p><b>NetBEUI: </b>NetBIOS Extended User Interface. Un petit protocole
convenant pour des r&eacute;seaux dans lesquels tous les noeuds
<br>&eacute;tablissent des liens directs avec le serveur.
<p><b>OLE:</b> Object Linking and Embedding. Protocole d&eacute;velopp&eacute;
par Microsoft pour permettre aux applications d'&eacute;changer des
<br>donn&eacute;es sous la forme d'objets stock&eacute;s dans des fichiers
s&eacute;par&eacute;s et li&eacute;s &agrave; l'application, ou encore
implant&eacute;s sous forme de
<br>copies au sein des applications.
<p><b>PAP: </b>Password Authentication Protocol. Protocole Internet standard
pour la v&eacute;rification des mots de passe des appelants
<br>distants.
<p><b>PAP(2): </b>Printer Access Protocol. Protocole AppleTalk pour surveiller
un flux de donn&eacute;es envoy&eacute;es de mani&egrave;re continue et
<br>non sous forme de sections.
<p><b>PDU:</b> Protocol Data Unit. A ne pas confondre avec UDP.
<p><b>PEP: </b>Packet Exchange Protocol. Protocole XNS qui traite des messages
pour les acheminer &agrave; travers un r&eacute;seau.
<p><b>POP: </b>Post office Protocol. Protocole de transfert de donn&eacute;es
qui g&egrave;re les messages de courrier &eacute;lectronique stock&eacute;s
sur des
<br>serveurs d'un r&eacute;seau.
<p><b>PPP: </b>Point-to-Point Protocol. Protocole de transfert de donn&eacute;es
appartenant &agrave; la famille TCP-IP, pour la transmission de
<br>paquets IP &agrave; travers des lignes t&eacute;l&eacute;phoniques.
<p><b>RCP: </b>Remote Courrier Protocol. Protocole de courrier &agrave;
distance. Protocole XNS permettant au logiciel d'&eacute;x&eacute;cuter
des
<br>services disponibles sur d'autres noeuds du r&eacute;seau.
<p><b>RIP: </b>Routing Information Protocol. Protocole XNS pour &eacute;tablir
le meilleur chemin de donnes pour les messages &eacute;chang&eacute;s
<br>entre deux noeuds de r&eacute;seau.
<p><b>RIP2: </b>RIP2 est utilis&eacute; pour &eacute;changer des informations
de routage. Il d&eacute;rive d'un premier protocole d&eacute;velopp&eacute;
par Xerox (RIP). Chaque machine qui utilise un protocole RIP2 a un processus
qui envoie et re&ccedil;oit des datagrammes transport&eacute;s par de l'UDP
port num&eacute;ro 520
<p><b>RIPX (Novell):</b> RIPX est utilis&eacute; pour collecter, maintenir
et &eacute;changer des informations de routage correctes entre les passerelles
dans Internet. Il ne faut pas confondre ce protocole avec celui de la famille
TCP/IP.
<p><b>RTPM:</b> Routing Table Maintenance Protocol. Protocole AppleTalk
pour tenir &agrave; jour l'emplacement des noeuds du r&eacute;seau
<br>ainsi qu'une base de donn&eacute;es des connexions fiables entre ces
noeuds.
<p><b>SAP (Novell): </b><font color="#000000">Server Advertising Protocol.
Avant qu'un client ne puisse communiquer avec un serveur, il doit savoir
quels serveur sont disponibles sur le r&eacute;seau. Cette information
est rendue disponible gr&acirc;ce au Novell's SAP. Le service&nbsp; SAP
diffuse l'information sur la liste des serveurs connu &agrave; travers
tout le r&eacute;seau. Ces serveurs peuvent comprendre des serveurs de
fichiers, des serveurs d'impression, des serveurs d'acc&egrave;s Netware,
et des serveurs distants.</font><font color="#000000"></font>
<p><font color="#000000"><b>SER (Novell): </b>SERialization. Pour assurer
qu'une simple version de Netware n'est pas en train d'&ecirc;tre charg&eacute;e
sur diff&eacute;rents serveurs, l'OS diffuse des paquets appel&eacute;s
paquets de s&eacute;rialisation pour d&eacute;terminer si il y a multiple
copies du m&ecirc;me OS sur le r&eacute;seau. Ces paquets ne contiennent
qu'un seul champ de 6 octets appel&eacute; champ de donn&eacute;e de s&eacute;rialisation.</font>
<p><b>SMB: </b>Server Message Block. Protocole qui traduit des instructions
d'ordinateur en instructions NetBIOS.
<p><b>SMTP:</b> Simple Mail Transfer Protocol. Protocole de courrier &eacute;lectronique
qui &eacute;tablit une connexion de courrier &eacute;lectronique
<br>entre le serveur &eacute;metteur et le serveur r&eacute;cepteur, fragmente
le message en sections et v&eacute;rifie chaque section au cours de son
<br>envoi.
<p><b>SNMP: </b>Le protocole SNMP est le langage que les agents et les
stations de gestion (managers) utilisent pour communiquer. C'est un protocole
de type question/r&eacute;ponse asynchrone. Ce protocole est situ&eacute;
au niveau application du mod&egrave;le OSI, c'est lui qui d&eacute;finit
la structure formelle des communications. SNMP est encapsul&eacute; dans
des trames UDP.
<p><b>SPP: </b>Sequenced Packet Protocol. Protocole XNS pour v&eacute;rifier
les donn&eacute;es transmises dans un r&eacute;seau.
<p><b>SPX: </b>Sequenced Packet Exchange. Protocole NetWare qui utilise
des fonctions NetWare pour v&eacute;rifier l'exactitude des
<br>donn&eacute;es.
<p><b>TCP: </b>Transmission Control Protocol. Protocole de communication
utilis&eacute; &agrave; la base d'Internet et support&eacute; par la plupart
des
<br>syst&egrave;mes d'exploitation r&eacute;seau.
<p><b>Telnet: </b>protocole permettant &agrave; une personne disposant
d'une station de travail d'acc&eacute;der &agrave; un ordinateur diff&eacute;rent
sur un site
<br>distant et de le faire marcher, comme si elle manipulait le clavier
de cet ordinateur.
<p><b>UDP: </b>User Datagram Protocol. Protocole de communication qui ne
soumet pas les donn&eacute;es &agrave; des tests de validit&eacute;. UDP
est
<br>utilis&eacute; en vid&eacute;o-conf&eacute;rence, o&ugrave; l'application
de tests de validit&eacute; sur des signaux vid&eacute;o en temps r&eacute;els
d&eacute;graderait la qualit&eacute; des
<br>images.
<p><b>WDOG<font color="#000000"> (Novell)</font>:</b> le WDOG fournit les
validations de connexion aux stations sur le syst&egrave;me Netware et
rend compte &agrave; l'OS lorsque une connexion doit &ecirc;tre ferm&eacute;e
pour cause de trop longue p&eacute;riode sans communications.
<p><b>XNS: </b>Xerox Network System. Famille de protocoles de communication
simplifi&eacute;es d&eacute;velopp&eacute; par Xerox.
<p><b>X25:</b> le protocole X25 d&eacute;finit l'interface entre un ETTD
( Equipement Terminal de Traitement des Donn&eacute;es ) et un ETCD ( Equipement
Terminal de Circuit de Donn&eacute;es ). Il a &eacute;t&eacute; adopt&eacute;
par le CCITT en septembre 1976. On entend souvent par X25 l'ensemble des
protocoles li&eacute;s &agrave; X25 et qui couvre les couches 1 &agrave;
3 du mod&egrave;le OSI. Pourtant, le terme X25 d&eacute;signe uniquement
le niveau 3 ou niveau paquet transport&eacute; entre les champs d'information
des trames LAPB.
<p><b>ZAP:</b> Zone Information Protocol. Protocole AppleTalk qui analyse
la configuration du r&eacute;seau et rassemble les adresses des
<br>appareils par groupes, permettant des acc&egrave;s plus efficaces.
<br>&nbsp;
<br>&nbsp;
<br>
<br>
<center>
<p><a name="RL"><b><tt><font size=+2>R&eacute;f&eacute;rences et liens</font></tt></b></center>
<b><tt><font size=+2></font></tt></b>
<p><b>Livre:</b> "Cr&eacute;ez votre r&eacute;seau", Ed. 1998 SYBEX. Auteur:
Robert M. Thomas.
<p><b>Sites:</b>
<br><a href="http://www.guill.net/">http://www.guill.net/</a>
<br><a href="http://www.argosnet.com/">http://www.argosnet.com/</a>
<br><a href="http://mike.elit.net/Braindump/">http://mike.elit.net/Braindump/</a>
<br><a href="http://security.web-france.com/"></a>&nbsp;
</body>
</html>
