<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Clad Strife">
   <meta name="GENERATOR" content="Mozilla/4.61 [en] (Win98; I) [Netscape]">
   <title>Linux Firewall HOWTO</title>
</head>
<body text="#000000" bgcolor="#FFF5F0" link="#0000EE" vlink="#551A8B" alink="#FF0000">

<center><b><tt><font size=+2>HOWTO sur les Firewalls sous Linux</font></tt></b>
<p><u><font size=-1>Le HOWTO du pare-feu et des serveurs mandataires</font></u>
<br><font size=-1><i>Mark Grennan</i> mark@grenna.com</font>
<br><font size=-1>v0.67, 26 septembre 1999 - Adaptation fran&ccedil;aise<i>
Bernard Choppy</i>, choppy@imaginet.fr 7 d&eacute;cembre 1999</font></center>

<p><br>
<br>
<br>
<br>
<p>
<hr WIDTH="100%">
<p><font size=-1>Ce document est destin&eacute; &agrave; enseigner les
bases des syst&egrave;mes pare-feux ainsi que pour donner quelques d&eacute;tails
sur la configuration d'un pare-feu aussi bien filtrant que serveur mandataire
avec un PC sous Linux. Une version HTML de la version originale en anglais
de ce document est disponible &agrave; http://www.grennan.com/Firewall-HOWTO.html.</font>
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<p>1. Introduction
<br>1.1 R&eacute;actions
<br>1.2 Avertissement
<br>1.3 Droit d'auteur
<br>1.4 Les raisons qui me poussent &agrave; &eacute;crire ceci
<br>1.5 Autres sources d'information
<p>2. Comprendre les pare-feux
<br>2.1 Politiques de s&eacute;curit&eacute;
<br>2.2 Types de pare-feux
<br>2.3 Serveurs mandataires
<p>3. Architecture de pare-feu
<p>4. Configurer le pare-feu filtrant Linux
<br>4.1 Mat&eacute;riel n&eacute;cessaire
<br>4.2 Logiciel n&eacute;cessaire
<p>5. Pr&eacute;parer le syst&egrave;me Linux
<br>5.1 Compiler le noyau
<br>5.2 Configurer deux cartes r&eacute;seau
<br>5.3 Configurer les adresses r&eacute;seau
<br>5.4 Tester votre r&eacute;seau
<br>5.5 S&eacute;curiser le pare-feu
<p>6. Configuration du filtrage IP (IPFWADM)
<p>7. Configuration du filtrage IP (IPchains)
<p>8. Rendre le tout plus simple
<p>9. Installer un mandataire Squid transparent
<p>10. Installer le serveur mandataire TIS
<br>10.1 Trouver le logiciel
<br>10.2 Compilation du FWTK TIS
<br>10.3 Installation du FWTK TIS
<br>10.4 Configuration du FWTK TIS
<p>11. Le serveur mandataire SOCKS
<br>11.1 Installation du serveur mandataire
<br>11.2 Configuration du serveur mandataire
<br>11.3 Travailler avec un serveur mandataire
<br>11.4 Faire fonctionner le serveur mandataire avec les paquets UDP
<br>11.5 Inconv&eacute;nients des serveurs mandataire
<p>12. Configurations avanc&eacute;es
<br>12.1 Un grand r&eacute;seau avec s&eacute;curit&eacute; renforc&eacute;e
<p>13. Simplifier l'administration
<p>14. Outrepasser un pare-feu mandataire
<br>&nbsp;
<br>&nbsp;
<br>
<center>
<p><b><font size=+1>1. Introduction</font></b></center>

<p>David Rudder drig@execpc.com. est l'auteur de la version d'origine de
ce Firewall-HOWTO, il y a de si nombreux mois, et je voudrais encore le
remercier pour m'avoir autoris&eacute; &agrave; mettre son travail &agrave;
jour.
<p>Les pare-feux sont devenus tr&egrave;s populaires en tant que "nec plus
ultra" de la s&eacute;curit&eacute; sur Internet. Comme de nombreuses choses
dont la renomm&eacute;e grandit, une certaine incompr&eacute;hension s'y
est jointe. Ce HOWTO pr&eacute;sente les bases de la d&eacute;finition
d'un pare-feu et la mani&egrave;re d'en configurer un.
<p>J'utilise un noyau 2.2.15 et RedHat 6.0 pour d&eacute;velopper ce howto,
ainsi les exemples ci-dessous sont fond&eacute;s sur cette distribution.
Si vous trouvez des diff&eacute;rences dans votre distribution, envoyez-moi
un courriel et je mettrai &agrave; jour ce howto.
<p>NdT : Diverses traductions ont &eacute;t&eacute; propos&eacute;es pour
le terme firewall, dont pare-feu, coupe-feu, mur anti-feu, etc. Le traducteur
a adopt&eacute; "pare-feu", qui semble actuellement le terme le plus couramment
admis.
<br>&nbsp;
<br>&nbsp;
<br>
<br>
<center>
<p><b><font size=+1>1.1 R&eacute;actions</font></b></center>

<p>Toute r&eacute;action est la bienvenue. SIGNALEZ TOUTE INEXACTITUDE
DANS CET ARTICLE S'IL VOUS PLAIT ! Je suis humain, et donc sujet aux erreurs.
Si vous trouvez une correction, envoyez-la moi. Je tenterai de r&eacute;pondre
&agrave; tout courriel, mais je suis tr&egrave;s occup&eacute;, donc ne
m'en veuillez pas si je ne le fais pas.
<p>Mon adresse courriel est : <a href="mailto:mark@grennan.com">mark@grennan.com</a>.
<br>&nbsp;
<br>&nbsp;
<br>
<br>
<center>
<p><b><font size=+1>1.2 Avertissement</font></b></center>

<p>JE NE SUIS RESPONSABLE D'AUCUN DOMMAGE RESULTANT D'ACTIONS FONDEES SUR
LE PRESENT DOCUMENT. Ce document est con&ccedil;u comme une introduction
au fonctionnement des pare-feux et des serveurs mandataires. Je ne suis,
ni ne pr&eacute;tends &ecirc;tre un expert &egrave;s s&eacute;curit&eacute;.
;-) Je suis simplement un individu qui a trop lu et qui appr&eacute;cie
les ordinateurs plus que ce n'est le cas pour beaucoup. Consid&eacute;rez
que j'&eacute;cris ceci pour familiariser les gens avec ce sujet, et que
je ne suis pas pr&ecirc;t &agrave; perdre ma jeunesse dans l'exactitude
de ce qui s'y trouve.
<p>NdT : Pour sa part, le traducteur &eacute;met les m&ecirc;mes r&eacute;serves
que celles de l'auteur.
<br>&nbsp;
<br>&nbsp;
<br>
<br>
<center>
<p><b><font color="#000000"><font size=+1>1.3 Droit d'auteur</font></font></b></center>

<p>Sauf mention contraire, les documents Linux HOWTO sont la propri&eacute;t&eacute;
de leurs auteurs respectifs. Les documents Linux HOWTO peuvent &ecirc;tre
reproduits et distribu&eacute;s en totalit&eacute; ou en partie, sur tout
support physique ou &eacute;lectronique, tant que cette notice de droit
d'auteur est pr&eacute;sente sur chaque copie. La redistribution commerciale
est autoris&eacute;e et encourag&eacute;e ; n&eacute;ammoins, l'auteur
souhaite &ecirc;tre inform&eacute; de toute distribution de ce genre.
<p>Toute traduction, travail d&eacute;riv&eacute;, ou agr&eacute;gat incorporant
tout ou partie d'un ou plusieurs documents Linux HOWTO doit &ecirc;tre
couvert par ce m&ecirc;me droit d'auteur. Ce qui veut dire que vous ne
pouvez produire un travail d&eacute;riv&eacute; d'un HOWTO et imposer des
restrictions suppl&eacute;mentaires concernant sa distribution. Des exceptions
&agrave; ces r&egrave;gles peuvent &ecirc;tre d&eacute;livr&eacute;es sous
certaines conditions ; contactez le coordinateur des Linux HOWTO.
<p>En bref, nous souhaitons promouvoir la diss&eacute;mination de cette
information &agrave; travers autant de canaux que possible. N&eacute;ammoins,
nous souhaitons conserver un droit d'auteur sur les documents HOWTO, et
&ecirc;tre avis&eacute;s de tout plan de distribution les concernant.
<p>Si vous avez des questions, veuillez me contacter (cf. supra).
<p>NdT : Le traducteur (Bernard Choppy) se met aussi &agrave; disposition,
soit pour r&eacute;pondre directement, dans la mesure de ses faibles moyens,
&agrave; toute question, soit pour transmettre et traduire, entre l'auteur
et l'interlocuteur francophone. Son adresse est : <a href="../../malto:choppy@imaginet.fr">choppy@imaginet.fr</a>
<br>&nbsp;
<br>&nbsp;
<br>
<br>
<center>
<p><b><font size=+1>1.4 Les raisons qui me poussent &agrave; &eacute;crire
ceci</font></b></center>

<p>Il y a quelques ann&eacute;es, alors que je travaillais pour l'&Eacute;tat
de l'Oklahoma en tant qu'"administrateur Internet", il me fut demand&eacute;
de "mettre l'&Eacute;tat sur Internet", sans m'allouer de budget (note
: il n'existait pas de titre de ce genre &agrave; l'&eacute;poque. J'&eacute;tais
juste le type qui faisait tout le travail). La meilleure mani&egrave;re
de faire en sorte que cela puisse arriver &eacute;tait d'utiliser le plus
possible de logiciel libre et de mat&eacute;riel de r&eacute;cup&eacute;ration.
Linux et un tas de vieux 486 &eacute;taient tout ce que j'avais pour travailler.
<p>Les pare-feux du commerce sont hors de prix et la documentation sur
leur fonctionnement est consid&eacute;r&eacute;e quasiment comme secret-d&eacute;fense.
J'ai d&eacute;couvert que la cr&eacute;ation d'un pare-feu de mon cru &eacute;tait
&agrave; peu pr&egrave;s impossible.
<p>Dans mon travail suivant, il m'a &eacute;t&eacute; demand&eacute; de
mettre en place un pare-feu. Linux venait d'int&eacute;grer le code correspondant.
&Agrave; nouveau sans budget, j'ai commenc&eacute; &agrave; monter un pare-feu
avec Linux. Six mois plus tard, mon pare-feu &eacute;tait en place et ce
document mis &agrave; jour.
<br>&nbsp;
<br>&nbsp;
<br>
<center>
<p><b><font size=+1>1.5 Autres sources d'information</font></b></center>

<p><a href="http://sunsite.unc.edu/mdw/HOWTO/Networking-Overview-HOWTO.html">The
Linux Networking Overview HOWTO</a> ;
<br><a href="http://sunsite.unc.edu/mdw/HOWTO/Ethernet-HOWTO.html">The
Ethernet HOWTO</a> ;
<br><a href="http://www.nerdherd.net/ipchains/">IPchains Firewalling made
Easy!</a> ;
<br><a href="http://www.linas.org/linux/load.html">Linux Network Address
Translation</a> ;
<br><a href="http://sunsite.unc.edu/mdw/HOWTO/NET-3-HOWTO.html">The Net-3
HOWTO</a> ;
<br><a href="http://sunsite.unc.edu/mdw/HOWTO/PPP-HOWTO.html">The NET-PPP
HOWTO</a> ;
<br><a href="http://www.oreilly.com/catalog/tcp2/">TCP/IP Network Administrator's
Guide aux &eacute;ditions O'Reilly and Associates</a> ;
<br><a href="http://www.tis.com/research/software/">The Documentation for
the TIS Firewall Toolkit</a> .
<br>Ces sites web sont des sources d'informations sur le sujet de la s&eacute;curit&eacute;
en g&eacute;n&eacute;ral.
<p><a href="http://okcforum.org/~markg/Secure_Linux/">Secure Linux</a>.
<br>Il s'agit de mon propre site de s&eacute;curit&eacute; sur lequel j'ai
rassembl&eacute; des livres blancs, de la documentation et des programmes
concourant &agrave; la s&eacute;curisation de syst&egrave;mes Unix.
<br>&nbsp;
<p><br>
<center>
<p><b><font size=+1>2. Comprendre les pare-feux</font></b></center>

<p>Un pare-feu est une structure destin&eacute;e &agrave; emp&ecirc;cher
un feu de la traverser. Dans un immeuble, il s'agit d'un mur qui divise
compl&egrave;tement des parties de celui-ci. Dans une voiture, un pare-feu
est une pi&egrave;ce m&eacute;tallique qui s&eacute;pare le moteur du compartiment
passagers.
<br>Les pare-feux Internet sont con&ccedil;us pour isoler votre r&eacute;seau
local priv&eacute; des flammes de l'Internet, ou de prot&eacute;ger la
puret&eacute; des membres de votre r&eacute;seau local en leur interdisant
l'acc&egrave;s aux tentations d&eacute;moniaques de l'Internet. ;-)
<br>Le premier pare-feu informatique &eacute;tait une machine Unix sans
routage avec deux connexions &agrave; deux r&eacute;seaux diff&eacute;rents.
Une carte r&eacute;seau &eacute;tait connect&eacute;e &agrave; Internet
et l'autre au r&eacute;seau priv&eacute;.
<br>Pour atteindre Internet depuis le r&eacute;seau priv&eacute;, il fallait
se loger sur le pare-feu (Unix). Ensuite, on utilisait les ressources de
ce syst&egrave;me pour acc&eacute;der &agrave; Internet. Par exemple, on
pouvait utiliser X-Window pour lancer le navigateur Netscape sur le pare-feu
et en avoir l'affichage sur sa station de travail. Si le navigateur tourne
sur le pare-feu, il a acc&egrave;s aux deux r&eacute;seaux.
<br>Cette sorte de h&ocirc;te &agrave; double r&eacute;seau (un syst&egrave;me
&agrave; deux connexions r&eacute;seau) est bien si l'on peut faire confiance
&agrave; TOUS les utilisateurs. On peut configurer simplement un syst&egrave;me
Linux et y cr&eacute;er un compte pour tout utilisateur souhaitant un acc&egrave;s
&agrave; Internet. Avec cette configuration, le seul ordinateur du r&eacute;seau
priv&eacute; qui connaisse quelque chose du monde ext&eacute;rieur est
le pare-feu proprement dit. Personne ne peut t&eacute;l&eacute;charger
directement sur un poste de travail personnelle il faut d'abord t&eacute;l&eacute;charger
un fichier sur le pare-feu, puis transf&eacute;rer celui-ci du pare-feu
au poste de travail.
<br>NOTE IMPORTANTE : 99% des intrusions commencent par l'obtention d'un
acc&egrave;s utilisateur sur le syst&egrave;me attaqu&eacute;. Pour cette
raison, je ne recommande pas ce type de pare-feu. De plus, il est aussi
extr&ecirc;mement limit&eacute;.
<br>&nbsp;
<p><br>
<center>
<p><b><font size=+1>2.1 Politiques de s&eacute;curit&eacute;</font></b></center>

<p>Il ne faut pas croire qu'un pare-feu soit la panac&eacute;e. Il faut
tout d'abord d&eacute;finir une politique de s&eacute;curit&eacute;.
<br>Les pare-feux sont utilis&eacute;s dans deux buts :
<br>pour maintenir des gens (intrus, vandales...) dehors ;
<br>pour maintenir des gens (employ&eacute;s, enfants...) dedans.
<br>Lorsque j'ai commenc&eacute; &agrave; travailler sur les pare-feux,
j'ai &eacute;t&eacute; surpris d'apprendre que l'entreprise pour laquelle
je travaillais cherchait plus &agrave; "espionner" ses propres employ&eacute;s
qu'&agrave; maintenir les intrus hors de ses r&eacute;seaux.
<br>Au moins dans mon &eacute;tat (l'Oklahoma), les employeurs ont le droit
de surveiller les appels t&eacute;l&eacute;phoniques et l'activit&eacute;
Internet &agrave; condition d'informer pr&eacute;alablement les employ&eacute;s
de cette surveillance (NdT : la l&eacute;gislation fran&ccedil;aise est
identique de ce point de vue).
<br>Big Brother n'est pas le gouvernement. Big Brother est le Big Businness.
<br>Ne me m&eacute;jugez pas : les gens sont au travail pour travailler,
non pour jouer. Et il me semble que l'&eacute;thique du travail est en
train de s'&eacute;roder. N&eacute;anmoins, j'ai aussi observ&eacute; que
certains types de directions se trouvent aussi les principaux transgresseurs
des r&egrave;gles qu'ils ont eux-m&ecirc;mes &eacute;dict&eacute;es. J'ai
vu des vacataires r&eacute;primand&eacute;s car ils avaient utilis&eacute;
Internet pour chercher le trajet de bus pour venir au travail alos que
le m&ecirc;me directeur passait des heures au travail &agrave; chercher
de bons restaurants et bo&icirc;tes de nuit pour y trouver des clients
potentiels.
<br>Mon correctif de ce genre d'abus est de publier les traces du pare-feu
sur une page web accessible &agrave; tout un chacun.
<br>Le travail dans la s&eacute;curit&eacute; peut &ecirc;tre difficile.
Si vous &ecirc;tes gestionnaire de pare-feux, surveillez vos arri&egrave;res.
<br>&nbsp;
<p><br>
<center>
<p><b><font size=+1>2.2 Types de pare-feux</font></b></center>

<p>Il y a deux types de pare-feux :
<br>pare-feux IP ou filtrants - ils bloquent tout le trafic sauf celui
s&eacute;lectionn&eacute; ;
<br>serveurs mandataires (parfois appel&eacute;s bastions) - ils r&eacute;alisent
les connexions r&eacute;seau pour vous.
<br>Pare-feux filtrants
<br>Le filtrage de paquets est le type de pare-feu inclus dans le noyau
Linux.
<br>Un pare-feu filtrant fonctionne au niveau du r&eacute;seau. Les donn&eacute;es
ne sont autoris&eacute;es &agrave; quitter le syst&egrave;me que si les
r&egrave;gles du pare-feu le permettent. Lorsque les paquets arrivent,
ils sont filtr&eacute;s en fonction de leurs type, origine, destination
et port qui sont d&eacute;crits dans chacun de ceux-ci.
<br>De nombreux routeurs comportent un certain nombre de services de type
pare-feu. Les pare-feux filtrants peuvent &ecirc;tre pens&eacute;s comme
des types particuliers de routeurs. Pour cette raison, il faut une profonde
compr&eacute;hension de la structure des paquets IP pour travailler avec
l'un d'eux.
<br>Puisque tr&egrave;s peu de donn&eacute;es sont analys&eacute;es et
trac&eacute;es, les pare-feux filtrants consomment peu de temps processeur
et cr&eacute;ent moins de latence sur un r&eacute;seau.
<br>Les pare-feux filtrants ne fournissent pas de contr&ocirc;le par mot
de passe. Un utilisateur ne peut s'identifier en tant que tel. La seule
identit&eacute; connue pour un utilisateur est l'adresse IP de son poste
de travail. Cela peut &ecirc;tre un probl&egrave;me lorsqu'on souhaite
utiliser DHCP (assignation dynamique d'adresses IP). En effet, les r&egrave;gles
&eacute;tant fond&eacute;es sur les adresses IP, il faut ajuster celles-ci
&agrave; chaque fois que de nouvelles adresses sont assign&eacute;es. Je
ne sais pas comment automatiser ce processus.
<br>Les pare-feux filtrants sont plus transparents pour les utilisateurs.
Ceux-ci n'ont en effet pas &agrave; configurer des r&egrave;gles dans leurs
applications pour utiliser Internet. Ce n'est pas vrai avec la plupart
des serveurs mandataires.
<br>&nbsp;
<p><br>
<center>
<p><b><font size=+1>2.3 Serveurs mandataires</font></b></center>

<p>Le meilleur exemple du fonctionnement de ceux-ci est celui d'une personne
se connectant &agrave; un syst&egrave;me puis, depuis celui-ci, au reste
du monde. C'est seulement avec un serveur mandataire que ce processus est
automatique. Lorsque vous vous connectez &agrave; l'ext&eacute;rieur, le
logiciel client vous connecte en fait d'abord au serveur mandataire. Le
serveur mandataire se connecte alors au serveur que vous cherchez &agrave;
atteindre (l'ext&eacute;rieur) et vous renvoie les donn&eacute;es re&ccedil;ues.
NdT : en fran&ccedil;ais, on utilise souvent le terme "bastion" pour d&eacute;signer
un serveur mandataire situ&eacute; entre le r&eacute;seau local interne
et l'ext&eacute;rieur. Dans le pr&eacute;sent document, on utilisera plut&ocirc;t
le terme bastion pour d&eacute;signer la machine qui porte le serveur mandataire.
<br>Puisque les serveurs mandataires g&egrave;rent toutes les communications,
ils peuvent enregistrer tout ce qu'ils font (donc ce que vous faites).
Pour les mandataires HTTP (web), cela comprend les URL que vous demandez.
Pour les mandataires FTP, cela inclut chaque fichier t&eacute;l&eacute;charg&eacute;.
Ils peuvent m&ecirc;me expurger les mots "inappropri&eacute;s" des sites
que vous visitez ou analyser la pr&eacute;sence de virus.
<br>Les serveurs mandataires d'applications peuvent authentifier des utilisateurs.
Avant qu'une connexion soit r&eacute;alis&eacute;e vers l'ext&eacute;rieur,
le serveur peut demander &agrave; l'utilisateur de se connecter pr&eacute;alablement.
Pour un utilisateur web, cela fonctionnera comme si chaque site requ&eacute;rait
une connexion.
<br>Mandataire SOCKS
<br>Un mandataire SOCKS ressemble beaucoup &agrave; un vieux central t&eacute;l&eacute;phonique
&agrave; fiches. Il interconnecte simplement une machine interne &agrave;
une autre externe.
<br>De nombreux serveurs SOCKS fonctionnent uniquement avec les connexions
de type TCP. De m&ecirc;me, comme les pare-feux filtrants, il ne permettent
pas l'authentification d'utilisateurs. En revanche, ils peuvent enregistrer
la destination de la connexion de chaque utilisateur.
<br>&nbsp;
<p><br>
<center>
<p><b><font size=+1>3. Architecture de pare-feu</font></b></center>

<p>Il existe de nombreuses mani&egrave;res de structurer un r&eacute;seau
pour prot&eacute;ger des syst&egrave;mes &agrave; l'aide d'un pare-feu.
<br>Si l'on dispose de connexions d&eacute;di&eacute;es &agrave; Internet
par un routeur, on peut connecter directement celui-ci au syst&egrave;me
pare-feu. Au contraire, on peut passer par un hub pour permettre un acc&egrave;s
complet aux serveurs &agrave; l'ext&eacute;rieur du pare-feu.
<br>On peut configurer un certain nombre de r&egrave;gles de filtrage mat&eacute;rielles
dans le routeur. N&eacute;anmoins, ce routeur peut &ecirc;tre la propri&eacute;t&eacute;
d'un FAI (fournisseur d'acc&egrave;s Internet), auquel cas on ne dispose
pas du contr&ocirc;le de celui-ci. Il faut demander au FAI d'y inclure
des filtres (NdT : et avoir pleine confiance dans son FAI !).
<center>
<p><img SRC="image1.jpg" height=121 width=569></center>

<p>On peut aussi utiliser un service commut&eacute; comme une ligne RNIS.
Dans ce cas on peut utiliser une troisi&egrave;me carte r&eacute;seau pour
cr&eacute;er une DMZ (De-Militarized Zone, ou "zone d&eacute;militaris&eacute;e")
filtr&eacute;e. Cela donne un contr&ocirc;le total sur les services Internet
et maintient la s&eacute;paration avec le r&eacute;seau local normal.
<center>
<p><img SRC="image2.jpg" height=115 width=397></center>

<p>Si l'on ne fournit pas soi-m&ecirc;me des services Internet mais que
l'on souhaite surveiller o&ugrave; vont les utilisateurs, on voudra utiliser
un serveur mandataire (bastion). Cela peut &ecirc;tre intr&eacute;gr&eacute;
dans le pare-feu.
<center>
<p><img SRC="image3.jpg" height=84 width=398></center>

<p>On peut aussi placer le serveur mandataire sur le r&eacute;seau local.
Dans ce cas, les r&egrave;gles du pare-feu ne doivent autoriser que le
bastion &agrave; se connecter &agrave; Internet pour les services que celui-ci
fournit. Ainsi les utilisateurs ne peuvent acc&eacute;der &agrave; Internet
que par le mandataire.
<center>
<p><img SRC="image4.jpg" height=135 width=425></center>

<p>Si l'on souhaite r&eacute;aliser un service comme ceux de Yahoo! ou
peut-&ecirc;tre SlashDot, on peut souhaiter r&eacute;aliser une architecture
redondante de routeurs et pare-feux (cf. High Availability HOWTO).
<br>En utilisant une technique de DNS &agrave; jeton tournant ou &agrave;
l'aide de serveurs d'application &agrave; &eacute;quilibrage de charge,
on peut cr&eacute;er un service &agrave; 100% de disponibilit&eacute;.
<center>
<p><img SRC="image5.jpg" height=224 width=494></center>

<p>Il est facile de voir corrompre son r&eacute;seau local. Il faut conserver
le contr&ocirc;le de chaque connexion. Il suffit d'un utilisateur avec
un modem pour compromettre tout un r&eacute;seau local.
<br>&nbsp;
<center>
<p><b><font size=+1>4. Configurer le pare-feu filtrant Linux</font></b>
<p><b><font size=+1>4.1 Mat&eacute;riel n&eacute;cessaire</font></b></center>

<p>Les pare-feux filtrants ne n&eacute;cessitent pas de mat&eacute;riel
haut de gamme. Ils ne sont pas grand chose de plus que de simples routeurs.
<br>Tout ce qu'il faut est :
<br>un 486-DX66 avec 16 Mo de m&eacute;moire vive ;
<br>un disque dur de 200 Mo (500 Mo sont tout de m&ecirc;me recommand&eacute;s)
;
<br>des connexions r&eacute;seau (cartes Ethernet, ports s&eacute;rie,
connexions sans fil ?) ;
<br>un moniteur et un clavier.
<br>Avec certains syst&egrave;mes, on peut m&ecirc;me &eacute;liminer le
moniteur et le clavier en utilisant une console sur port s&eacute;rie.
<br>Si l'on a besoin d'un serveur mandataire qui doive g&eacute;rer un
fort trafic, il faut prendre le syst&egrave;me le plus puissant qui soit
possible. En effet, pour chaque utilisateur qui se connectera par le bastion,
il se cr&eacute;era un nouveau processus. Si l'on a 50 utilisateurs simultan&eacute;s
ou plus, je pense qu'il faut :
<br>un Pentium II avec 64 Mo de m&eacute;moire vive ;
<br>un disque dur de 2 Go pour contenir toutes les traces ;
<br>deux connexions r&eacute;seau ;
<br>un moniteur et un clavier.
<br>Les connexions r&eacute;seau peuvent &ecirc;tre de n'importe quel type
(cartes NIC, RNIS ou m&ecirc;me des modems).
<br>&nbsp;
<center>
<p><b><font size=+1>4.2 Logiciel n&eacute;cessaire</font></b></center>

<p>Pare-feu filtrant
<br>Pour cr&eacute;er un pare-feu filtrant, aucun logiciel sp&eacute;cifique
n'est n&eacute;cessaire. Linux suffit.
<br>Si l'on utilise un _TRES_ vieux noyau Linux (1.0.x ou plus ancien),
il faut une copie de ipfwadm (NdT : il faut surtout passer &agrave; un
noyau plus r&eacute;cent, car ces noyaux sont obsol&egrave;tes, et risquent
de plus de contenir des points faibles dont il sera difficile de retrouver
trace).
<br>Si l'on utilise un noyau 2.1.102 ou plus r&eacute;cent, il faut utiliser
un ipchaining comme par exemple celui d&eacute;velopp&eacute; par <a href="http://www.rustcorp.com/linux/ipchains">http://www.rustcorp.com/linux/ipchains</a>.
<br>Serveur mandataire
<br>Si l'on veut configurer un serveur mandataire, il faut l'un des paquetages
suivants :
<br>Squid ;
<br>la bo&icirc;te &agrave; outils TIS Firewall (FWTK) ;
<br>SOCKS.
<br>Squid est un beau paquetage et fonctionne avec la fonctionnalit&eacute;
de Linux de mandataire transparent. Je vais d&eacute;crire comment configurer
ce serveur.
<br>&Agrave; l'heure o&ugrave; j'&eacute;cris ces lignes, Network Associates
&lt;http://www.networkassociates.com/> et Trusted Information System's
(TIS) ont fusionn&eacute;. Il faut donc continuer &agrave; consulter leurs
sites web pour toute information sur les modifications. Dans l'intervalle,
la bo&icirc;te &agrave; outils TIS est toujours disponible sur : &lt;http://www.tis.com/research/software/>.
<br>Trusted Information System fournit une collection de programmes con&ccedil;ue
pour faciliter la gestion de pare-feux. Avec cette bo&icirc;te &agrave;
outils, on configure un daemon pour chaque service (web, telnet, etc.)
qui sera utilis&eacute;.
<br>&nbsp;
<center>
<p><b><font size=+1>5. Pr&eacute;parer le syst&egrave;me Linux</font></b>
<p><b><font size=+1>5.1 Compiler le noyau</font></b></center>

<p>Commencez avec une installation minimale propre de votre distribution
Linux. Moins vous installez de logiciels, moins votre syst&egrave;me aura
de trous de s&eacute;curit&eacute;, portes d&eacute;rob&eacute;es et/ou
bogues susceptibles d'induire des probl&egrave;mes de s&eacute;curit&eacute;
dans votre syst&egrave;me.
<br>Prenez un noyau stable. J'utilise le noyau Linux 2.2.9 ou plus pour
mon syst&egrave;me. La documentation est donc fond&eacute;e sur ces param&egrave;tres.
<br>Vous devez recompiler le noyau Linux avec les options appropri&eacute;es.
Si vous n'avez jamais recompil&eacute; de noyau, je vous renvoie au Kernel
HOWTO, &agrave; l'Ethernet HOWTO et au NET-3 HOWTO.
<br>Voici les param&egrave;tres r&eacute;seau que je sais correspondre
&agrave; quelque chose qui fonctionne. J'en ai signal&eacute; quelques-uns
avec un "?". Si l'on souhaite utiliser cette fonctionnalit&eacute;, il
faut aussi l'activer.
<br>J'utilise "make menuconfig" pour &eacute;diter ma configuration de
noyau.
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; &lt;*> Packet socket</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; [ ] Kernel/User netlink socket</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; [*] Network firewalls</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; [ ] Socket Filtering</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; &lt;*> Unix domain sockets</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; [*] TCP/IP networking</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; [ ] IP: multicasting</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; [*] IP: advanced router</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; [ ] IP: kernel level autoconfiguration</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; [*] IP: firewalling</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; [?] IP: always defragment
(required for masquerading)</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; [?] IP: transparent proxy
support</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; [?] IP: masquerading</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; --- Protocol-specific masquerading
support will be built as modules.</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; [?] IP: ICMP masquerading</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; --- Protocol-specific masquerading
support will be built as modules.</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; [ ] IP: masquerading special
modules support</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; [*] IP: optimize as router
not host</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; &lt; > IP: tunneling</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; &lt; > IP: GRE tunnels over
IP</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; [?] IP: aliasing support</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; [*] IP: TCP syncookie support
(not enabled per default)</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; --- (it is safe to leave these
untouched)</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; &lt; > IP: Reverse ARP</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; [*] IP: Allow large windows
(not recommended if &lt;16Mb of memory)</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; &lt; > The IPv6 protocol (EXPERIMENTAL)</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; ---</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; &lt; > The IPX protocol</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; &lt; > Appletalk DDP</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; &lt; > CCITT X.25 Packet Layer
(EXPERIMENTAL)</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; &lt; > LAPB Data Link Driver
(EXPERIMENTAL)</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; [ ] Bridging (EXPERIMENTAL)</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; [ ] 802.2 LLC (EXPERIMENTAL)</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; &lt; > Acorn Econet/AUN protocols
(EXPERIMENTAL)</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; &lt; > WAN router</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; [ ] Fast switching (read help!)</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; [ ] Forwarding between high
speed interfaces</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; [ ] PU is too slow to handle
full bandwidth</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp; QoS and/or fair queueing&nbsp;
---></font>
<br>Apr&egrave;s avoir r&eacute;alis&eacute; toute la configuration qu'il
vous faut vous devez recompiler, r&eacute;installer le noyau et rebouter.
<br>J'utilise la commande :
<br>make dep;make clean;make bzlilo;make modules;make modules_install;init
6
<br>pour accomplir tout cela en une &eacute;tape.
<br>&nbsp;
<center>
<p><b><font size=+1>5.2 Configurer deux cartes r&eacute;seau</font></b></center>

<p>Si vous avez deux cartes r&eacute;seau dans votre ordinateur, vous devrez
tr&egrave;s certainement ajouter un param&egrave;tre "append" dans votre
fichier /etc/lilo.conf pour d&eacute;crire les IRQ et adresses des deux
cartes. Le mien se pr&eacute;sente ainsi :
<br>append="ether=12,0x300,eth0 ether=15,0x340,eth1"
<br>&nbsp;
<center>
<p><b><font size=+1>5.3 Configurer les adresses r&eacute;seau</font></b></center>

<p>Nous arrivons &agrave; la partie amusante de notre configuration. Je
ne vais pas entrer tr&egrave;s profond&eacute;ment dans les d&eacute;tails
de mise en place d'un r&eacute;seau local. Pour r&eacute;soudre vos probl&egrave;mes
&agrave; ce niveau, vous pouvez vous reporter au Networking-HOWTO.
<br>Votre but est de fournir deux connexions r&eacute;seau &agrave; votre
syst&egrave;me pare-feu filtrant : l'une est Internet (c&ocirc;t&eacute;
dangereux) et l'autre est le r&eacute;seau local (c&ocirc;t&eacute; s&eacute;curis&eacute;).
<br>Dans tous les cas, vous devez prendre quelques d&eacute;cisions :
<br>utiliserez-vous des adresses IP r&eacute;elles ou non pour votre r&eacute;seau
local ?
<br>votre FAI vous assigne-t'il une adresse IP ou utilisez-vous des adresses
IP statiques ?
<br>Puisque nous ne souhaitons pas laisser InterNet acc&eacute;der au r&eacute;seau
priv&eacute;, il n'est pas n&eacute;cessaire d'utiliser des adresses "r&eacute;elles".
On peut toujours choisir des adresse arbitraires pour un r&eacute;eau priv&eacute;,
mais ce n'est pas recommand&eacute; : au cas o&ugrave; des donn&eacute;es
seraient rout&eacute;es en-dehors de celui-ci, elles pourraient arriver
sur un autre syst&egrave;me.
<br>Un certain nombre de plages d'adresses Internet ont &eacute;t&eacute;
laiss&eacute;es de c&ocirc;t&eacute; pour les r&eacute;seaux priv&eacute;s.
Parmi celles-ci, nous utiliserons celles de 192.168.2.xxx pour nos exemples.
<br>Il vous faudra utiliser le masquage IP (IP masquerading) pour permettre
&agrave; cela de fonctionner. Dans ce mode de fonctionnement, le pare-feu
transmet les paquets en les traduisant en adresses IP "r&eacute;elles"
pour leur permettre de voyager sur Internet.
<br>L'utilisation de ces adresses IP non routables rend le r&eacute;seau
priv&eacute; plus s&ucirc;r, car les routeurs Internet ne transmettront
pas les paquets porteurs de ces adresses.
<br>Il peut &ecirc;tre judicieux maintenant de lire le IP Masquerading
HOWTO.
<center>
<p><img SRC="image6.jpg" height=80 width=460></center>

<p>Vous devez assigner l'adresse IP "r&eacute;elle" &agrave; la carte r&eacute;seau
du c&ocirc;t&eacute; Internet. Cette adresse peut vous &ecirc;tre assign&eacute;e
de mani&egrave;re permanente (comme adresse IP statique) ou &agrave; chaque
connexion par le processus PPP.
<br>Vous assignez vos num&eacute;ros IP internes, comme 192.168.2.1 pour
la carte Ethernet du r&eacute;eau local. Il s'agira de votre adresse de
passerelle. Vous pouvez assigner une adresse de la plage 192.168.2.xxx
&agrave; toutes les autres machines du r&eacute;seau prot&eacute;g&eacute;
(soit 192.168.2.2 &agrave; 192.168.2.254).
<br>J'utilise Linux RedHat. Pour configurer le r&eacute;seau lors du d&eacute;marrage,
j'ai ajout&eacute; un fichier "ifcfg-eth1" dans le r&eacute;pertoire /etc/sysconfig/network-scripts.
On peut aussi trouver des fichiers ifcfg-ppp0 ou ifcfg-tr0 dans ce r&eacute;pertoire.
Ces fichiers "ifcfg-" sont utilis&eacute;s par RedHat pour configurer et
activer les p&eacute;riph&eacute;riques r&eacute;seau lors du d&eacute;marrage.
Leur nom est fonction du type de connexion.
<br>Voici l'allure du fichier ifcfg-eth1 (deuxi&egrave;me carte Ethernet)
de notre exemple :
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; DEVICE=eth1</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; IPADDR=192.168.2.1</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; NETMASK=255.255.255.0</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; NETWORK=192.168.2.0</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; BROADCAST=192.168.2.255</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; GATEWAY=199.1.2.10</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ONBOOT=yes</font>
<br>Si vous utilisez une connexion commut&eacute;e, vous devrez consulter
les fichiers ifcfg-ppp0 et chat-ppp0 qui contr&ocirc;lent votre connexion
PPP.
<br>Ce fichier ifcfg peut avoir l'allure suivante :
<br>&nbsp;<font color="#FF0000">&nbsp;&nbsp; DEVICE="ppp0"</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp; ONBOOT="yes"</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp; USERCTL="no"</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp; MODEMPORT="dev/modem"</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp; LINESPEED="115200"</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp; PERSIST="yes"</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp; DEFABORT="yes"</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp; DEBUG="yes"</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp; INITSTRING="ATZ"</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp; DEFROUTE="yes"</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp; HARDFLOWCTL="yes"</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp; ESCAPECHARS="no"</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp; PPPOPTIONS=""</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp; PAPNAME="LoginID"</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp; REMIP=""</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp; NETMASK=""</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp; IPADDR=""</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp; MRU=""</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp; MTU=""</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp; DISCONNECTTIMEOUT=""</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp; RETRYTIMEOUT="5"</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp; BOOTPROTO="none"</font>
<br><font color="#FF0000"></font>&nbsp;<font color="#FF0000"></font>
<center>
<p><b><font size=+1>5.4 Tester votre r&eacute;seau</font></b></center>

<p>Commencer en utilisant les commandes ifconfig et route. Si vous avez
deux cartes r&eacute;seau, votre ifconfig doit ressembler &agrave; :
<br>&nbsp;&nbsp;<font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; #ifconfig</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; lo&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Link encap:Local Loopback</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
inet addr:127.0.0.0&nbsp; Bcast:127.255.255.255&nbsp; Mask:255.0.0.0</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
UP BROADCAST LOOPBACK RUNNING&nbsp; MTU:3584&nbsp; Metric:1</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
RX packets:1620 errors:0 dropped:0 overruns:0</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
TX packets:1620 errors:0 dropped:0 overruns:0</font><font color="#3333FF"></font>
<p><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; eth0&nbsp;&nbsp;&nbsp;
Link encap:10Mbps Ethernet&nbsp; HWaddr 00:00:09:85:AC:55</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
inet addr:199.1.2.10 Bcast:199.1.2.255&nbsp; Mask:255.255.255.0</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
UP BROADCAST RUNNING MULTICAST&nbsp; MTU:1500&nbsp; Metric:1</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
RX packets:0 errors:0 dropped:0 overruns:0</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
TX packets:0 errors:0 dropped:0 overruns:0</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Interrupt:12 Base address:0x310</font><font color="#3333FF"></font>
<p><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; eth1&nbsp;&nbsp;&nbsp;
Link encap:10Mbps Ethernet&nbsp; HWaddr 00:00:09:80:1E:D7</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
inet addr:192.168.2.1&nbsp; Bcast:192.168.2.255&nbsp; Mask:255.255.255.0</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
UP BROADCAST RUNNING MULTICAST&nbsp; MTU:1500&nbsp; Metric:1</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
RX packets:0 errors:0 dropped:0 overruns:0</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
TX packets:0 errors:0 dropped:0 overruns:0</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Interrupt:15 Base address:0x350</font>
<br>et votre table de routage :
<br>&nbsp;<font color="#FF0000">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; #route
-n</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Kernel
routing table</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Destination&nbsp;
Gateway&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Genmask&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Flags MSS&nbsp;&nbsp; Window Use Iface</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 199.1.2.0&nbsp;&nbsp;&nbsp;
*&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 255.255.255.0&nbsp;
U&nbsp;&nbsp;&nbsp;&nbsp; 1500&nbsp; 0&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
15 eth0</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 192.168.2.0&nbsp;
*&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 255.255.255.0&nbsp;
U&nbsp;&nbsp;&nbsp;&nbsp; 1500&nbsp; 0&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
0 eth1</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 127.0.0.0&nbsp;&nbsp;&nbsp;
*&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 255.0.0.0&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
U&nbsp;&nbsp;&nbsp;&nbsp; 3584&nbsp; 0&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
2 lo</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; default&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
199.1.2.10&nbsp;&nbsp; *&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
UG&nbsp;&nbsp;&nbsp; 1500&nbsp; 0&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 72
eth0</font>
<br>&nbsp;
<table BORDER COLS=1 WIDTH="100%" BGCOLOR="#FFCCCC" >
<tr>
<td><b><i>Note:</i></b> 199.1.2.0 est l'adresse du c&ocirc;t&eacute; Internet
du pare-feu et 192.168.2.0 celle du c&ocirc;t&eacute; priv&eacute; (r&eacute;seau
local).
<br>Vous devez commencer par vous assurer que chaque ordinateur de votre
r&eacute;seau local puisse atteindre l'adresse de votre pare-feu (192.168.2.2
dans cet exemple) par ping. Dans le cas contraire, replongez-vous dans
le NET-3 HOWTO et retravaillez un peu votre r&eacute;seau.</td>
</tr>
</table>

<p>Ensuite, essayez d'atteindre un syst&egrave;me Internet depuis le pare-feu.
J'utilise personnellement l'adresse <a href="www.internic.net">www.internic.net</a>
pour mes tests. Si cela ne fonctionne pas, essayez un serveur de votre
FAI. Si cela ne fonctionne toujours pas, il y a un probl&egrave;me quelque
part dans la configuration de votre connexion Internet. Vous devriez pouvoir
atteindre n'importe quel point d'Internet depuis votre pare-feu. Essayez
de v&eacute;rifier la configuration de votre passerelle par d&eacute;faut.
Si vous utilisez une connexion commut&eacute;e, recontr&ocirc;lez votre
nom d'utilisateur et votre mot de passe. Replongez--vous dans le NET-3
HOWTO et essayez encore.
<br>Maintenant, essayez d'atteindre l'adresse ext&eacute;rieure du pare-feu
(199.1.2.10 dans notre exemple) depuis une machine du r&eacute;seau local.
Cela ne doit pas fonctionner. Dans le cas contraire, le masquage IP ou
la transmission IP sont activ&eacute;s ou vous avez d&eacute;j&agrave;
une sorte de filtrage de paquet positionn&eacute;e. D&eacute;sactivez-les
et r&eacute;essayez. Vous devez savoir si le filtrage est en place.
<br>Pour les noyaux post&eacute;rieurs au 2.1.102, vous pouvez utiliser
la commande :
<br>&nbsp;<font color="#008080">&nbsp;&nbsp; echo "0" > /proc/sys/net/ipv4/ip_forward</font>
<br>Si, en revanche, vous utilisez un noyau plus ancien (pourquoi ?), vous
devrez recompiler celui-ci en d&eacute;sactivant la transmission IP (IP
forwarding, mais mettez plut&ocirc;t votre noyau &agrave; jour).
<br>Essayez &agrave; nouveau d'atteindre l'adresse ext&eacute;rieure du
pare-feu (199.1.2.10 dans notre exemple) depuis une machine du r&eacute;seau
local. Cela ne doit pas fonctionner.
<br>Maintenant, activez la transmission IP et/ou le masquage IP. Vous devez
&ecirc;tre &agrave; m&ecirc;me d'atteindre n'importe quel point d'Internet
depuis n'importe quelle machine de votre r&eacute;seau local.
<br>&nbsp;<font color="#008080">&nbsp;&nbsp; echo "0" > /proc/sys/net/ipv4/ip_forward</font>
<br>Note importante : Si vous utilisez des adresses IP "r&eacute;elles"
sur votre r&eacute;seau local (et non 192.168.xxx.yyy) et que vous ne puissisez
atteindre Internet, mais que vous puissiez atteindre le c&ocirc;t&eacute;
ext&eacute;rieur de votre pare-feu, v&eacute;rifiez que votre FAI route
correctement les paquets depuis l'adresse de votre r&eacute;seau priv&eacute;.
<br>Un test de ce probl&egrave;me est de conna&icirc;tre quelqu'un d'autre
sur Internet (un ami utilisant un fournisseur local, par exemple) et de
lui demander d'effectuer un traceroute vers votre r&eacute;seau. Si la
trace s'arr&ecirc;te sur le routeur de votre fournisseur, c'est qu'il ne
transmet pas votre trafic.
<br>&Ccedil;a fonctionne ? Bien. La partie la plus difficile est faite.
:-)
<br>&nbsp;
<center>
<p><b><font size=+1>5.5 S&eacute;curiser le pare-feu</font></b></center>

<p>Le pare-feu n'est d'aucune utilit&eacute; s'il reste largement ouvert
aux attaques. Un "m&eacute;chant" pourrait obtenir l'acc&egrave;s au pare-feu
et le modifier pour ses desseins personnels. Vous devez d&eacute;sactiver
tous les services inutilis&eacute;s.
<br>Regardez dans votre fichier /etc/inetd.conf. Ce fichier contr&ocirc;le
inetd qu'on appelle aussi "super-serveur". Il contr&ocirc;le un tas de
daemons serveurs et les ex&eacute;cute &agrave; la demande, &agrave; partir
des paquets qui arrivent sur un port "bien connu" (well known port).
<br>Vous devez d&eacute;sactiver echo, discard, daytime, chargen, ftp,
gopher, shell, login, exec, talk, ntalk, pop-2, pop-3, netstat, systat,
tftp, bootp, finger, cfinger, time, swat ainsi que linuxconfig si vous
en poss&eacute;dez un.
<br>Pour d&eacute;sactiver un service, placez simplement un "#" (di&egrave;ze)
devant. Ensuite, envoyez un signal SIG-HUP au processus inetd, selon la
syntaxe suivante :
<br><font color="#008080">kill -HUP &lt;pid></font>
<br>o&ugrave; "pid" est le num&eacute;ro du processus inetd. Cela force
inetd &agrave; relire son fichier de configuration (inetd.conf) et &agrave;
se relancer sans arr&ecirc;ter votre syst&egrave;me.
<br>Testez le r&eacute;sultat par telnet sur le port 15 (netstat) du pare-feu.
Si vous obtenez une r&eacute;ponse de netstat, c'est que vous n'avez pas
arr&ecirc;t&eacute; ces services correctement.
<br><font color="#008080">telnet localhost 15</font>
<br>Vous pouvez aussi cr&eacute;er le fichier /etc/nologin. Placez-y quelques
mots (comme "CONNEXION STOPPEE"). Lorsque ce fichier existe, login n'autorise
pas de connexion d'utilisateur. Ceux-ci verront simplement le contenu de
ce fichier et leur connexion sera refus&eacute;e. Seul root peut alors
se loger.
<br>Vous pouvez encore &eacute;diter le fichier /etc/securetty. Si l'utilisateur
est root, la connexion doit s'effectuer depuis l'un des p&eacute;riph&eacute;riques
indiqu&eacute;s dans /etc/securetty. Les &eacute;checs seront trac&eacute;s
par la facilit&eacute; syslog. Avec ces deux contr&ocirc;les actifs, la
seule mani&egrave;re de se connecter sur le pare-feu est de se pr&eacute;senter
comme root sur la console.
<br>&nbsp;
<center>
<p><b><font size=+1>6. Configuration du filtrage IP (IPFWADM)</font></b></center>

<p>Si vous utilisez un noyau 2.1.102 ou sup&eacute;rieur, passez directement
&agrave; la section suivante sur IPCHAINS.
<br>Dans les anciens noyaux, la transmission IP est activ&eacute;e par
d&eacute;faut. Pour cette raison, votre r&eacute;seau doit commencer par
refuser l'acc&egrave;s &agrave; tout et vider toutes les r&egrave;gles
de transmission (ipfw) en place depuis le dernier lancement. Le fragment
de script suivant doit se trouver dans votre script de lancement r&eacute;seau
(en g&eacute;n&eacute;ral, /etc/rc.d/init.d/network) :
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; #</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; #
configuration de la transmission IP et</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; #
de la trace</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; #</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; #&nbsp;&nbsp;
Transmission</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; #</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; #
Par defaut INTERDIRE tous les services</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ipfwadm
-F -p deny</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; #
Vider toutes les regles de trace</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ipfwadm
-F -f</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ipfwadm
-I -f</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ipfwadm
-O -f</font>
<br>Maintenant, nous avons un pare-feu absolu. Rien ne peut passer au travers.
<br>Maintenant, on peut cr&eacute;er le fichier /etc/rc.d/rc.firewall.
Ce script doit autoriser le passage des trafics courrier, web et DNS. ;-)
<br><font color="#FF0000">#!/bin/sh</font>
<br><font color="#FF0000">#</font>
<br><font color="#FF0000"># rc.firewall</font>
<br><font color="#FF0000">#</font>
<br><font color="#FF0000"># Lancement de la bibliotheque de fonctions</font>
<br><font color="#FF0000">. /etc/rc.d/init.d/functions</font><font color="#FF0000"></font>
<p><font color="#FF0000"># Lecture de la configuration</font>
<br><font color="#FF0000">. /etc/sysconfig/network</font><font color="#FF0000"></font>
<p><font color="#FF0000"># On controle que le reseau soit actif</font>
<br><font color="#FF0000">if [ $NETWORKING = "no" ]</font>
<br><font color="#FF0000">then</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; exit
0</font>
<br><font color="#FF0000">fi</font>
<br><font color="#FF0000">case "$1" in</font>
<br><font color="#FF0000">&nbsp; start)</font>
<br><font color="#FF0000">&nbsp; echo -n "Lancement des services du pare-feu
: "</font>
<br><font color="#FF0000">&nbsp; # Autorise le courriel a arriver au serveur</font>
<br><font color="#FF0000">&nbsp; /sbin/ipfwadm -F -a accept -b -P tcp -S
0.0.0.0/0 1024:65535 -D 192.1.2.10 25</font>
<br><font color="#FF0000">&nbsp; # Autorise les connexions aux serveurs
courriel externes</font>
<br><font color="#FF0000">&nbsp; /sbin/ipfwadm -F -a accept -b -P tcp -S
192.1.2.10 25 -D 0.0.0.0/0 1024:65535</font>
<br><font color="#FF0000">&nbsp; # Autorise les connexions a notre serveur
web</font>
<br><font color="#FF0000">&nbsp; /sbin/ipfwadm -F -a accept -b -P tcp -S
0.0.0.0/0 1024:65535 -D 192.1.2.11 80</font>
<br><font color="#FF0000">&nbsp; # Autorise les connexions aux serveurs
web externes</font>
<br><font color="#FF0000">&nbsp; /sbin/ipfwadm -F -a accept -b -P tcp -S
192.1.2.* 80 -D 0.0.0.0/0 1024:65535</font>
<br><font color="#FF0000">&nbsp; # Autorise le trafic DNS</font>
<br><font color="#FF0000">&nbsp; /sbin/ipfwadm -F -a accept -b -P udp -S
0.0.0.0/0 53 -D 192.1.2.0/24</font>
<br><font color="#FF0000">&nbsp; ;;</font>
<br><font color="#FF0000">&nbsp; stop)</font>
<br><font color="#FF0000">&nbsp; echo -n "Arret des services du pare-feu
: "</font>
<br><font color="#FF0000">&nbsp; ipfwadm -F -p deny</font>
<br><font color="#FF0000">&nbsp; ;;</font>
<br><font color="#FF0000">&nbsp; status)</font>
<br><font color="#FF0000">&nbsp; echo -n "Montrez-vous les statistiques
du pare-feu ?"</font>
<br><font color="#FF0000">&nbsp; ;;</font>
<br><font color="#FF0000">&nbsp; restart|reload)</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; $0
stop</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; $0
start</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ;;</font>
<br><font color="#FF0000">&nbsp; *)</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; echo
"Usage: firewall {start|stop|status|restart|reload}"</font>
<br><font color="#FF0000">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; exit
1</font>
<br><font color="#FF0000">esac</font>
<br><font color="#FF0000"></font>&nbsp;
<table BORDER COLS=1 WIDTH="100%" BGCOLOR="#FFCCCC" >
<tr>
<td><b><i>Note:</i></b> Dans cet exemple, nous avons un serveur courriel
(SMTP) qui tourne sur 192.1.2.10 qui doit &ecirc;tre capable d'envoyer
et recevoir des paquets sur le port 25. Le serveur web tourne sur 192.1.2.11.
Nous autorisons quiconque sur le r&eacute;seau local &agrave; acc&eacute;der
aux serveurs web externes ainsi qu'aux serveurs DNS.</td>
</tr>
</table>
<font color="#FF0000"></font>
<p>Cet exemple n'est pas parfaitement s&eacute;curis&eacute;. Puisque le
port 80 n'est pas obligatoirement utilis&eacute; comme port web, un intrus
rus&eacute; pourrait utiliser celui-ci pour cr&eacute;er un r&eacute;seau
priv&eacute; virtuel (VPN : virtual private network) au-travers du pare-feu.
Pour contourner cela, il faut configurer un mandataire web, et n'autoriser
que celui-ci &agrave; traverser le pare-feu. Les utilisateurs du r&eacute;seau
local devront alors passer par le mandataire pour atteindre les serveurs
web ext&eacute;rieurs.
<br>On peut aussi s'int&eacute;resser &agrave; la surveillance du trafic
qui passe au-travers du pare-feu. Le script qui suit compte chaque paquet.
On peut ajouter une ou deux lignes pour compter les paquets qui vont vers
un syst&egrave;me particulier.
<br><font color="#3333FF">&nbsp; # Flush the current accounting rules</font>
<br><font color="#3333FF">&nbsp; ipfwadm -A -f</font>
<br><font color="#3333FF">&nbsp; # Accounting</font>
<br><font color="#3333FF">&nbsp; /sbin/ipfwadm -A -f</font>
<br><font color="#3333FF">&nbsp; /sbin/ipfwadm -A out -i -S 192.1.2.0/24
-D 0.0.0.0/0</font>
<br><font color="#3333FF">&nbsp; /sbin/ipfwadm -A out -i -S 0.0.0.0/0 -D
192.1.2.0/24</font>
<br><font color="#3333FF">&nbsp; /sbin/ipfwadm -A in -i -S 192.1.2.0/24
-D 0.0.0.0/0</font>
<br><font color="#3333FF">&nbsp; /sbin/ipfwadm -A in -i -S 0.0.0.0/0 -D
192.1.2.0/24</font>
<br>Si tout ce que vous cherchez est un pare-feu filtrant, vous pouvez
vous arr&ecirc;ter ici. Testez-le et amusez-vous bien :-)
<br>&nbsp;
<center>
<p><b><font size=+1>7. Configuration du filtrage IP (IPchains)</font></b></center>

<p>Les ipchains Linux sont une r&eacute;&eacute;criture du code pare-feu
IPv4 de Linux (en grande partie inspir&eacute; de BSD) ainsi que de ipfwadm
qui &eacute;tait lui-m&ecirc;me une r&eacute;&eacute;criture du ipfw de
BSD, je crois. Il est indispensable d'administrer les filtres de paquets
IP dans les noyaux Linux versions 2.1.102 et au-del&agrave;.
<br>L'ancien code ne g&egrave;re pas les fragments, a des compteurs sur
32 bits (sur Intel en tout cas), ne permet aucune autre sp&eacute;cification
de protocole que TCP, UDP ou ICMP, ne peut r&eacute;aliser de vastes modifications
de mani&egrave;re atomique, ne peut sp&eacute;cifier de r&egrave;gles invers&eacute;es,
a quelques d&eacute;fauts et peut se r&eacute;v&eacute;ler dur &agrave;
administrer (ce qui le rend vuln&eacute;rable aux erreurs d'utilisation).
Ou du moins c'est ce qu'en dit l'auteur.
<br>Je ne vais pas entrer en d&eacute;tail sur la mani&egrave;re de contr&ocirc;ler
un pare-feu IPchains, car il existe un _BON !!_ HOWTO qui en parle sur
<a href="http://www.rustcorp.com/linux/ipchains/HOWTO.html">http://www.rustcorp.com/linux/ipchains/HOWTO.html</a>.
Je finirais juste par le recopier ici. En voici les bases.
<br>On travaille avec les cha&icirc;nes par noms. Il existe au d&eacute;but
trois cha&icirc;nes pr&eacute;d&eacute;finies input, output et forward,
qu'il est impossible de supprimer. On peut cr&eacute;er des cha&icirc;nes
personnelles. Des r&egrave;gles peuvent ensuite &ecirc;tre ajout&eacute;es
et supprim&eacute;es de ces ensembles de r&egrave;gles.
<br>Les op&eacute;rations n&eacute;cessaires pour travailler sur les cha&icirc;nes
sont les suivantes :
<br>cr&eacute;ation d'une nouvelle cha&icirc;ne (-N) ;
<br>suppression d'une cha&icirc;ne vide (-X) ;
<br>modification de la sp&eacute;cification pour une cha&icirc;ne pr&eacute;d&eacute;finie
(-P)
<br>liste des r&egrave;gles d'une cha&icirc;ne (-F) ;
<br>remise &agrave; z&eacute;ro des compteurs de paquets et d'octets de
toutes les r&egrave;gles d'une cha&icirc;ne (-Z).
<br>Il existe diff&eacute;rentes m&eacute;thodes pour manipuler les r&egrave;gles
&agrave; l'int&eacute;rieur des cha&icirc;nes :
<br>ajout d'une nouvelle r&egrave;gle dans une cha&icirc;ne (-A) ;
<br>insertion d'une nouvelle r&egrave;gle &agrave; une position donn&eacute;e
d'une cha&icirc;ne (-I) ;
<br>remplacement d'une r&egrave;gle &agrave; une position donn&eacute;e
d'une cha&icirc;ne (-R) ;
<br>suppression d'une r&egrave;gle &agrave; une position donn&eacute;e
d'une cha&icirc;ne (-D) ;
<br>suppression de la premi&egrave;re r&egrave;gle correspondante dans
une cha&icirc;ne (-D).
<br>Il existe quelques op&eacute;rations pour le masquage qui se trouvent
dans ipchains dans l'attente d'un bon emplacement pour les placer :
<br>liste des connexions actuellement masqu&eacute;es (-M -L) ;
<br>positionnement du temps d'expiration du masquage (-M -S).
<br>Il y a quelques d&eacute;tails de chronologie qui interviennent dans
la modification des r&egrave;gles de pare-feu. Si l'on n'est pas suffisamment
prudent, il est possible de laisser passer quelques paquets pendant la
mise en place des modifications. Une approche simpliste est la suivante
:
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp; # ipchains -I input
1 -j DENY</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp; # ipchains -I output
1 -j DENY</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp; # ipchains -I forward
1 -j DENY</font>
<br>... r&eacute;alisation des modification ...
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp; # ipchains -D input
1</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp; # ipchains -D output
1</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp; # ipchains -D forward
1</font>
<br><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp; #</font>
<br>Cela interdit tout passage de paquet durant les modifications.
<br>Voici une copie des r&egrave;gles de pare-feu qui pr&eacute;c&egrave;dent
dans IPChains :
<br><font color="#FF0000">#!/bin/sh</font>
<br><font color="#FF0000">#</font>
<br><font color="#FF0000"># rc.firewall</font>
<br><font color="#FF0000">#</font>
<br><font color="#FF0000">## Tout vider et repartir du debut</font>
<br><font color="#FF0000">&nbsp; /sbin/ipchains -F input</font>
<br><font color="#FF0000">&nbsp; /sbin/ipchains -F output</font>
<br><font color="#FF0000">&nbsp; /sbin/ipchains -F forward</font><font color="#FF0000"></font>
<p><font color="#FF0000">## Redirection pour le mandatement transparent
de HTTP</font>
<br><font color="#FF0000">&nbsp; #$IPCHAINS&nbsp; -A input -p tcp -s 192.1.2.0/24
-d 0/0 80 -j REDIRECT 8080</font><font color="#FF0000"></font>
<p><font color="#FF0000">## Creation de nos propres chaines</font>
<br><font color="#FF0000">&nbsp; /sbin/ipchains -N ma-chaine</font>
<br><font color="#FF0000">&nbsp; # On autorise le courriel entrant vers
le serveur</font>
<br><font color="#FF0000">&nbsp; /sbin/ipchains -A ma-chaine -s 0.0.0.0/0
smtp -d 192.1.2.10 1024:-j ACCEPT</font>
<br><font color="#FF0000">&nbsp; # On autorise les connexions courriel
vers l'ext&eacute;rieur</font>
<br><font color="#FF0000">&nbsp; /sbin/ipchains -A ma-chaine -s 192.1.2.10
-d 0.0.0.0/0 smtp -j ACCEPT</font>
<br><font color="#FF0000">&nbsp; # On autorise les connexions web entrantes
vers le serveur</font>
<br><font color="#FF0000">&nbsp; /sbin/ipchains -A ma-chaine -s 0.0.0.0/0
www -d 192.1.2.11 1024: -j ACCEPT</font>
<br><font color="#FF0000">&nbsp; # On autorise les connexions web vers
l'ext&eacute;rieur</font>
<br><font color="#FF0000">&nbsp; /sbin/ipchains -A ma-chaine -s 192.1.2.0/24
1024: -d 0.0.0.0/0 www -j ACCEPT</font>
<br><font color="#FF0000">&nbsp; # On autorise le trafic DNS</font>
<br><font color="#FF0000">&nbsp; /sbin/ipchains -A ma-chaine -p UDP -s
0.0.0.0/0 dns -d 192.1.2.0/24 -j ACCEPT</font><font color="#FF0000"></font>
<p><font color="#FF0000">## Si on utilise le masquage</font>
<br><font color="#FF0000">&nbsp; # On ne masque pas le trafic interne</font>
<br><font color="#FF0000">&nbsp; /sbin/ipchains -A forward -s 192.1.2.0/24
-d 192.1.2.0/24 -j ACCEPT</font>
<br><font color="#FF0000">&nbsp; # On ne masque pas l'interface externe
directe</font>
<br><font color="#FF0000">&nbsp; /sbin/ipchains -A forward -s 199.1.2.0/24
-d 0/0 -j ACCEPT</font>
<br><font color="#FF0000">&nbsp; # On masque tout paquet interne qui sort</font>
<br><font color="#FF0000">&nbsp; /sbin/ipchains -A forward -s 192.1.2.0/24
-d 0/0 -j MASQ</font><font color="#FF0000"></font>
<p><font color="#FF0000">## On interdit tout le reste</font>
<br><font color="#FF0000">&nbsp; /sbin/ipchains -P my-chains input DENY</font>
<br>Il ne faut pas s'arr&ecirc;ter l&agrave;. Ce n'est pas un pare-feu
tr&egrave;s puissant et je suis s&ucirc;r qu'il y a d'autres services que
vous souhaiteriez fournir. &Agrave; nouveau, lisez le IPCHAINS-HOWTO.
<br>&nbsp;
<center>
<p><b><font size=+1>8. Rendre le tout plus simple</font></b></center>

<p>Il existe des interfaces graphiques ou fond&eacute;es sur le web d&eacute;velopp&eacute;es
pour fonctionner avec les r&egrave;gles de filtrage Linux. Un certain nombre
d'entreprises ont m&ecirc;me cr&eacute;&eacute; des pare-feux commerciaux
fond&eacute;s sur Linux en le pla&ccedil;ant dans leur propre machine avec
leur propre code de management (joli).
<br>gfcc (GTK+ Firewall Control Center) est une application GTK+ capable
de contr&ocirc;ler les principes et r&egrave;gles de filtrage de Linux,
fond&eacute;e sur le paquetage ipchains. Rendez-vous sur &lt;http://megaman.ypsilonia.net/kfirewall/>.
<br>FCT est un outil HTML de configuration de pare-feu. Il permet la g&eacute;n&eacute;ration
automatique de scripts de commandes de filtrage IP (ipfwadm) sur un pare-feu
pour des interfaces multiples et tout service internet <a href="http://www.fen.baynet.de/~ft114/FCT/firewall.htm">http://www.fen.baynet.de/~ft114/FCT/firewall.htm</a>
<br>&nbsp;
<br>&nbsp;
<p>Voil&agrave;, c'est ici que s'arr&ecirc;te cet int&eacute;ressant et
populaire HOWTO sur les firewalls sous linux. Ce n'est pas moi qui l'ai
&eacute;crit, je me suis juste occup&eacute; de la mise en forme. Donc
pour tout commentaires regardez les r&eacute;f&eacute;rences au d&eacute;but.
</body>
</html>
