<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Clad Strife">
   <meta name="GENERATOR" content="Mozilla/4.61 [en] (Win98; I) [Netscape]">
   <title>Protocoles d'authetification</title>
</head>
<body text="#000000" bgcolor="#FFF5F0" link="#0000EE" vlink="#551A8B" alink="#FF0000">
<body>

<center><b><tt><font size=+2>S&eacute;curit&eacute; r&eacute;seau : les
protocoles d'authentification</font></tt></b>
<br><b><font face="Verdana"><font size=-2>(Source guill.net)</font></font></b></center>

<p><br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<p><b><font size=+1>Introduction</font></b>
<p>D&eacute;tecter les intrusions permet de limiter les incidents. Les
techniques de d&eacute;tection d'intrusions et d'authentification se perfectionnent
pour fortifier le syst&egrave;me d'information. Dans l'&eacute;ternel combat
entre les pirates et les cr&eacute;ateurs de syst&egrave;mes de s&eacute;curit&eacute;,
les progr&egrave;s de l'un sont toujours suivis, voire pr&eacute;c&eacute;d&eacute;s,
par ceux de l'autre. Et dans le cas des syst&egrave;mes d'information,
les exploits des pirates, s'ils ne constituent que la partie &eacute;merg&eacute;e
de l'iceberg des incidents qui proviennent des tentatives d'intrusion (tent&eacute;es
ou r&eacute;ussies), sont autant de signaux d'alarme qu'il convient de
prendre au s&eacute;rieux. La mise en place d'un syst&egrave;me de s&eacute;curit&eacute;
doit donc faire l'objet d'une strat&eacute;gie globale et d'une politique
rigoureuse de d&eacute;finition et d'application des mesures de s&eacute;curit&eacute;.
L’authentification fait partie de ces mesures de s&eacute;curit&eacute;.
Elle consiste &agrave; apporter la preuve de l’identit&eacute; d’un utilisateur
sur un r&eacute;seau informatique.
<p><b><font size=+1>Quand faut-il authentifier?</font></b>
<p>L’authentification des utilisateurs intervient :
<br>- Sur un r&eacute;seau local
<br>- Sur un r&eacute;seau &eacute;tendu local client-serveur de type Intranet
<br>- Sur un r&eacute;seau Internet pour acc&eacute;der &agrave; des parties
confidentielles ou payantes des sites web.
<br>- Sur un r&eacute;seau local client-serveur classique : Windows NT,
Novell Netware.
<br>- Sur un r&eacute;seau &eacute;tendu avec acc&egrave;s distant : Windows
NT RAS (Remote Access Service)
<br>- Acc&egrave;s &agrave; des serveurs confidentiels ou payants, t&eacute;l&eacute;service
bancaire, ordre de bourse, commerce &eacute;lectronique, EDI, etc.
<p><b><font size=+1>Fonctionnement des protocoles d'authentification</font></b>
<p>Les protocoles d’authentification ont chacun leur propre mani&egrave;re
d’authentifier un utilisateur ou une machine. Ils utilisent diff&eacute;rent
algorithmes, diff&eacute;rentes techniques. Cependant, tous ont quasiment
le m&ecirc;me principe de fonctionnement qui est &agrave; base de cl&eacute;s.<b><font size=+1></font></b>
<p><b><font size=+1>Empreinte et int&eacute;grit&eacute; d’un message</font></b>
<p><b>Empreinte</b>
<p>Il s’agit de g&eacute;n&eacute;rer l’empreinte d’un message afin de
certifier que le contenu de celui-ci n’a pas &eacute;t&eacute; modifi&eacute;.
Il s’agit en fait d’une somme de contr&ocirc;le obtenue par un calcul num&eacute;rique.
<br>Il existe diff&eacute;rents algorithmes certifi&eacute;s tels que MD2,
MD4, MD5 ou SHA1.
<br>Ce sont g&eacute;n&eacute;ralement des fonctions de hachages. Pour
qu’un tel algorithme soit efficace, il faut que la probabilit&eacute; d’obtenir
une m&ecirc;me empreinte &agrave; partir de deux documents diff&eacute;rents
soit minimale.
<p><b>Int&eacute;grit&eacute; d’un message</b>
<p>Cette empreinte ainsi obtenue est crypt&eacute;e par l’&eacute;metteur
&agrave; l’aide de sa clef priv&eacute;e, et ajout&eacute;e au message.
<br>A la r&eacute;ception, le destinataire r&eacute;alise la m&ecirc;me
empreinte et d&eacute;crypte l’empreinte envoy&eacute;e &agrave; l’aide
de la clef publique de l’&eacute;metteur. Si les deux empreintes sont &eacute;gales,
le destinataire peut &ecirc;tre sur de l’int&eacute;grit&eacute; du message
et de son &eacute;metteur. (&agrave; condition d’&ecirc;tre sur de la relation
Clef publique/&eacute;metteur)
<p><i>Avantages : </i>Le destinataire est sur de l'int&eacute;grit&eacute;
du message et de son origine.
<br>Inconv&eacute;nients : Le destinataire doit poss&eacute;der de mani&egrave;re
fiable la clef publique de l'&eacute;metteur.
<p><b><font size=+1>Certificats</font></b>
<p><b>Principe</b>
<p>Un Certificat est un document &eacute;lectronique attestant qu’une clef
publique appartient r&eacute;ellement &agrave; un individu ou &agrave;
une organisation.
<br>Les certificats sont d&eacute;livr&eacute;s par des autorit&eacute;s
de certification. Elles sont appel&eacute;es CAs (Certificates Authorities).
<br>L’entit&eacute; contacte une de ces autorit&eacute;s et lui transmet
sa clef publique. L’autorit&eacute; v&eacute;rifie les informations : identit&eacute;
de l’individu, propri&eacute;taire de la clef, etc.; et d&eacute;livre
un certificat attestant la relation entre le propri&eacute;taire et sa
clef publique. L’entit&eacute; peut ainsi distribuer son certificat librement
et sans risque.
<br>Serveurs et clients peuvent utiliser les certificats lorsqu’ils &eacute;tablissent
une connexion afin de pouvoir s’authentifier ; cela &eacute;vite le transfert
d’un secret du type "login/password ".
<br>Les certificats peuvent ainsi remplacer les multiples mot de Passe.
Il est ainsi possible de configurer tous les serveurs d’une entreprise
de mani&egrave;re &agrave; ce que le client n’ait qu’&agrave; retenir le
mot de passe d&eacute;bloquant sa clef secr&egrave;te.
<br>Avantages : Il est possible de transmettre une clef publique en authentifiant
son propri&eacute;taire.
<br>Inconv&eacute;nients : Tous les destinataires doivent faire confiance
&agrave; l’autorit&eacute; de certification.
<p><b>Contenu d’un certificat</b>
<p>Le format d’un certificat te que d&eacute;finit par le standard X.509
est constitu&eacute; de 2 parties :
<p><u>Donn&eacute;es du Certificat (partie une) :</u>
<br>1.1 : Num&eacute;ro de version X.509 pour la compatibilit&eacute; avec
de futures versions
<br>1.2 : Num&eacute;ro de s&eacute;rie du certificat. Tous les certificats
issus d’une m&ecirc;me autorit&eacute; de certification (CA) doivent avoir
un num&eacute;ro de s&eacute;rie diff&eacute;rent.
<br>1.3 : Algorithme de signature utilis&eacute; par l’autorit&eacute;
de certification (CA).
<br>1.4 : Le Nom Complet (Distinguished Name) de l’autorit&eacute; (CA)
qui est &agrave; l’origine de ce certificat. Ex : CN=CertificateServer01,
O=phenix-informatique, C=fr
<br>1.5 : La p&eacute;riode durant laquelle le certificat est valide.
<br>1.6 : Le Nom Complet (Distinguished Name) de l’entit&eacute; certifi&eacute;e.
Ex : CN=job, OU=techniques, O=phenix-informatique, C=fr
<br>1.7 : L’algorithme de clef publique de l’entit&eacute; certifi&eacute;e.
<br>1.8 : La clef publique de l’entit&eacute; certifi&eacute;e.
<p><u>Validit&eacute; du Certificat (partie deux) :</u>
<br>2.1 : La signature des donn&eacute;es ci-dessus par l’autorit&eacute;
de certification (CA).
<br>2.2 : L’algorithme de signature utilis&eacute;e par l’autorit&eacute;
de certification (CA).
<p><b>Exemple de certificat</b>
<p>Ex : Certificat personnel Verisign
<br>"
<br>This Certificate belongs to:
<br>Olivier GROSJEANNE
<br>job@phenix-informatique.fr
<br>Digital ID Class 1 - Netscape
<br>Persona Not Validated
<br>www.verisign.com/repository/RPA Incorp.
<br>by Ref.,LIAB.LTD(c)98
<br>VeriSign Trust Network
<br>VeriSign, Inc.
<br>This Certificate was issued by:
<br>VeriSign Class 1 CA Individual
<br>Subscriber-Persona Not Validated
<br>www.verisign.com/repository/RPA Incorp.
<br>By Ref.,LIAB.LTD(c)98
<br>VeriSign Trust Network
<br>VeriSign, Inc.
<p>Serial Number: 44:E1:C5:AE:F4:AB:79:2F:31:35:30:93:8E:0B:25:C1
<br>This Certificate is valid from Tue Nov 17, 1998 to Sun Jan 17, 1999
<br>Certificate Fingerprint:1C:D5:A2:33:CD:4D:F9:62:55:4C:1D:80:82:80:30:9E
<br>"
<p><b>V&eacute;rification d’un certificat</b>
<p>Le destinataire du certificat fait confiance &agrave; l’autorit&eacute;
de certification :
<br>- Il poss&egrave;de donc la clef publique de l’autorit&eacute; de certification.
<br>- Il r&eacute;alise l’empreinte des donn&eacute;es du certificat.
<br>- Il d&eacute;code l’emprunte transmise &agrave; l’aide de la clef
publique de l’autorit&eacute; de certification.
<br>- Il compare les deux r&eacute;sultats.
<p><b><font size=+1>Les principaux protocoles d'authentification</font></b>
<p><b>RADIUS (Remote Authentication Dial-In User Service)</b>
<p><u>Fonctionnalit&eacute;s de RADIUS :</u>
<p>- Le protocole RADIUS fonctionne selon un mod&egrave;le client/serveur.
<br>- Un NAS (Network Access Server) fonctionne comme un client RADIUS.
Un client effectue des requ&egrave;tes RADIUS et agit en fonction des r&eacute;ponses
re&ccedil;ues.
<br>- Un serveur RADIUS peut agir en tant que proxy RADIUS pour d'autres
serveurs RADIUS, ainsi que pour d'autres syst&egrave;mes d'authentifications.
<br>- Toutes les transactions RADIUS sont authentifi&eacute;es par l'utilisation
d'un secret qui n'est jamais transmis sur le r&eacute;seau. De plus les
mots de passe sont encrypt&eacute;s en utilisant cette m&ecirc;me cl&eacute;
secrete.
<p>RADIUS utilise le protocole UDP.
<p><b>CHAP (Challenge-Handshake Authentication Protocol)</b>
<p><u>Fonctionnalit&eacute;s de CHAP :</u>
<p>- CHAP est une proc&eacute;dure plus s&eacute;curis&eacute;e pour se
relier &agrave; un syst&egrave;me que le proc&eacute;d&eacute; d'authentification
de mot de passe PAP.
<br>- Fonctionnement (Authentification en mode d&eacute;fi-r&eacute;ponse)
:
<br>&nbsp;&nbsp;&nbsp; - Apr&egrave;s que le lien soit fait, le serveur
envoie un message au demandeur de connexion.&nbsp; Le demandeur r&eacute;pond
avec une valeur obtenue en utilisant une fonction &agrave; sens unique
d'informations parasites.
<br>&nbsp;&nbsp;&nbsp; - Le serveur contr&ocirc;le la r&eacute;ponse en
la comparant &agrave; son propre calcul de la valeur pr&eacute;vue d'informations
parasites.
<br>&nbsp;&nbsp;&nbsp; - Si les valeurs s'assortissent, l'authentification
est reconnue;&nbsp; autrement la connexion est termin&eacute;e.&nbsp; &Agrave;
tout moment, le serveur peut inviter la partie reli&eacute;e pour envoyer
un nouveau message. Puisque des identificateurs de CHAP sont chang&eacute;s
fr&eacute;quemment et parce que l'authentification peut &ecirc;tre demand&eacute;e
par le serveur &agrave; tout moment, CHAP fournit plus de s&eacute;curit&eacute;
que PAP.
<p><b>PAP (Password Authentication Protocol)</b>
<p><u>Fonctionnalit&eacute;s de PAP :</u>
<p>- PAP est un protocole bidirectionnel simultan&eacute; pour les paquets
de transfert entre les parties dans un r&eacute;seau. PAP comprend l’ordonnan&ccedil;ant
de donn&eacute;es, le contr&ocirc;le d'&eacute;coulement, la responsabilit&eacute;,
et la d&eacute;tection et reprise d'erreur.
<br>- PAP est un proc&eacute;d&eacute; employ&eacute; par des serveurs
de PPP pour valider une demande de connexion.&nbsp; Le PAP fonctionne comme
suit:
<br>- Apr&egrave;s que le lien soit &eacute;tabli, le demandeur envoie
un mot de passe et une identification au serveur.
<br>- Le serveur valide la demande et renvoie un accus&eacute; de r&eacute;ception,
termine la connexion, ou offre au demandeur une autre chance.&nbsp; Des
mots de passe sont envoy&eacute;s sans s&eacute;curit&eacute; et le cr&eacute;ateur
peut faire des tentatives r&eacute;p&eacute;t&eacute;es d'acc&egrave;s.&nbsp;
Pour ces raisons, un serveur qui comprend CHAP offrira d’utiliser ce&nbsp;
protocole avant d'utiliser PAP.
<p><b>TACACS (Terminal Access Controller Access Control System)</b><u></u>
<p><u>Fonctionnalit&eacute;s de TACACS :</u>
<p>- TACACS est un protocole d'authentification plus ancien, commun aux
r&eacute;seaux d’Unix qui permet &agrave; un serveur d'acc&egrave;s &agrave;
distance d'exp&eacute;dier le mot de passe de la proc&eacute;dure de connexion
d'un utilisateur &agrave; un serveur d'authentification pour d&eacute;terminer
si on peut permettre l'acc&egrave;s &agrave; un syst&egrave;me donn&eacute;.&nbsp;
TACACS est un protocole non cod&eacute; et donc moins s&eacute;curis&eacute;
que les protocoles post&eacute;rieurs de TACACS et de RADIUS.
<br>- Une version post&eacute;rieure de TACACS est TACACS+ (TACACS &eacute;tendu).
Malgr&eacute; son nom, TACACS+ est un protocole enti&egrave;rement nouveau.&nbsp;
TACACS et RADIUS ont g&eacute;n&eacute;ralement remplac&eacute;&nbsp; les
protocoles pr&eacute;c&eacute;dents dans les r&eacute;seaux plus r&eacute;cemment
&eacute;tablis.
<br>- TACACS utilise TCP. Quelques administrateurs recommandent d'utiliser
TACACS parce que TCP est vu comme un protocole plus fiable. De plus, alors
que RADIUS combine l'authentification et l'autorisation dans un profil
d'utilisateur, TACACS quant &agrave; lui s&eacute;pare les deux. TACACS
et TACACS+ fonctionnent toujours sur beaucoup de syst&egrave;mes anciens.
<p><b>SecurID</b>
<p>SecurID permet, en une seule &eacute;tape, d’identifier avec certitude
les utilisateurs du syst&egrave;me et du r&eacute;seau afin d'interdire
tout acc&egrave;s illicite. Utilis&eacute; avec des modules de contr&ocirc;le
d’acc&egrave;s (ACM) logiciels ou mat&eacute;riels d&eacute;di&eacute;s,
SecurID g&eacute;n&egrave;re un nouveau code d’acc&egrave;s impr&eacute;visible
toutes les soixante secondes.
<p><u>Caract&eacute;ristiques principales:</u>
<p>- Proc&eacute;dure ais&eacute;e en une seule &eacute;tape, garantissant
l’authentification certaine des utilisateurs.
<br>- Pr&eacute;vention des acc&egrave;s non-autoris&eacute;s aux ressources
d’information de l’organisation Authentification des utilisateurs au niveau
du r&eacute;seau, du syst&egrave;me, des applications ou des transactions.
<br>- G&eacute;n&eacute;ration de codes d’acc&egrave;s &agrave; usage unique,
impr&eacute;visibles et renouvel&eacute;s automatiquement toutes les soixante
secondes.
<br>- Fonctionnement sur modules de contr&ocirc;le d’acc&egrave;s assurant
la s&eacute;curit&eacute; multi plate-forme de l’entreprise.
<p><b>Authentification Header dans IPSec</b>
<p><i>Probl&egrave;me: </i>Les paquets IP (adresse + contenu) sont "faciles"
&agrave; falsifier
<br><i>Solution: </i>Rajouter une ent&ecirc;te d'authentification cryptographique
(Authentication Header - AH) pour permettre d’authentifier la provenance
des paquets et obtenir :
<br>- Authentification de la source du paquet (adresse IP authentique)
<br>- Int&eacute;grit&eacute; du contenu
<br>- L'authentification se fait normalement de bout en bout m&ecirc;me
si une authentification faisant intervenir des syst&egrave;mes interm&eacute;diaires
est possible
<br>- Porte sur l'ensemble du paquet IP (ent&ecirc;te + donn&eacute;es)
except&eacute; sur les enregistrements modifi&eacute;s en cours de route
("hop count", "time to live", etc.)
<br>- Un paquet contenant un AH peut &ecirc;tre trait&eacute; par tous
les intervenants d'un r&eacute;seau IP m&ecirc;me s'ils ne le "comprennent"
pas (compatibilit&eacute; vers l'arri&egrave;re)
<br>- Pour g&eacute;n&eacute;rer un AH valide il faut que chaque syst&egrave;me
soit muni d'une (ou plusieurs) cl&eacute;s et qu'il soit en mesure de valider
les AH g&eacute;n&eacute;r&eacute;s par les autres intervenants
<br>&nbsp;
<p><b><font size=+1>Quelques logiciels d'authentification</font></b>
<p>X.COD Authentification
<p><u>Services rendus / fonctionnalit&eacute;s :</u>
<p>- Authentification par possession d’un support d’identification et par
connaissance d’un code confidentiel.
<br>- Authentification de l’utilisateur et pas seulement de son PC.
<br>- Authentification en mode d&eacute;fi-r&eacute;ponse (cf CHAP) avec
cl&eacute; d’authentification &agrave; usage unique.
<br>- Absence d’investissement suppl&eacute;mentaire pour les PC reli&eacute;s
au r&eacute;seau : ni lecteur de carte &agrave; puce, ni d&eacute;codeur
analogique ou num&eacute;rique, ni calculette, etc…
<br>- Mise en œuvre simple et rapide du d&eacute;ploiement aupr&egrave;s
des utilisateurs : aucun logiciel &agrave; installer sur le poste client.
<br>- Faible contrainte pour l’utilisateur : interface minimum permettant
la saisie du code confidentiel.
<br>- Suivi individualis&eacute; de tous les utilisateurs autoris&eacute;s.
<br>- Co&ucirc;t unitaire par utilisateur le plus faible du march&eacute;.
<br>- Technologie brevet&eacute;e au niveau international.
<p><u>Co&ucirc;t :</u>
<p>- Module de base X.COD authentification : 29500 F HT
<br>- Module de base optionnel X.COD authentification administration :
8500 F HT
<br>- Installation, mise en œuvre et formation : de 1 &agrave; 3 jours,
7000 F HT/jour.
<p><b>Kerberos</b>
<p>Kerberos est un service distribu&eacute; d'authentification qui permet
&agrave; un proc&eacute;d&eacute; (un client) &agrave; prouver son identit&eacute;
&agrave; un verificateur (un serveur d'application, ou serveur simplement)
sans envoyer des donn&eacute;es &agrave; travers le r&eacute;seau qui pourrait
permettre &agrave; un agresseur &agrave; les imiter post&eacute;rieurement.
<br>Kerberos fournit int&eacute;grit&eacute; et confidentialit&eacute;
pour des donn&eacute;es envoy&eacute;es entre le client et serveur.
<p><u>Fonctionnement :</u>
<p>Au d&eacute;part, le client souhaite envoyer un message au serveur.
Le serveur, pour &ecirc;tre s&ucirc;r de l'identit&eacute; du client, lui
demande de s'authentifier.
<br>Interviennent alor le serveur d'authentification et le v&eacute;rificateur.
<br>Le client et le serveur d'authentification poss&egrave;de la m&ecirc;me
cl&eacute; d'authentification=cl&eacute; client. Pour le client, cette
cl&eacute; equivaut &agrave; un mot de passe. Celui-ci envoie ensuite un
message d'authentification crypt&eacute; avec cette cl&eacute; au serveur
d'authentification. Celui-ci utilise alors sa cl&eacute; pour v&eacute;rifier
l’identification du client. Si le message est d&eacute;crypt&eacute;, le
client est authentifi&eacute;.
<p>Le service d'authentification envoie alors au client un certificat crypt&eacute;
(contenant une cl&eacute; unique permettant d'identifier le client=cl&eacute;
session, et une date d'expiration au del&agrave; de laquelle il ne pourra
plus s'identifier) par une cl&eacute; connu seulement de lui et du v&eacute;rificateur=cl&eacute;
serveur (le client ne peut donc pas modifier le certificat puisqu’il ne
conna&icirc;t pas cette cl&eacute;).
<p>Le certificat est alors achemin&eacute; jusqu’au v&eacute;rificateur
qui le d&eacute;crypte en utilisant la cl&eacute; serveur et utilise la
cl&eacute; session obtenue pour authentifier le client
<br>&nbsp;
<p>1 : Envoi du message d’authentification crypt&eacute; avec la cl&eacute;
client.
<br>2 : Si client authentifi&eacute;, Le serveur d’authentification utilise
sa cl&eacute; serveur pour envoyer le&nbsp; certificat crypt&eacute; contenant
la cl&eacute; session=cl&eacute; unique identifiant le client.
<br>3 : Envoi de ce certificat crypt&eacute; au v&eacute;rificateur.
<br>4 : Le v&eacute;rificateur, apr&egrave;s avoir d&eacute;crypt&eacute;
le certificat avec sa cl&eacute; serveur, obtient la cl&eacute; session
qui permet d’authentifier le client.
<p><b>SecurWar ID</b>
<p>SecurWar ID permet une authentification forte des utilisateurs par carte
&agrave; puce. SecurWar ID permet pr&eacute;cis&eacute;ment d&acute;authentifier
sans aucun doute possible les utilisateurs distants. Il se base sur les
principes suivants :
<br>- les informations &eacute;chang&eacute;es pour l&acute;authentification
ne sont jamais deux fois identiques et ne pr&eacute;sentent aucun &eacute;l&eacute;ment
exploitable par les observateurs externes.
<br>- la conservation des cl&eacute;s secr&egrave;tes sur carte &agrave;
microprocesseur offre une garantie d&acute;inviolabilit&eacute; maximale.
<br>- chaque carte utilisateur contient une cl&eacute; diff&eacute;rente,
et son utilisation est prot&eacute;g&eacute;e par la frappe d&acute;un
code personnel qui bloque la carte apr&egrave;s trois tentatives erron&eacute;es.
<br>- une session de s&eacute;curit&eacute; permet un contr&ocirc;le permanent
de l&acute;origine des connexions applicatives, et des r&eacute;-authentifications
r&eacute;guli&egrave;res et automatiques en cours de dialogue (transparente
pour l&acute;utilisateur) permet de pr&eacute;venir toute tentatives d&acute;usurpation
d&acute;identit&eacute;.
<p><b>Steel-Belted RADIUS</b>
<p>Steel-Belted RADIUS s'occupe de l'identification de chaque utilisateur
qui souhaite acc&eacute;der &agrave; votre r&eacute;seau &agrave; distance,
il n'a besoin que des informations de s&eacute;curit&eacute; que vous avez
d&eacute;j&agrave; cr&eacute;&eacute;es.
<p><u>Caract&eacute;ristiques :</u>
<p>- Steel-Belted RADIUS utilise la norme d'identification d'utilisateur
distant RADIUS.
<br>- Quand un utilisateur se connecte &agrave; un serveur d'acc&egrave;s
distant, ce serveur communique avec Steel-Belted RADIUS pour d&eacute;terminer
les droits de l'utilisateur et l'autoriser &agrave; se connecter au r&eacute;seau
local. Il peut d&eacute;cider d'accepter ou de refuser la connexion, selon
les informations indiqu&eacute;es dans les bases de donn&eacute;es de s&eacute;curit&eacute;
du r&eacute;seau.
<br>- Toute modification effectu&eacute;e sur les informations de s&eacute;curit&eacute;
du r&eacute;seau est prise en compte imm&eacute;diatement par Steel-Belted
RADIUS ( mots de passe, les d&eacute;placements, suppressions ou ajouts
d'utilisateurs), vous serez certain de l'identification des utilisateurs
distants.
<br>-&nbsp; Pour autoriser des utilisateurs ext&eacute;rieurs &agrave;
acc&eacute;der au r&eacute;seau, il suffit d'inclure leurs noms et leurs
mots de passe dans la base de donn&eacute;es locale de Steel-Belted RADIUS.
<br>- Steel-Belted RADIUS utilise tous les attributs de connexion sp&eacute;ciaux
de vos serveurs d'acc&egrave;s distant - en particulier les options de
s&eacute;curit&eacute; de connexion, de rappel ou de limites sur le temps
de connexion, etc.
<p><b>HTTP auth</b>
<p>HTTP Auth permet d’offrir un service d’authentification continue :
<br>- Fiable : HTTP Auth utilise des techniques de cryptographie forte,
avec des protocoles et algorithmes de hash et signature &eacute;prouv&eacute;s
(MD5, SHA/DSA, RSA) combin&eacute;s avec des cl&eacute;s longues et fortes
:
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Algorithmes sym&eacute;triques
: 128 bits.
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Algorithmes asym&eacute;triques
: 1024 ou 2048 bits.
<br>- Sans d&eacute;ploiement : HTTP Auth ne n&eacute;cessite aucun programme,
module ou objet sur les postes des clients. HTTP Auth cr&eacute;e dynamiquement
les signatures num&eacute;riques de chaque utilisateur, puis les envoie
(apr&egrave;s chiffrement fort) sur le poste de l’utilisateur &agrave;
chaque connexion HTTP.
<p><u>Fonctionnalit&eacute;s :</u>
<p>- Protection des serveurs : HTTP Auth permet de v&eacute;rifier &agrave;
chaque appel d’un programme transactionnel du serveur Web que l’utilisateur
est autoris&eacute; &agrave; l’ex&eacute;cuter Il s’agit d’un service d’authentification
forte.
<br>- Session continue dans un contexte asynchrone : le produit authentifie
de fa&ccedil;on &laquo; continue &raquo; les utilisateurs; le syst&egrave;me
affecte &agrave; chaque utilisateur une session qui est sign&eacute;e.
<br>- Param&egrave;trage des dur&eacute;es des sessions : Il est possible
de d&eacute;finir des dur&eacute;es maximales de session pour chaque utilisateur,
avec d&eacute;connexion du service &agrave; expiration.
<br>- Logging complet des actions utilisateurs : chaque appel de script
provoque un logging complet et d&eacute;taill&eacute; : param&egrave;tres
d’identification de l’utilisateur (adresse IP, OS du poste client, marque/mod&egrave;le
de navigateur, date/heure, etc.).
<p><b><font size=+1>Le futur de l'authentifiaction</font></b>
<p><b>La solution S.CORT IC pour le driver LDAP</b>
<p>LDAP (Lightweight Directory Access Protocol) est devenu, en l'espace
de quelques ann&eacute;es, le standard dominant en termes d'acc&egrave;s
&agrave; des donn&eacute;es d'annuaires d'entreprises. La quasi-totalit&eacute;
des annuaires d'aujourd'hui sont maintenant accessibles &agrave; travers
le protocole LDAP. De m&ecirc;me, de plus en plus d'applications utilisent
maintenant un annuaire LDAP (g&eacute;n&eacute;ralement externe) pour stocker
leurs informations (configuration, topologie).
<p>S.cort va offrir aux d&eacute;veloppeurs d'applications Internet/Intranet
la possibilit&eacute; d'int&eacute;grer des acc&egrave;s LDAP afin de satisfaire
&agrave; la fonctionnalit&eacute; de login unique (Single Sign-On).
<p><u>Login unique :</u>
<p>Aujourd'hui, chaque application impose son propre sch&eacute;ma d'authentification.
Cela oblige donc aux utilisateurs de stocker un certain nombre d'identifiants
et de mots de passe, ce qui devient vite r&eacute;barbatif et dangereux
en terme de s&eacute;curit&eacute;. Les annuaires LDAP peuvent donc &ecirc;tre
utilis&eacute;s pour fournir une solution &agrave; ce probl&egrave;me.
En effet, l'ensemble des donn&eacute;es d'authentification peut &ecirc;tre
stock&eacute; dans un annuaire.
<p>Le driver LDAP permettra donc &agrave; toute application d'acc&eacute;der
aux annuaires LDAP afin de proc&eacute;der au " mapping " entre les donn&eacute;es
d'authentification g&eacute;n&eacute;rales Web/Internet/Intranet et les
donn&eacute;es d'authentification sp&eacute;cifiques &agrave;/aux application(s)
acc&eacute;d&eacute;e(s).
<p>Les types et format des donn&eacute;es d'authentification stock&eacute;es
dans l'annuaire, sont laiss&eacute;s au libre choix du d&eacute;veloppeur,
S.cort n'imposant n'imposant pas de pr&eacute; requis pour ces informations.
<p>Une technique d'authentification fran&ccedil;aise : le r&eacute;seau
GSM
<p>En g&eacute;n&eacute;ral, les syst&egrave;mes d'exploitation et les
applications sont organis&eacute;s pour identifier une machine (serveur
ou poste client) et non l'individu qui l'utilise. En attendant les techniques
biom&eacute;triques, les syst&egrave;mes d'authentification restent fond&eacute;s
sur la transmission d'un mot de passe " jetable ", calcul&eacute; &agrave;
partir d'une identification de l'utilisateur et d'un g&eacute;n&eacute;rateur
al&eacute;atoire Malheureusement, cette m&eacute;thode &eacute;choue sur
un point essentiel qui emp&ecirc;che sa banalisation : le prix du mat&eacute;riel
n&eacute;cessaire reste souvent trop &eacute;lev&eacute;. La solution viendra
peut-&ecirc;tre de l'astucieux Magic@xess, un brevet fran&ccedil;ais en
cours d'&eacute;valuation par plusieurs organismes bancaires. L'id&eacute;e
de base est simple : utiliser un deuxi&egrave;me r&eacute;seau, diff&eacute;rent
de celui qui connecte le client &agrave; son fournisseur, pour le contr&ocirc;le
d'identit&eacute; : le GSM. Lors d'une demande d'authentification par le
fournisseur, le client est appel&eacute; sur son t&eacute;l&eacute;phone
GSM par un organisme certificateur, et un code al&eacute;atoire lui est
fourni sous forme de message court. Il ne lui reste qu'&agrave; entrer
ce code, valable quelques minutes, sur son terminal informatique pour &ecirc;tre
identifi&eacute;.
<p><b><font size=+1>La biom&eacute;trie</font></b>
<p>Il est fr&eacute;quent d'oublier le code d'acc&egrave;s. Pour &eacute;viter
cet oubli, beaucoup de personnes &eacute;crivent ce code sur un carnet,
perdant ainsi toute confidentialit&eacute;. Le mot de passe est un moyen
de pr&eacute;s&eacute;lection et non de contr&ocirc;le d'acc&egrave;s.
<br>Il y a plusieurs moyens pour v&eacute;rifier l'identit&eacute; de quelqu'un,
la biom&eacute;trie est consid&eacute;r&eacute;e comme &eacute;tant le
plus appropri&eacute;.
<br>Les moyens biom&eacute;triques, permettent une authentification s&ucirc;re,
ce qui n'est pas le cas avec les mots de passe ou les cartes (badges) qui
peuvent &ecirc;tre vol&eacute;s. La biom&eacute;trie s'appuie sur la prise
en compte d'&eacute;l&eacute;ments morphologiques uniques et propres &agrave;
chacun d'entre nous.<u></u>
<p><u>Les moyens biom&eacute;triques :</u>
<br>- Empreintes digitales.
<br>- Forme de la main ou des doigts.
<br>- Forme ou traits du visage.
<br>- Caract&eacute;ristiques de la voix.
<br>- Dessin du r&eacute;seau veineux de la r&eacute;tine ou fond de l’œil.
<br>-&nbsp; Informations g&eacute;n&eacute;tiques.
<br>- Dynamique de la signature.
<br>- etc. ... Ce syst&egrave;me supprime :
<br>- La duplication.
<br>- Le vol.
<br>- L'oubli.
<br>- La perte.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Copie Vol Oubli Perte
<br>Cl&eacute; X X X X
<br>Badge - X X X
<br>Code X - X -
<br>Empreinte - - - -
<br>&nbsp;
<br><u>Les applications :</u>
<br>- Le contr&ocirc;le d'acc&egrave;s aux locaux.
<br>- La mon&eacute;tique - Cartes de paiement - Transactions.
<br>- L'automobile (antivol).
<br>- L'acc&egrave;s aux syst&egrave;mes informatiques.
<br>- Le judiciaire.
<br>- Les titres d'identit&eacute; - Les services sociaux.
<p><b><font size=+1>Conclusion</font></b>
<p>De cet expos&eacute;, nous pouvons retenir que les moyens d’authentification
actuels, quoique d&eacute;j&agrave; tr&egrave;s s&eacute;curis&eacute;s,
sont toujours sous la menace du piratage. Les technologies futures d&eacute;crites
ci-dessus devraient permettre de r&eacute;soudre ce probl&egrave;me (biom&eacute;trie).
Mais les progr&egrave;s scientifiques ne permettront-ils pas &agrave; ces
&laquo; pirates &raquo; de trouver une technique capable de les contourner
?
<br>&nbsp;
</body>
</html>
