<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Clad Strife">
   <meta name="GENERATOR" content="Mozilla/4.61 [en] (Win98; I) [Netscape]">
   <title>Les ports du PC.</title>
</head>
<body text="#000000" bgcolor="#FFF5F0" link="#0000EE" vlink="#551A8B" alink="#FF0000">

<center><b><tt><font color="#000000"><font size=+2>Les ports du PC</font></font></tt></b></center>

<p><br>
<br>
<br>
<br>
<br>
<br>
<p>&nbsp;&nbsp; Je vous vois venir, r&acirc;leurs comme vous &ecirc;tes,
&agrave; vous dire que quelqu'un va ENCORE balancer pour la &eacute;ni&egrave;me
fois une liste des 65535 ports avec fonction. Pour changer, je vais expliquer
ce qu'est un port et quelle est sa fonction globale. Je ne mettrais m&ecirc;me
pas de liste. Cet article est le plus court du zine et sert vraiment &agrave;
s'instruire.
<p>&nbsp;&nbsp; Nous savons qu'un grand nombre de circuits int&eacute;gr&eacute;s
soutiennent l'unit&eacute; centrale pour la gestion du syst&egrave;me.
Il ne s'agit pas cependant de circuits autonomes qui accomplissent leur
travail sans communiquer entre eux. Ils sont au contraire en contact permanent
avec l'unit&eacute; centrale qui les charge de certains travaux ou bien
qui en obtient un certain nombre d'informations.
<p>&nbsp;&nbsp; C'est &agrave; cette communication entre les diff&eacute;rents
&eacute;l&eacute;ments du syst&egrave;me que servent justement les ports,
qui constituent une interface entre l'unit&eacute; centrale et le reste
de l'&eacute;lectronique. Un port est simplement une entr&eacute;e ou une
sortie de donn&eacute;es d'une largeur de 8 bits, qui est reli&eacute;e
&agrave; une unit&eacute; &eacute;lectronique d&eacute;termin&eacute;e
et &agrave; laquelle correspond une adresse entre 0 et 65535 qui lui est
enti&egrave;rement r&eacute;serv&eacute;e. Pour communiquer avec les ports,
l'unit&eacute; centrale emploie le bus de donn&eacute;es et le bus d'adresse.
Pour appeler un port, elle sort tout d'abord un signal dit de contr&ocirc;le
de port. Ce signal indique au reste de l'&eacute;lectronique que c'est
un port et non la m&eacute;moire RAM qui doit maintenant &ecirc;tre appel&eacute;e.
Les ports ont en effet des adresses qui correspondent aussi &agrave; des
cellules de m&eacute;moire bien qu'ils n'aient rien &agrave; voir avec
ces cellules de m&eacute;moire. L'unit&eacute; centrale place ensuite l'adresse
du port sur les 16 bits inf&eacute;rieurs du bus d'adresse. De cette fa&ccedil;on,
elle aiguille en quelque sorte vers le port appropri&eacute; les informations
(de 8 bits) qui vont ensuite &ecirc;tre plac&eacute;es sur le bus de donn&eacute;es.
L'&eacute;lectronique reli&eacute;e &agrave; ce port re&ccedil;oit alors
les donn&eacute;es et peut r&eacute;agir en cons&eacute;quence.
<p>&nbsp;&nbsp; L'adresse de port d'une unit&eacute; &eacute;lectronique
d&eacute;termin&eacute;e&nbsp; n'est pas une valeur fix&eacute;e une fois
pour toutes, elle peut au contraire &ecirc;tre d&eacute;finie par le syst&egrave;me
g&eacute;n&eacute;ral. C'est ainsi que certains circuits peuvent porter
des adresses variables suivant le mod&egrave;le de PC.
<p><b><i>Clad Strife</i></b>
</body>
</html>
