<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Clad Strife">
   <meta name="GENERATOR" content="Mozilla/4.61 [en] (Win98; I) [Netscape]">
   <title>Proxys</title>
</head>
<body text="#000000" bgcolor="#FFF5F0" link="#0000EE" vlink="#551A8B" alink="#FF0000">

<center><b><tt><font size=+2>S&eacute;curit&eacute; r&eacute;seau : proxys
et architectures</font></tt></b></center>

<p><br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<p><b><font size=+1>Introduction :</font></b>
<p>Le but d'un serveur proxy est d'isoler une ou plusieurs machines pour
les prot&eacute;ger.
<br>Les machines A doivent se connecter au r&eacute;seau par l’interm&eacute;diaire
du serveur Proxy. Ce dernier sert de relais entre le r&eacute;seau et les
machines &agrave; cacher. Ainsi,&nbsp; les machines du r&eacute;seau B
auront l'impression de communiquer avec le proxy, et non les machines A.
<br>Pour les applications du r&eacute;seau B, l'adresse IP du client sera
celle du serveur Proxy. Par exemple, lors d’une connexion &agrave; un serveur
HTTP, le browser se connecte au serveur proxy et demande l’affichage d’une
URL. C’est le serveur proxy qui g&egrave;re la requ&ecirc;te et qui renvoie
le r&eacute;sultat &agrave; votre browser.
<br>Ainsi, en utilisant un num&eacute;ro de port diff&eacute;rent, le proxy
oblige toutes les requ&ecirc;te &agrave; passer par lui en supprimant les
trames dont le num&eacute;ro de port ne lui correspond pas.
<br>De plus, le proxy poss&egrave;de un avantage suppl&eacute;mentaire
en termes de performances. Si deux utilisateurs demandent &agrave; peu
de temps d’intervalle la m&ecirc;me page, celle-ci sera m&eacute;moris&eacute;e
dans le proxy, et appara&icirc;tra donc beaucoup plus rapidement par la
suite.
<br>Ce proc&eacute;d&eacute; est tr&egrave;s int&eacute;ressant en termes
de s&eacute;curit&eacute; sur Internet, les machines sont prot&eacute;g&eacute;es.
Le serveur proxy peut filtrer les requ&ecirc;tes, en fonctions de certaines
r&egrave;gles.
<p><b><font size=+1>Architectures :</font></b>
<br>&nbsp;
<blockquote><b><font size=+1>Solution Mono Proxy Serveur</font></b></blockquote>

<p><br><b>Avec un proxy central sur le r&eacute;seau d'acc&egrave;s &agrave;
l'Internet</b>
<p>Le Proxy Server se rattache au r&eacute;seau Intranet principal.
<br>Lorsque un client d'un site distant recherche une information sur un
site Web de la DMZ ou de l'Internet, il acc&egrave;de au Proxy central
via le r&eacute;seau WAN priv&eacute; de l'entreprise.
<br>Si le proxy serveur contact&eacute; dispose de l'information en cache
disque local, il renvoie directement l'information demand&eacute;e au client.
Si l'information n'est pas en cache, ou n'est pas &agrave; jour, alors
il &eacute;met une requ&ecirc;te vers l'Internet.
<br>L'&eacute;conomie de bande passante est r&eacute;alis&eacute;e sur
la liaison WAN reliant le r&eacute;seau interne au r&eacute;seau Internet.
<br>Pour le client du LAN central, la redirection vers le proxy lui permet
de b&eacute;n&eacute;ficier du cache disque g&eacute;r&eacute; au niveau
du proxy.
<br>&nbsp;
<br>&nbsp;
<blockquote><b><font size=+1>&nbsp;Solution Multi Proxy Serveurs</font></b></blockquote>

<p><br><b>&nbsp;Un proxy par site d&eacute;port&eacute;, un proxy sur le
LAN central</b>
<p>Le Proxy Server d&eacute;port&eacute; se rattache au r&eacute;seau Intranet
distant
<br>Le proxy Server central se connecte au LAN central..
<br>Lorsque un client d'un site distant recherche une information sur un
site Web de la DMZ ou de l'Internet, il acc&egrave;de au Proxy de son r&eacute;seau.
LAN.
<br>Si ce proxy serveur (de proximit&eacute;!) dispose de l'information
en cache disque local, il renvoie directement l'information demand&eacute;e
au client. Si l'information n'est pas en cache, ou n'est pas &agrave; jour,
alors il &eacute;met la requ&ecirc;te vers le Proxy Central.
<br>Lorsque le proxy&nbsp; serveur du LAN central re&ccedil;oit la requ&ecirc;te
du proxy d&eacute;port&eacute;, il v&eacute;rifie la pr&eacute;sence dans
son cache interne de l'information demand&eacute;e. Si l'information requise
est en cache et &agrave; jour, il renvoie au proxy d&eacute;port&eacute;
qui mettra &agrave; jour son propre cache avant de retourner l'information
au client.
<br>L'&eacute;conomie de bande passante est r&eacute;alis&eacute;e sur
la liaison WAN reliant le r&eacute;seau d&eacute;port&eacute; au r&eacute;seau
central et sur la liaison WAN vers l'Internet.
<br>&nbsp;
<p>Afin d'&eacute;tablir une tol&eacute;rance de pannes entre proxies locaux
et central, on ajoutera au script d'auto-configuration des navigateurs
client (&eacute;crit en langage Javascript), une nouvelle fonctionnalit&eacute;
: si le proxy local ne fonctionne plus, le navigateur se connectera automatiquement
au proxy central.
<br>&nbsp;
<br>&nbsp;
<blockquote><b><font size=+1>Solution Proxy Serveur avec firewall et Acc&egrave;s
distant</font></b></blockquote>
<b>&nbsp;Un proxy sur chaque site d&eacute;port&eacute;, un proxy-firewall
vers WAN-RNIS sur le LAN central</b>
<p>Le Proxy Server d&eacute;port&eacute; se rattache au r&eacute;seau Intranet
distant
<br>Le proxy Server central&nbsp; connecte le LAN central au WAN commut&eacute;
(g&eacute;n&eacute;ralement r&eacute;seau RNIS) vers l'op&eacute;rateur
Internet.
<br>Comme dans les cas pr&eacute;c&eacute;dents, lorsque un client d'un
site distant recherche une information sur un site Web, il se connecte
d'abord &agrave; son proxy puis &eacute;ventuellement son proxy au proxy
central.
<br>Si l'information n'est pas &agrave; jour dans le cache du proxy central,
celui-ci se connecte automatiquement en dial-out vers le r&eacute;seau
op&eacute;rateur.
<p>Dans les deux cas &eacute;voqu&eacute;s ci dessus, le proxy joue essentiellement
le r&ocirc;le de gestionnaire de cache et assure une optimisation naturelle
des flux d'information de type http et ftp.
<br>Il ne se substitue pas au firewall qui joue le r&ocirc;le de filtreur
de paquet, de translateur et d'authentification.
<br>Dans ce dernier cas, le proxy est le point de passage oblig&eacute;;
il doit donc&nbsp; accepter tous les types de flux sortants (via proxy
Winsock ou Socks). Dans ce cas, le masquage d'adresse permet aux clients
du r&eacute;seau LAN d'&ecirc;tre "vus" de l'ext&eacute;rieur par l'adresse
publique dynamique attribu&eacute; au proxy au moment de sa connexion&nbsp;
PPP vers l'ISP.
<br>&nbsp;
</body>
</html>
