<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Clad Strife">
   <meta name="GENERATOR" content="Mozilla/4.61 [en] (Win98; I) [Netscape]">
   <title>Fichiers rhosts</title>
</head>
<body text="#000000" bgcolor="#FFF5F0" link="#0000EE" vlink="#551A8B" alink="#FF0000">

<center><b><tt><font color="#000000"><font size=+2>Les fichiers rhosts</font></font></tt></b></center>

<p><br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<p><font color="#000000">&nbsp;&nbsp;&nbsp; Sous Unix il existe des commandes
comme <i>rsh, rcp, rlogin</i>... Toutes ces commandes seraient d&eacute;j&agrave;
connues si elles n'avaient pas de r ( login, cp ...). Le r (pour remote)
pr&eacute;cise que la commande va s'ex&eacute;cuter sur une autre machine.
Pour que ces commandes fonctionnent, il est imp&eacute;ratif d'avoir son
fichier .rhost &agrave; jour. Ce fichier permet de s'affranchir du mot
de passe normalement n&eacute;cessaire lors d'une connection avec une autre
machine. Voici un exemple de fichier .rhost existant sur le HOME de la
machine_A pour le compte login_A .</font>
<br>&nbsp;
<blockquote><font color="#3333FF">machine_B.mon_labo.fr login_machine_B</font>
<br><font color="#3333FF">eclipse.totale.fr observateur</font></blockquote>

<p><br><font color="#000000">Ici, sur la machine_A peuvent se connecter
sans taper de mot de passe, login_machine_B depuis machine_B et observateur
depuis eclipse.</font>
<br><font color="#000000">Comme vous vous en doutez ces types de fichier
rhosts peuvent cr&eacute;er des probl&egrave;mes de s&eacute;curit&eacute;.
Ainsi le fichier /.rhosts est tres dangereux. Si vous ne l'avez pas cree
en pleine connaissance de cause et s'il existe, detruisez le. Si vous l'utilisez,
verifiez ses acces et son contenu. V&eacute;rifiez les fichiers de configuration
syst&egrave;me et r&eacute;seau, pour ce qui concerne les entr&eacute;es
non autoris&eacute;es. En particulier le signe "+", ou des noms de machines
ext&eacute;rieures dans </font><font color="#FF0000">/etc/hosts.equiv</font><font color="#000000">,</font><font color="#FF0000">
/etc/hosts.lpd</font><font color="#000000"> et dans tous les fichiers .rhosts
(sp&eacute;cialement root, uucp, ftp et autres comptes syst&egrave;mes).
Ces fichiers doivent &ecirc;tre prot&eacute;g&eacute;s en &eacute;criture.
De plus, assurez vous que ces fichiers existaient avant toute intrusion
et n'ont pas &eacute;t&eacute; cr&eacute;&eacute;s par un intrus. La plupart
du temps, si une machine a &eacute;t&eacute; pirat&eacute;e, les autres
sur le r&eacute;seau l'ont &eacute;t&eacute; aussi. C'est surtout vrai
sur les r&eacute;seau o&ugrave; tourne NIS et o&ugrave; les serveurs s'autorisent
les un les autres &agrave; travers l'usage des fichiers .rhosts ou </font><font color="#FF0000">/etc/hosts.equiv</font><font color="#000000">.
V&eacute;rifiez donc tous les serveurs avec lesquels les utilisateurs partagent
des acc&egrave;s.</font>
<p>Ainsi pirater une machine gr&acirc;ce aux fichiers rhosts serait simple:
il suffit de les cr&eacute;er ou de les &eacute;diter. On peut approfondir
le fonctionnement de ces fichiers. Imaginons que nous sommes logg&eacute;s
sur <font color="#FF0000">machine1</font> et que l'on aimerait se logger
sur <font color="#FF0000">machine2</font>. Pour cela, il faut ouvrir un
shell et y taper:
<blockquote><font color="#3333FF">rlogin cible2</font></blockquote>
La machine demandera alors un mot de passe. Si on ne veut pas avoir &agrave;
taper un mot de passe &agrave; chaque fois, il suffit de cr&eacute;er un
fichier .rhosts &agrave; mettre &agrave; la racine:
<blockquote><font color="#3333FF">#</font>
<br><font color="#3333FF"># fichier ~/.rhosts</font>
<br><font color="#3333FF">#</font>
<br><font color="#3333FF">machine1 ton_login</font>
<br><font color="#3333FF">machine2 ton_login</font></blockquote>
et ainsi de suite pour toutes les machines. Ainsi, si l'on est sur jardin
et que l'on fait un rlogin <font color="#FF0000">machine2</font>, <font color="#FF0000">machine2</font>
regardera le fichier .rhosts, verra que l'utilisateur <font color="#FF0000">ton_login</font>
a le droit de se connecter si il vient de <font color="#FF0000">machine1</font>.
Et donc ouvrira une session sans demander de mot de passe.
<p>On voit qu'il faut donc avoir un acc&egrave;s &agrave; la machine pour
pouvoir y acc&eacute;der. Dans le cas ou une attaque aurait &eacute;t&eacute;
r&eacute;ussie, et un fichier rhosts &eacute;crit, l'utilisation apr&egrave;s-coup
de ce fichier se r&eacute;v&egrave;lerait efficace m&ecirc;me si la faille
utilis&eacute;e en premier cas ne marche plus.
<br>&nbsp;
<br>&nbsp;
<table BORDER COLS=1 WIDTH="100%" BGCOLOR="#FFCCCC" >
<tr>
<td><b><i>Note:</i></b> le point mis devant le fichier ce fichier est volontaire.
C'est un fichier cach&eacute;.
<br><b><i>Note:</i></b> le "r" devant les commandes UNIX sont des commandes
qui se r&eacute;alisent &agrave; distance le "r" &eacute;tant mis pour
remote.
<br><b><i>Note:</i></b> la commande <i>echo cible.com >> guest/.rhosts</i>
permet un acc&egrave;s &agrave; l'utilisateur guest sur la machine cible.com.
Cette commande se d&eacute;compose ainsi: "echo" annonce l'&eacute;criture,
"cible.com" est l'objet de l'&eacute;criture, ">>" indique o&ugrave; va
se r&eacute;aliser l'&eacute;criture, "guest/.rhosts" est le fichier cible.</td>
</tr>
</table>

<p><b><i>Clad Strife</i></b>
</body>
</html>
