<html>
<head>
   <meta name="Author" content="Clad Strife">
   <title>Syst&egrave;me de d&eacute;tection d'intrusions</title> 
</head>
<body bgcolor="#FFF5F0">
<body>

<center><b><tt><font size=+2>S&eacute;curit&eacute; r&eacute;seau : syst&egrave;me
de d&eacute;tections des intrusions</font></tt></b>
<br><b><font face="Verdana"><font size=-2>(Source guill.net)</font></font></b></center>

<p><br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<p><b><font size=+2>1 Introduction</font></b><b><font size=+2></font></b>
<p><b><font size=+1>1.1&nbsp; Pourquoi les syst&egrave;mes sont-ils vuln&eacute;rables?</font></b><b><font size=+1></font></b>
<p>La s&eacute;curit&eacute; est devenue un point crutial des syst&egrave;mes
d'informations. Cependant, les organisations sont peu ou pas prot&eacute;g&eacute;es
contre les attaques sur leur r&eacute;seau ou les h&ocirc;tes du r&eacute;seau.
Dorothy&nbsp; DENNING, apr&egrave;s avoir donn&eacute; des chiffres montrant
l'importance du nombre d'attaques dans le monde, nous donne des raisons
visant &agrave; d&eacute;montrer la vulnaribilit&eacute; des syst&egrave;mes
d'informations.
<br>La premi&egrave;re raison qui fait que les syst&egrave;mes sont mal
prot&eacute;g&eacute;s est que la s&eacute;curit&eacute; co&ucirc;te ch&egrave;re.
Les organismes n'ont pas de budget allou&eacute; &agrave; ce domaine. Elle
souligne &eacute;galement que la s&eacute;curit&eacute; ne peut &ecirc;tre
s&ucirc;r &agrave; 100%, voire qu'elle est m&ecirc;me souvent innefficace.
Aurobino SUNDARAM nous en donne les raisons : les bugs dans les programmes
sont courants et seront toujours exploitables par les attaquants. De plus,
m&ecirc;me la cryptographie a ses faiblesses et les mots de passe, par
exemple, peuvent &ecirc;tre cass&eacute;s. Il n'existe pas d'organisation
centralis&eacute;e g&egrave;rant l'ensemble des clefs et autres &eacute;l&eacute;ments
de cryptographie. Enfin, m&ecirc;me un syst&egrave;me fiable peut &ecirc;tre
attaqu&eacute; par des personnes abusant de leurs droits l&eacute;gitimes.
<p>Dorothy DENNING ajoute d'autres raisons d&eacute;montrant la vuln&eacute;rabilit&eacute;s
des syst&egrave;mes : la politique de s&eacute;curit&eacute; est complexe
et est bas&eacute;e sur des jugements humains. On trouve notamment des
faiblesses dues &agrave; la gestion et &agrave; la configuration des syst&egrave;mes.
Il y a aussi en permanence de nouvelles technologies qui &eacute;mergent,
et par l&agrave;-m&ecirc;me, de nouveaux points d'attaques. En dernier
point, les organisations acceptent de courir ce risque, la s&eacute;curit&eacute;
n'&eacute;tant pas leur principale priorit&eacute;.
<p>Pour exploiter ces faiblesses, les attaquants profitent de la n&eacute;gligence
des utilisateurs vis-&agrave;-vis de leurs droits et autorisations d'acc&egrave;s,
en se faisant passer pour un employ&eacute; du service informatique dans
le but d'obtenir des informations. Ils peuvent aussi casser les clefs d'une
longueur insuffisante ou les mots de passe par une attaque syst&eacute;matique.
Ils peuvent se mettre &agrave; l'&eacute;coute sur le r&eacute;seau pour
obtenir des informations. Ils peuvent changer leur adresse r&eacute;seau
pour se faire passer pour quelqu'un de confiance. Ils ont la possibilit&eacute;
d'injecter du code comme un virus ou un cheval de Troie sur la cible. Enfin,
ils peuvent exploiter les faiblesses des applications, des protocoles ou
des syst&egrave;mes d'exploitation.
<p><b><font size=+1>1.2&nbsp; Introduction &agrave; la s&eacute;curit&eacute;
des syst&egrave;mes d'informations</font></b>
<p>Etant donn&eacute; le nombre de syst&egrave;mes attaqu&eacute;s ces
derni&egrave;res ann&eacute;es et les enjeux financiers qu'ils abritent,
les syst&egrave;mes d'informations se doivent aujourd'hui d'&ecirc;tre
prot&eacute;g&eacute;s contre les anomalies de fonctionnement provenant
soit d'une attitude intentionnellement malveillante d'un utilisateur, soit
d'une faille rendant le syst&egrave;me vuln&eacute;rable.
<br>Du fait du nombre toujours croissant de personnes ayant acc&egrave;s
&agrave; ces syst&egrave;mes par le biais d'Internet, la politique de s&eacute;curit&eacute;
se concentre g&eacute;n&eacute;ralement sur ce point d'entr&eacute;e du
r&eacute;seau interne. La mise en place d'un pare-feu est devenu indispensable
afin d'interdire l'acc&egrave;s aux paquets ind&eacute;sirables. On peut,
de cette fa&ccedil;on, proposer une vision restreinte du r&eacute;seau
interne vu de l'ext&eacute;rieur et filtrer les paquets en fonction de
certaines caract&eacute;ristiques telles qu'une adresse ou un port de communication.
<p>Cependant, ce syst&egrave;me de forteresse est insuffisant s'il n'est
pas accompagn&eacute; d'autres protections. Citons la protection physique
des informations par des acc&egrave;s contr&ocirc;l&eacute;s aux locaux,
la protection contre les failles de configuration par des outils d'analyse
automatique des vuln&eacute;rabilit&eacute;s du syst&egrave;me, ou encore
la protection par des syst&egrave;mes d'authentification fiables pour que
les droits accord&eacute;s &agrave; chacun soient clairement d&eacute;finis
et respect&eacute;s, ceci afin de garantir la confidentialit&eacute; et
l'int&eacute;grit&eacute; des donn&eacute;es.
<p>Faire de la s&eacute;curit&eacute; sur des syst&egrave;mes d'informations
consiste &agrave; s'assurer que celui qui modifie ou consulte des donn&eacute;es
du syst&egrave;me en a l'autorisation et qu'il peut le faire correctement
car le service est disponible.
<p>M&ecirc;me en mettant en place tous ces m&eacute;canismes, il reste
encore beaucoup de moyens pour contourner ces protections. Pour les compl&eacute;ter,
une surveillance permanente ou r&eacute;guli&egrave;re des syst&egrave;mes
peut &ecirc;tre mise en place : ce sont les syst&egrave;mes de d&eacute;tection
d'intrusions. Ils ont pour but d'analyser tout ou partie des actions effectu&eacute;es
sur le syst&egrave;me afin de d&eacute;tecter d'&eacute;ventuelles anomalies
de fonctionnement.
<p><b><font size=+1>1.3&nbsp; L'audit de s&eacute;curit&eacute;</font></b>
<p>L'audit de s&eacute;curit&eacute; permet d'enregistrer tout ou partie
des actions effectu&eacute;es sur le syst&egrave;me. L'analyse de ses informations
permet de d&eacute;tecter d'&eacute;ventuelles intrusions. Les syst&egrave;mes
d'exploitation disposent g&eacute;n&eacute;ralement de syst&egrave;mes
d'audit int&eacute;gr&eacute;s, certaines applications aussi. Les diff&eacute;rents
&eacute;v&egrave;nements du syst&egrave;mes sont enregistr&eacute;s dans
un journal d'audit qui devra &ecirc;tre analys&eacute; fr&eacute;quemment,
voire en permanence. Sur les r&eacute;seaux, il est indispensable de disposer
d'une base de temps commune pour estampiller les &eacute;v&egrave;nements.
<br>Voici les types d'informations &agrave; collecter sur les syst&egrave;mes
pour permettre la d&eacute;tection d'intrusions. On y trouve les informations
sur les acc&egrave;s au syst&egrave;me (qui y a acc&eacute;d&eacute;, quand
et comment), les informations sur l'usage fait du syst&egrave;me (utilisation
du processeur, de la m&eacute;moire ou des entr&eacute;es/sorties) et les
informations sur l'usage fait des fichiers. L'audit doit &eacute;galement
permettre d'obtenir des informations relatives &agrave; chaque application
(le lancement ou l'arr&ecirc;t des diff&eacute;rents modules, les variables
d'entr&eacute;e et de sortie et les diff&eacute;rentes commandes ex&eacute;cut&eacute;es).
Les informations sur les violations &eacute;ventuelles de la s&eacute;curit&eacute;
(tentatives de commandes non autoris&eacute;es) ainsi que les informations
statistiques sur le syst&egrave;me seront elles aussi n&eacute;cessaires.
<p>Notons que ces nombreuses informations occupent beaucoup de place et
sont tr&egrave;s longues &agrave; analyser. Ces informations devront &ecirc;tre,
au moins pour un temps, stock&eacute;es quelque part avant d'&ecirc;tre
analys&eacute;es par le syst&egrave;me de d&eacute;tection d'intrusions.
<br>&nbsp;
<p><b><font size=+2>2&nbsp; Classification des syst&egrave;mes de d&eacute;tection
d'intrusions</font></b>
<p>Pour classer les syst&egrave;mes de d&eacute;tection d'intrusions, on
peut se baser sur plusieurs variables. La principale diff&eacute;rence
retenue est l'approche utilis&eacute;e, qui peut &ecirc;tre soit comportementale,
soit par sc&eacute;narios. Nous verrons ensuite d'autres param&egrave;tres
permettant de classer les diff&eacute;rents syst&egrave;mes de d&eacute;tection
d'intrusions.
<p><b><font size=+1>2.1&nbsp; Approche comportementale et approche par
sc&eacute;narios</font></b>
<p>Dans les traces d'audit, on peut chercher deux choses diff&eacute;rentes.
La premi&egrave;re correspond &agrave; l'approche comportementale, c'est-&agrave;-dire
qu'on va chercher &agrave; savoir si un utilisateur a eu un comportement
d&eacute;viant par rapport &agrave; ses habitudes. Ceci signifierait qu'il
essaye d'effectuer des op&eacute;rations qu'il n'a pas l'habitude de faire.
On peut en d&eacute;duire, soit que c'est quelqu'un d'autre qui a pris
sa place, soit que lui m&ecirc;me essaye d'attaquer le syst&egrave;me en
abusant de ses droits. Dans les deux cas, il y a intrusion.
<br>La deuxi&egrave;me chose que l'on peut chercher dans les traces d'audit
est une signature d'attaque. Cela correspond &agrave; l'approche par sc&eacute;narios.
Les attaques connues sont r&eacute;pertori&eacute;es et les actions indispensables
de cette attaque forment sa signature. On compare ensuite les actions effectu&eacute;es
sur le syst&egrave;me avec ces signatures d'attaques. Si on retrouve une
signature d'attaque dans les actions d'un utilisateur, on peut en d&eacute;duire
qu'il tente d'attaquer le syst&egrave;me par cette m&eacute;thode.
<p>Plusieurs m&eacute;thodes diff&eacute;rentes peuvent &ecirc;tre mises
en oeuvre pour d&eacute;tecter le comportement d&eacute;viant d'un individu
par rapport &agrave; un comportement ant&eacute;rieur consid&eacute;r&eacute;
comme normal par le syst&egrave;me. La m&eacute;thode statistique se base
sur un profil du comportement normal de l'utilisateur au vu de plusieurs
variables al&eacute;atoires. Lors de l'analyse, on calcule un taux de d&eacute;viation
entre le comportement courant et le comportement pass&eacute;. Si ce taux
d&eacute;passe un certain seuil, le syst&egrave;me d&eacute;clare qu'il
est attaqu&eacute;. Les syst&egrave;mes experts, eux, visent &agrave; repr&eacute;senter
le profil d'un individu par une base de r&egrave;gles cr&eacute;&eacute;e
en fonction de ses pr&eacute;c&eacute;dentes activit&eacute;s et recherchent
un comportement d&eacute;viant par rapport &agrave; ces r&egrave;gles.
Une autre m&eacute;thode consiste &agrave; pr&eacute;dire la prochaine
commande de l'utilisateur avec une certaine probabilit&eacute;. Notons
&eacute;galement l'utilisation des r&eacute;seaux de neurones pour apprendre
les comportements normaux des utilisateurs ou encore l'utilisation de la
m&eacute;thode d&icirc;te "d'immunologie" se basant sur le comportement
normal du syst&egrave;me et non des utilisateurs.
<p>De m&ecirc;me que pour l'approche comportementale, plusieurs m&eacute;thodes
peuvent &ecirc;tre utlis&eacute;es pour g&eacute;rer les signatures d'attaques.
Les syst&egrave;mes experts les repr&eacute;sentent sous forme de r&egrave;gles.
La m&eacute;thode dite du "Pattern Matching" (reconnaissance de forme)
repr&eacute;sente les signatures d'attaques comme des suites de lettres
d'un alphabet, chaque lettre correspondant &agrave; un &eacute;v&egrave;nement.
Les algorithmes g&eacute;n&eacute;tiques sont &eacute;galement utilis&eacute;s
pour analyser efficacement les traces d'audit. Les signatures d'attaques
peuvent &ecirc;tre &eacute;galement vues comme une s&eacute;quence de changements
d'&eacute;tats du syst&egrave;me. La simple analyse de s&eacute;quences
de commandes a &eacute;t&eacute; rapidement abandonn&eacute;e car elle
ne permettait pas la d&eacute;tection d'attaques complexes. Pour l'approche
par sc&eacute;narios, le poids donn&eacute; &agrave; chaque entit&eacute;
(audit, base de signatures d'attaques et m&eacute;canisme d'analyse) et
la fa&ccedil;on dont elles sont mises en relation est d&eacute;cisif pour
obtenir un syst&egrave;me de d&eacute;tection efficace.
<p>Chacune des deux approches a ses avantages et ses inconv&eacute;nients,
et les syst&egrave;mes de d&eacute;tection d'intrusions impl&eacute;mentent
g&eacute;n&eacute;ralement ces deux aspects. Avec l'approche comportementale,
on a la possibilit&eacute; de d&eacute;tecter une intrusion par une attaque
inconnue jusqu'alors. Par contre, le choix des param&egrave;tres est d&eacute;licat,
ce syst&egrave;me de mesures n'est pas prouv&eacute; exact, et on obtient
beaucoup de faux positifs, c'est-&agrave;-dire que le syst&egrave;me croit
&ecirc;tre attaqu&eacute; alors qu'il ne l'est pas. Qui plus est, un utilisateur
peut apprendre &agrave; la machine le comportement qu'il souhaite, notamment
un comportement totalement anarchique ou encore changer lentement de comportement.
Avec l'approche par sc&eacute;narios, on peut prendre en compte les comportements
exacts des attaquants potentiels. Les inconv&eacute;nients sont dans la
base de r&egrave;gles qui doit &ecirc;tre bien construite et les performances
qui sont limit&eacute;es par l'esprit humain qui les a con&ccedil;ues.
Notons &eacute;galement que l'approche par sc&eacute;narios ne permet &eacute;videmment
pas de d&eacute;tecter une attaque inconnue jusque l&agrave;.
<p><b><font size=+1>2.2&nbsp; Autres m&eacute;thodes de classification
des syst&egrave;mes de d&eacute;tection d'intrusions</font></b>
<p>Si la classification la plus utilis&eacute;e est celle de l'approche
comportementale et de l'approche par sc&eacute;narios, il est possible
de classer les syst&egrave;mes de d&eacute;tection d'intrusions en fonction
d'autres param&egrave;tres :
<br>On peut classer les syst&egrave;mes en fonction de la r&eacute;ponse
qu'il apporte &agrave; l'intrusion qu'ils ont d&eacute;tect&eacute;e. Certains
syst&egrave;mes se contentent d'&eacute;mettre une alarme &agrave; l'administrateur
(r&eacute;ponse passive) tandis que d'autres essayent de contrer l'attaque
en cours (r&eacute;ponse active). Il y a pour l'instant deux principaux
m&eacute;canismes de r&eacute;ponse impl&eacute;ment&eacute;s : les alarmes
qui permettent de pr&eacute;venir rapidement l'administrateur et le filtrage
des paquets venant de l'attaquant.
<p>Les syst&egrave;mes peuvent &ecirc;tre class&eacute;s en fonction de
la provenance de leurs donn&eacute;es d'audit, selon qu'elles viennent
du syst&egrave;me, des applications ou des paquets du r&eacute;seau.
<p>Certains syst&egrave;mes surveillent en permanance le syst&egrave;me
d'informations tandis que d'autres se contentent d'une analyse p&eacute;riodique.
<p>On peut tr&egrave;s bien envisager de se baser sur d'autres param&egrave;tres
comme le d&eacute;lai de d&eacute;tection, c'est-&agrave;-dire si le syst&egrave;me
d&eacute;tecte les intrusions en temps r&eacute;el ou non, sa capacit&eacute;
de traiter les donn&eacute;es de fa&ccedil;on distribu&eacute;e, sa capacit&eacute;
&agrave; r&eacute;pondre aux attaques sur lui-m&ecirc;me ou encore son
degr&eacute; d'interop&eacute;rabilit&eacute; avec d'autres syst&egrave;mes
de d&eacute;tection d'intrusions.
<br>&nbsp;
<p><b><font size=+2>3&nbsp; Les syst&egrave;mes de d&eacute;tection d'intrusions
actuels</font></b>
<p><b><font size=+1>3.1&nbsp; Mod&egrave;le de base d'un syst&egrave;mes
de d&eacute;tection d'intrusions</font></b>
<p>Le premier syst&egrave;me de d&eacute;tection d'intrusions a &eacute;t&eacute;
propos&eacute; en 1980 par James&nbsp; ANDERSON. Il en existe maintenant
beaucoup d'autres, commerciaux ou non. La majorit&eacute; de ses syst&egrave;mes
se basent sur les deux approches, comportementale et par sc&eacute;narios.
<br>Stefan&nbsp; AXELSSON donne un mod&egrave;le d'architecture de base
pour un syst&egrave;me de d&eacute;tection d'intrusions. Du syst&egrave;me
surveill&eacute;, un module s'occupe de la collecte d'informations d'audit,
ces donn&eacute;es &eacute;tant stock&eacute;es quelque part. Le module
de traitement des donn&eacute;es int&eacute;ragit avec ces donn&eacute;es
de l'audit et les donn&eacute;es en cours de traitement, ainsi qu'avec
les donn&eacute;es de r&eacute;f&eacute;rence (signatures, profils) et
de configuration entr&eacute;es par l'administrateur du syst&egrave;me
de s&eacute;curit&eacute;. En cas de d&eacute;tection, le module de traitement
remonte une alarme vers l'administrateur du syst&egrave;me de s&eacute;curit&eacute;
ou vers un module. Une r&eacute;ponse sera ensuite apport&eacute; sur le
syst&egrave;me surveill&eacute; par l'entit&eacute; alert&eacute;e.
<p>Les imperfections de ce type de syst&egrave;mes monolithiques et m&ecirc;me
des syst&egrave;mes de d&eacute;tection d'intrusions en g&eacute;n&eacute;ral
sont &agrave; prendre en compte. Stefano Martino souligne que si un certain
nombre de techniques ont &eacute;t&eacute; d&eacute;velopp&eacute;es jusque
l&agrave; pour les syst&egrave;mes de d&eacute;tection d'intrusions, la
plupart analysent des &eacute;v&egrave;nements au niveau local et se contentent
de remonter une alarme sans agir. Ils d&eacute;tectent de plus les activit&eacute;s
dangereuses d'un utilisateur sans se pr&eacute;occuper du code dangereux.
<p><b><font size=+1>3.2&nbsp; Imperfections dans les impl&eacute;mentations
actuelles</font></b>
<p>Dans la plupart des cas, les syst&egrave;mes de d&eacute;tection d'intrusions
sont faits d'un seul bloc ou module qui se charge de toute l'analyse. Ce
syst&egrave;me monolithique demande qu'on lui fournisse beaucoup de donn&eacute;es
d'audit, ce qui utilise beaucoup de ressources de la machine surveill&eacute;e.
L'aspect monolithique pose &eacute;galement des probl&egrave;mes de mises
&agrave; jour et constitue un point d'attaque unique pour ceux qui veulent
s'introduire dans le syst&egrave;me d'informations.
<br>D'autres imperfections plus g&eacute;n&eacute;rales sont relevables
dans les syst&egrave;mes de d&eacute;tection d'intrusions actuels :
<br>- M&ecirc;me en impl&eacute;mentant les deux types d'approches, certaines
attaques sont ind&eacute;celables et les syst&egrave;mes de d&eacute;tection
sont eux-m&ecirc;me attaquables. Les approches comportementale et par sc&eacute;narios
ont elles-m&ecirc;mes leurs limites.
<br>- Les groupes de travail sur ce sujet sont relativement ferm&eacute;s
et il n'y a pas de m&eacute;thodologie g&eacute;n&eacute;rique de construction.
Aucun standard n'a pour l'instant vu le jour dans ce domaine. Des groupes
y travaillent, notament au sein de la DARPA et de l'IETF.
<br>- Les mises &agrave; jour de profils, de signatures d'attaques ou de
fa&ccedil;on de sp&eacute;cifier des r&egrave;gles sont g&eacute;n&eacute;ralement
difficiles. De plus, les syst&egrave;mes de d&eacute;tection d'intrusions
demande de plus en plus de comp&eacute;tence &agrave; celui qui administre
le syst&egrave;me de s&eacute;curit&eacute;.
<br>- Les syst&egrave;mes de d&eacute;tection sont g&eacute;n&eacute;ralement
&eacute;crits pour un seul environnement et ne s'adapte pas au syst&egrave;me
surveill&eacute; alors que les syst&egrave;mes d'informations sont, la
plupart du temps, h&eacute;t&eacute;rog&egrave;nes et utilis&eacute;s de
plusieurs fa&ccedil;ons diff&eacute;rentes.
<br>- Aucune donn&eacute;e n'a &eacute;t&eacute; pour l'instant publi&eacute;e
pour quantifier la performance d'un syst&egrave;me de d&eacute;tection
d'intrusions. De plus, pour tester ces syst&egrave;mes, les attaques sont
de plus en plus difficile &agrave; simuler.
<p>De ces imperfections, on a tent&eacute; de r&eacute;pondre &agrave;
la question "Quelles sont les obligations d'un syst&egrave;me de d&eacute;tection
d'intrusions?" et on en a d&eacute;duit des conditions indispensables pour
un bon fonctionnement de ces syst&egrave;mes.
<p><b><font size=+1>3.3&nbsp; Conditions de fonctionnement des syst&egrave;mes
de d&eacute;tection d'intrusions</font></b>
<p>Stefano&nbsp; MARTINO souligne qu'un syst&egrave;me de d&eacute;tection
d'intrusions vise &agrave; augmenter la fiabilit&eacute; d'un r&eacute;seau
et en devient donc un composant critique. Un syst&egrave;me de d&eacute;tection
d'intrusions, quelque soit son architecture, doit :
<li>
tourner en permanence sans superviseur humain.</li>

<li>
&ecirc;tre tol&eacute;rant aux fautes et r&eacute;sister aux attaques.</li>

<li>
utiliser un minimum de ressources du syst&egrave;me surveill&eacute;.</li>

<li>
d&eacute;tecter les d&eacute;viations par rapport &agrave; un comportement
normal.</li>

<li>
&ecirc;tre facilement adaptable &agrave; un r&eacute;seau sp&eacute;cifique.</li>

<li>
s'adapter aux changements avec le temps.</li>

<li>
&ecirc;tre difficile &agrave; tromper.</li>

<br>Les conditions &agrave; appliquer aux syst&egrave;mes de d&eacute;tection
d'intrusions peuvent &ecirc;tre class&eacute;es en deux parties : les conditions
fonctionnelles, c'est-&agrave;-dire ce que le syst&egrave;me de d&eacute;tection
se doit de faire, et les conditions de performances, c'est-&agrave;-dire
comment il se doit de le faire.
<br>Un syst&egrave;me de d&eacute;tection d'intrusions se doit &eacute;videmment
de faire une surveillance permanente et d'&eacute;mettre une alarme en
cas de d&eacute;tection. Il doit de fournir suffisamment d'informations
pour r&eacute;parer le syst&egrave;me et de d&eacute;terminer l'&eacute;tendu
des dommages et la responsabilit&eacute; de l'intrus. Il doit &ecirc;tre
modulable et configurable pour s'adapter aux plates-formes et aux architectures
r&eacute;seaux. Il doit pouvoir assurer sa propre d&eacute;fense, comme
supporter que tout ou partie du syst&egrave;me soit hors-service. La d&eacute;tection
d'anomalies doit avoir un faible taux de faux positifs. Le syst&egrave;me
de d&eacute;tection doit tirer les le&ccedil;ons de son exp&eacute;rience
et &ecirc;tre fr&eacute;quemment mis &agrave; jour avec de nouvelles signatures
d'attaques. De plus, il doit pouvoir g&eacute;rer les informations apport&eacute;es
par chacune des diff&eacute;rentes machines et discuter avec chacune d'entre
elles. En cas d'attaques, il doit &ecirc;tre capable d'apporter une r&eacute;ponse
automatique, m&ecirc;me aux attaques coordonn&eacute;es ou distribu&eacute;es.
Ensuite, le syst&egrave;me de d&eacute;tection devra &eacute;galement pouvoir
travailler avec d'autres outils, et notamment ceux de diagnostic de s&eacute;curit&eacute;
du syst&egrave;me. Il faudra, lors d'une attaque, retrouver les premiers
&eacute;v&egrave;nements de corruption pour r&eacute;parer correctement
le syst&egrave;me d'informations. Enfin, il va de soi qu'il ne doit pas
cr&eacute;er de vuln&eacute;rabilit&eacute;s suppl&eacute;mentaires et
qu'il doit aussi surveiller l'administrateur syst&egrave;me.
<p>Les &eacute;v&egrave;nements anormaux ou les br&egrave;ches dans la
s&eacute;curit&eacute; doivent &ecirc;tre rapport&eacute;s en temps r&eacute;el
pour minimiser les d&eacute;g&acirc;ts. Le syst&egrave;me de d&eacute;tection
d'intrusions ne devra pas donner un lourd fardeau au mat&eacute;riel surveill&eacute;,
ni interf&eacute;rer avec les op&eacute;rations qu'il traite. Il doit pouvoir
s'adapter &agrave; la taille du r&eacute;seau qu'il surveille.
<p>Pour pallier &agrave; un certain nombre de ses probl&egrave;mes et remplir
ses conditions, la technologie des agents mobiles a &eacute;t&eacute; appliqu&eacute;e
aux syst&egrave;mes de d&eacute;tection d'intrusions. Le paragraphe suivant
explique le principe, les avantages et les inconv&eacute;nients des agents
mobiles.
<p><b><font size=+2>4&nbsp; Utilisation des agents mobiles dans les syst&egrave;mes
de d&eacute;tection d'intrusions</font></b>
<p>Une alternative &agrave; l'utilisation d'un module monolithique pour
la d&eacute;tection d'intrusions est la mise en oeuvre de processus ind&eacute;pendants.<b><font size=+1></font></b>
<p><b><font size=+1>4.1&nbsp; Qu'est-ce qu'un agent mobile ?</font></b>
<p>Un agent mobile est un programme autonome qui peut se d&eacute;placer
de son propre chef, de machine en machine sur un r&eacute;seau h&eacute;t&eacute;rog&egrave;ne
dans le but de d&eacute;tecter et combattre les intrusions. Cet agent mobile
doit &ecirc;tre capable de s'adapter &agrave; son environnement, de communiquer
avec d'autres agents, de se d&eacute;placer et de se prot&eacute;ger. Pour
ce dernier point, une des fonctions de l'agent doit &ecirc;tre l'identification
et l'authentification pour donner l'emplacement et l'identit&eacute; de
celui qui l'a lanc&eacute;.
<br>Ainsi, Chaque agent est un programme l&eacute;ger, insuffisant pour
faire un syst&egrave;me de d&eacute;tection d'intrusions entier car il
n'a qu'une vision restreinte du syst&egrave;me. Si plusieurs agents coop&egrave;rent,
un syst&egrave;me de d&eacute;tection plus complet peut &ecirc;tre construit,
permettant l'ajout et le retrait d'agents sans reconstruire l'ensemble
du syst&egrave;me.
<p>La premi&egrave;re caract&eacute;ristique dont ont peut tirer des avantages
est la mobilit&eacute; des agents. Le fait qu'il n'y ait pas de programme
principal qui se sert des autres modules comme esclaves mais plut&ocirc;t
la pr&eacute;sence de plusieurs entit&eacute;s intelligentes qui collaborent,
fait que si une des entit&eacute;s s'arr&ecirc;te, le syst&egrave;me continue
de fonctionner.
<p><b><font size=+1>4.2&nbsp; Avantages et inconv&eacute;nients des agents
mobiles</font></b>
<p>Si les agents n'apportent pas fondamentalement de nouvelles capacit&eacute;s,
ils apportent n&eacute;anmoins des r&eacute;ponses aux imperfections soulign&eacute;es
pr&eacute;c&eacute;demment. Stefano&nbsp; MARTINO fait d'ailleurs une analogie
entre le syst&egrave;me immunitaire humain et cette approche : chaque cellule
ou agent doit combattre les intrus avant que &ccedil;a ne deviennent une
menace pour le syst&egrave;me.
<br>Quatre classes peuvent &ecirc;tre faites pour caract&eacute;riser ces
avantages :
<p>La flexibilit&eacute; : on a la possibilit&eacute; d'adapter le nombre
d'agents &agrave; la taille du syst&egrave;me d'informations ainsi que
d'avoir des agents entra&icirc;n&eacute;s en fonction du syst&egrave;me
surveill&eacute;.
<br>L'efficacit&eacute; : les agents affectent moins les performances de
chaque machine puisqu'ils peuvent travailler sur les ressources ayant uniquement
rapport avec leur champ de vision. Le gain au niveau de l'&eacute;change
d'informations, sur le r&eacute;seau notamment, est loin d'&ecirc;tre n&eacute;gligeable.
<br>La fiabilit&eacute; : c'est la tol&eacute;rance aux fautes. Si un agent
est hors-service, il reste d'autres agents qui peuvent se reproduire. Le
syst&egrave;me de d&eacute;fense n'est pas annihil&eacute; par la compromission
d'un seul agent, un agent corrompu ne donnnant pas une image fausse de
l'ensemble du syst&egrave;me aux autres agents.
<br>La portabilit&eacute; : les agents supportent plus facilement les syst&egrave;mes
distribu&eacute;s, et donc &agrave; la fois l'aspect h&ocirc;te et l'aspect
r&eacute;seau. Notons par exemple que ce syst&egrave;me permet de d&eacute;tecter
les attaques distribu&eacute;es, c'est-&agrave;-dire d&ucirc;es aux attaques
simultan&eacute;es de plusieurs personnes r&eacute;parties sur un r&eacute;seau.
<br>En plus de ses avantages, il y en a encore un certain nombre. L'architecture
par agents mobiles est naturelle et pr&eacute;sente une plus grande r&eacute;sistance
aux attaques puisqu'elle se base sur un syst&egrave;me autre que hi&eacute;rarchique.
Qui plus est, elle est bas&eacute;e sur une ex&eacute;cution asynchrone
et une certaine autonomie, ce qui fait que les agents mobiles sont d&eacute;solidaris&eacute;s
du reste pour une plus grande tol&eacute;rance aux fautes. Enfin, les agents
mobiles pr&eacute;sentent la capacit&eacute; de s'adapter dynamiquement
aux changements et peuvent donc r&eacute;agir plus rapidement.
<br>Si les syst&egrave;mes par agents mobiles ont des avantages ind&eacute;niables,
ils ont &eacute;galement des inconv&eacute;nients notables. Il est clair
que le codage et le d&eacute;ploiement sera difficile pour assurer un code
code s&ucirc;r avec beaucoup de fonctionnalit&eacute;s.
<p>Il y a d'autres inconv&eacute;nients : quand les agents se d&eacute;placent,
un noeud d&eacute;pourvu d'agent est vuln&eacute;rable pendant un moment.
De plus, si les agents ont besoin d'un apprentissage, ce temps peut &ecirc;tre
long. Il souligne ensuite quelques unes des imperfections des syst&egrave;mes
de d&eacute;tection d'intrusions qui ne sont pas corrig&eacute;es par le
syst&egrave;me des agents mobiles. Ils peuvent &ecirc;tre corrompus et
ils imposent une utilisation des ressources et que quelque soit le syst&egrave;me.
Enfin, certains attaquants r&eacute;ussiront toujours &agrave; obtenir
des droits pendant quelques temps avant d'&ecirc;tre d&eacute;tect&eacute;s.
<p>Enfin, quelques points resteront &agrave; &eacute;tudier, comme la performance,
car il faut voir la rapidit&eacute; avec laquelle l'agent d&eacute;tecte
et remonte l'information d'intrusion, la taille du code, car les syst&egrave;mes
de d&eacute;tection sont complexes et les agents risquent de demander d'assez
gros programmes et le temps d'adaptation des agents &agrave; un syst&egrave;me,
car il y aura un manque de connaissance de base &eacute;tant donn&eacute;
que beaucoup de plates-formes et de configurations sont diff&eacute;rentes.
<p><b><font size=+1>4.3&nbsp; Conclusion et perspectives pour les agents
mobiles</font></b>
<p>Si les agents mobiles apportent des avantages importants, les inconv&eacute;nients
qu'ils engendent du m&ecirc;me coup ne sont pas n&eacute;gligeable. Cependant,
l'approche par agents mobiles semble pouvoir donner des r&eacute;sultats
meilleurs que les autres technologies et la recherche va d&eacute;velopper
une nouvelle architecture pour cette technologie.
<br>Les avantages des agents mobiles pourront &ecirc;tre exploit&eacute;s
de plusieurs fa&ccedil;ons : en pr&eacute;voyant de la surveillance en
plus de la d&eacute;tection, en fournissant une r&eacute;ponse aux attaques
et en augmentant la fiabilit&eacute; du syst&egrave;me. On peut aussi tirer
profit de la diversit&eacute; en repr&eacute;sentant les signatures d'attaques
par une m&eacute;thode diff&eacute;rente pour chaque agent.
<br>&nbsp;
<p><b><font size=+2>5&nbsp; Perspectives pour la recherche</font></b>
<p>Les tendances de la recherche vont de la machine vers le r&eacute;seau,
d'un syst&egrave;me centralis&eacute; vers un syst&egrave;me distribu&eacute;,
vers une plus grande interop&eacute;rabilit&eacute; des syst&egrave;mes
et vers une plus grande r&eacute;sistance aux attaques. Les constantes
de la recherche sont l'utilisation d'un syst&egrave;me hybride (approche
comportementale et par sc&eacute;narios) permettant de la d&eacute;tection
en temps r&eacute;el. Beaucoup de chercheurs se penchent sur le probl&egrave;me
de l'am&eacute;lioration du nombre de faux positifs et d'attaques non d&eacute;tect&eacute;s.
<br>Les m&eacute;canismes id&eacute;aux de r&eacute;ponses aux attaques
consisteraient &agrave; supprimer l'action de l'intrus dans la cible, &eacute;teindre
la cible et prot&eacute;ger le reste du r&eacute;seau. Dans le cas des
attaques internes, il faudrait bloquer l'attaquant, &eacute;teindre sa
machine ou &ecirc;tre capable de remonter &agrave; l'attaquant tr&egrave;s
rapidement pour surveiller ses actions. Enfin, il faudrait que le syst&egrave;me
de d&eacute;tection puisse toujours modifier les tables de filtrage des
routeurs et pare-feux, ce qui est d&eacute;j&agrave; le cas de certains
syst&egrave;mes du commerce.
<p>L'approche par agents mobiles apportent l&agrave; aussi une solution
puisqu'il n'est pas n&eacute;cessaire d'avoir un serveur de s&eacute;curit&eacute;
dans le sens o&ugrave; les agents peuvent automatiquement se mouvoir dans
le r&eacute;seau et installer les composants appropri&eacute;s sur les
&eacute;l&eacute;ments qu'il faut. Ils peuvent traquer les attaquants et
rassembler des preuves de fa&ccedil;on automatique ou encore effectuer
des op&eacute;rations sur la machine de l'attaquant, sur la machine cible
ou sur le r&eacute;seau en les mettant, par exemple, en quarantaine.
<p><b>Un certain nombre de questions restent ouvertes :</b>
<p><i>Quels types d'intrusions est-on s&ucirc;r de d&eacute;tecter ?</i>
<br><i>De quelles donn&eacute;es d'audit a-t-on besoin pour prendre la
d&eacute;cision qu'il y a eu intrusion ?</i>
<br><i>Quels sont les types d'attaques contre les syst&egrave;mes de d&eacute;tection
m&ecirc;me ?</i>
<br><i>Quand est-on s&ucirc;r que le syst&egrave;me de d&eacute;tection
d'intrusions n'est pas compromis et si c'est le cas, que faire ?</i>
<br><i>Quelle quantit&eacute; minimum de ressources peut prendre un syst&egrave;me
de d&eacute;tection pour &ecirc;tre efficace ?</i>
<br><i>A ces questions, on peut en ajouter une autre : Comment peut-on
r&eacute;duire le taux de faux positif? La r&eacute;ponse passera sans
doute par ces deux autres questions :</i>
<br><i>Quelles m&eacute;thodes et m&eacute;canismes permettent de d&eacute;tecter
les sc&eacute;narios d'attaques complexes?</i>
<br><i>Comment peut-on faire coop&eacute;rer les diff&eacute;rents syst&egrave;mes
de d&eacute;tection d'intrusions?</i>
</body>
</html>
