<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Clad Strife">
   <meta name="GENERATOR" content="Mozilla/4.61 [en] (Win98; I) [Netscape]">
   <title>Virus partie B</title>
</head>
<body text="#000000" bgcolor="#FFF5F0" link="#0000EE" vlink="#551A8B" alink="#FF0000">

<center><b><tt><font size=+2>Virus (B): th&egrave;mes</font></tt></b></center>

<br><b><tt><font size=+2></font></tt></b>&nbsp;
<br><b><tt><font size=+2></font></tt></b>&nbsp;
<br><b><tt><font size=+2></font></tt></b>
<br><b><tt><font size=+2></font></tt></b>
<br><b><tt><font size=+2></font></tt></b>
<br><b><tt><font size=+2></font></tt></b>
<br>
<p>Lorsque les virus ont fait leur apparition, le seul syst&egrave;me d'exploitation
notable &eacute;tait MS-DOS. Il a fallu quelques ann&eacute;es pour que
Windows se stabilise et devienne populaire, ce qui a favoris&eacute; l'&eacute;closion
des fichiers sous MS-DOS. En fait, la plupart des virus de fichiers (&agrave;
l'exception des virus de macro) sont bas&eacute;s sur MS-DOS.
<br>Bien qu'OS/2 soit entr&eacute; en sc&egrave;ne peu de temps apr&egrave;s
l'apparition des virus, il n'a jamais &eacute;t&eacute; un syst&egrave;me
d'exploitation tr&egrave;s r&eacute;pandu, comme l'&eacute;tait DOS. De
ce fait, les programmeurs de virus &eacute;taient - et sont toujours -
moins &agrave; m&ecirc;me d'employer OS/2 et, m&ecirc;me si des virus ont
&eacute;t&eacute; fr&eacute;quemment &eacute;crits pour OS/2, ils ne sont
pas aussi r&eacute;pandus que les virus MS-DOS. Il en r&eacute;sulte que
seuls deux virus OS/2 sont connus &agrave; ce jour.
<br>Windows 95/98 et Windows NT deviennent tr&egrave;s communs, et ils
sont compatibles vers la bas avec MS-DOS, ce qui signifie que cette compatibilit&eacute;
est &eacute;galement vraie pour les virus. Cependant, l'architecture des
nouveaux syst&egrave;mes d'exploitation sont un challenge int&eacute;ressant
pour les virus.
<p><b>MS-DOS: </b>les virus de macro que nous avons vu infectant les fichiers
de donn&eacute;es g&eacute;n&eacute;r&eacute;s et lus par des applications
Windows, ils ne sont pas un probl&egrave;me sur les machines ne fonctionnant
que sous MS-DOS.
<br>Les virus de fichiers et d'amor&ccedil;age traditionnels prosp&egrave;rent
dans les machines MS-DOS, car ce syst&egrave;me ne dispose d'aucune fonction
de s&eacute;curit&eacute;. Les virus ont donc le champ libre pour infecter
la m&eacute;moire et les fichiers de programmes, comme le d&eacute;crit
la section Virus de fichier.
<p><b>Windows 3x: </b>lorsque Windows a &eacute;t&eacute; introduit, les
utilisateurs ont d&ucirc; changer de comportement vis &agrave; vis de leur
ordinateur. Les images &eacute;taient plus color&eacute;es, la navigation
dans un programme devint plus intuitive et le fait de passer d'une t&acirc;che
&agrave; l'autre sans quitter l'application &eacute;tait tr&egrave;s appr&eacute;ciable.
<br>DOS continuant &agrave; se charger sous Windows, les virus de fichiers
pouvaient infecter les machines fonctionnant sous Windows, bien que leur
esp&eacute;rance de vie soit r&eacute;duite. En g&eacute;n&eacute;ral,
les virus de fichiers peuvent infecter les ex&eacute;cutables de Windows,
qui se mettent alors &agrave; mal fonctionner. Les utilisateurs impatients
les remplacent alors ou, s'ils sont suffisamment frustr&eacute;s, ils peuvent
m&ecirc;me r&eacute;installer Windows. Cet &eacute;tat de fait a entra&icirc;n&eacute;
la fin des virus traditionnels. De plus, la structure des ex&eacute;cutables
de Windows est plus compliqu&eacute;e et la m&eacute;moire est mieux prot&eacute;g&eacute;e.
Ces virus n'ont donc jamais atteint sous Windows la puissance qu'ils avaient
sous MS-DOS.
<br>Cependant, cette fatalit&eacute; ne s'est pas appliqu&eacute;e aux
virus de macros et d'amor&ccedil;age. Les virus de macro sont maintenant
&eacute;crits pour les applications Windows, la pr&eacute;sence de Windows
est donc n&eacute;cessaire. La combinaison du fort d&eacute;veloppement
de Windows et du fait que les virus de macros infectent d&eacute;sormais
les fichiers de donn&eacute;es de pr&eacute;f&eacute;rence aux programmes
(reportez-vous &agrave; Virus de Macro) a fait qu'un virus de macro, Macro.Word.Concept,
est devenu l'un des dix virus les plus courants.
<br>Le processus de d&eacute;marrage des machines Windows est tr&egrave;s
similaire &agrave; celui des PC fonctionnant sous DOS uniquement. Windows
n'a donc pas r&eacute;solu le probl&egrave;me virus d'amor&ccedil;age qui
continuent &agrave; se propager en infectant les disques durs, s'installant
en m&eacute;moire et infectant les disquettes.
<p><b>OS/2: </b>OS/2 n'est pas aussi fortement r&eacute;pandu que Windows
ou que les autres syst&egrave;mes d'exploitation de Microsoft. Cependant,
du fait de sa conception, il est toujours sensible aux virus non sp&eacute;cifiques
&agrave; OS/2.
<br>Contrairement &agrave; Windows, MS-DOS ne fonctionne pas sous OS/2.
OS/2 est un syst&egrave;me d'exploitation 32-bits tr&egrave;s puissant
supportant les applications DOS, Windows et OS/2 natives. Pour faire fonctionner
les applications DOS, OS/2 propose VDM (machine virtuelle DOS). Comme son
nom le sugg&egrave;re, VDM "ressemble" &agrave; DOS. Un programme DOS infect&eacute;
peut donc infecter un autre programme DOS dans cette VDM, mais en aucun
cas ceux des autres VDM. Le programme infect&eacute; peut ensuite contaminer
les autres fichiers programmes lanc&eacute;s plus tard dans la VDM. L'infection
continue donc.
<p>Si les applications Windows int&eacute;grant des langages de programmation
de macros sont lanc&eacute;es sur une machine OS/2, alors cette derni&egrave;re
devient aussi sensible aux virus de macros qu'une machine Windows.
<br>L&agrave; encore, le processus de d&eacute;marrage &eacute;tant le
m&ecirc;me sur les machines compatibles IBM avant le chargement du syst&egrave;me
d'exploitation, alors les virus d'amor&ccedil;age peuvent toucher les machines
OS/2. OS/2 g&egrave;re les disquettes d'une fa&ccedil;on diff&eacute;rente
de DOS ou Windows, aussi la probabilit&eacute; de propagation d'un virus
d'amor&ccedil;age apr&egrave;s qu'il ait infect&eacute; le disque dur est
moins &eacute;lev&eacute;e sur une machine OS/2 que sur une machine Windows
ou DOS. Le risque tient plut&ocirc;t dans l'action du virus d'amor&ccedil;age
sur le disque dur. Si le virus est con&ccedil;u pour avoir une certaine
puissance, alors il la d&eacute;livrera tr&egrave;s probablement, sans
consid&eacute;ration du fait qu'il peut infecter les disquettes ou non.
<p>OS/2 supporte deux syst&egrave;mes de fichiers : FAT (table d'allocation
des fichiers) et HPFS (syst&egrave;me de fichiers hautes performances),
et vous pouvez en utiliser un ou les deux. HPFS est plus &eacute;volu&eacute;
et ils stocke les informations dans des endroits diff&eacute;rents, vous
pouvez donc vous attendre &agrave; de s&eacute;rieux effets sur un syst&egrave;me
HPFS de la part d'un virus d'amor&ccedil;age qui n'esp&egrave;re trouver
qu'une FAT.
<p><b>Windows9x:</b> Windows 95 a &eacute;t&eacute; lanc&eacute; au moment
o&ugrave; Internet est devenu public. De nos jours, le web est accessible
&agrave; tous. Bien que la majorit&eacute; des utilisateurs de PC ait accueilli
favorablement Internet, la messagerie &eacute;lectronique et les programmes
de discussion, la face cach&eacute;e est un &eacute;norme potentiel d'auteurs
de virus, parfois r&eacute;pertori&eacute;s comme terroristes Internet.
L'emploi intensif de ces possibilit&eacute;s a contribu&eacute; &agrave;
la propagation des virus sous Windows 95/98.
<br>Contrairement &agrave; Windows et DOS, Windows 95/98 est suppos&eacute;
int&eacute;grer des fonctions de s&eacute;curit&eacute;. Malheureusement,
elles ne sont pas assez puissantes pour prot&eacute;ger ce syst&egrave;me
contre les virus. En fait, le premier virus &eacute;crit sp&eacute;cialement
pour Windows 95 (le virus Boza) a &eacute;merg&eacute; d&egrave;s la fin
de 1995. Qui plus est, l'environnement r&eacute;seau pour groupe de travail
de Windows 95 ne poss&eacute;dait pas de protection des fichiers, ce qui
pouvait conduire &agrave; l'aumentation de la propagation des virus.
<p>Apr&egrave;s le virus Boza assez primitif, les virus Windows 95/98 ont
augment&eacute; en nombre et en complexit&eacute;. Comme dans l'environnement
DOS, les premiers virus &eacute;taient tr&egrave;s amateurs. Ils sont devenus
techniquement plus complexes, les auteurs gagnant en exp&eacute;rience.
Certains virus sous Windows 95/98 se r&eacute;pandent par l'emploi intensif
du protocole r&eacute;seau. Un sommet temporaire de complexit&eacute; et
de capacit&eacute; destructive a &eacute;t&eacute; atteint avec l'arriv&eacute;e
du virus CIH en 1998. Windows 95/98 partage de nombreuses caract&eacute;ristiques
avec OS/2, respectant l'architecture du syst&egrave;me et l'interaction
avec les virus.
<p>Comme OS/2, Windows 95/98 est un syst&egrave;me d'exploitation 32-bits
qui supporte les applications DOS, Windows et les applications natives
Windows 95/98.
<br>De m&ecirc;me qu'OS/2 a ses VDM, Windows 95/98 poss&egrave;de des VM
(machines virtuelles) - une machine virtuelle syst&egrave;me poss&eacute;dant
un espace d'adressage s&eacute;par&eacute; pour les applications Win32
; un espace d'adressage partag&eacute; pour les applications Win16 ; et
des machines virtuelles s&eacute;par&eacute;es pour les applications DOS
individuelles.
<br>Les virus de fichiers peuvent se propager facilement sur une machine
Windows 95/98 parce que la seule limitation des fichiers programmes de
DOS sous Windows 95/98 est qu'ils ne peuvent pas &eacute;crire directement
sur le disque dur.
<p>Chaque VM DOS s'appuie sur les caract&eacute;ristiques du syst&egrave;me
tel qu'il &eacute;tait lors du chargement de la machine virtuelle. Windows
95/98 se chargeant en lan&ccedil;ant les m&ecirc;mes programmes DOS qu'une
machine purement DOS, il est possible qu'un programme infect&eacute; se
lance lors du chargement et qu'il pourra infecter les programmes de la
VM. De plus, si le programme infect&eacute; a &eacute;t&eacute; lanc&eacute;
pendant le d&eacute;marrage, il peut s'activer dans toutes les VM lanc&eacute;es
ult&eacute;rieurement. Bien que les fichiers programmes d'une VM ne puissent
pas infecter les programmes d'une autre, il est possible pour un programme
infect&eacute; de se charger dans une machine VM s&eacute;par&eacute;e
plus tard, et l'infection peut continuer.
<p>Les virus de macros ont &eacute;t&eacute; &eacute;crits pour dater les
fichiers cibles g&eacute;n&eacute;r&eacute;s et lus par des applications
Win16 et Win32 qui sont lus sous Windows 95/98. Le r&eacute;sultat est
l'abondance des abondances de macro virus sous Windows 95/98.
<br>Le processus de d&eacute;marrage sous Windows 95/98 est le m&ecirc;me
que pour les machines DOS ou Windows (jusqu'&agrave; un certain point),
les virus d'amor&ccedil;age sont capables d'infecter les disques durs des
machines Windows 95/98. Lorsque Windows 95/98 se charge, cependant, les
virus d'amor&ccedil;age sont souvent d&eacute;sactiv&eacute;s et ne peuvent
pas se propager. Si le virus d'amor&ccedil;age a une puissance potentielle,
il peut la lib&eacute;rer sans n&eacute;cessiter une duplication pr&eacute;alable.
<p><b>WindowsNT:</b> ainsi que nous l'avons dit dans les sections OS/2
et Windows 95/98, Windows NT supporte les applications DOS applications,
Windows, et les applications Windows NT natives. Tout comme Windows 95/98,
Windows NT est compatible vers le bas avec DOS et Windows. Malgr&eacute;
que les fonctions de s&eacute;curit&eacute; de NT soient plus &eacute;labor&eacute;es
que celles de Windows 95/98, les virus de fichiers peuvent toujours se
propager dans Windows NT. Les applications DOS sont lanc&eacute;es dans
des machines virtuelles DOS s&eacute;par&eacute;es, et le virus peut fonctionner
dans cette fen&ecirc;tre. Certains virus de fichiers DOS peuvent ne pas
fonctionner correctement sous NT, mais rien sous NT ne peut emp&ecirc;cher
l'infection des fichiers.
<p>Comme Windows 95/98, Windows NT supporte des applications qui contiennent
des langages de programmation des macros, ce qui rend NT aussi vuln&eacute;rables
aux virus de macro que les machines Windows proprement dites.
<br>Les machines Windows NT d&eacute;marrant de la m&ecirc;me fa&ccedil;on
que les machines DOS (jusqu'au point ou NT prend le relais), les virus
d'amor&ccedil;age peuvent donc infecter les disques durs NT. Cependant,
lorsque ces virus tentent de s'installer en m&eacute;moire, ils sont stopp&eacute;s
par NT et deviennent incapables de s'installer sur une disquette. En effet,
cela stoppe l'infection, mais l'utilisateur doit g&eacute;rer tous les
effets secondaires du virus d'amor&ccedil;age sur le syst&egrave;me - destructions
ou manipulations du secteur d'amor&ccedil;age, emp&ecirc;chant le d&eacute;marrage
de NT.
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<p><b>CIH: </b>jusqu'au 26 avril 1998, il &eacute;tait vrai que les virus
pouvaient infliger de s&eacute;rieux dommages aux logiciels mais pas au
mat&eacute;riel. C'est ce jour la que le nouveau virus Win95.CIH.1003 a
frapp&eacute; pour la premi&egrave;re fois. Les victimes ont d&ucirc; remplacer
leur BIOS et parfois (surtout sur les portables) leur carte m&egrave;re.
Dans le mois qui ont suivi, le virus CIH a &eacute;t&eacute; signal&eacute;
partout dans le monde. Il existe maintenant sous quatre formes et se d&eacute;clenche
toujours le 26 du mois.
<br>Le virus CIH infecte les fichiers ex&eacute;cutables sous Windows 95/98
d'une fa&ccedil;on tr&egrave;s furtive. En principe un changement inattendu
dans la longueur d'un fichier binaire est un signe certain d'activit&eacute;
virus.
<p>La description technique des actions entreprises par ce virus lorsqu'il
se d&eacute;clenche sort du propos de cet ouvrage. Sachez cependant que
lorsque le BIOS est programm&eacute; par le virus CIH, le PC est lobotomis&eacute;
et oublie son langage interne. Lorsque cela se produit, le seul rem&egrave;de
est de remplacer cette pi&egrave;ce. Le virus peut aussi &eacute;craser
le contenu du disque dur et le rendre inutilisable.
<br>Le virus CIH nous rappelle que les auteurs de virus ont souvent &agrave;
leur disposition des informations d&eacute;taill&eacute;es sur les proc&eacute;dures
non document&eacute;es log&eacute;es au fin fond des syst&egrave;mes d'exploitation.
Lorsqu'ils emploient leur savoir-faire pour &eacute;crire des virus presque
exempts de bogues aussi nuisibles que CIH, une protection anti-virus efficace
est absolument n&eacute;cessaire.
<p>En g&eacute;n&eacute;ral, de nombreuses victimes de CIH ont &eacute;t&eacute;
infect&eacute;es apr&egrave;s avoir effectu&eacute; des t&eacute;l&eacute;chargements
sur des sites de jeux Internet. Nous pensons donc qu'il est utile de rappeler
&agrave; tous les surfers les risques qu'ils encourent au quotidien.
<br>Nous vous recommandons de visiter les pages web de votre fournisseur
d'outils anti-virus pour t&eacute;l&eacute;charger des mises &agrave; jour.
Les temps o&ugrave; vous pouviez vous contenter d'une mise &agrave; jour
trimestrielle de votre anti-virus sont d&eacute;finitivement r&eacute;volus.
<p><b>IRC: </b>Internet Relay Chat (IRC) est un syst&egrave;me qui permet
aux utilisateurs d'avoir des conversations en temps r&eacute;el sur Internet.
Les programmes IRC sont devenus ordinaires et ils sont assez &eacute;volu&eacute;s.
Il est possible d'&eacute;changer des fichiers et d'automatiser certaines
routines, par exemple. Certains programmes clients IRC acceptent le transfert
de fichiers permettant aux personnes pr&eacute;sentes d'envoyer des scripts
qui deviendront partie int&eacute;grante du client IRC proprement dit.
<br>Certains incidents se sont produits dans lesquels il a &eacute;t&eacute;
prouv&eacute; que ces scripts contenaient des portions de code qui, dans
les faits, ont attaqu&eacute; la machine de la victime. Script.ini, parfois
appel&eacute; le virus Ananas, est le code de ce type le plus r&eacute;pandu
et il accomplit des actions telles qu'envoyer des copies de lui-m&ecirc;me
aux autres utilisateurs, &eacute;met des opinions embarrassantes au nom
de l'utilisateur, ou transforme votre machine en serveur de fichiers public.
<p>On peut d&eacute;battre du fait que des scripts comme script.ini, DMSetup.exe
ou DMSetup2.exe, par exemple, soient consid&eacute;r&eacute;s comme des
worms ou des virus. On ne peut cependant pas nier qu'ils repr&eacute;sentent
un risque pour la s&eacute;curit&eacute; et que des virus peuvent &ecirc;tre
distribu&eacute;s via IRC, tout comme les autres fichiers.
<br>La meilleure pr&eacute;vention est de d&eacute;sactiver la fonction
" d'acquisition automatique " et de ne jamais accepter de fichiers ou de
programmes inconnus.
<br>&nbsp;
<p><b><i>Clad Strife</i></b>
</body>
</html>
