<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Clad Strife">
   <meta name="GENERATOR" content="Mozilla/4.61 [en] (Win98; I) [Netscape]">
   <title>Virus partie C</title>
</head>
<body text="#000000" bgcolor="#FFF5F0" link="#0000EE" vlink="#551A8B" alink="#FF0000">

<center><b><tt><font size=+2>VIRUS (C): pr&eacute;vention et d&eacute;tection
avec des programmes Windows</font></tt></b></center>

<p><br>
<br>
<br>
<br>
<br>
<br>
<p>&nbsp;&nbsp; L'action d'un virus est souvent rep&eacute;rable en fonction
de votre machine ou de votre OS. Souvent, lorsque le virus se met en action,
des signes d'activit&eacute; ext&eacute;rieure provenant de votre machine
sont notables: ralentissements, grattage sur le disque... On va essayer
de mieux cerner ces sympt&ocirc;mes au niveau de l'acitivit&eacute; du
disque, d'essayer de rep&eacute;rer si un quelconque programme utilise
votre m&eacute;moire vive de mani&egrave;re permanente, ou de rep&eacute;rer
des signes d'activit&eacute;s virales int&eacute;rieures flagrantes. Toujours
est-il quechacune des astuces livr&eacute;es ci-apr&egrave;s ne vous permettent
pas d'&eacute;liminer un virus. Le mieux est de faire appel &agrave; un
anti-virus r&eacute;cent.
<p>Commencez par un scann du disque &agrave; l'aide de Microsoft Scandisk.
S&eacute;lectionnez le(s) lecteur(s) &agrave; analyser. Pour "Type d'analyse"
cochez "Standard". Ne cochez pas "corriger automatiquement les erreurs".
Lancez le scann: si des probl&egrave;mes figurent, vous pouvez voir de
quoi il s'agit. Si des erreurs de structures ont &eacute;t&eacute; trouv&eacute;es
lancez une analyse "minutieuse".
<p>La perte de fragments de fichiers est un probl&egrave;me courant. Ce
type de probl&egrave;me peut &ecirc;tre du &agrave; des:
<ul>
<li>
erreurs de programme</li>

<li>
plantages syst&egrave;mes</li>

<li>
activit&eacute;s virales destructrices</li>
</ul>
Il est g&eacute;n&eacute;ralement plus efficace de supprimer les fragments
perdus et de lib&eacute;rer l'espace disque correspondant.
<p>Des informations incorrectes pour certains fichiers sont suspectes.
Ainsi une indication de taille erron&eacute;e peut notamment indiquer la
pr&eacute;sence d'un virus.
<p>Les erreurs touchant le secteur d'amor&ccedil;age sont tr&egrave;s alarmantes.
Elles constituent un sympt&ocirc;me &eacute;vident d'infection virale de
la zone d'amor&ccedil;age de votre disque dur. Si votre ordinateur fonctionne
sans probl&egrave;mes il vous est conseill&eacute; d'ignorer ce type de
messages.
<p>Nous savons que certains virus modifient la date des fichiers. Vous
pouvez demander &agrave; Scandisk de chercher les fichiers dont la date
et l'heure seraient non valides: dans Scandisk cliquez sur le bouton "Avanc&eacute;"
cochez ensuite "Dates et heures non valides" dans le carr&eacute; "V&eacute;rification
de fichiers". Validez et lancez l'analyse en "Standard". Regardez le r&eacute;sultat
de l'examen et agissez en cons&eacute;quence.
<p>De nombreux virus utilisent une partie de la m&eacute;moire conventionnelle
en guise de r&eacute;sidence. Pour passer inaper&ccedil;us, ils r&eacute;duisent
la taille de cette m&eacute;moire (qui atteint en principe 640ko exactement)
de quelques ko. Ils &eacute;vitent ainsi de se faire expulser par d'autres
programmes. Pour v&eacute;rifier que vous disposez de l'int&eacute;grit&eacute;
de votre m&eacute;moire conventionnelle, passez sous DOS. Puis tapez: <font color="#008080">mem</font>
<br><font color="#000000">Validez, et assurez vous que vous avez bien 640ko
&agrave; l'intersection de la ligne "Conventionnelle" et de la colonne
"Type de m&eacute;moire". V&eacute;rifiez &eacute;galement que le "Total
inf&eacute;rieur" est &eacute;quivalent &agrave; 640ko.&nbsp; Si il y a
un probl&egrave;me &agrave; ce niveau l&agrave;, passez votre ordinateur
&agrave; l'anti-virus (r&eacute;cemment mis &agrave; jour s'entend).</font>
<p><font color="#000000">Je l'ai d&eacute;j&agrave; dit, les virus peuvent
entrainer une augmentation de l'activit&eacute; du disque. Cette augmentation
d'activit&eacute; n'est pas forc&eacute;ment due &agrave; un virus, n&eacute;anmoins
vous pouvez surveillez cette activit&eacute; &agrave; l'aide de l'outil
"Moniteur syst&egrave;me":</font>
<ol>
<li>
<font color="#000000">Activez la commande "Supprimer un &eacute;l&eacute;ment"
du menu "Edition" pour d&eacute;truire les &eacute;l&eacute;ments &eacute;ventuellement
affich&eacute;s.</font></li>

<li>
<font color="#000000">S&eacute;lectionnez l'ensemble des &eacute;l&eacute;ments
de la liste et supprimez-les en cliquant sur OK</font></li>

<li>
<font color="#000000">Choisissez ensuite la commande "Edition/Ajouter un
&eacute;l&eacute;ment" pour choisir les activit&eacute;s du disque dur
&agrave; afficher.</font></li>

<li>
<font color="#000000">Dans la fen&ecirc;tre "Ajout d'un &eacute;l&eacute;ment",
dans la colonne de gauche intitul&eacute;e "Cat&eacute;gorie", choisissez
"Syst&egrave;me de fichiers"</font></li>

<li>
<font color="#000000">Tous les &eacute;l&eacute;ments correspondant &agrave;
cette cat&eacute;gorie s'affichent dans la colonne "Element". Choisissez
"Ecritures/seconde" et "Lectures/seconde". Validez.</font></li>
</ol>
<font color="#000000">Le moniteur syst&egrave;me affiche d&eacute;sormais
sous forme graphique les &eacute;l&eacute;ments s&eacute;lectionn&eacute;s.
Chaque activit&eacute; de lecture ou d'&eacute;criture sur le disque se
traduit par un pic sur le sch&eacute;ma. la commande "Toujours visible"
du menu "Affichage" vous permet de le garder sous les yeux en permanence.
R&eacute;duisez sa taille et placez le dans un coin de votre &eacute;cran
pour pouvoir surveiller l'activit&eacute; de votre disque en m&ecirc;me
temps que vous vous occupez d'autre chose.</font>
<br>&nbsp;
<br>&nbsp;
<table BORDER COLS=1 WIDTH="100%" BGCOLOR="#FFCCCC" >
<tr>
<td><b><i>Note:</i></b> si vous lancez le Moniteur syst&egrave;me en "mode
sans &eacute;chec" de Windows, et que vous n'utilisez pas votre PC, aucune
activit&eacute; disque ne doit &ecirc;tre enregistr&eacute;e. Si vous constatez
que c'est le cas, inqui&eacute;tez vous de savoir ce qui produit cet effet.</td>
</tr>
</table>

<p><font color="#000000">Pour &eacute;viter des probl&egrave;mes avec les
virus de secteurs d'amor&ccedil;age, les BIOS r&eacute;cents sont munis
d'une capacit&eacute; antivirale qui permet de contr&ocirc;ler ce probl&egrave;me.
Une fois dans votre BIOS allez dans: "Bios features setup", puis pour "Virus
Warning" changez la valeur et s&eacute;lectionnez "Enabled". Sauvez votre
configuration avant de partir.</font>
<p><font color="#000000">Un virus peut modifier d'autres r&eacute;glages
que ceux concernant le disque dur. Certains sont critiques, en particulier
lorsqu'ils d&eacute;finissent les temps d'acc&egrave;s &agrave; la m&eacute;moire.
Lorsqu'un virus s'attaque aux informations sur le Plug &amp; Play, certains
p&eacute;riph&eacute;riques deviennent (provisoirement) inutilisables.
Si vous &ecirc;tes confront&eacute;s &agrave; ce type de probl&egrave;mes,
il est possible qu'un virus en soit la cause. Pour r&eacute;tablir une
configuration correcte, allez dans votre BIOS, faites "Load BIOS defaults",
validez, sauvez et quittez. En effet pour tous les param&egrave;tres du
BIOS il existe un r&eacute;glage usine qui garantit le d&eacute;marrage
du PC.</font>
<p><font color="#000000">Les virus de secteur d'amor&ccedil;age sont particuli&egrave;rement
g&ecirc;nants. Ils s'installent dans les secteurs de d&eacute;marrage du
disque dur et par la m&ecirc;me occasion, endommagent, plus ou moins volontairement,
la zone d'amor&ccedil;age. Le PC refuse ensuite de d&eacute;marrer &agrave;
partir du disque dur et affiche le message d'erreur suivant: "DISK BOOT
FAILURE, INSERT SYSTEM DISK AND PRESS ENTER". La seule solution consiste
&agrave; amorcer l'ordinateur au moyen d'une disquette, si possible une
disquette de secours pr&eacute;par&eacute;e auparavant. Une fois effectu&eacute;
le d&eacute;marrage, une question essentielle se pose: est-ce que les donn&eacute;es
du disque dur sont perdues? Ce n'est pas n&eacute;cessairement le cas.
Des outils que vous poss&eacute;dez peuvent souvent r&eacute;tablir l'acc&egrave;s
au disque. En ce sens, vous avez besoin d'une disquette d'amor&ccedil;age
comportant l'utilitaire FDISK.EXE. Vous pouvez &eacute;ventuellement la
configurer sur un autre PC.</font>
<ol>
<li>
<font color="#000000">D&eacute;marrez l'ordinateur &agrave; partir de la
disquette d'amor&ccedil;age</font></li>

<li>
<font color="#000000">Attendez l'affichage de la ligne de commande DOS</font></li>

<li>
<font color="#000000">Saisissez la commande: </font><font color="#008080">fdisk
/mbr </font><font color="#000000">et validez. Vous lancez ainsi l'utilitaire
syst&egrave;me Fdisk qui g&egrave;re les disques durs disponibles. L'option
<i>Master
Boot Recovery </i>(MBR) r&eacute;tablit, dans le secteur d'amor&ccedil;age,
les informations d'origine exploit&eacute;es par le PC au d&eacute;marrage.
Il est possible que vous n'ayez jamais entendu parler de ce param&egrave;tre
et que votre manuel n'y fasse pas allusion. Il s'agit d'une fonction non
document&eacute;e, quasi inconnue.</font></li>

<li>
<font color="#000000">FDISK analyse le contenu du secteur d'amor&ccedil;age
et le corrige &eacute;ventuellement</font></li>

<li>
<font color="#000000">Ejectez la disquette du lecteur et red&eacute;marrez
l'ordinateur. Il doit fonctionner comme avant.</font></li>

<li>
<font color="#000000">Vous n'avez cependant pas &eacute;limin&eacute; le
virus. Faites appel rapidement &agrave; un antivirus performant pour vous
aider</font></li>
</ol>
<font color="#000000">Rappelez vous quand m&ecirc;me les sympt&ocirc;mes
suivants qui peuvent r&eacute;v&eacute;ler l'existence d'un quelconque
virus:</font>
<ol>
<li>
<font color="#000000">La protection antivirus du BIOS vous informe d'un
acc&egrave;s &agrave; la zone d'amor&ccedil;age du disque dur.</font></li>

<li>
<font color="#000000">Lorsque vous lancez votre ordinateur, un message
vous indique qu'il ne peut pas d&eacute;marrer &agrave; partir du disque
dur.</font></li>

<li>
<font color="#000000">Windows refuse de charger les pilotes de disque dur
32 bits.</font></li>

<li>
<font color="#000000">Au lancement de Windows, un message vous informe
qu'un programme TSR force le d&eacute;marrage en mode compatible MS-DOS.</font></li>

<li>
<font color="#000000">ScanDisk d&eacute;tecte des fichiers &agrave; liaison
crois&eacute;es ou d'autre probl&egrave;mes.</font></li>

<li>
<font color="#000000">ScanDisk indique des secteurs d&eacute;fectueux sur
les disques durs ou les disquettes.</font></li>

<li>
<font color="#000000">La taille des fichiers &eacute;x&eacute;cutables
augmente subitement.</font></li>

<li>
<font color="#000000">La date de cr&eacute;ation ou de modification des
fichiers comporte des valeurs erron&eacute;es.</font></li>

<li>
<font color="#000000">Vous constatez que l'ordinateur se bloque fr&eacute;quemment
alors que vous n'avez ajout&eacute; aucun nouveau composant logiciel ou
mat&eacute;riel.</font></li>

<li>
<font color="#000000">L'ordinateur se bloque et indique une erreur de parit&eacute;.</font></li>

<li>
<font color="#000000">L'ordinateur semble &ecirc;tre plus lent sans raisons
apparentes.</font></li>

<li>
<font color="#000000">Le clavier et la souris&nbsp; ne fonctionnent plus
de mani&egrave;re fiable, m&ecirc;me apr&egrave;s un nettoyage.</font></li>

<li>
<font color="#000000">Des fichiers ou des dossiers disparaissent de votre
ordinateur de fa&ccedil;on inexpliqu&eacute;e.</font></li>

<br><font color="#000000">Dans vos documents des mots disparaissent ou
s'ajoutent subitement.</font></ol>

</body>
</html>
