<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.03 [es] (Win95; I) [Netscape]">
   <META NAME="Author" CONTENT="Miguel Angel Nieto">
   <TITLE>Curso de Pascal</TITLE>
</HEAD>
<BODY TEXT="#FFFFFF" BGCOLOR="#000000" LINK="#0000EE" VLINK="#551A8B" ALINK="#FF0000">

<CENTER><FONT FACE="Tahoma"><FONT COLOR="#FF0000"><FONT SIZE=+3>CURSO DE
PASCAL</FONT></FONT></FONT></CENTER>


<P><FONT FACE="Tahoma"><FONT SIZE=-1>Esta es la tercera secci&oacute;n
de programaci&oacute;n, curso de Pascal. En esta secci&oacute;n aprenderemos
a programar en este sencillo lenguaje mediante ejemplos y las explicaciones
de cada parte de ellos, como hacemos en el curso de C.&nbsp; Espero que
con este curso por entregas de Pascal aprend&aacute;is bastante bien este
estupendo lenguaje de programaci&oacute;n.</FONT></FONT> :)
<BR>&nbsp;
<CENTER><FONT FACE="Tahoma"><FONT COLOR="#FF0000"><FONT SIZE=+3>INTRODUCCI&Oacute;N:</FONT></FONT></FONT></CENTER>
<FONT FACE="Tahoma"><FONT SIZE=-1>Pascal es un lenguaje estructurado. La
programaci&oacute;n estructurada consiste en dar al programa un cierto
orden, dividiendolo en bloques independientes unos de otros, que se encargan
de cada una de las tareas necesarias. Esto hace un programa mas f&aacute;cil
de leer y de entender.</FONT></FONT>
<BR>&nbsp;
<BR>&nbsp;

<P><FONT FACE="Tahoma"><FONT SIZE=-1>Como lenguaje estructurado que es,
muchas veces habr&aacute; que dividir en bloques las diferentes partes
que componen el programa. Estos bloques se denotan marcando el principio
y el final con las palabras BEGIN y END.</FONT></FONT>
<BR>&nbsp;

<P><FONT FACE="Tahoma"><FONT SIZE=-1>Las mayor&iacute;a de las palabras
clave de Pascal son palabras en ingles. No existe distinci&oacute;n en
may&uacute;sculas y min&uacute;sculas, por lo que END har&iacute;a el mismo
efecto que end. Cada sentencia u orden de Pascal debe terminar por un punto
y coma (;) salvo el ultimo end que lo har&aacute; con un punto.</FONT></FONT>
<BR>&nbsp;

<P><FONT FACE="Tahoma"><FONT SIZE=-1>Cuando definimos tipos, variables,
constantes, etc. veremos que tampoco va el punto y coma despu&eacute;s
de la cabezeras de las declaraciones.</FONT></FONT>

<P><FONT FACE="Tahoma"><FONT SIZE=-1>Y despu&eacute;s de esta introducci&oacute;n
ya viene nuestro primer programa. Adivin&aacute;is cual... el "Hola mundo"&nbsp;
otra vez.</FONT></FONT>
<BR>&nbsp;
<CENTER><FONT FACE="Tahoma"><FONT COLOR="#FF0000"><FONT SIZE=+3>EL PRIMER
PROGRAMA:</FONT></FONT></FONT></CENTER>
<FONT FACE="Tahoma"><FONT COLOR="#3366FF">program Hola;</FONT></FONT>

<P><FONT FACE="Tahoma"><FONT COLOR="#3366FF">begin</FONT></FONT>
<BR><FONT FACE="Tahoma"><FONT COLOR="#3366FF">&nbsp;&nbsp;&nbsp; write(&acute;Hola
mundo&acute;);</FONT></FONT>
<BR><FONT FACE="Tahoma"><FONT COLOR="#3366FF">end.</FONT></FONT>
<BR>&nbsp;

<P><FONT FACE="Tahoma"><FONT SIZE=-1>La palabra <FONT COLOR="#FF0000">program</FONT>
no es necesaria en turbo pascal pero la vamos a utilizar para recordar
el objetivo del programa.<FONT COLOR="#FF0000"> "Hola"</FONT> es un identificador
que nos va a servir para indicar el nombre del programa. Los identificadores
son palabras que usaremos para referirnos a una variable, una constante,
el nombre de una funci&oacute;n o de un procedimiento.</FONT></FONT>

<P><FONT FACE="Tahoma"><FONT SIZE=-1>Una variable equivale a la cl&aacute;sica
inc&oacute;gnita (x) de matem&aacute;ticas que puede tomar cualquier valor.
Ahora nuestras inc&oacute;gnitas pueden tener cualquier valor (no solo
un numero: tambi&eacute;n podremos guardar textos, fichas sobre personas
o libros, etc.) y nombres mas largos (y explicaremos mejor su contenido).</FONT></FONT>

<P><FONT FACE="Tahoma"><FONT SIZE=-1>Los identificadores ser&aacute;n combinaciones
de letras y n&uacute;meros junto con algunos s&iacute;mbolos especiales
como el (_). Los identificadores no pueden empezar por un numero no pueden
tener s&iacute;mbolos como &Ntilde; o &ntilde; ni acentos y no pueden tener
espacios.</FONT></FONT>
<BR>&nbsp;
<BR><FONT FACE="Tahoma"><FONT SIZE=-1>Write es la orden que permite escribir
un texto en pantalla. El conjunto de todo lo que desee escribir aparece
entre par&eacute;ntesis y con comillas simples como se puede apreciar en
el ejemplo.</FONT></FONT>
<BR><FONT FACE="Tahoma"><FONT SIZE=-1>Y se acabo, el numero que viene mucho
mas.</FONT></FONT>
<DIV ALIGN=right><I><FONT FACE="Tahoma"><FONT COLOR="#FF0000"><FONT SIZE=+1>The
Punisher `98</FONT></FONT></FONT></I></DIV>
&nbsp;
<CENTER><A HREF="programa.htm"><IMG SRC="volver.JPG" HEIGHT=50
WIDTH=100></A></CENTER> &nbsp;

<P><I><FONT FACE="Tahoma"><FONT SIZE=-2>Pare escribir este curso me he
basado en el curso de programaci&oacute;n en pascal de Nacho Cabanes. Quien
quiera este curso que me mande un disco y yo se lo env&iacute;o (la versi&oacute;n
shareware). El que tenga e-mail y quiera el curso ya sabe o que tiene que
hacer.&nbsp; Un saludo desde aqu&iacute; a Nacho Cabanes.</FONT></FONT></I>
</BODY>
</HTML>
