<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.03 [es] (Win95; I) [Netscape]">
   <META NAME="Author" CONTENT="Miguel Angel Nieto">
   <TITLE>Curso de Qoole V2.50</TITLE>
</HEAD>
<BODY TEXT="#FFFFFF" BGCOLOR="#000000" LINK="#0000EE" VLINK="#551A8B" ALINK="#FF0000">

<CENTER><IMG SRC="qoole2.jpg" HEIGHT=148 WIDTH=508></CENTER>
&nbsp;
<BR>&nbsp;

<P><FONT FACE="Tahoma"><FONT SIZE=-1>Este es el primer numero del curso
de creaci&oacute;n de mapas para Quake2. Para crear nuestros mapas utilizaremos
el mapeador shareware WinQoole v2.50, que se encuentra en la siguiente
direcci&oacute;n:&nbsp;</FONT></FONT> <A HREF="http://www.qoole.com">http://www.qoole.com</A>
<FONT FACE="Tahoma"><FONT SIZE=-1>. Si alguien no tiene internet y quiere
tener el programa que me mande una carta con dos discos y yo se lo enviare.</FONT></FONT>

<P><FONT FACE="Tahoma"><FONT SIZE=-1>Las principales caracter&iacute;sticas
de este mapeador creado por la empresa "Lithium software" es su agradable
interface y su facilidad de uso, y los amantes del Quake 1 (entre los que
no me incluyo) y el Hexen2 tambi&eacute;n podr&aacute;n usar este mapeador.
En los pr&oacute;ximos 3 n&uacute;meros estudiaremos sus principales caracter&iacute;sticas,
y aprenderemos a crear nuestro primer mapa.</FONT></FONT>
<BR>&nbsp;
<CENTER><FONT COLOR="#FF0000"><FONT SIZE=+3>LA PRIMERA VISTA A QOOLE:</FONT></FONT></CENTER>

<CENTER>&nbsp;</CENTER>
<FONT FACE="Tahoma"><FONT SIZE=-1>Nada mas instalar en mapeador, nos preguntara
para que juego queremos crear los mapas y nosotros seleccionaremos Quake2.
A continuaci&oacute;n el programa nos preguntara donde se encuentra instalado
el juego y despu&eacute;s de localizarlo empezara a extraer las diferentes
texturas.</FONT></FONT>
<BR>&nbsp;

<P><FONT FACE="Tahoma"><FONT SIZE=-1>Despu&eacute;s de esto ya podemos
empezar a mapear. Pulsaremos en el men&uacute; File y despu&eacute;s New
empezar un nuevo mapa. Ahora en la pantalla aparecer&aacute;n las diferentes
vistas del mapa, en la parte superior izquierda la vista <FONT COLOR="#FF0000">TOP</FONT>
(a&eacute;rea), en la superior derecha <FONT COLOR="#FF0000">3D View</FONT>
(vista 3D), en la inferior izquierda <FONT COLOR="#FF0000">BACK</FONT>
(trasera), y por ultimo en la inferior izquierda <FONT COLOR="#FF0000">Side</FONT>
(de un lado). Como te habr&aacute;s dado cuenta son las vistas que utilizan
los programas de dibujo 3D pero nosotros no necesitaremos saber nada de
infografia ni nada por el estilo. A continuaci&oacute;n ver&eacute;is lo
que tendr&iacute;a que aparecer en vuestra pantalla si hab&eacute;is seguido
bien los pasos anteriormente comentados.</FONT></FONT>
<BR>&nbsp;

<P><IMG SRC="qoole1.jpg" HEIGHT=362 WIDTH=520>
<BR>&nbsp;
<CENTER><FONT FACE="Tahoma"><FONT COLOR="#FF0000"><FONT SIZE=+3>NUESTRO
PRIMER MAPA:</FONT></FONT></FONT></CENTER>


<P><FONT FACE="Tahoma"><FONT SIZE=-1>Para crear el primer mapa habr&aacute;
que hacer alguna habitaci&oacute;n por donde podamos pasearnos. Para ello
debemos seguir los siguientes pasos.</FONT></FONT>

<P><FONT FACE="Tahoma"><FONT SIZE=-1>1-&nbsp;&nbsp;&nbsp; Pulsamos en el
men&uacute; <FONT COLOR="#FF0000">Object</FONT> y despu&eacute;s <FONT COLOR="#FF0000">ADD
BRUSH</FONT> donde podemos elegir el tama&ntilde;o del cubo que queremos,
<FONT COLOR="#FF0000">large</FONT> (grande), <FONT COLOR="#FF0000">med</FONT>
(mediano) y <FONT COLOR="#FF0000">small</FONT> (peque&ntilde;o). Despu&eacute;s
de elegir el tama&ntilde;o que queremos aparecer&aacute; en todas las vistas
nuestro precioso cubo ;). Pero si todav&iacute;a el tama&ntilde;o no esta
como nos gustar&iacute;a lo transformaremos muy f&aacute;cilmente. Solo
hay que pulsar dentro del cubo en cualquiera de las vistas y manteniendo
el bot&oacute;n del rat&oacute;n y la tecla shift (may&uacute;sculas) pulsados,
moveremos el rat&oacute;n y ver&eacute;is como cambia el tama&ntilde;o
del cubo. La mejor vista para ver los cambios, es la 3D donde se pueden
apreciar muy bien.</FONT></FONT>

<P><FONT FACE="Tahoma"><FONT SIZE=-1>2-&nbsp;&nbsp;&nbsp; El cubo ya esta
creado, pero todav&iacute;a no esta preparado para que nuestro personaje
pasee por ella, y para que eso ocurra hay que crear un vac&iacute;o en
el maldito cubo. Para eso habr&aacute; que seleccionar el cubo pinchando
sobre el y luego pulsar el bot&oacute;n derecho. A continuaci&oacute;n
te saldr&aacute; un Sub-menu donde elegir&aacute;s <FONT COLOR="#FF0000">Edit</FONT>
y despu&eacute;s <FONT COLOR="#FF0000">Hollow Brush</FONT>. Despu&eacute;s
de esto el cubo se transformara creando una especie de vac&iacute;o dentro
de ella. Ahora si podremos pasearnos dentro de el en el juego.</FONT></FONT>

<P><FONT FACE="Tahoma"><FONT SIZE=-1>3-&nbsp;&nbsp;&nbsp; Para que el ordenador
sepa donde debe empezar el jugador tendemos que colocar al personaje de
el juego, en el lugar donde queramos empezar a jugar (si no lo incluimos
no se podr&aacute; jugar el mapa). Para colocarlo en nuestro mapa deberemos
seguir los siguientes pasos. <FONT COLOR="#FF0000">Object / add entity
/ player / start.</FONT> Despu&eacute;s de esto se vera en la pantalla
un peque&ntilde;o mu&ntilde;equito (eso somos nosotros en el juego). Ahora
deberemos colocarlo dentro del cubo, pues es por el &uacute;nico lugar
por el que puede andar el personaje.</FONT></FONT>

<P><FONT FACE="Tahoma"><FONT SIZE=-1>4-&nbsp;&nbsp;&nbsp; Ahora tenemos
que colocar una fuente de luz dentro de... &iquest;lo adivinas?... si,
en el cubo, lo tienes que poner dentro del cubo, pero esta vez no te digo
como ponerlo, lo tendr&aacute;s que buscar y colocarlo tu. Es f&aacute;cil.</FONT></FONT>

<P><FONT FACE="Tahoma"><FONT SIZE=-1>5-&nbsp;&nbsp;&nbsp; Nuestro mapa
ya esta construido, ahora lo salvamos con el nombre que queramos y lo compilamos.
&iquest;Que como se hace esto? En el men&uacute; file elegimos "<FONT COLOR="#FF0000">export
BSP</FONT>" y seleccionamos todas las opciones menos la de Build pause.
Despu&eacute;s de esto se creara el mapa, se ejecutara el juego con nuestro
mapa y ya podremos jugar.</FONT></FONT>

<P><FONT FACE="Tahoma"><FONT SIZE=-1>As&iacute; es como se crea a grandes
rasgos un mapa con Qoole. En el pr&oacute;ximo numero profundizaremos mas
en todas las opciones de este mapeador y mejoraremos nuestro mapa.</FONT></FONT>
<DIV ALIGN=right><I><FONT FACE="Tahoma"><FONT COLOR="#FF0000">The Punisher
`98</FONT></FONT></I></DIV>
&nbsp;
<CENTER><A HREF="indice.htm"><IMG SRC="volver.JPG" HEIGHT=50 WIDTH=100></A></CENTER>

</BODY>
</HTML>
