<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>Brazilian Hackers Journal</TITLE>
   <META NAME="Author" CONTENT="Liquid Byte">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.0b1 (WinNT; I) [Netscape]">
   <META NAME="Description" CONTENT="This is a first edition.">
</HEAD>
<BODY TEXT="#FFFF00" BGCOLOR="#000000" LINK="#0000FF" VLINK="#8080FF" ALINK="#00FF00">

<UL>
<P><A HREF="clube.html"><IMG SRC="Oclube.JPG" BORDER=0 HEIGHT=69 WIDTH=219></A></P>

<P><IMG SRC="MetallicRule15.gif" HEIGHT=16 WIDTH=525></P>

<UL>
<P><FONT SIZE=+1>Bem pessoal, para aqueles que j&aacute; fazem parte de
nosso clube &agrave; algum tempo informar o que &eacute; o BHC, ou como
foi formado pode parecer besteira, mas isso &eacute; muito importante.
Lembrem-se, este &eacute; o primeiro e acredito, o &uacute;nico Clube Hacker
do Brasil. Portanto, voc&ecirc; que &eacute; membro deste clube, orgulhe-se
disso !</FONT></P>

<P><FONT SIZE=+1>A id&eacute;ia de criar o clube virtual surgiu quando
eu conversava com um amigo sobre os hackers norte-americanos, sua influ&ecirc;ncia
sobre o usu&aacute;rio brasileiro, as verdades e mentiras dos filmes encontrados
por a&iacute;, das hist&oacute;rias reais, enfim, de tudo aquilo relacionado
ao mundo hacker, e percebemos como o Brasil ficaria longe de tudo isso.</FONT></P>

<P><FONT SIZE=+1>Querendo ent&atilde;o encontrar o pessoal ligado a &aacute;rea,
resolvi atrav&eacute;z de minha home-page, criar este clube virtual, sequer
sabendo se algu&eacute;m visitaria minha p&aacute;gina, quanto mais, enviar
um formul&aacute;rio de inscri&ccedil;&atilde;o para um clube hacker.</FONT></P>

<P><FONT SIZE=+1>Bem, a id&eacute;ia deu certo. Tanto, que hoje somos um
n&uacute;mero consider&aacute;vel. Tive at&eacute; que fechar as inscri&ccedil;&otilde;es
do clube por excesso de pedidos. O clube j&aacute; estava virando uma verdadeira
zona. Assim, hoje estamos mais organizados do que nunca e crescendo cada
vez mais, de uma forma tranquila e ordenada, n&atilde;o importanto o que
acham alguns, que ainda n&atilde;o acreditam nisto aqui.</FONT></P>

<P><FONT SIZE=+1>A id&eacute;ia principal deste clube &eacute; termos um
meiode comunica&ccedil;&atilde;o entre s&iacute;, independente e seguro,
sem exageros e principalmente, organizado. Temos nossa pr&oacute;pria lista
de discuss&atilde;o, nosso canal de chat, e agora, nosso &quot;jornal&quot;.
Ganhando espa&ccedil;o na m&iacute;dia, ainda que timidamente, come&ccedil;amos
a aparecer. Tanto, que hoje aqueles que pedem para ingressar no clube t&ecirc;m
que esperar, e muito, pois os pedidos s&atilde;o muito maiores do que podemos
dar conta.</FONT></P>

<P><FONT SIZE=+1>Com o intuito de informar, de trocar muita informa&ccedil;&atilde;o
entre os s&oacute;cios, esperamos que este clube continue a crescer, e
veremos at&eacute; onde podemos chegar.</FONT></P>

<P><FONT SIZE=+1>&Eacute; isso a&iacute; pessoal ! Continuem colaborando
com o clube, enviando sugest&otilde;es, dicas, endere&ccedil;os interessantes,
hist&oacute;rias interessantes, an&aacute;lise de circuitos, enfim, tudo
aquilo que julgar ser &uacute;til para o interesse hacker ! Ajude-nos a
desmistificar os Hackers e abrir a cabe&ccedil;a dos c&eacute;ticos que
pensam s&oacute; em destrui&ccedil;&atilde;o.</FONT></P>

<P><FONT SIZE=+1>Valeu turma !</FONT></P>

<UL>
<UL>
<UL>
<UL>
<UL>
<UL>
<UL>
<UL>
<P><FONT SIZE=+1>Liquid Byte.</FONT></P>
</UL>
</UL>
</UL>
</UL>
</UL>
</UL>
</UL>
</UL>
</UL>
</UL>

<P><A HREF="indice.html"><IMG SRC="bullet.gif" BORDER=0 HEIGHT=26 WIDTH=26 ALIGN=ABSCENTER></A><FONT SIZE=+1><A HREF="indice.html">Volta
para o &iacute;ndice</A></FONT></P>

</BODY>
</HTML>
