<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>Brazilian Hackers Journal</TITLE>
   <META NAME="Author" CONTENT="Liquid Byte">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.0b1 (WinNT; I) [Netscape]">
   <META NAME="Description" CONTENT="This is a first edition.">
</HEAD>
<BODY TEXT="#FFFF00" BGCOLOR="#000000" LINK="#0000FF" VLINK="#8080FF" ALINK="#00FF00">

<UL>
<P><A HREF="Software.html"><IMG SRC="soft.jpg" BORDER=0 HEIGHT=77 WIDTH=239></A></P>

<P><IMG SRC="MetallicRule15.gif" HEIGHT=16 WIDTH=525></P>

<P><B><FONT COLOR="#FF66CC"><FONT SIZE=+2>Manual de uso do programa Kaboom
3.0</FONT></FONT></B></P>

<P><FONT SIZE=+1>&nbsp;</FONT></P>

<P><FONT SIZE=+1>Pra quem ainda n&atilde;o sabe, o Kaboom &eacute; um dos
mais populares programas de mail-bombers utilizados na Internet. O que
?&nbsp;Voc&ecirc; n&atilde;o sabe o que &eacute; um mail bomber ?... Ent&atilde;o
&eacute; melhor voc&ecirc; parar sua leitura por aqui, e ir ler uma revistinha...
do Mickey, quem sabe ?</FONT></P>

<P><FONT SIZE=+1>&nbsp;</FONT></P>

<P><FONT SIZE=+1>Para aqueles que j&aacute; sabem o que &eacute; um mail-bomber,
bem, aqui v&atilde;o algumas pequenas dicas para o uso deste &quot;terr&iacute;vel&quot;
software :)</FONT></P>

<P><FONT SIZE=+1>&nbsp;</FONT></P>

<P><FONT SIZE=+1>O Kabbom tem uma interface um tanto simples, o que, embora
facilite um pouco, justamente por n&atilde;o possuir um monte de besteiras,
acaba confundindo um pouco os mais novatos.</FONT></P>

<P><FONT SIZE=+1>Ao executar-mos o soft, ele abre uma pequena janela com
3 grandes bot&otilde;es, a saber:</FONT></P>

<P><FONT SIZE=+1>Mailbomber&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Mailing Lists&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Close</FONT></P>

<P><FONT SIZE=+1>&nbsp;</FONT></P>

<P><FONT SIZE=+1>Mailbomber:</FONT></P>

<P><FONT SIZE=+1>Esse bot&atilde;o nos d&aacute; acesso a janela &quot;principal&quot;
do programa, cuja visualiza&ccedil;&atilde;o perfeita requer uma configura&ccedil;&atilde;o
de v&iacute;deo de no m&iacute;nimo 800X600. Caso seu monitor estiver configurado
em 640X480, voc&ecirc; ter&aacute; dificuldades em visualizar corretamente
essa janela.</FONT></P>

<P><FONT SIZE=+1>Temos v&aacute;rias op&ccedil;&otilde;es dispon&iacute;veis:</FONT></P>

<P><FONT SIZE=+1>TO : -&gt; Aqui voc&ecirc; digita o endere&ccedil;o de
mail da v&iacute;tima, a qual voc&ecirc; enviar&aacute; o mail-bomber.</FONT></P>

<P><FONT SIZE=+1>FROM&nbsp;: -&gt; Voc&ecirc; coloca aqui, o endere&ccedil;o
que voc&ecirc; quer que o programa envie como o respons&aacute;vel pelo
envio. Voc&ecirc; pode inventar qualquer endere&ccedil;o idiota, do tipo
: devil@hell.net, ou hehehe@palhaco.com, ou ainda aquilo que voc&ecirc;
preferir...</FONT></P>

<P><FONT SIZE=+1>SERVER : -&gt; O servidor de mails que voc&ecirc; vai
utilizar. Aqui &eacute; que vale frizar algo muito importante: Verifique
antes de enviar um bomb mail, se o servidor que voc&ecirc; escolheu est&aacute;
realmente enviando os mails anonimamente, ou sen&atilde;o meu amigo, he
he he, voc&ecirc; vai dan&ccedil;ar bonitinho. Uma dica &eacute; voc&ecirc;
enviar um e-mail pra voc&ecirc; mesmo, e verificar o cabe&ccedil;alho.
Claro, cuidado pra n&atilde;o enviar um bomb mail pra si mesmo, a n&atilde;o
ser que voc&ecirc; seja louco, ou muito burro, quem sabe... Na Internet
tem de tudo...&nbsp; :)</FONT></P>

<P><FONT SIZE=+1>Priority : -&gt; Aqui vai a prioridade de envio de seu
mail. Pode deixar em prioridade Normal, a n&atilde;o ser que voc&ecirc;
queira presentear a v&iacute;tima muito r&aacute;pido...</FONT></P>

<P><FONT SIZE=+1>Subject : -&gt; O Assunto relativo a seu mail. Algumas
pessoas costumam &quot;filtrar&quot; seus programas de e-mail pelo campo
subject, portanto, seja experto.</FONT></P>

<P><FONT SIZE=+1>Message body : -&gt; O corpo da sua mensagem. Vale lembrar
que mensagens muito longas demoram mais para serem enviadas... mas tamb&eacute;m
para serem &quot;descarregadas&quot;..</FONT></P>

<P><FONT SIZE=+1>Number of messages : -&gt; O n&uacute;mero de mails que
voc&ecirc; quer enviar. Aqui existe uma caixa de op&ccedil;&atilde;o, para
voc&ecirc; enviar &quot;perpetuamente&quot;, ou seja, enquanto voc&ecirc;
estiver conectado, o Kabbom ir&aacute; ficar enviando mails para a v&iacute;tima,
at&eacute; que voc&ecirc; interrompa, ou, que caia a liga&ccedil;&atilde;o...</FONT></P>

<P><FONT SIZE=+1>Vale lembrar aqui, que quando voc&ecirc; digita uma vez
o nome da v&iacute;tima, ou seu pseud&ocirc;nimo de envio, o Kabbom arquiva
essas informa&ccedil;&otilde;es, portanto, num pr&oacute;ximo envio, esses
dados j&aacute; estar&atilde;o a disposi&ccedil;&atilde;o, bastanto abrir
a caixa de escolha.</FONT></P>

<P><FONT SIZE=+1>&nbsp;</FONT></P>

<P><FONT SIZE=+1>Mailing Lists</FONT></P>

<P><FONT SIZE=+1>Esta op&ccedil;&atilde;o talvez seja at&eacute; melhor
do que enviar um mail bomb para uma v&iacute;tima qualquer. Diferente disso,
voc&ecirc; estar&aacute; colocando o &quot;dito cujo&quot;, numa enrrascada
danada, pois, receber dezenas, at&eacute; centenas de mails diferentes,
de listas de discuss&atilde;o das mais idiotas, pode ser muito pior do
que voc&ecirc; imagina.</FONT></P>

<P><FONT SIZE=+1>Aqui tem-se in&uacute;meras op&ccedil;&otilde;es de listas
dispon&iacute;veis. Uma passada lenta com o cursos do mouse sobre elas,
lhe abrir&aacute; uma pequena mensagem informando do que se trata. Tem
um pouco de tudo, sempre no entanto, de assuntos um tanto &quot;chatos&quot;
e irirritantes.</FONT></P>

<P><FONT SIZE=+1>Address : -&gt; Voc&ecirc; coloca o mail da v&iacute;tima.
Caso voc&ecirc; j&aacute; tenha enviado algum mail a essa pessoa, o endere&ccedil;o
j&aacute; estar&aacute; dispon&iacute;vel.</FONT></P>

<P><FONT SIZE=+1>Name : -&gt; O nome fict&iacute;cio da inscri&ccedil;&atilde;o
da v&iacute;tima, ou seja, este &eacute; o nome que ela receber&aacute;
na lista de discuss&atilde;o que voc&ecirc; a est&aacute; inscrevendo.</FONT></P>

<P><FONT SIZE=+1>Server : -&gt; O servidor de mail que voc&ecirc; escolher.
Aqui vale lembrar, n&atilde;o tem muita import&acirc;ncia se o servidor
&eacute; 100% confi&aacute;vel em mat&eacute;ria de anonimato, mas, em
compensa&ccedil;&atilde;o, voc&ecirc; n&atilde;o poder&aacute; testar em
s&iacute; mesmo... Algumas listas s&atilde;o dif&iacute;ceis de se sair...</FONT></P>

<P><FONT SIZE=+1>Send your condolences : -&gt; Aqui voc&ecirc;, al&eacute;m
de inscrever o pobre coitado nessas listas, ainda envia suas &quot;condol&ecirc;ncias&quot;...
Vale lembrar aqui o anonimato do server...</FONT></P>

<P><FONT SIZE=+1>Em lists left to subscribe to , o programa mostra quantas
listas aindam restam a inscrever...</FONT></P>

<P><FONT SIZE=+1>&nbsp;</FONT></P>

<P><FONT SIZE=+1>Al&eacute;m dessas telas, o programa possui um pequeno
menu, que contem tambem poucas op&ccedil;&otilde;es:</FONT></P>

<P><FONT SIZE=+1>Phile : -&gt; Apenas com a op&ccedil;&atilde;o para sair
do programa</FONT></P>

<P><FONT SIZE=+1>Edit : -&gt; Aqui voc&ecirc; pode criar j&aacute; uma
pequena lista de v&iacute;timas para ficarem j&aacute; dispon&iacute;veis
quando do uso do Kaboom. Voc&ecirc; tamb&eacute;m poder&aacute; adicionar
servers, ou retirar os indesej&aacute;veis, bem como tamb&eacute;m permitir
que o programa inclua o bem-bolado som de uma descarga, quando do envio
de seus mail-bombs.</FONT></P>

<P><FONT SIZE=+1>Window -&gt; O mesmo que se voc&ecirc; apertar um dos
bot&otilde;es da janela.</FONT></P>

<P><FONT SIZE=+1>About -&gt; Com duas op&ccedil;&otilde;es,&nbsp; apenas
com as informa&ccedil;&otilde;es sobre o autor deste soft, um maluco com
cara de terrorista mesmo, que se denomina The Messiah. Aqui o programa
exibe algumas informa&ccedil;&otilde;es sobre sua m&aacute;quina.</FONT></P>

<P><FONT SIZE=+1>&nbsp;</FONT></P>

<P><FONT SIZE=+1>Lembrando que o uso deste programa por pessoas mal intencionadas
pode criar muitas dores de cabe&ccedil;a, tanto para as poss&iacute;veis
&quot;v&iacute;timas&quot;, quanto para o malfeitor, se for um idiota qualquer,
que n&atilde;o sabe utilizar corretamente um servidor de mails an&ocirc;nimo.
Portanto, a responsabilidade &eacute; sua.</FONT></P>

<P><FONT SIZE=+1>&nbsp;</FONT></P>

<DIV ALIGN=right><P><FONT SIZE=+1>LB</FONT></P></DIV>

<P><FONT SIZE=+1>&nbsp;</FONT></P>
</UL>

<P><A HREF="indice.html"><IMG SRC="bullet.gif" BORDER=0 HEIGHT=26 WIDTH=26 ALIGN=ABSCENTER></A><FONT SIZE=+1><A HREF="indice.html">Volta
para o &iacute;ndice</A></FONT></P>

</BODY>
</HTML>
