<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Oscar Montes">
   <meta name="GENERATOR" content="Mozilla/4.74 [en] (Win95; U) [Netscape]">
   <meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
   <title>Curso de programacion en Delphi</title>
</head>
<body text="#000000" bgcolor="#FFFFFF" link="#330099" vlink="#330099" alink="#330099">

<center><img SRC="Bar.gif" height=30 width=500>
<br><b><font face="Arial, Helvetica, sans-serif"><font color="#000099"><font size=+4>-DELPHI-</font></font></font></b></center>
<font face="Arial, Helvetica, sans-serif"><font size=-1></font></font>
<p><br><font face="Arial, Helvetica, sans-serif"><font size=-1></font></font>
<p><font face="Arial, Helvetica, sans-serif"><font size=-1>Hola, que pasa!!!</font></font>
<br><font face="Arial, Helvetica, sans-serif"><font size=-1>Creo que recordareis
que en el anterior n&uacute;mero dejamos un programilla (m&aacute;s bien
cutre) sin terminar, la verdad que para lo que hacia, no era para tirar
coetes, recordad, tan solo pod&iacute;as entrar y pulsar un bot&oacute;n
de salida, pues para eso, para salir.</font></font>
<br><font face="Arial, Helvetica, sans-serif"><font size=-1>Pues venga,
vamos a a&ntilde;adirle algo m&aacute;s para que tenga un poco de merito
el invento este.</font></font>
<p><font face="Arial, Helvetica, sans-serif"><font size=-1>Pues bueno,
vamos a poner otro label (recuerda, el botoncito con un "A") justo debajo
del anterior, pero esta vez no vamos a modificar el Caption, en el cual
deber&aacute; poner "Label2". Ahora vamos a insertar un nuevo bot&oacute;n,
como el de salida, pero esta vez le nombraremos <i>BotonMsg2</i> y escribiremos
en el caption <i>Mensaje.</i> Ahora vamos a la p&aacute;gina de eventos,
pulsamos dos veces en <b>On click</b> y escribimos lo siguiente:</font></font>
<center><font face="Arial, Helvetica, sans-serif"><font color="#006600"><font size=-1>Label2.Caption
:= 'Hala pa casa que llueve' ;</font></font></font></center>
<font face="Arial, Helvetica, sans-serif"><font size=-1>Ahora solo falta
compilarlo y guardarlo y tendremos esto:</font></font>
<center>
<p><img SRC="Delphi1.jpg" height=297 width=433></center>

<p><font face="Arial, Helvetica, sans-serif"><font size=-1>Un programa
que al pulsar el bot&oacute;n Mensaje saldra en el lugar de Label2 la frase
"Hala pa casa que llueve", tio, algo es algo :)</font></font>
<p><font face="Arial, Helvetica, sans-serif"><font size=-1>Ahora simplemente
te voy a contar un par de detalles, para que te enteres un poco m&aacute;s
de la historia. Por ejemplo, te habr&aacute;s dado cuenta que algunas cosas
ni siquiera las has tenido que codificar, como los tipicos botones de windows
de minimizar, maximizar y cerrar, bueno, estos, a diferencia de visual
basic, por ejemplo, se crean automaticamente y funcionan y todo, y al minimizar
aparece escrito Project1 en la barra de tareas de windows, bueno, pues
si quieres que ponga otra cosa, vas al men&uacute; options|project y la
pagina Applications y ahi lo cambias. Tambien puedes cambiar el icono,
eso se hace en Opciones, Application|Icon y adem&aacute;s ahi puedes elegir
el archivo de help que todo buen programa debe tener.</font></font>
<p><font face="Arial, Helvetica, sans-serif"><font size=-1>Bueno, como
siempre, para que no tengas problemas, en el Delphi.zip tienes los archivos
necesarios para ver como queda el programa, recuerda, lo puedes abrir con
el delphi utilizando el archivo "project1.dpr".</font></font>
<p><font face="Arial, Helvetica, sans-serif"><font size=-1>Bueno y no se
que m&aacute;s contaros por ahora, ya terminamos este primer programa y
estate por seguro que haremos alguno m&aacute;s chungo para aprender m&aacute;s
cosas, venga, nos vemos en el proximo n&uacute;mero.</font></font>
<br>&nbsp;
<div align=right><font face="Arial, Helvetica, sans-serif"><font size=+2><a href="mailto:omontes@binary-zone.com">OSCAR
MONTES</a></font></font>
<br><font face="Arial, Helvetica, sans-serif"><font size=-1><a href="http://www.geocities.com/doncaballo">Oscar
Montes Web Site</a></font></font>
<br><font face="Arial, Helvetica, sans-serif"><font size=-1><a href="http://www.traxinspace.com/Artists/MusicDirectory.asp?ArtistID=10239">Te
aburres, escucha mi musica y ya est&aacute;</a></font></font></div>
<b><font face="Arial, Helvetica, sans-serif"><font color="#FF0000"><font size=-1>FE
DE ERRATAS:</font></font></font></b>
<br><font face="Arial, Helvetica, sans-serif"><font color="#FF0000"><font size=-1>Repasando
el articulo anterior encontre un error que no entendio muy bien, no se
como me confundi en eso, pero lo hice y puede que causara alg&uacute;n
problema al que siga estos articulos, fue al explicar como se guarda un
programa ya hecho, yo dije "Antes de compilar el programa, estar&iacute;a
bien que guard&aacute;ramos el c&oacute;digo fuente, asi que vete a "Save
project as..." te aparecer&aacute; por defecto unit1.pas (la extensi&oacute;n
.PAS significa que es un fichero fuente de pascal), cambialo y escribe
"project1.dpr" y aceptas." bueno, eso es una burrada, lo que tienes que
hacer es no cambiar para nada, sino cuando te pone unit1.pas dar aceptar
y justamente te aparecer&aacute; otra ventana con "project1.dpr" para guardar,
dar&aacute;s aceptar y ya tendr&aacute;s todo guardado, desde aqui pido
disculpas y espero que no vuelva a pasar, hasta otra.</font></font></font>
</body>
</html>
