<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Oscar Montes">
   <meta name="GENERATOR" content="Mozilla/4.74 [en] (Win95; U) [Netscape]">
   <title>Curso de impulse tracker</title>
</head>
<body text="#000000" bgcolor="#FFFFFF" link="#330099" vlink="#330099" alink="#330099">

<center><img SRC="Bar.gif" height=30 width=500>
<br><b><font face="Arial,Helvetica"><font color="#000099"><font size=+4>-IMPULSE
TRACKER-</font></font></font></b></center>

<p><b><font face="Arial, Helvetica, sans-serif"><font size=-1>HEMOS DEDICADO
UNOS CUANTOS N&Uacute;MEROS, A LA PARTE (CREO YO) M&Aacute;S IMPORTANTE
DEL IMPULSE TRACKER, LOS PATRONES, AHORA VAMOS A POR LA SEGUNDA M&Aacute;S
IMPORTANTE, QUE SON LOS SAMPLES, PORQUE SIN ELLOS, NO HABR&Iacute;A TRACKERS,
LOGICAMENTE.</font></font></b>
<p><font face="Arial, Helvetica, sans-serif"><font size=-1>Todos los m&oacute;dulos
se contruyen a partir de samples.</font></font>
<br><font face="Arial, Helvetica, sans-serif"><font size=-1>Los samples
son muestras de sonido, que puede ser Wav, Voc, etc.</font></font>
<br><font face="Arial, Helvetica, sans-serif"><font size=-1>Ya sabes que
los samples se cargan en F3, eligiendo uno de alguna canci&oacute;n o de
donde sea y pulsando enter, cuando le tienes seleccionado.</font></font>
<br><font face="Arial, Helvetica, sans-serif"><font size=-1>Los samples
se pueden conseguir de muchas maneras, el m&aacute;s utilizado es el denominado
"ripearlos", que es la acci&oacute;n de sacar los samples de otras canciones
(lo que hace casi todo el mundo ;-))</font></font>
<br><font face="Arial, Helvetica, sans-serif"><font size=-1>Hay algunos
trackers a los que no les gusta que les "roben" sus samples porque les
ha costado mucho hacerlos o por que se han gastado dinero compr&aacute;ndolos.
Lo ideal antes de utilizar alg&uacute;n sample de otra canci&oacute;n es
pedirle permiso al autor de dicha canci&oacute;n para poder utilizar su
sample o samples. Normalmente no se suele poner ning&uacute;n obst&aacute;culo.
El autor suele estar contento con que alguien haya escuchado su canci&oacute;n,
y adem&aacute;s quiera alg&uacute;n sample suyo. Pero no siempre ocurre
de este modo, as&iacute; que siempre es mejor preguntar antes. Cuando utilic&eacute;is
alg&uacute;n sample de otra canci&oacute;n siempre poned en el texto de
los samples (recuerda F3) de d&oacute;nde proceden indicando sobre todo
el nombre del autor de la canci&oacute;n.</font></font>
<br><font face="Arial, Helvetica, sans-serif"><font size=-1>Otra manera
de conseguir samples es comprar colecciones de samples en CD que venden
en algunas tiendas. Normalmente estas colecciones sueles ser para profesionales
de la m&uacute;sica y, por tanto, suelen ser algo caras. Los mejor de ellas
es que tienen siempre la m&aacute;xima calidad. A&uacute;n as&iacute;,
los que quieran tener una buena colecci&oacute;n de samples, especiales
para trackers, y tengan acceso a Internet, tienen la posibilidad de hacerse
con un CD por unas 4000 ptas en la p&aacute;gina Web&nbsp;&nbsp; <a href="Http://WWW.mazsound.com">WWW.MAZSOUND.COM.</a></font></font>
<br><font face="Arial, Helvetica, sans-serif"><font size=-1>Otra opci&oacute;n
para conseguir samples es la de fabricarnos los nuestros propios grabando
nuestra voz, un sonido que ocurra en nuestra casa, un trozo de canci&oacute;n,
etc. Sin duda este m&eacute;todo es el m&aacute;s casero y con el que obtendremos
la peor calidad en nuestros samples (sobre todo si grabamos desde el micr&oacute;fono
del ordenador), pero es bastante &uacute;til en algunos casos.</font></font>
<p><b><font face="Arial, Helvetica, sans-serif"><font size=-1>MODIFICAR
SAMPLES</font></font></b>
<br><font face="Arial, Helvetica, sans-serif"><font size=-1>No siempre
estaremos contentos con los samples que obtendremos y necesitaremos quitarle
algo de ruido de fondo, acortarlo para que desaparezca un trozo de silencio
al comienzo o al final del sample, etc. Para hacer estas operaciones tenemos
que conseguir un programa que nos ayude. Uno de los m&aacute;s utilizados,
(que adem&aacute;s utilizo yo y no est&aacute; tan mal) es el "Cool Edit
96".</font></font>
<br><font face="Arial, Helvetica, sans-serif"><font size=-1>Podemos utilizar
este programa tambi&eacute;n para grabar nuestros propios samples.</font></font>
<br><font face="Arial, Helvetica, sans-serif"><font size=-1>Normalmente
despu&eacute;s de grabar un sonido casero por el micr&oacute;fono el resultado
no es satisfactorio, as&iacute; que tendremos que retocarlo qutando algo
de ruido de fondo, recortando las partes de silencio que sobran, normalizando
el volumen, etc. Es muy sencillo realizar todas estas funciones porque
todas est&aacute;n en la barra de herramientas del programa.</font></font>
<p><font face="Arial, Helvetica, sans-serif"><font size=-1>Tecnicamente
hablando, los samples de mejor calidad son aquellos que est&aacute;n grabados
con una frecuencia de muestreo de 44100 Hz y con una resoluci&oacute;n
de 16 Bits, que equivale a la calidad de los CD de audio.</font></font>
<br><font face="Arial, Helvetica, sans-serif"><font size=-1>Los 16 Bits
es la amplitud de la onda del sample, tambi&eacute;n se puede poner a la
mitad, 8 Bits.</font></font>
<br><font face="Arial, Helvetica, sans-serif"><font size=-1>44100 es, como
ya he dicho, la frecuencia de muestreo, que nos dice el n&uacute;mero de
puntos que est&aacute;n representado en un segundo, es decir, en el caso
de la calidad CD, hay 44100 puntos representados en el intervalo de tiempo
de un segundo.</font></font>
<br><font face="Arial, Helvetica, sans-serif"><font size=-1>La verdad es
que para un tracker, los mejores samples son los que tienen muy poco ruido
de fondo, est&aacute;n normalizados y contienen un sonido que no se ve
cortado ni tiene silencios al principio ni al final.</font></font>
<br><font face="Arial, Helvetica, sans-serif"><font size=-1>Por cierto,
sonido normalizado es el que no est&aacute; saturado, es decir, su amplitud
no rebasa los l&iacute;mites de representaci&oacute;n ni por arriba ni
por abajo, por ejemplo, si grabamos un sonido con el "Cool Edit 96" y gritamos
encima del micr&oacute;fono, veremos que lo que hemos grabado suena fatal.
Eso es porque hemos gritado tan alto que la amplitud de representaci&oacute;n
no daba m&aacute;s de s&iacute; en los putnos donde se gritaba y se ha
quedado en el l&iacute;mite m&aacute;s alto o bajo sin sobrepasarlo.</font></font>
<br><font face="Arial, Helvetica, sans-serif"><font size=-1>Adem&aacute;s,
si grabamos un susrro veremos que las ondas que tenemos se alejan poco
de la l&iacute;nea del silencio (la l&iacute;nea horizontal del medio).
Esto tambi&eacute;n es malo ya que no escucharemos bien ese sample una
vez que lo utilizemos en nuestro m&oacute;dulo por ser demasiado bajo.</font></font>
<br><font face="Arial, Helvetica, sans-serif"><font size=-1>Deberemos siempre
grabar los samples entre estos dos l&iacute;mites. Despu&eacute;s pulsaremos
sobre el bot&oacute;n normalizar del "Cool Edit 96" y el volumen del sample
subir&aacute; hasta que su punto m&aacute;s alto o bajo toque con el l&iacute;mite
de representaci&oacute;n. Asi tendremos el sample normalizado.</font></font>
<p><font face="Arial, Helvetica, sans-serif"><font size=-1>BUENO, PUES
NADA M&Aacute;S, VENGA, NOS VEREMOS, DIGO YO.</font></font>
<p><font face="Arial, Helvetica, sans-serif"><font size=-1>PD: Este art&iacute;culo
de los samples est&aacute; inspirado en los de la PCMAN&Iacute;A escrito
por Overflow (Curso de ficheros musicales).</font></font>
<div align=right><font face="Arial, Helvetica, sans-serif"><font size=+2><a href="mailto:omontes@binary-zone.com">OSCAR
MONTES</a></font></font>
<br><font face="Arial, Helvetica, sans-serif"><font size=-1><a href="http://www.geocities.com/doncaballo">Oscar
Montes Web Site</a></font></font>
<br><font face="Arial, Helvetica, sans-serif"><font size=-1><a href="http://www.traxinspace.com/Artists/MusicDirectory.asp?ArtistID=10239">Te
aburres, escucha mi musica y ya est&aacute;</a></font></font></div>

</body>
</html>
