<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Miguel Angel [ Punisher '00? ]">
   <meta name="GENERATOR" content="Mozilla/4.74 [en] (Win95; U) [Netscape]">
   <title>lan</title>
</head>
<body text="#000000" bgcolor="#FFFFFF" link="#000099" vlink="#000099" alink="#000099">

<center><img SRC="Bar.gif" height=30 width=500>
<br><b><font face="Arial,Helvetica"><font color="#000099"><font size=+4>-C&oacute;mo
hackear una LAN-</font></font></font></b></center>
<font face="Arial,Helvetica"><font size=-1></font></font>
<p><br><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>(Una introducci&oacute;n
a los Packet Sniffers)</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Hoy voy a presentarles una
clase de aplicaciones que son muy utilizadas por los "hackers" para obtener
las contrase&ntilde;as de sus compa&ntilde;eros de trabajo, de escuela,
o de los usuarios de redes LAN en general.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Para comprender lo que vamos
a hacer vamos a ver primero algunos conceptos b&aacute;sicos sobre redes.
Empecemos por introducir algunos t&eacute;rminos...</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1><b>REDES LAN:</b> Redes de
&aacute;rea local. Son redes de alta velocidad que se encuentran generalmente
en empresas y organizaciones. LAN significa "Local Area Network" (red de
area local)</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1><b>TOPOLOGIA:</b> Esta palabra
no es m&aacute;s que un sin&oacute;nimo de "tipo" o "clase", o sea que
cuando hablamos de una red con topolog&iacute;a estrella o con topolog&iacute;a
bus, estamos hablando de una red "tipo" estrella o "tipo" bus, o en los
casos mas exquisitos podr&iacute;amos decir</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1><b>ESTRELLA:</b> Las redes
de clase ESTRELLA son aquellas en las que todas las computadoras que pertenecen
a ella est&aacute;n comunicadas con un nodo de conmutaci&oacute;n que recibe
cada paquete de datos y lo env&iacute;a a la computadora a la que est&aacute;
destinado. En este tipo de redes cada computadora recibe s&oacute;lo los
mensajes que est&aacute;n destinados a ella.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1><b>BUS:</b> Las redes con
topolog&iacute;a BUS no tienen un nodo central de conmutaci&oacute;n, y
los paquetes de datos parten de la computadora de origen y llegan a todas
las dem&aacute;s de la red, o sea que cada una debe ser capaz de reconocer
si dichos datos son para ella o no. Si el paquete estaba destinado a ella,
lo recibe, si no, lo ignora. En las redes "Ethernet" este&nbsp; trabajo
es responsabilidad de la placa de red, o sea que el sistema operativo nunca
se entera de los paquetes ajenos.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1><b>ETHERNET:</b> Es el protocolo
m&aacute;s com&uacute;n en redes LAN. En algunas instalaciones antiguas
a&uacute;n se puede ver que las m&aacute;quinas se interconectan con cable
coaxil (el de la TV) y en las m&aacute;s nuevas se usan cables UTP o STP
(parecidos al del tel&eacute;fono, pero con m&aacute;s alambres).</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1><b>MODO PROMISCUO:</b> Muchas
placas de red Ethernet permiten activar el "modo promiscuo" de forma que
TODOS los paquetes de datos que llegan a la placa son aceptados (no s&oacute;lo
los destinados a esa PC) de modo que se puede "espiar" las "conversaciones"
entre nuestros compa&ntilde;eros de red y</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Pues bien, ahora podemos
seguir con lo de las aplicaciones...</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Estos programas, llamados
PACKET SNIFFERS activan el MODO PROMISCUO de las placas de red, y capturan
todos los paquetes para su posterior an&aacute;lisis.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>En este informe nos vamos
a centrar en el "SpyNet", que es un capturador/analizador de paquetes muy
completo.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>El programa se divide en
dos partes: CaptureNet, que es el capturador, y PeepNet, que es el analizador/visualizador.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>El URL para bajarlo es: http://www.granavenida.com/dzone/utils/SpyNet</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><b><font face="Arial,Helvetica"><font color="#000099">CAPTURENET</font></font></b><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Una vez instalado, utilizarlo
es t&aacute;n sencillo como clickear el bot&oacute;n "Start Capture", pero
algunas opciones m&aacute;s avanzadas nos permitir&aacute;n dominar el
programa a fondo y obtener los mismos resultados de modo mucho m&aacute;s
c&oacute;modo, r&aacute;pido y ordenado.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Pongamos un ejemplo: Queremos
averiguar las passwords del e-mail POP3 de nuestro jefe... Entonces tenemos
dos m&eacute;todos sencillos. El primero es combinar CaptureNet con el
visor PeepNet, el otro, la b&uacute;squeda por filtros del mismo CaptureNet.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><b><font face="Arial,Helvetica"><font color="#000099">PEEPNET</font></font></b><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Este m&eacute;todo es el
m&aacute;s f&aacute;cil. Capturamos todo durante un buen rato (quiz&aacute;s
sea necesario dejarlo capturando todo el d&iacute;a, suponiendo que nuestro
jefe chequear&aacute; el correo en alg&uacute;n momento y ah&iacute; su
contrase&ntilde;a pasar&aacute; por nuestra PC), luego vamos al men&uacute;
"File/Save as" y grabamos todo lo que capturamos en un archivo CAP (elegimos
"save from memory buffer"). Luego tocamos el bot&oacute;n PeepNet, y se
ejecutar&aacute; este programa.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Una vez dentro de PeepNet
abrimos el archivo CAP que acabamos de grabar. All&iacute; veremos una
lista de algunas de las conexiones que capturamos. Ahora lo &uacute;nico
que tenemos que hacer es recorrer una por una las conexiones de POP3, que
tienen el icono del sobrecito (el conocido icono del Outlook Express) y
en la ventana inferior del visor podremos ver todo lo que la m&aacute;quina
espiada envi&oacute; al servidor POP3 (es decir, podremos ver el nombre
de usuario y contrase&ntilde;a).</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><b><font face="Arial,Helvetica"><font color="#000099">FILTROS</font></font></b><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>La desventaja del m&eacute;todo
anterior es que no nos muestra todas las conexiones que hubo, por ejemplo,
no veremos en PeepNet los mensajes de ICQ que la victima envi&oacute; y
recibi&oacute; (a menos que lo configuremos correctamente, pero eso se
lo dejo a ustedes). S&oacute;lo nos muestra ciertos tipos de conexi&oacute;n
conocidos, como el HTTP, POP3, TELNET y algunos m&aacute;s.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Para eso tenemos este otro
m&eacute;todo, que v&aacute; un poco m&aacute;s a la ra&iacute;z del asunto.
Ponemos el CaptureNet a capturar todo durante un largo rato, luego tocamos
el bot&oacute;n FIND, y nos va a decir que necesitamos definir el filtro.
En la secci&oacute;n "IP Address" ponemos el IP de la PC de nuestro jefe,
(si es que lo conocemos) y en la secci&oacute;n "Pattern Matching" escribimos
el texto que buscamos, por ejemplo "ICQ", "user" y/o "pass".</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Luego de ejecutada la b&uacute;squeda
los paquetes que contengan esas palabras se marcar&aacute;n con un punto
rojo. Si un paquete contiene la palabra PASS, probablemente ese mismo u
otro posterior (muy cercano) contenga una clave.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Pero los filtros no solo
sirven para hacer b&uacute;squedas, sino tambi&eacute;n, como su nombre
lo indica, para filtrar los mensajes que vamos a espiar. As&iacute; que
si tildamos la opci&oacute;n "Use Filter" para omitir todos los mensajes
que no cumplan con las reglas del filtro (cuidado, una regla demasiado
restrictivahar&aacute; que nos perdamos los paquetes importantes).</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>No olvidemos que las &uacute;nicas
contrase&ntilde;as que podremos capturar son las que viajan DESENCRIPTADAS
en protocolos b&aacute;sicos, pero por suerte o por desgracia, estas son
casi la mayor&iacute;a... POP3, TELNET, HTTP, etc. Poco a poco la inform&aacute;tica
va evolucionando de a poco hacia las conexiones seguras, y muy pronto las
contrase&ntilde;as que viajan por la red ser&aacute;n cosa del pasado (habr&aacute;
contrase&ntilde;as, pero no habr&aacute; necesidad de enviarlas por la
red).</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Este programa cuenta con
much&iacute;simas opciones m&aacute;s, pero un informe tan extenso exeder&iacute;a
el prop&oacute;sito introductorio de esta nota.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>NOTA: Esta nota, as&iacute;
como las mejores notas sobre hacking que encuentre en la red siempre pueden
ser le&iacute;das en: http://www.datafull.com</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<div align=right>
<p><font face="Arial,Helvetica"><font size=+2><a href="http://www.dzone.com.ar">http://www.dzone.com.ar</a></font></font>
<br><font face="Arial,Helvetica">(texto extraido de DZone)</font></div>

</body>
</html>
