<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Miguel Angel [ Punisher '00? ]">
   <meta name="GENERATOR" content="Mozilla/4.74 [en] (Win95; U) [Netscape]">
   <title>Pepo</title>
</head>
<body text="#000000" bgcolor="#FFFFFF" link="#000099" vlink="#000099" alink="#000099">

<center><img SRC="Bar.gif" height=30 width=500>
<br><b><font face="Arial,Helvetica"><font color="#000099"><font size=+4>-LAS
DIVERTIDAS AVENTURAS DE PEPO-</font></font></font></b></center>
<b><font face="Arial,Helvetica"><font color="#CC6600"><font size=-1></font></font></font></b>
<p><b><font face="Arial,Helvetica"><font color="#CC6600"><font size=-1>CAP&Iacute;TULO
VII</font></font></font></b><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Pepo estuvo otros dos d&iacute;as
de rodillas en el suelo mirando f&iacute;jamente a la pared, inm&oacute;vil,
y sin respirar. Tem&iacute;a que la pared se convirtiera en un monstruo
y tratara de morderle, pero sobre todo lo que le pasaba era que se hab&iacute;a
quedado solo, sin comida y por el &uacute;nico sitio por el que podr&iacute;a
escapar era muy probable que estuviera plagado de miles de millones de
c&aacute;scaras de pl&aacute;tano asesinas o, al menos, eso pens&oacute;
&eacute;l...</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Al tercer d&iacute;a decidi&oacute;
levantarse y caminar hacia el lugar en el que encontr&oacute; la c&aacute;scara
de pl&aacute;tano. Se hab&iacute;a puesto una cacerola en la cabeza y llevaba
un tenedor para trinchar el pavo en la mano derecha y una maraca en la
mano izquierda, quer&iacute;a estar seguro por si ten&iacute;a que enfrentarse
contra un ej&eacute;rcito de c&aacute;scaras de pl&aacute;tano.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Camin&oacute; por las galer&iacute;as
hac&iacute;a aquel lugar y se encontr&oacute; otra c&aacute;scara de pl&aacute;tano
en el suelo. Le estaba mirando fijamente y en actitud amenazante. Pepo
se percat&oacute; de ello, de hecho eran imaginaciones suyas, y, dici&eacute;ndo...</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- DESP&Iacute;DETE
DE LA VIDA, MALDITA C&Aacute;SCARA DE PL&Aacute;TANO DEL INFIERNO.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>...la dispar&oacute; con
su maraca intergal&aacute;ctica y la hizo volar en pedazos.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Una puerta de madera y con
incrustaciones de piedras preciosas estaba en frente de Pepo, y hab&iacute;a
en ella un folleto publicitario que deb&iacute;a decir algo asi:</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF8000"><font size=-1>--
RENEPEPOS --</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF9900"><font size=-1>Esta
sociedad de Renepepos fue creada en sus inicios con la intenci&oacute;n
de alzar en el poder legitimo que le fue arrebatado por sus enemigos a
nuestro amo y se&ntilde;or: EL GRAN CABEZA DE CALABAZA.</font></font></font>
<br><font face="Arial,Helvetica"><font color="#FF9900"><font size=-1>El
Gran Cabeza de Calabaza tiene la cabeza con la forma de una calabaza y,
es por ello que debe reinar por los siglos de los siglos ense&ntilde;&aacute;ndonos
a sus fieles siervos como debemos plantar a nuestros hijos para que crezcan
con la cabeza como una calabaza.</font></font></font>
<br><font face="Arial,Helvetica"><font color="#FF9900"><font size=-1>Tu,
si crees en el poder del Gran Cabeza de Calabaza, &uacute;nete a nosotros.
Los Renepepos necesitan de tu ayuda para hacer la revoluci&oacute;n. &iexcl;&iexcl;&Uacute;NETE
A LOS RENEPEPOS!!. Los requisitos son:</font></font></font><font face="Arial,Helvetica"><font color="#FF9900"><font size=-1></font></font></font>
<p><font face="Arial,Helvetica"><font color="#FF9900"><font size=-1>- Admirar
al Gran Cabeza de Calabaza.</font></font></font>
<br><font face="Arial,Helvetica"><font color="#FF9900"><font size=-1>-
Querer ser una calabaza.</font></font></font>
<br><font face="Arial,Helvetica"><font color="#FF9900"><font size=-1>-
Admirar a las calabazas.</font></font></font>
<br><font face="Arial,Helvetica"><font color="#FF9900"><font size=-1>-
Ser fieles al clan.</font></font></font>
<br><font face="Arial,Helvetica"><font color="#FF9900"><font size=-1>-
Permanecer en las sombras hasta el d&iacute;a de la revoluci&oacute;n.</font></font></font>
<br><font face="Arial,Helvetica"><font color="#FF9900"><font size=-1>-
Ser capaz de sacrificarse en favor del Gran Cabeza de Calabaza.</font></font></font>
<br><font face="Arial,Helvetica"><font color="#FF9900"><font size=-1>-
Odiar a los Tinos, a los pollos fritos, y, sobre todo, al Rey de los Pepos.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Pepo, si hubiera estado atendiendo
mientras le&iacute;a el folleto se hab&iacute;a dado cuenta de que corr&iacute;a
un grave peligro qued&aacute;ndose cerca de aquella puerta. Eran los mundos
subterr&aacute;neos que tantos imaginaron pero nadie fue capaz de encontrar
ni describir con precisi&oacute;n. Detr&aacute;s de esa puerta habr&iacute;a
miles de CabezasRojas y CabezasVerdes sedientos de sangre deseosos de alzar
en el poder al Gran Cabeza de Calabaza, y la &uacute;nica manera que ten&iacute;an
de hacerlo era matando antes al anterior rey, es decir, a Pepo. Este grupo
de fan&aacute;ticos llevaba ya varios siglos luchando por alzar en el poder
a su &iacute;dolo Gran Cabeza de Calabaza en las sombras, pegando carteles
publicitarios por las calles y seg&uacute;n cifras oficiales deb&iacute;an
ser m&aacute;s de 100.000 con miles de nuevas incorporaciones cada d&iacute;a.
Se hab&iacute;an especializado en la artiller&iacute;a. Se pasaban toda
su vida sentados en el banco de trabajo con un papel y un l&aacute;piz
calculando trayectorias de misiles cada vez m&aacute;s grandes y mort&iacute;feros.
Empezaron con l&aacute;pices-mortero en sus inicios y por aquel entonces
ya ten&iacute;an misiles del tama&ntilde;o de una d&eacute;cima parte del
radio del planeta. Constru&iacute;an misiles sin cesar, como locos. No
ten&iacute;an pensado utilizarlos nunca contra la civilizaci&oacute;n PEP
porque no les gustar&iacute;a acabar con los edificios pero los hac&iacute;an
m&aacute;s bien pensando en utilizarlos para intimidar a los Pepos o para
m&aacute;s tarde acabar con alg&uacute;n planeta enemigo como la Tierra,
el planeta de los Tinos o cualquier otro que no rindiera tributo al Gran
Cabeza de Calabaza.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Se hab&iacute;an vuelto completamente
locos desde que los Tinos hab&iacute;an conquistado el planeta. Creyeron
que se les hab&iacute;a pasado el tiempo de la revoluci&oacute;n y que
pronto los Tinos encerrar&iacute;an a todos los Pepos en sus cabezas sin
dejarles completar la revoluci&oacute;n que llevaban tantos a&ntilde;os
gestando. Cuando los Tinos y los Pollos Fritos se rindieron ante el SuperPepo
y volvieron a vivir armoni&oacute;samente durante un corto periodo los
CabezaRojas y CabezasVerdes reanudaron su creaci&oacute;n sin l&iacute;mite
de misiles y esta vez los recubrieron de chocolate con leche y los rellenaron
de trufa y horchata. Sin duda era el arma m&aacute;s mort&iacute;fera creada
nunca por un ser inteligente.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Pero lo que no sab&iacute;an
esos malditos CabezaRojas y CabezasVerdes era que Pepo hab&iacute;a sido
entrenado muy duramente para defenderse de los misiles de chocolate con
leche, especialmente contra las que estaban rellenas de trufa y horchata;
esto fu&eacute; as&iacute; porque la primera prueba para ingresar en la
casta de los Guerreros era la defensa a&eacute;rea contra misiles de chocolate
con leche... luego ya cada uno se iba especializando en lo que pod&iacute;a.
Unos se dedicaban a practicar con los misiles de natillas, otros se dedicaban
a los de membrillo y luego ya en la capa m&aacute;s alta se encontraban
los que se encargaban de los misiles de queso manchego y los de trufa y
horchata, que eran sin duda los m&aacute;s dificiles de destruir por su
estructura volatil y a su contenido altamente pringoso.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Sin embargo justo entonces
record&oacute; que hab&iacute;a suspendido de manera estrepitosa todas
las pruebas de defensa contra misiles de chocolate con leche y que en realidad
nunca le dejaron pasar m&aacute;s all&aacute; de la puerta de entrada...
sin embargo un d&iacute;a Pepo se arm&oacute; de valor y decidi&oacute;
internarse en el cuartel; m&aacute;s especificamente en el campo de simulaci&oacute;n
de batalla. All&iacute; carg&oacute; todos los ca&ntilde;ones anti-misiles-chocolate-con-leche-aire-aire-tierra-m&aacute;s-menos-menos-menos-m&aacute;s-menos-m&aacute;s-m&aacute;s
con su munici&oacute;n (Esparragos con mayonesa azucarada) y acto seguido
comenz&oacute; a dispararlos uno a uno contra la oficina de su padre que
en ese momento se encontraba de espia en un cuartel de los Tinos intentando
averiguar donde escond&iacute;an los churros que hab&iacute;an estado saqueando
en los barcos que hab&iacute;an abordado en los &uacute;ltimos meses...</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Al oir los impactos todos
los generales, subgenerales, cabezones, subcabezones y subnormales decidieron
salir para ver que ocurr&iacute;a ah&iacute; fuera... Pepo que no ten&iacute;a
ya tiempo tuvo que pensar r&aacute;pido...</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FEBF01"><font size=-1>- &iexcl;&iexcl;EH
T&Uacute;!! &iexcl;QU&Eacute; DEMONIOS EST&Aacute;S HACIENDO CON LOS CA&Ntilde;ONES!.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- Es
que resulta que...</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FEBF01"><font size=-1>- &iexcl;&iexcl;&iquest;&iquest;QU&Eacute;??!!.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- Pues
que...</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FEBF01"><font size=-1>- &iexcl;&iexcl;&iquest;&iquest;SI??!!.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- Bluo,
BLUP, BLIIIIIIPPPP, BLUOP, BLUOP, BLA, BLIOU.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FEBF01"><font size=-1>- Hmmmm...
&iexcl;&iexcl;&iexcl;&iexcl;A POR EEEEEEEELLLLLLLL!!!!.</font></font></font><font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<center>
<p><font face="Arial,Helvetica"><font color="#000000"><font size=-1>PAF,
ARGH, BOOOOM, KABOOOOM, URGF...</font></font></font></center>
<font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<p><font face="Arial,Helvetica"><font color="#000000"><font size=-1>Ciertamente
ese no fue un buen d&iacute;a para Pepo...</font></font></font><font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<p><font face="Arial,Helvetica"><font color="#000000"><font size=-1>Pero
ahora se encontraba en otra situaci&oacute;n bien distinta que requer&iacute;a
de una gran capacidad para tomar decisiones... Por un lado de encontraba
la puerta en la cual se encontraban los CabezasVerdes y los CabezasRojas
con sed de venganza, misiles de chocolate y lo mismo natillas hirviendo...
Sin embargo el panorama que se desarrollaba detr&aacute;s de &eacute;l
tampoco era un paraiso... Las cascaras de pl&aacute;tano asesinas se hab&iacute;an
organizado y hab&iacute;an rodeado a Pepo... En cualquier momento iban
a atacar... &iexcl;&iexcl;&iexcl;&iexcl;TIENES QUE TOMAR UNA DECISI&Oacute;N!!!!.</font></font></font><font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<p><i><font face="Arial,Helvetica"><font color="#000000"><font size=-1>Si
decides introducirte en la guarida de los Renepepos vete a la p&aacute;gina
0.</font></font></font></i><font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<p><i><font face="Arial,Helvetica"><font color="#000000"><font size=-1>Si
por el contrario deseas hacer frente a las hordas de cascaras de pl&aacute;tanos
asesinos que se agolpan a tu espalda vete a la p&aacute;gina 1.</font></font></font></i><font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<p><i><font face="Arial,Helvetica"><font color="#000000"><font size=-1>Si
deseas sacar el ca&ntilde;on de plasma, matar al Gran Cabeza, a todos los
Tinos y a las cascaras de pl&aacute;tano vete a la p&aacute;gina 2.</font></font></font></i><font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<p><i><font face="Arial,Helvetica"><font color="#000000"><font size=-1>Si
quieres sacar la nevera intergal&aacute;ctica y tomarte un refresco isot&oacute;nico
vete a la p&aacute;gina 3.</font></font></font></i><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- Venga
t&iacute;o, &iexcl;&iexcl;Date prisa!!.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#000099"><font size=-1>- &iexcl;Hey,
yo cre&iacute;a que este libro no era de esos interactivos!.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- &iexcl;&iexcl;Y
QU&Eacute; M&Aacute;S DA ESO AHORA!! &iexcl;&iexcl;AY&Uacute;DAME!!.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#000099"><font size=-1>- Est&aacute;
bien t&iacute;o... Creo que deber&iacute;as meterte en la guarida de los
Renepepos.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- &iexcl;&iexcl;C&Oacute;MO
DEMONIOS VOY A HACER ESO!! &iexcl;&iexcl;ESOS RENEPEPOS EST&Aacute;N LOCOS
Y ME QUIEREN MATAR!!.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#000099"><font size=-1>- Tambien
es verdad... Esta bien... Tal vez debieras hacer frente a las hordas de
cascaras de pl&aacute;tano asesinas.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- &iexcl;&iexcl;C&Oacute;MO
SE NOTA QUE NO EST&Aacute;S T&Uacute; AQU&Iacute; LISTILLO!! &iexcl;&iexcl;&iexcl;&iexcl;SON
MILES!!!! &iexcl;&iexcl;NO TENGO NINGUNA POSIBILIDAD!!.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#000099"><font size=-1>- Vale,
vale... No te pongas nervioso... Usa el ca&ntilde;on de plasma.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- &iquest;El
ca&ntilde;on de plasma? &iexcl;&iexcl;Yo no tengo ning&uacute;n ca&ntilde;on
de plasma!!.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF8000"><font size=-1>- &iexcl;&iexcl;PEPO!!.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- &iquest;Pap&aacute;?.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF8000"><font size=-1>- &iexcl;&iexcl;TE
HABLO DESDE EL M&Aacute;S ALL&Aacute;!!. &iexcl;&iexcl;MIRA EN TU NEVERA
INTERGAL&Aacute;CTICA!!.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- &iquest;&iquest;&iexcl;&iexcl;LA
NEVERA INTERGAL&Aacute;CTICA!!??.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF8000"><font size=-1>- SI...
LA NEVERA INTERGAL&Aacute;CTICA... ES AQUELLO QUE LLEVAS SOLDADO A LA ESPALDA
DESDE QUE TEN&Iacute;AS DOS A&Ntilde;OS.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- &iexcl;&iexcl;&iexcl;AJ&Aacute;!!,
&iexcl;&iexcl;AQU&Iacute; DENTRO HAY UN HELIC&Oacute;PTERO, UNA LANCHA
MOTORA Y UNA BARRA DE PAN!! &iexcl;&iexcl;&iexcl;GRACIAS PAP&Aacute;!!!</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#000099"><font size=-1>- &iexcl;&iexcl;&iexcl;PAPOTR&Oacute;NICO!!!,
&iexcl;&iexcl;&iexcl;VUELVE A TU CANTERA TE HE DICHO!!!</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF8000"><font size=-1>- HASTA
PRONTO, HIJO, ESTE MALDITO REY DE BASTOS ME TIENE HASTA LAS --AAAAAAAH--</font></font></font><font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<p><font face="Arial,Helvetica"><font color="#000000"><font size=-1>Pepo,
sin hacer caso al confuso lector que no acababa a decidirse por la p&aacute;gina
a elegir y que, sin darse cuenta de que era un libro interactivo, acab&oacute;
volvi&eacute;ndose loco leyendo de principio a fin p&aacute;ginas que no
tienen nada que ver la una con la otra, corri&oacute; por las galer&iacute;as
de las alcantarillas. Salt&oacute; sobre las cabezas de las c&aacute;scaras
de pl&aacute;tano asesinas y corri&oacute; por los pasadizos de las alcantarillas
tirando miguitas de pan por si alg&uacute;n d&iacute;a le apetecia volver
para acabar con las c&aacute;scaras de pl&aacute;tano o con los Renepepos.</font></font></font>
<br><font face="Arial,Helvetica"><font color="#000000"><font size=-1>Gir&oacute;
en una esquina y se apoy&oacute; en la pared para descansar creyendo que
nadie le segu&iacute;a ya y trat&oacute; de dormir un rato, pero seg&uacute;n
se agachaba escuch&oacute; el ruido ensordecedor de unas motos retumbando
por la alcantarilla.</font></font></font>
<br><font face="Arial,Helvetica"><font color="#000000"><font size=-1>Creyendo
que ser&iacute;an los p&aacute;jaros de los prados de las alcantarillas,
los cuales hay que aclarar que no exist&iacute;an, ni nunca existieron,
ni probablemente nunca existir&aacute;n, se durmi&oacute; durante cinco
segundos antes de que una moto le atropellara.</font></font></font>
<br><font face="Arial,Helvetica"><font color="#000000"><font size=-1>Los
Renepepos le hab&iacute;an seguido montados en su Harley con la chupa de
cuero, el casco de pinchos y la cadena con una gran bola de metal llena
de clavos en la mano.</font></font></font>
<br><font face="Arial,Helvetica"><font color="#000000"><font size=-1>Eran
muchos, por lo menos, uno, y en ese momento se encontraba dando la vuelta
para volver a atropellar a Pepo.</font></font></font>
<br><font face="Arial,Helvetica"><font color="#000000"><font size=-1>D&aacute;ndose
cuenta de sus intenciones Pepo se hizo una bola y acurrucado en medio de
la alcantarilla cerr&oacute; los ojos y empez&oacute; a cantar; de nuevo
le atropell&oacute;.</font></font></font>
<br><font face="Arial,Helvetica"><font color="#000000"><font size=-1>Una
hora despu&eacute;s el Renepepo estaba muri&eacute;ndose de risa: hab&iacute;a
atropellado tant&iacute;simas veces a Pepo, de las maneras m&aacute;s diversas,
y a&uacute;n le divert&iacute;a. Un corrillo de RenePepos y c&aacute;scaras
de pl&aacute;tano le rodeaban gritando "M&Aacute;S M&Aacute;S M&Aacute;S"...</font></font></font>
<br><font face="Arial,Helvetica"><font color="#000000"><font size=-1>A
las dos horas la moto del Renepepo explot&oacute; en mil pedazos y Pepo
aprovech&oacute; el momento de confusi&oacute;n para confundirse entre
las ratas y agachado camin&oacute; hasta la salida de la alcantarilla m&aacute;s
cercana, tir&oacute; dos de las bombas de hidr&oacute;geno que ten&iacute;a
en la nevera intergal&aacute;ctica a la alcantarilla y se despreocup&oacute;
ya por lo que a partir de entonces pudieran hacerle los habitantes de los
mundos subterr&aacute;neos.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><b><font face="Arial,Helvetica"><font color="#FEBF01"><font size=-1>CAP&Iacute;TULO
VIII</font></font></font></b><font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<p><font face="Arial,Helvetica"><font color="#000000"><font size=-1>Por
fin ve&iacute;a de nuevo la luz de Zetoplasma desde doce d&iacute;as antes.
No hab&iacute;a ni un solo ruido en la superficie, por lo que se ve los
combatientes todav&iacute;a estaban comprobando qu&eacute; les hab&iacute;a
pasado a sus ancianas madres y por esto Pepo no tard&oacute; demasiado
en llegar al monasterio Tinotano.</font></font></font><font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<p><font face="Arial,Helvetica"><font color="#000099"><font size=-1>- Peque&ntilde;o
saltamontes, veo que has loglado tu plop&oacute;sito... Pasa a tu letilo
espilitual...</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- &iquest;Ha
llegado Constantino?</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#000099"><font size=-1>- Tu
amigo de espilitualidad se malch&oacute; de aqu&iacute; hace dos minutos
cuando le expliqu&eacute; que no pod&iacute;a leelos el futulo sin el dinelo,
y el no ten&iacute;a dinelo asi que le met&iacute; una patada en su culo
y lo lanc&eacute; muy lejos de aqu&iacute;. Mientlas volaba me dijo que
le buscalas en el pueblo, que tlatal&iacute;a de ganalse el dinelo honladamente.
Pelo ah&iacute; no acaba la cosa, tambi&eacute;n te tengo que adveltil
de un glan peliglo que se aploxima desde las... las... &iquest;Peque&ntilde;o
saltamontes? &iexcl;&iexcl;&iexcl;&iquest;D&Oacute;NDE VAS?!!!! &iexcl;&iexcl;&iexcl;A&Uacute;N
NO HE TELMINADO!!!... &iexcl;&iexcl;CUERNOS!!</font></font></font><font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<p><font face="Arial,Helvetica"><font color="#000000"><font size=-1>Pepo
sali&oacute; corriendo del monasterio tinotano sin dejar acabar al calvo
de Rodolfo y se fue derechito y sin entretenerse hacia el pueblo... la
mala suerte es que no ten&iacute;a ni idea de la existencia de dicho pueblo...
a decir verdad ni siquiera alcanzaba a comprender lo que significaba esa
palabra. No hab&iacute;a nadie a quien preguntar y ninguno de los anticuados
e in&uacute;tiles sistemas de descomposici&oacute;n interplanetaria y desplazamiento
inmediato a cualquier parte del cosmos ni los sistemas navegadores universales
localizadores de pueblos que trajeron los atrasados Tinos en su conquista
funcionaban; hab&iacute;an sido destruidos por los Pepos y cambiados por
dos palos clavados en el suelo y cruzados que nadie sab&iacute;a para que
serv&iacute;an, pero aseguraban era ingenier&iacute;a pura.</font></font></font>
<br><font face="Arial,Helvetica"><font color="#000000"><font size=-1>Pensando
esto, y sin ocurr&iacute;rsele nada mejor que hacer, Pepo se comi&oacute;
su nevera intergal&aacute;ctica tan llena de objetos &uacute;tiles de los
que nunca deber&iacute;a prescindir y uno de los objetos que dentro se
guardaba sali&oacute; volando de su boca: era una paloma.</font></font></font>
<br><font face="Arial,Helvetica"><font color="#000000"><font size=-1>Al
segundo aparecio Constantino:</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#6A6AFF"><font size=-1>- &iquest;Has
visto eso?</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- &iquest;El
qu&eacute;?</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#6A6AFF"><font size=-1>- Si,
no te hagas el tonto. Sabes perfectamente de lo que te hablo.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- &iquest;De
qu&eacute; hablas?</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#6A6AFF"><font size=-1>- He
o&iacute;do salir una paloma de tu boca, y de aqu&iacute; no me ir&eacute;
hasta que no la haya atrapado, &iquest;entiendes?. &iexcl;&iexcl;&iquest;D&Oacute;NDE
EST&Aacute; LA PALOMA?!!</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- &iexcl;No
se de qu&eacute; me est&aacute;s hablando!, &iexcl;&iexcl;De verdad!!.
Ni siquiera s&eacute; lo que significa la palabra "paloma".</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#6A6AFF"><font size=-1>- &iexcl;&iexcl;EMPIEZAS
A CANSARME!!.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- &iexcl;Har&eacute;
lo que quieras, pero d&eacute;jame ir!.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#6A6AFF"><font size=-1>- &iexcl;&iexcl;RESPUESTA
INCORRECTA!! &iexcl;&iexcl;&iquest;D&Oacute;NDE EST&Aacute; LA PALOMA?!!.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- Yo
no s&eacute; d&oacute;nde est&aacute; tu paloma.</font></font></font><font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<p><font face="Arial,Helvetica"><font color="#000000"><font size=-1>...Constantino
abofetea a Pepo...</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#6A6AFF"><font size=-1>- &iexcl;&iexcl;INCORRECTO!!
&iquest;D&Oacute;NDE EST&Aacute; MI PALOMA?.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- Se
fue volando por el cielo.</font></font></font><font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<p><font face="Arial,Helvetica"><font color="#000000"><font size=-1>...le
coge del cuello, zarande&aacute;ndolo br&uacute;scamente...</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#6A6AFF"><font size=-1>- Si.
&iexcl;&iexcl;Tu siempre dices lo mismo cuando se te pregunta!! &iexcl;&iexcl;&iexcl;&iquest;D&Oacute;NDE
ESTA TU SENSATEZ, VOY A MATARTE COMO NO ME LO DIGAS?!!!.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- Se
fue volando por el cielo.</font></font></font><font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<p><font face="Arial,Helvetica"><font color="#000000"><font size=-1>...le
pega un pu&ntilde;etazo en el estomago...</font></font></font><font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<p><font face="Arial,Helvetica"><font color="#6A6AFF"><font size=-1>- &iexcl;&iexcl;OYE,
NO TE LO PREGUNTAR&Eacute; OTRA VEZ!! &iexcl;&iexcl;&iexcl;ESA PALOMA SERA
M&Iacute;A!!!, &iexcl;NO ME LA PODR&Aacute;S ARREBATAR NI T&Uacute;, NI
NINGUNA VIEJECITA CON MIGAS DE PAN AS&Iacute; QUE DIME EN D&Oacute;NDE
LA HAS ESCONDIDO!!.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- De
verdad que no lo s&eacute;... Solo recuerdo como sal&iacute;a de mi boca
y echaba a volar... del resto no tengo ni--</font></font></font><font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<p><font face="Arial,Helvetica"><font color="#000000"><font size=-1>De
un pu&ntilde;etazo Constantino tira a Pepo al suelo, y cuando su abultada
frente golpea con el suelo provocando un estruendo de considerable magnitud
suena un extra&ntilde;o sonido como si algo se estuviera electrocutando.
Constantino alza la vista y ve, enrrollada en los cables de alta tension
y soltando chispas a la paloma que estaba buscando. Se arrodillo en el
suelo, sin fuerzas y con l&aacute;grimas en los ojos:</font></font></font><font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<p><font face="Arial,Helvetica"><font color="#6A6AFF"><font size=-1>- &iexcl;&iexcl;&iexcl;&iexcl;&iexcl;&iquest;POOR
QU&Eacute;&Eacute;&Eacute;&Eacute;&Eacute;&Eacute;&Eacute;&Eacute;&Eacute;&Eacute;&Eacute;&Eacute;&Eacute;&Eacute;&Eacute;?!!!!!.</font></font></font><font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<p><font face="Arial,Helvetica"><font color="#000000"><font size=-1>Cay&oacute;
al suelo, exhausto por la cantidad de aire que hab&iacute;a tenido que
expulsar para gritar, y al rato se levant&oacute;, a&uacute;n con l&aacute;grimas
en los ojos, que los ten&iacute;a en blanco, y cabizbajo, direcci&oacute;n
de nuevo al monasterio tinotano de m&aacute;s all&aacute; de las monta&ntilde;as,
en busqueda de amparo espiritual. Llevaba persiguiendo a esa paloma desde
no se sabe cuant&iacute;simos a&ntilde;os, la hab&iacute;a seguido muy
de cerca durante las &uacute;ltimas semanas y ya estaba preparando su ataque
para capturarla, y la noticia de que hab&iacute;a muerto a manos de otro
que no hubiera sido &eacute;l destroz&oacute; por completo su moral.</font></font></font>
<br><font face="Arial,Helvetica"><font color="#000000"><font size=-1>Por
su parte Pepo hab&iacute;a despertado ya del shock que le hab&iacute;a
causado la paliza de Constantino y, todav&iacute;a tumbado, estaba imagin&aacute;ndose
una noria hecha con piruletas de fresa girando en torno a un precioso y
reluciente engranaje de 10 dientes.</font></font></font>
<br><font face="Arial,Helvetica"><font color="#000000"><font size=-1>Sab&iacute;a
de sobra aquella afici&oacute;n m&aacute;s all&aacute; de lo com&uacute;n
y del plano axial de la realidad que supon&iacute;a para Constantino las
palomas. La leyenda de Constantino es todo un ejemplo de heroicidad y entrega
completa a su trabajo que es contada a los Pepos desde que son peque&ntilde;os
para que se duerman. Pero a pesar de que le hab&iacute;a golpeado y de
que incluso podr&iacute;a haberle matado Pepo comprendi&oacute; que estaba
fuera de s&iacute; alimentado por el &eacute;xtasis sobrenatural que hac&iacute;a
a Constantino actuar de manera inconsciente y agresiva con tal de comerse
a todas las palomas del universo, y se fue al monasterio tinotano de m&aacute;s
all&aacute; de las monta&ntilde;as a buscarle de nuevo.</font></font></font><font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<p><font face="Arial,Helvetica"><font color="#000000"><font size=-1>Una
duda volvi&oacute; a asaltar su mente &iquest;D&oacute;nde demonios se
encuentra el monasterio tinotano de m&aacute;s all&aacute; de las monta&ntilde;as?,
&iquest;D&oacute;nde est&aacute;n las monta&ntilde;as de m&aacute;s all&aacute;?
&iquest;Qu&eacute; cuernos es una monta&ntilde;a?, &iquest;Por qu&eacute;
nunca s&eacute; a d&oacute;nde tengo que ir?, &iquest;Por qu&eacute; no
puedo ser inteligente como... como...? &iquest;Por qu&eacute; en este planeta
nadie es inteligente?</font></font></font><font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<p><font face="Arial,Helvetica"><font size=-1><font color="#80FF80">-</font><font color="#006600">
&iquest;Qu&eacute; te pasa? -</font><font color="#80FF80"> </font><font color="#FFFFFF">le
dijo un desconocido que pasaba por la calle en ese momento acompa&ntilde;ado
de otra persona.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- No
lo entender&iacute;as.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#006600"><font size=-1>- &iquest;Una
raiz trigonom&eacute;trica de un polinomio trioestatob&aacute;rico de grado
treinta y dos?.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- No.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#006600"><font size=-1>- &iquest;No
sabes la f&oacute;rmula qu&iacute;mica del trifosfato metafosforoso con
tendencias c&aacute;lcicas y rec&iacute;proco a azufrarse?.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- No.
D&eacute;jalo, nunca lo entender&iacute;as, en este planeta todos son est&uacute;pidos.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#006600"><font size=-1>- Yo
no soy de este planeta. Vengo de la Tierra. Me llamo John Wayne, este es
mi compa&ntilde;ero Clint Eastwood. Somos los jefes de la resistencia terrestre,
el R.E.T.R.E.T.E. (Resistencia Eficaz Total y Real para Erradicacion de
los Tinos Est&uacute;pidos). El RETRETE se fund&oacute; cuando las primeras
hordas de Tinos se fueron asentando en nuestro planeta y hoy en d&iacute;a,
todos los humanos que no han sido capturados por los Tinos pertenecen a
esta b&eacute;lica asociaci&oacute;n. Nos hemos enterado de que un enorme
contingente de m&aacute;s de treinta millones de feroces y asesinos Tinos
se dirigen a este planeta y, amigo, por muy fuertes que ustedes sean...
&iexcl;Ja!... Necesitar&aacute;n un milagro para hacerle frente a todos
esos malditos cabezones.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- Perd&oacute;n...
podr&iacute;a repetir desde digamos... el principio.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#006600"><font size=-1>- Como
le iba diciendo, estamos dispuestos a colaborar con ustedes en la defensa
de su planeta con la condici&oacute;n de que m&aacute;s tarde nos ayuden
a limpiar La Tierra de Tinos... &iquest;Qu&eacute; le parece amigo?</font></font></font><font face="Arial,Helvetica"><font color="#006600"><font size=-1></font></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- Hombreee...
pueesss... &iquest;Como se lo podr&iacute;a decir...? No le entiendo. &iquest;Podr&iacute;a
hablar de manera m&aacute;s sencilla?.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#006600"><font size=-1>- &iquest;M&aacute;s
sencillo? Usted debe ser... Pepo &iquest;Verdad?.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- S&iacute;.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#006600"><font size=-1>- &iexcl;&iexcl;FABULOSO!!
&iexcl;&iexcl;Le estabamos buscando!!. Pero de momento cont&eacute;stenos
a nuestra proposici&oacute;n. &iquest;Aceptan la alianza o no?.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- No
se si lo coges... NO ME HE ENTERADO.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#006600"><font size=-1>- Ah,
perdona, olvide que eres... en fin... t&uacute;. Te lo explicar&eacute;
para que lo entiendas:</font></font></font>
<br><font face="Arial,Helvetica"><font color="#006600"><font size=-1>Tino
malo, pega humano, pega Pepos. Tino viene para pegar Pepos. Pepos buenos
son pegados por Tinos. Si alianza con humano, Pepos y humanos vencen a
Tinos y Pepos y humanos felices y contentos podran comer golosinas. Si
no alianza, Tinos malos vencen a Pepos y humanos y se los comen. Tu Pepo,
yo humano. Tu y yo alianza. &iquest;Tu aceptar?</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- &iexcl;AH!,
&iexcl;&iexcl;HABERLO DICHO ANTES!! En el fondo tienes raz&oacute;n, esas
naves, sobre todo la de enmedio que me comentabas estaba blindada hasta
arriba, armada hasta los dientes y con el mismisimo Gran Cabeza en su interior
ser&iacute;a un gran problema para nuestras tropas a la hora de disparar
contra las naves. De hecho, como bien has dejado claro en tu segundo punto
ser&iacute;a pr&aacute;cticamente imposible vencer a los Tinos con las
catapultas de pedruscos y los tirachinas asalta-castillos de los que contamos
en nuestro ej&eacute;rcito as&iacute; que ser&iacute;a recomendable alguna
que otra investigaci&oacute;n en ese sentido sobre alguna manera de aumentar
la eficacia no nos vendr&iacute;a nada mal. Pues lo dicho, cuentan con
nuestro apoyo para lo que quieran. Yo por mi parte tratar&eacute; de reunir
a todas las tropas que pueda en un plazo de dos d&iacute;as &iquest;De
acuerdo?.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#006600"><font size=-1>- Yo
contento, yo feliz. Yo aviso superiores en La Tierra. Gracias. Adi&oacute;s.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- Adi&oacute;s
Clint Wayne y John Eastwood.</font></font></font><font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<p><font face="Arial,Helvetica"><font color="#000000"><font size=-1>En
ese instante los dos humanos se fueron con paso lento pero decidido hac&iacute;a
el monasterio tinotano de m&aacute;s all&aacute; de las monta&ntilde;as
dejando all&iacute; al pobre y desamparado Pepo...</font></font></font><font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<p><font face="Arial,Helvetica"><font color="#000000"><font size=-1>Pepo
ten&iacute;a que ir a ese monasterio, pero no sab&iacute;a como ir, as&iacute;
que en vez de seguir a los dos humanos para que le llevaran decidi&oacute;
que en ese momento lo que realmente necesitaba era mirar un buen rato y
de manera fija a Zetoplasma... cierto es que le costaba un mont&oacute;n
mantener su mirada fija en Zetoplasma, pero Pepo siempre hab&iacute;a sido
un luchador y logr&oacute; aguantar la mirada durante casi 2 segundos seguidos;
despu&eacute;s de haber jugado decidi&oacute; quedarse observando al suelo
por si acaso se mov&iacute;a, crec&iacute;a, cambiaba de color o lo que
fuera... no estaba seguro de la utilidad de esto pero pens&oacute; que
quiz&aacute;s podr&iacute;a darle alguna pista, as&iacute; que all&iacute;
se qued&oacute; acurrucado y observando...</font></font></font><font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<p><font face="Arial,Helvetica"><font color="#000000"><font size=-1>Ante
el aburrimiento que al cabo de un par de horas le entr&oacute;, decidi&oacute;
vomitar su nevera intergal&aacute;ctica por si acaso tuviera algo de lo
cual no se hubiera percatado hasta ahora y que quiz&aacute; pudiera darle
alguna pista... Despu&eacute;s de buscar un rato encontr&oacute; varios
libros y un televisor...</font></font></font><font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<p><font face="Arial,Helvetica"><font color="#000000"><font size=-1>Tras
pasarse un buen rato diciendole a la televisi&oacute;n de las m&aacute;s
diversas maneras que se encendiera perdi&oacute; las esperanzas y cogi&oacute;
uno de los libros que hab&iacute;a...</font></font></font><font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- A
ver... TINOLANDIA WARS!... Vaya parece bueno... Voy a echarle un vistazo...</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<center>
<p><font face="Arial,Helvetica"><font size=-1>------------------------------------------------------------------------------------------------------------------------</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><b><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>TINOLANDIA
WARS!</font></font></font></b></center>
<font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Alg&uacute;n lugar al Oeste
de la galaxia de Susinmunitrastroslopi.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>22-11-3.914 - 17:34.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Desde hac&iacute;a a&ntilde;os
Tinolandia hab&iacute;a sido siempre un lugar tranquilo y pac&iacute;fico
en el que todos los Tinos conviv&iacute;an en paz y armon&iacute;a... sin
embargo la paz y armon&iacute;a que hasta el d&iacute;a de hoy se respiraba
en tinolandia se ve&iacute;a seriamente amenazada desde la llegada de los
K-bron-az-os...</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Los K-bron-az-os, en esencia,
no eran m&aacute;s que huevos de avestruz que ten&iacute;an en su cascar&oacute;n
grandes cabras de color rosa tatuadas. La raz&oacute;n de este extra&ntilde;o
suceso se deb&iacute;a a las fuertes radiaciones de naturaleza frutal que
ten&iacute;an que soportar de los melocotones en almibar. Estos irradiaban
por estar en contra del sistema y porque estaban obligados a convivir con
las Judiths, (Judias pintas sin chorizo pero desarrolladas de sobremanera)
que eran crueles y frustrantes seres que no paraban de decir gilipolleces
ya pod&iacute;a ser en forma de "osea", "te lo juro", "de verdad", "osea
osea", "osea, osea, osea" y dem&aacute;s.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Esta raza perteneci&oacute;
en su d&iacute;a a Penoso Country Ville, lugar en el cual viv&iacute;an
en paz y armon&iacute;a... Todo iba bien hasta que un d&iacute;a cerraron
el Corte Ingl&eacute;s... En ese momento, la histeria se apoder&oacute;
de la poblaci&oacute;n; como respuesta las Judiths comemzaron a hacer Motines
(Postres arrojadizos de chocolate con nueces) con los que poder reducir
a la histeria (cre&iacute;an que era un monstruo)... sin embargo a la mitad
de la ornada (con "h") se dieron cuenta de que les faltaban nueces para
hacer todos los Motines as&iacute; que se vieron obligadas a abandonar
Penoso Country Ville durante el periodo de tiempo que requerieran para
almacenar el n&uacute;mero necesario de nueces... esto les llev&oacute;
a... Tinolandia, la tierra en la que las nueces bailan samba y juegan a
la oca...</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Otra de las razas que se
encontraban en Tinolandia eran los Victors, criaturas humanas en apariencia
aunque con algunas diferencias...</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Ten&iacute;an una memoria
limitada a solo 48 frases, si aprend&iacute;an m&aacute;s, la cabeza se
les convert&iacute;a en una liendre que una vez se hab&iacute;a desarrollado
empezaba a devorarse a si misma provocando la muerte al individuo hu&eacute;sped,
sin embargo y debido a su escaso coeficiente intelectual jam&aacute;s se
hab&iacute;a dado ning&uacute;n caso.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Tambi&eacute;n eran bocazas,
aunque jam&aacute;s se ha descubierto el porqu&eacute; de esta extra&ntilde;a
caracter&iacute;stica, a falta de pruebas diremos que son bocazas porque
s&iacute;.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Otra extra&ntilde;a caracter&iacute;stica
que los hac&iacute;a diferentes de los dem&aacute;s era que solo pod&iacute;an
vestir con forros polares de color rojo, las razones de este extra&ntilde;o
suceso est&aacute;n a&uacute;n sin aclarar.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>La &uacute;ltima caracter&iacute;sca
y m&aacute;s importante era su capacidad para hacer cabronadas, esto &uacute;ltimo
lo heredaron de un cuerno volador que impact&oacute; contra el huevo de
un Victor, este cuerno, seg&uacute;n parece conten&iacute;a en su interior
material gen&eacute;tico de los K-bron-az-os que estaba siendo transportado
a Susinmunitrastroslopi, solo para ver lo r&aacute;pido que el cuerno era
capaz de volar. Esto hizo que el ADN del VICTOR mutar&aacute; y bla bla
bla...</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Estas 3 razas ten&iacute;an
por finalidad la de instaurar una monarqu&iacute;a microf&oacute;nica (El
micr&oacute;fono tiene el poder y solo debe rendir tributos a los altavoces).</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Los K-bron-az-os llevaban
a&ntilde;os intentando implantar un nuevo r&eacute;gimen en el cual los
alimentos predominantes eran, en Invierno, los helados de pelo de Paco
y en Verano los turrones de Francisco a la romana. Esto sin duda alguna
cabreo a los Tinos, a las Judiths y a los Victors los cuales decidieron
unirse formando lo que se le llam&oacute; La Triple Casta&ntilde;a que
luchaban por defender los ideales del difunto, pero no por ello peor ni
de mala calidad, Chorizo X de Estrasburgo; este decidi&oacute; abdicar
al perder la cabeza en una guillotina y aseguraba que la luz blanca era
m&aacute;s blanca que la roja y que la luz roja era m&aacute;s roja que
la blanca porque la blanca era blanca y no roja como su malvado hermano
(Morcillo X de Estrasburgo) pretendi&oacute; hacer creer al pueblo bajo
el lema, "El rojo es m&aacute;s blanco que el blanco"...</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<center>
<p><font face="Arial,Helvetica"><font size=-1>------------------------------------------------------------------------------------------------------------------------</font></font></center>
<font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- Bah...
Es solo uno de esos libros patriotistas que los Tinos leen a sus hijos
por las noches... A ver este otro...</font></font></font><font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<center>
<p><font face="Arial,Helvetica"><font color="#000000"><font size=-1>------------------------------------------------------------------------------------------------------------------------</font></font></font><font face="Arial,Helvetica"><font color="#000000"><font size=-1></font></font></font>
<p><b><font face="Arial,Helvetica"><font color="#000000"><font size=-1>Utilizaci&oacute;n
de las mesas y de las sillas</font></font></font></b></center>
<font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Actualmente las sillas y
las mesas se relacionan con las actividades de trabajo y relax diarios,
sin embargo, a lo largo de la historia, las mesas y las sillas han tenido
unos usos y or&iacute;genes completamente distintos.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Historia de las sillas.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>El f&oacute;sil m&aacute;s
antiguo encontrado de una silla data aproximadamente del a&ntilde;o 200.000
a.C. &eacute;poca en la que el hombre primitivo, el "homo sapiens", utilizaba
voluminosas piedras para lanzarse entre ellos mismos hacia las cabezas,
este acto era utilizado principalmente para delimitar su territorio, pero,
un d&iacute;a, el fil&oacute;sofo y arquitecto Bartolomi&uacute; III de
la silla redonda, se percat&oacute; de que una vez te han lanzado una piedra
te puedes sentar encima para evitar que el lanzador en cuesti&oacute;n
la coja de nuevo y te la vuelva a tirar, solucionando as&iacute; uno de
los problemas m&aacute;s graves en las disputas territoriales. A este descubrimiento
Bartolomi&uacute; lo hizo llamar "La jugada de la croqueta loca" en honor
a su honorable abuelo Croquetini&uacute; de Merluci&uacute; a la Planchi&uacute;,
quedando as&iacute; patentado.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Casi a la vez, Monsier Do
Espagetti, cient&iacute;fico y mec&aacute;nico de reactores nucleares italianos,
demostr&oacute; que el descanso ejercido por una piedra es equivalente
a la rugosidad partido por la esponjosidad de la misma y que queda expresada
en la siguiente f&oacute;rmula R = Rug/Esp a la cual titul&oacute; como
"La ley de la croqueta cuerda" quedando igualmente patentado en el mismo
d&iacute;a.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Ambos descubrimientos pasaron
desapercibidos los siguientes 201.500 a&ntilde;os hasta que un monje tibetano,
Morcillo Sujustruscus, decidi&oacute; combinar ambas teor&iacute;as para
crear lo que quiso hacer llamar "Objeto que sirve para sentarse y que es
muy bueno para las cervicales". Sin embargo, el inventor de la piedra se
le hab&iacute;a adelantado en el registro del nombre al haber bautizado
as&iacute; a su hijo Alfonso, as&iacute; que Morcillo renombr&oacute; su
invento como Sailla (Del lat&iacute;n Saillae).</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>En posteriores reuniones
de la Real Academia de la Lengua Espa&ntilde;ola se decidi&oacute; renombrar
Sailla por Silla, ya que quer&iacute;an proliferar el uso de la letra "i"
por considerarse m&aacute;s latina que la "a".</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Historia de las mesas.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Casi de manera paralela al
descubrimiento de "La jugada de la croqueta loca" y "La jugada de la croqueta
cuerda" un famoso traficante de judias pintas con merluza llamado Leonardo
Da Chanchin decidi&oacute; incorporar un nuevo producto para traficar que
sustituyera a los cangrejos malvas debido a su gran dificultad de captura
y a su alto contenido en incienso. Cre&oacute; m&uacute;ltiples bocetos
sobre lo que ser&iacute;a su nuevo invento y al cual le daba m&uacute;ltiples
aplicaciones, a uno lo hizo llamar el giro-mesa, a otro la mesa-marina,
al tercero la tele-mesa y al &uacute;ltimo el libro, pero como no supo
en donde colocar el prefijo mesa en esta palabra lo elimin&oacute; de su
inventario. En verdad, todos eran una tabla con dos patas que en teor&iacute;a
deber&iacute;an servir para apoyar cosas, pero debido a su mala construcci&oacute;n
con tan solo dos patas tuvo que usarlo en otras tareas para que la gente
no se diera cuenta de su incompetencia. Entre otras utilidades estas mesas
de dos patas serv&iacute;an para le&ntilde;a y para le&ntilde;a en &uacute;ltima
estancia.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Pocos a&ntilde;os despu&eacute;s
este invento se hizo muy famoso por el famoso "Juego de la mesa loca" que
consist&iacute;a en lanzar una mesa todo lo fuerte que se pod&iacute;a
contra las cabezas de las ancianas que sal&iacute;an a darle de comer a
las palomas.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>200 a&ntilde;os tuvieron
que transcurrir para que un grupo de cient&iacute;ficos se percataran de
la inconsistencia de la mesa. Gracias a montones de horas de trabajo se
logr&oacute; por fin la mesa de una pata, m&aacute;s ligera y que permit&iacute;a
lanzarla m&aacute;s lejos y fuerte.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>20 a&ntilde;os m&aacute;s
tarde otro grupo de cient&iacute;ficos quit&oacute; esta &uacute;ltima
pata y le puso alas y un motor a propulsi&oacute;n para que estas pudieran
introducirse en el interior de las casas de las ancianas y as&iacute; no
tener que esperar a que les dieran de comer a las palomas.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>2 a&ntilde;os m&aacute;s
tarde un grupo de ladrones robaron de las mentes de las personas la idea
de mesa a propulsi&oacute;n y decidieron crear la mesa cuadr&uacute;peda
que fu&eacute; considerada desde el principio un fracaso debido a su peso
que la hacia incapaz de impactar en las cabezas de las ancianas ya que
estas ahora usaban zancos y escopetas cargadas de pan para alimentar a
las palomas.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>2 segundos m&aacute;s tarde
se decidi&oacute; patentar este &uacute;ltimo dise&ntilde;o como el correcto
ya que conten&iacute;a m&aacute;s madera que sus sucesores y por lo tanto
m&aacute;s le&ntilde;a.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Modo de empleo de las sillas.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Para usar una silla hace
falta seguir unos pasos muy sencillos a la par que importantes... Quien
sabe los tr&aacute;gicos sucesos que de un procedimiento incorrecto podr&iacute;an
desatarse.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Antes de usar una silla,
cerci&oacute;rese el lector de que tiene una silla cerca, y esto lo digo
porque usted no ser&iacute;a el primero en sentarse encima de una caja
de explosivos, un bid&oacute;n de &aacute;cido o un puercoesp&iacute;n.
Una vez est&eacute; seguro de que tiene una silla cerca compruebe el n&uacute;mero
de patas de su silla.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Las sillas de una pata son
m&aacute;s &aacute;giles y r&aacute;pidas para el "Juego de la silla loca"
(Una variante de el "Juego de la mesa loca"), pero suelen ser poco consistentes
para la tarea de sentarse y podr&iacute;an presentar cierta... &iquest;Incompetencia?.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Las sillas de dos patas son
a la vez de &aacute;giles y robustas, ideales para las ancianas mas fuertes
y r&aacute;pidas, pero si no se usan con el debido cuidado a la hora de
sentarse pueden producir somnolencia (Golpearse la cabeza con el suelo
puede producir somnolencia).</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Las sillas de 3 patas son
m&aacute;s lentas pero eficaces contra las ancianas m&aacute;s poderosas,
dependiendo de la colocaci&oacute;n de las mismas sobre la madera pueden
resultar muy peligrosas o por el contrario muy arriesgadas si se van a
usar como asiento, en caso de usarse como alimento no deber&iacute;a haber
m&aacute;s problema que el que en su cabeza se este sucediendo ya que intentar
comerse una silla de 3 patas dennota cierta estupidez.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Las sillas de 4 patas son
ideales para depositarse encima de ellas, aunque tambien pueden ser usados
en bombardeos masivos contra las casas de las ancianas que al salir despavoridas
de sus hogares podran ser atacadas de nuevo con las r&aacute;pidas sillas
F-18 (Modelo sin patas).</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Una vez comprobado el n&uacute;mero
de patas usted debe comprobar que el suelo en el que est&aacute; asentada
no es viscoso, arenoso, resbaladizo ni gaseoso por razones obvias (Podr&iacute;an
herir los sentimientos de las sillas).</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Cuando est&eacute; todo comprobado
puede proceder a la acci&oacute;n de depositar sobre el suelo el susodicho
objeto. Primero col&oacute;quese de espaldas justo delante y flexione lentamente
las rodillas, d&eacute;jese entonces caer hasta que note el contacto con
la silla, si todos los pasos han sido seguidos correctamente estar&aacute;
usted sentado, en caso de haber errado en alguna de las partes es m&aacute;s
que probable que se encuentre en el suelo, si no es as&iacute;, ENHORABUENA,
&iexcl;&iexcl;&iexcl;&iexcl;Est&aacute; usted sentado!!!!.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Por supuesto es obvio decir
que ser&iacute;a recomendable antes de dejarse caer comprobar que la silla
se encuentra sobre las coordenadas correctas teniendo en cuenta el eje
X, Y y Z.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Para levantarse siga los
mismos pasos en sentido inverso. Si no consigue levantarse l&aacute;ncese
contra el suelo intentando parar el peso del cuerpo con los dientes o llame
a nuestro servicio de atenci&oacute;n personal al cliente.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Modo de empleo de las mesas.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Para usar una mesa de lo
primero que ha de cerciorarse es de del n&uacute;mero de patas que esta
contiene. Para ello rem&iacute;tase a nuestro anterior apartado en el cual
se explica las caracter&iacute;sticas de cada silla teniendo en cuenta
el n&uacute;mero de patas ya que las caracter&iacute;sticas entre mesas
y sillas son similares.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Tan solo debe tenerse en
cuenta que en la actualidad existe un modelo de mesa con 8 patas que contiene
un acelerador de neutrones y un disparador de &aacute;cido acetilsalic&iacute;lico
que tienen como &uacute;nico objetivo solventar la perdida de velocidad
en escaramuzas contra ancianas.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Ha de tenerse en cuenta que
para batallas tipo G-47 es necesario el uso de modelos con m&aacute;s de
96 patas y 4 reactores.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Despu&eacute;s de la comprobaci&oacute;n
pertinente aseg&uacute;rese de que las patas de la mesa apuntan a la direcci&oacute;n
contraria a las agujas del reloj al marcar las 12, si por alguna raz&oacute;n
tuviera un reloj digital c&oacute;mprese uno de manecillas para la correcta
instalaci&oacute;n de la mesa.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>En caso de que tenga la hora
del reloj mal ajustada consulte con su farmace&uacute;tico. Si este no
sabe responderle compre 9 relojes m&aacute;s y halle la media para ajustar
de manera convincente el &aacute;ngulo que la mesa ha de formar con respecto
al techo.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Una vez la mesa haya sido
instalada puede proceder a sentarse encima y a colocar los objetos sobre
las sillas que a su vez deber&aacute;n estar colocadas sobre las mesas.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<center>
<p><font face="Arial,Helvetica"><font size=-1>FIN</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>------------------------------------------------------------------------------------------------------------------------</font></font></center>
<font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font color="#FF0000"><font size=-1>- Vaya...
Este manual era bastante bueno... Voy a ver que m&aacute;s encuentro...
&iquest;Manual paso a paso para llegar al monasterio de m&aacute;s all&aacute;
de las monta&ntilde;as? &iquest;Qu&eacute; clase de est&uacute;pido libro
es este? Voy a quemarlo, incinerarlo, pisotearlo, descuartizarlo y destruirlo
por si acaso lo necesitara m&aacute;s adelante... Bueno, venga, tengo que
llegar a ese monasterio como sea y sin ning&uacute;n tipo de distracci&oacute;n
que... que me... &iquest;Pero qu&eacute; es esto? &iexcl;&iexcl;&iexcl;PERO
SI ES EL CUENTO DE BLANCATINA!!!.</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<center>
<p><font face="Arial,Helvetica"><font size=-1>------------------------------------------------------------------------------------------------------------------------</font></font></center>
<font face="Arial,Helvetica"><font size=-1></font></font>
<div align=right>
<p><font face="Arial,Helvetica"><font color="#000099"><font size=+2><a href="mailto:ivanr@arrakis.es">Ivan
Ramirez</a></font></font></font>
<br><font face="Arial,Helvetica"><font color="#000099"><font size=+2><a href="mailto:alcachofo@arrakis.es">Ivan
Salmeron</a></font></font></font>
<br><font face="Arial,Helvetica"><font size=-1>y de web: <a href="http://www.ivansoft.net">www.ivansoft.net</a></font></font></div>

</body>
</html>
