<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.5 [es]C-CCK-MCD QXW0410a  (Win98; I) [Netscape]">
</head>
<body text="#FFFFFF" bgcolor="#000000">

<center><pre><img SRC="Redbevel.gif" height=15 width=400></pre></center>

<center><pre>&nbsp;<img SRC="irc.gif" height=100 width=300></pre></center>

<center><u><font face="Tahoma"><font color="#FF8040"><font size=+1>C&Oacute;MO
BLOQUEAR ORDENADORES A TRAV&Eacute;S DE LOS CHATS</font></font></font></u></center>

<p><font face="Tahoma"><font size=-1>Con lo que voy a explicar a continuaci&oacute;n
podr&eacute;is tener un chat bajo control, podr&eacute;is hacer lo que
querais con los usuarios que est&eacute;n conectados.</font></font>
<p><font face="Tahoma"><font size=-1>Podr&eacute;is bloquear los ordenadores
de los usuarios que est&eacute;n conectados en ese momento al chat (ya
sabes, bloquear el ordenador de ese capullo que siempre va molestando y
haciendo el imb&eacute;cil).</font></font>
<center>
<p><u><font face="Tahoma"><font color="#FF8040"><font size=+1>QU&Eacute;
ES LO QUE BLOQUEA EL ORDENADOR DEL USUARIO?</font></font></font></u></center>

<p><font face="Tahoma"><font size=-1>Lo que provoca este hecho es un sencill&iacute;simo
programa hecho en JAVASCRIPT (tan solo son un par de l&iacute;neas, pero
muy eficaces, ya sabes aquello de peque&ntilde;o pero mat&oacute;n).</font></font>
<p><font face="Tahoma"><font size=-1>El programa que bloquea el ordenador,
en realidad son dos, y cada uno produce (m&aacute;s o menos) lo mismo pero
de distinta manera, esto lo explico en el siguiente apartado.</font></font>
<center>
<p><u><font face="Tahoma"><font color="#FF8040"><font size=+1>EL PROGRAMA
QUE BLOQUEA EL ORDENADOR DEL USUARIO</font></font></font></u></center>

<p><font face="Tahoma"><font size=-1>Como ya he dicho antes hay dos progrmas
que son estos:</font></font>
<p><font face="Tahoma"><font size=-1>1) <font color="#0080FF">&lt;script
language=javascript> for(i=1; i&lt;2;){ alert("texto") }&lt;/script></font></font></font>
<p><font face="Tahoma"><font size=-1>2) <font color="#0080FF">&lt;script
language=javascript>a=1; for(i=1; i&lt;2;){a=a+1}&lt;/script></font></font></font>
<p><font face="Tahoma"><font size=-1>El n&uacute;mero dos lo que provoca
es un bucle que se repite a si mismo un n&uacute;mero de veces determinado
y que en tiempo se traduce en unos 30 &oacute; 45 segundos dependiendo
del procesador de la m&aacute;quina. Transcurrido este tiempo volver&aacute;
a salir otro mensaje esta vez del propio navegador y despues de este volver&aacute;
la normalidad. La ventaja de este programa es que mientras se est&aacute;
leyendo el bucle, el ordenador queda totalmente inoperativo y no se puede
hacer nada de nada. La desventaja es que en los futuros navegadores es
posible que no se produzca este bucle, las razones son t&eacute;cnicas
y no creo que valga la pena expicarlas adem&aacute;s del tiempo que nos
llevar&iacute;a. Y la otra desventaja es que dependiendo del sistema operativo
que se use se puede anular este bucle manualmente.</font></font>
<p><font face="Tahoma"><font size=-1>El n&uacute;mero uno lo que provoca
es un bucle que se repite a si mismo indefinidamente haciendo imposible
que se pueda salir de el, por lo que el ordenador del usuario leer&aacute;
una y otra vez este bucle y no podr&aacute; salir de &eacute;l. En el lugar
donde pone texto ser&aacute; el mensaje que le saldr&aacute; al usuario
una y otra vez. As&iacute; que sustituye el (texto) por el mensaje que
quieras. La ventaja de este programa es que el funcionamiento est&aacute;
casi garantizado ante la llegada de futuros navegadores m&aacute;s modernos,
y la desventaja (aunque yo no diria desventaja) es que el ordenador no
queda totalmente inoperativo, lo &uacute;nico que queda inoperativo es
el navegador o la ventana del navegador.</font></font>
<p><font face="Tahoma"><font size=-1>* <font color="#FF0000">NOTA:</font>
estos dos programas no funcionan en el 100% de los chats, dependiendo del
CGI que usen estos chats, para ver si funcionarian estos programas en el
chat que desees, escribe el s&iacute;mbolo "&lt;", si luego ves que no
ha salido o que ha salido otro caracter en su lugar quiere decir que estos
programas no funcionar&aacute;n en ese chat, entonces m&aacute;s vale que
no lo intentes, hazme caso y si te ocurre esto no lo intentes.</font></font>
<p><font face="Tahoma"><font size=-1>*<font color="#FF0000"> IMPORTANTE:</font>
cuando escribas estos programas en el chat y pulses el bot&oacute;n de
enviar, estos se ejecutar&aacute;n a todos los usuarios que est&eacute;n
conectados (excepto en los chats que se pueden mandar a una sola persona)
en cualquiera de los dos casos, estos programas tambi&eacute;n se ejecutar&aacute;n
en tu computadora, cosa que nos fastidiaria mucho porque tambi&eacute;n
se nos bloquearia a el ordenador a nosotros, entonces lo que se puede hacer
son muchas cosas, la m&aacute;s sencilla es, o bien mirar en el Trumpet
y vigilar a ver cuando nuestro mensaje es enviado por el m&oacute;dem (cosa
un poco complicada si no se tiene un poco de idea), o bien pulsar el bot&oacute;n
de "Enviar" propio del chat y esperar a que la pantalla se ponga en blanco
(esto significa que se ha borrado toda la pantalla para cargarla de nuevo
con los mensajes actualizados) entonces pulsar Stop. Tambi&eacute;n hay
otras t&eacute;cnicas mejores pero tambi&eacute;n m&aacute;s dif&iacute;iles
de hacer, y que no voy a explicar ahora.</font></font>
<p><font face="Tahoma"><font size=-1>Ya se que algunos de vosotros esto
&uacute;ltimo que acabo de explicar puede que no lo entendais, entonces
lo mejor que pod&eacute;is hacer es probarlo sin tener en cuanta lo que
he explicado en la nota de "IMPORTANTE", despu&eacute;s de hacerlo ya vereis
como lo entendereis.</font></font>
<p><font face="Tahoma"><font size=-1>Adi&oacute;s y hasta otra. Y si ten&eacute;is
dudas escribirme!</font></font>
<br>
<hr>
<p><font face="Tahoma"><font color="#FF0000"><font size=-1>Si haces alguna
variante m&aacute;s o tambi&eacute;n programas o has programado algo (lo
que sea) escr&iacute;beme, y aunque no hayas programado nada tambi&eacute;n,
me gusta todo este mundo de la programaci&oacute;n.</font></font></font>
<p><font face="Tahoma"><font size=+0>E-mail:</font><font size=-1> <a href="mailto:rbosch@readysoft.es">rbosch@readysoft.es</a></font></font>
</body>
</html>
