<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.5 [es]C-CCK-MCD QXW0410a  (Win95; I) [Netscape]">
   <title>Editorial</title>
<bgsound src="GATE.it" loop="1">
</head>
<body text="#000000" bgcolor="#000000" background="Estr.jpg">

<hr size="0"><img SRC="Ms-gamin.jpg" height=296 width=292 align=RIGHT><b><font face="Tahoma"><font color="#FFCC00"><font size=-1>Aqu&iacute;
estoy otra vez con el segundo numero de Binary Zone. Seguramente mucho
de vosotros pensabais que esto iva a ser una magazine como las dem&aacute;s,
que aparece un numero y despu&eacute;s nadie sabe mas de ellas. Pues lo
siento mucho, pero no va a ser as&iacute;. Aqu&iacute; voy a estar mas
y mas n&uacute;meros para hacer que sufr&aacute;is con esta revista ;)))En
este numero tenemos muchas nuevas secciones, gracias a las colaboraciones
de algunos lectores, y otras simplemente gracias a las recomendaciones
de las encuestas. He recibido muchas cartas, y eso es de agradecer, pero
necesito mas colaboraciones, as&iacute; que si no ten&eacute;is nada mejor
que hacer, escribirme, y si ten&eacute;is algo que hacer, dejarlo para
luego, que ya habr&aacute; tiempo.</font></font></font></b>
<br><b><font face="Tahoma"><font color="#FFCC00"><font size=-1>Los cambios
respecto al numero anterior se pueden apreciar a primera vista. Una interface
mejorada con Frames, un poco de java en la parte de arriba, y un poco de
m&uacute;sica XM, eso si, para escucharla ten&eacute;is que instalar el
Plugin que se encuentra en el directorio \Modp dentro del directorio datos.</font></font></font></b>
<br><b><font face="Tahoma"><font color="#FFCC00"><font size=-1>En cuanto
a las secciones, solamente desaparecen tres, Refranes, y el curso de creaci&oacute;n
de mapas con Qoole y programaci&oacute;n de Pascal. Pero tranquilos, estas
dos ultimas secciones las retomare el numero que viene y con raci&oacute;n
doble. Pero no solo desaparecen, tambi&eacute;n aparecen muchas mas. Por
ejemplo, ahora tenemos un curso de Autocad, una introducci&oacute;n al
Hacking, una curso r&aacute;pido de como bloquear ordenadores a trav&eacute;s
de un Chat, una secci&oacute;n donde analizo las ultimas publicaciones
electr&oacute;nicas aparecidas en los &uacute;ltimos meses, un foro que
tambi&eacute;n funciona como consulta, y algunas mas. Como veis, la calidad
a subido bastante comparado con el numero anterior, y espero que siga as&iacute;
gracias a vuestras colaboraciones. Bueno, despu&eacute;s de esta introducci&oacute;n
ya pod&eacute;is empezar a leer la revista.</font></font></font></b>
<center>
<p><b><font face="Tahoma"><font color="#FF0000"><font size=-1>Para contactar:</font></font></font></b>
<br><font face="Tahoma"><font color="#FFFFFF"><font size=-1>Binary Zone</font></font></font>
<br><font face="Tahoma"><font color="#FFFFFF"><font size=-1>Miguel Angel
Nieto</font></font></font>
<br><font face="Tahoma"><font color="#FFFFFF"><font size=-1>C\ Juan de
Aranoa N&ordm;5 3A</font></font></font>
<br><font face="Tahoma"><font color="#FFFFFF"><font size=-1>Amurrio (ALAVA)</font></font></font>
<br><font face="Tahoma"><font color="#FFFFFF"><font size=-1>01470</font></font></font><font face="Tahoma"><font color="#999999"><font size=-1></font></font></font>
<p><font face="Tahoma"><font color="#999999"><font size=-1>[Esta magazine
ha sido creada por Miguel Angel Nieto. The punisher `99]</font></font></font>
<p><b><font face="Tahoma"><font color="#3366FF"><font size=-1>&iexcl;Os
repito que la ortograf&iacute;a no es lo m&iacute;o! ;)</font></font></font></b>
<p><img SRC="fuego.jpg" height=70 width=420></center>

</body>
</html>
