<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.5 [es]C-CCK-MCD QXW0410a  (Win98; I) [Netscape]">
   <title>Windows 98</title>
</head>
<body text="#FFFFFF" bgcolor="#000000">

<center><img SRC="Redbevel.gif" height=15 width=400>
<br><img SRC="windows.jpg" height=100 width=300></center>

<p><font face="Tahoma"><font size=-1>Ya estamos otra vez en la secci&oacute;n
de opini&oacute;n dispuestos a repartir leches a diestro y siniestro, e
intentar imponer el orden en una sociedad inform&aacute;tica controlada
por un par de "empresas" que se aprovechan de el monopolio para vender
mas y mas productos de una calidad mas que dudosa. Bueno, despu&eacute;s
de esta introducci&oacute;n ya sabr&eacute;is de que vamos a hablar, pues
si ni&ntilde;os, de microsoft y de uno de sus hijos predilectos, el windows.</font></font>
<p><font face="Tahoma"><font size=-1>&iquest;Quien no querr&iacute;a volver
a los tiempos de el amstrad y de ese tipo de ordenadores? Pulsabas un bot&oacute;n
y ya estaba listo para funcionar, y con sus 128 tenias memoria para dar
y tomar. Pues dejar de so&ntilde;ar y volver a nuestra &eacute;poca. Ahora
para escribir una carta necesitas un windows, ocho megas de ram como m&iacute;nimo,
y un poco de paciencia mientras se cargan todas las opciones y men&uacute;s
posibles. &iquest;Y quien tiene la culpa? Nuestro amigo, el windows 98.</font></font>
<p><font face="Tahoma"><font size=-1>Como habr&eacute;is visto en la publicidad
de este nefasto programa decian... "gracias a esta actualizaci&oacute;n
el software funcionara mucho mas r&aacute;pido, ser&aacute; mucho mas seguro
y fiable, una interface mas agradable..." En resumidas cuantas, las mismas
historias que el 95. Quien tenga el Windows 98, se habr&aacute; dado cuanta
que esto es pura mentira como ocurri&oacute; con la versi&oacute;n anterior.
Yo, por ejemplo, cuando instale el 98 todo era muy bonito. Cuando un d&iacute;a
puse un juego para pasar el tiempo, vi como el juego iva a saltitos, no...
mejor aun, a pantallazos. Y el mismo juego que con la versi&oacute;n del
95 me iva normal, ahora con el 98 no se puede ni jugar. Y eso no ocurre
solo con ese juego, sino con mas de la mitad. Cuando reinicie en modo Ms-Dos
para echarme una partida al Theme Park para ver si los pantallazos tambi&eacute;n
ocurr&iacute;an en el dos, menuda sorpresa. Seg&uacute;n el programa no
tengo tarjeta de sonido &iquest;---?. Y esto no ocurre solo con los juegos.
Cuando ejecuto el 3D Max, lo mejor es tumbarse en la cama y esperar, y
esperar, y esperar...</font></font>
<p><font face="Tahoma"><font size=-1>Ahora el ordenador tarda mas en cargar
el nuevo engendro de Billy Verjas, aunque los de microsoft repitan una
y otra vez repiten que el ordenador despu&eacute;s de la actualizaci&oacute;n
se carga antes. Quiz&aacute;s quieran decir que se lo carga antes, porque
de estos no te puedes fiar.</font></font>
<p><font face="Tahoma"><font size=-1>Bueno, est&aacute;is avisados. Lo
&uacute;nico que pod&eacute;is hacer de momento es esperar al Freedows
(que va para largo) o sino probar con el Linux (os lo recomiendo). Y ahora
os dejo, que ten&eacute;is que formatear el disco duro para cambiar de
S.O. ;)</font></font>
<br>&nbsp;
<div align=right><b><u><font face="Tahoma"><font color="#FF0000"><font size=-1>The
Punisher `99</font></font></font></u></b></div>
&nbsp;
</body>
</html>
