<HTML>
<HEAD>
<TITLE>.pt zine - Correio</TITLE>
</HEAD>
<BODY BGCOLOR="Black" TEXT="#000000" LINK="Green" VLINK="Red">
<IMG SRC="pt_small.gif" WIDTH=452 HEIGHT=81 BORDER=0>
<P>
<FONT SIZE="5" FACE="Arial" COLOR="#FFC639">
<B>Correio:</B><BR>
-------------
</FONT>
<P>
<FONT SIZE="3" FACE="Arial" COLOR="#FFC639">
by secretos
<P>
Recebemos bastantes mail's a felicitar-nos pelo n&uacute;mero 0 da .pt zine e a perguntar o que poderiam fazer para ajudar a constru&ccedil;&atilde;o do n&uacute;mero 1.<BR>
Muito simples! Podem fazer o que quiserem!!<P>
Aqui ficam algumas ideias:
<DD> - escrever uma artigo sobre hacking, redes, programa&ccedil;&atilde;o, etc...
<DD> - mandar noticias sobre a "hacking scene";
<DD> - traduzir textos sobre hacking, redes, programa&ccedil;&atilde;o, etc...
<DD> - enviar uns exploit's novos;
<DD> - explicar um determinado programa;
<DD> - explicar um determinado bug; 
<DD> - responder &agrave;s perguntas levantadas nesta sec&ccedil;&atilde;o pelos leitores; 
<DD> - enviar cr&iacute;ticas e opini&otilde;es; 
<DD> - etc...

<P>
<CENTER>
<HR>
</CENTER>
<P>
<B>Date</B>: Mon, 29 Sep 1997 17:43:23 +0100<BR>
<B>From</B>: X_eeu@hotmail.com<BR>
<B>To</B>: &lt;secretos@hotmail.com&gt;<BR>
<B>Subject</B>: parabens pela vossa ptzine mas tenho algumas duvidas<P>


Antes de dizer qualquer coisa gostava de dizer que todos 
voces (tu, o Elektro e os membros da Kaotic Team) estao de
parabens. A vossa zine &eacute;, sem d&uacute;vida nehuma, um passo, ou melhor, um salto
em frente no hacking portugues (nao que eu seja um grande entendedor no que
diz respeito a hacking, muito pelo contrario: sou um completo ignorante -
quer em termos relativos quer em termos absolutos). Acho que foi precisa
muita coragem para fazerem a .pt zine.
<P>
Eu descobri a vossa zine ao "vasculhar" num CD de um amigo
meu, por isso n&atilde;o sei como ela foi distribuida: se na Internet, se em BB's,
se por outro meio qualquer. Penso que dever&aacute; ter sido pela Internet. Se o
foi, onde a poderei encontrar?
<P>
Ao ler a vossa zine apareceram-me muitas questoes que me apeteceu,
imediatamente, colocar-lhes mas, devido ao seu caracter bastante b&aacute;sico
(penso eu) imediatamente censurei por pensar que seria chamado de estupido
e outras coisas piores. Agora, pensando melhor, acho que (como hackers que
julgo serem, por acharem que toda a informa&ccedil;&atilde;o devia ser livre (incluindo o
conhecimento) e, &eacute; claro, por se terem estado na mesma situacao em que eu
estou: completos ignorantes nesta area) nao se importariam de me responder
a algumas questoes que acho  necessarias para eu conseguir compreender a
vossa zine e evoluir.
<P>
As questoes que eu tenho sao mais ao nivel de termos do que de outras
coisas quaisquer. Assim sendo aqui vai uma pequena lista de termos que eu
vos agradecia que me esclarecessem. Se quiserem (como e obvio!!).
Na seccao PHF WEB HACKING:<BR>
1-phf; 2-wordlist; 
<P>
Na seccao Cavalos de Troia<BR>
3-fazer um kill a shell;
<P>
Na seccao getpwent<BR>
4-inverter o algoritmo de encripta&ccedil;&atilde;o-(ser&aacute; executar a operacao de
encripacao no sentido inverso?Nao pode ser!); 5-DES;6-um very short;
<P>
Na seccao exploits<BR>
7-exploit;
<P>
Ja agora gostava que me dessem a vossa opiniao sobre o Linux. E mesmo
excelente como se diz por ai? E um autentico quebra-cabecas a instalacao, a
configuracao e a utilizacao pelas primeiras vezes?
<P>
Obrigado<BR>
(tia) :-)
<P>
eeu
<P>
X_eeu@hotmail.com
<P>
---------------------------------------------
<P>
resposta por: secretos & Elektro<P>

Obrigado pelo apoio. Todo o feedback &eacute; sempre bem vindo.<BR>
A .pt zine pode ser encontrada em alguns sites portugueses sobre hacking, mas 
a  pagina "semi-oficial" encontra-se neste momento em  
<A HREF="http://www.complex-x.net/kaotik/ptzine/index.html">http://www.complex-x.net/kaotik/ptzine/index.html</A>
<P>
Em rela&ccedil;&atilde;o &agrave;s tuas quest&otilde;es:
<P>
<B>1-phf</B> - &eacute; um execut&aacute;vel usado no CGI-BIN de certas m&aacute;quinas. Este programa tem 
um hole, e &eacute; atrav&eacute;s dele que se consegue "sacar" o ficheiro das passwords 
desse server e at&eacute; correr programas no server.
<P>
<B>2-wordlist</B> -  wordlist, tal como o pr&oacute;prio nome indica e uma
"lista de palavras".<BR>
Em "giria" de cracking, wordlist &eacute; um ficheiro que contem uma lista
de palavras, que o cracker utilizar&aacute;, para tentar encontrar passwords.
<P>

<B>3-fazer um kill &agrave; shell</B>  - quando se referiu, fazer um kill a shell,
o objectivo, era "sair da area" que alojava o cavalo de 
troia (ct).<BR>
Como o processo pai do ct, era a shell, bastou descobrir o PID (Process ID)
respectivo, e fazer um kill (mandar um sinal ao sistema operativo, para 
acabar a respectiva tarefa).
<P>

<B>4-inverter o algoritmo de encripta&ccedil;&atilde;o</B> - 
Com processamento paralelo isso ser&aacute;, possivel! No entanto esse algoritmo &eacute;
chamado um "one way hash function", ou seja &eacute; computacionalmente f&aacute;cil
executa-lo num sentido, mas muito moroso, no sentido inverso, quase
inviabilizando qualquer tentativa com o poder de computacao mais
usual, para um simples utilizador.
<P>
<B>5-DES</B> -
Sigla de Data Encryption Standart, ou seja, &eacute; o algoritmo acima mencionado
que &eacute; utilizado pelo linux, para encriptar as passwords providas, 
pelo utilizador.
<P>
<B>6-um very short</B> - 
nota&ccedil;&atilde;o utilizada por alguns autores para representar um inteiro de 8 bits,
usualmente, conhecidos por "char".
<P>
7-exploit - &eacute; a forma de "entrar" dentro de uma maquina atrav&eacute;s de um buraco 
de seguran&ccedil;a ("hole") que exista no server. "Explorar", "Exploitar".<BR>
Um exploit &eacute; um pequeno programa que explora bugs do sistema, e podem 
ser utilizados, por exemplo para obter previl&eacute;gios de root!
<P>



  Em rela&ccedil;&atilde;o &agrave; nossa opini&atilde;o sobre o Linux, realmente o maximo que posso
  fazer e dizer sob o meu ponto de vista as vantagens e desvantagens que
  achamos que
o Linux possui acerca de diversos aspectos.<P>
  Como tu disseste no teu mail, algumas versoes do Linux podem ser um
  aut&ecirc;ntico quebra-cabecas em termos de configura&ccedil;&atilde;o e de utiliza&ccedil;&atilde;o nas
  primeiras
vezes...isto porque ao contr&aacute;rio, de outros sistemas operativos (SO) (ex:
Windows,OS/2, etc...) que possuem por exemplo programas de setup, que
facilitam a instala&ccedil;&atilde;o de aplica&ccedil;&otilde;es e drivers, estes escasseiam no Linux,
o que  
torna estas opera&ccedil;&otilde;es, mais demoradas e sujeitas a erros (chegando as vezes por
exemplo a ser necess&aacute;rio recompilar o kernel) visto que o n&iacute;vel de
conhecimentos por vezes necess&aacute;rios vao al&eacute;m da optica do utilizador.<P>
  Em termos de programa&ccedil;&atilde;o e desenvolvimento de aplica&ccedil;&otilde;es o Linux &eacute; um 
paraiso para programadores que acreditam no lema "Unix e Internet", que 
em tempos 
representavam a gratuitidade do software e transmiss&atilde;o de conhecimentos, pois
alem de o pr&oacute;prio Linux como o seu c&oacute;digo serem freeware, e poderem ser
alterados, muitas raras sao as aplica&ccedil;&otilde;es que ter&atilde;o de ser pagas para as
adquirir!
A um n&iacute;vel mais t&eacute;cnico, em termos de programa&ccedil;&atilde;o, o Linux tamb&eacute;m &eacute; uma
excelente plataforma para desenvolvimento de grandes aplic&ccedil;&otilde;es, como para
pequenos 
utlit&aacute;rios, pois possui excelentes libraries, relacionadas com seguran&ccedil;a e
suporte de rede (sendo isto tudo de borla, coisa que n&atilde;o acontece para outras
plataformas,...toda a gente sabe que e preciso dar o olho do c*, para comprar
um Borland 5.0!!!).<P>
  Uma outra vantagem do Linux &eacute; o facto de ser um puro SO 32 bits, que o torna numa 
  autentica "maquina de velocidade",...alem de ser a plataforma mais
utilizada, para a computa&ccedil;&atilde;o matem&aacute;tica, em termos de investiga&ccedil;&atilde;o cientifica e
universit&aacute;ria.<P>
  O facto de ter sido talvez um dos primeiros, sen&atilde;o o primeiro SO multi-user, tambem ajudou a sua popularidade.
  Resumindo eis alguns aspectos que tornaram o Linux o SO preferencial de
muitos:<BR>
<DD>  - Por ser mais dificil de configurar, faz algumas pessoas sentirem-se mais
  "hackers"!
<DD>  - Possuem suporte de rede.
<DD>  - &Eacute; um puro 32 bits.
<DD>  - &Eacute; multi-utilizador.
<DD>  - &Eacute; de borla.
<DD>  - &Eacute; mais personalizavel (que um pouco relativo se &eacute; uma vantagem ou uma desvantagem em termos de seguranca!).
<DD>  - etc...
<P>
  Na minha opini&atilde;o o Linux &eacute; um sistema seguro se for bem utilizado, caso
contr&aacute;rio &eacute; um aut&ecirc;ntico "buraco", pois &eacute; totalmente personalizavel, e
permite in&uacute;meros modos de configura&ccedil;&atilde;o, o que pode criar situa&ccedil;&otilde;es de
ignorar certos aspectos...situa&ccedil;&atilde;o que n&atilde;o acontece noutros sistemas
cujas configura&ccedil;&otilde;es s&atilde;o standart (ex: Windows NT).
  Pode-se ent&atilde;o concluir que o Linux, apenas e maravilhoso se for bem utili-
zado,...caso contr&aacute;rio &eacute; uma grande dor de cabe&ccedil;a!!!




</FONT>
</BODY>
</HTML>


