<HTML>
<HEAD>
<TITLE>.pt zine - Internet Daemons</TITLE>
</HEAD>
<BODY BGCOLOR="Black" TEXT="#000000" LINK="Green" VLINK="Red">
<IMG SRC="pt_small.gif" WIDTH=452 HEIGHT=81 BORDER=0>
<P>
<FONT SIZE="5" FACE="Arial" COLOR="#FFC639">
<B>Internet Daemons:</B><BR>
---------------------------
</FONT>
<BR>
<FONT SIZE="3" FACE="Arial" COLOR="#FFC639">
Documento traduzido e adaptado por DrSkull<BR>
Fonte: Internet Daemons<BR>
por Voyager[TNO] <P>

Os computadores da Internet comunicam uns com os outros usando o TCP 
(Transmission Control Protocol) ou UDP  (User Datagram Protocol) no topo do IP
(Internet Protocol). Outros protocolos s&atilde;o usados no topo do IP, mas TCP e UDP 
s&atilde;o aqueles que nos interessam. Num Sistema Unix, o ficheiro /etc/protocols 
mostra os protocolos dispon&iacute;veis numa m&aacute;quina.
<P>
Na Session Layer (modelo OSI) ou na Internet Layer (DOD Protocol Model) os 
dados s&atilde;o transferidos atrav&eacute;s dos hosts usando as ports.
Cada comunica&ccedil;&atilde;o de dados ter&aacute; o n&uacute;mero da port de origem e o n&uacute;mero da port de 
destino. Os n&uacute;meros das ports podem ser divididos em dois tipos, as j&aacute; ports 
conhecidas e as ports atribu&iacute;das dinamicamente. Em Unix as ports conhecidos 
est&atilde;o definidas no ficheiro /etc/services.<BR>
As ports din&acirc;micas s&atilde;o atribu&iacute;dos por necessidade do sistema.
<P>
Unix tem a capacidade de ligar programas designados por daemons &agrave;s ports 
conhecidas. O computador remoto ir&aacute;  ligar-se &agrave;s ports conhecidos do outro 
computador, que ser&aacute; ligado ao programa daemon.
<P>



Os programas Daemon come&ccedil;am tradicionalmente por inetf (The Internet Daemon) 
para serem executados definem-se em inetd ficheiro de configura&ccedil;&atilde;o, 
/etc/inetd.conf.
<P>
A maioria destes Daemons s&atilde;o executados por utilizadores privilegiados, como 
root. Muitos deste programas tem a vulnerabilidade na qual pode-se ganhar 
acesso ao computador remoto.
<P>
Os daemons que nos interessam s&atilde;o:


<TABLE WIDTH="80%" BORDER="1">
<TR ALIGN="CENTER">
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639"><B>Servi&ccedil;o</B></FONT></TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639"><B>N&uacute;mero da Port</B></FONT></TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639"><B>Descri&ccedil;&atilde;o</B></FONT></TD>
</TR>
<TR ALIGN="CENTER">
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">ftp</FONT></TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">21</FONT></TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">File Transfer [Control]</FONT></TD>
</TR>
<TR ALIGN="CENTER">
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">smtp</FONT></TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">25</FONT></TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">Simple Mail Transfer Protocol</FONT></TD>
</TR>
<TR ALIGN="CENTER">
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">tftp</FONT></TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">69</FONT></TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">Trivial File Transfer Protocol</FONT></TD>
</TR>
<TR ALIGN="CENTER">
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">finger</FONT></TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">79</FONT></TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">Finger</FONT></TD>
</TR>
<TR ALIGN="CENTER">
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">www-http</FONT></TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">80</FONT></TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">World Wide Web HTTP</FONT></TD>
</TR>
<TR ALIGN="CENTER">
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">sunrpc</FONT></TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">111</FONT></TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">SUN Remote Procedure Call</FONT></TD>
</TR>
<TR ALIGN="CENTER">
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">fln-spx</FONT></TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">221</FONT></TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">Berkeley rlogind with SPX auth</FONT></TD>
</TR>
<TR ALIGN="CENTER">
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">rsh-spx</FONT></TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">222</FONT></TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">Berkeley rshd with SPX auth</FONT></TD>
</TR>
<TR ALIGN="CENTER">
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">netinfo</FONT></TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">716-719</FONT></TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">NetInfo</FONT></TD>
</TR>
<TR ALIGN="CENTER">
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">ibm-res</FONT></TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">1405</FONT></TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">IBM Remote Execution Starter</FONT></TD>
</TR>
<TR ALIGN="CENTER">
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">nfs</FONT></TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">2049</FONT></TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">Network File System</FONT></TD>
</TR>
<TR ALIGN="CENTER">
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">x11</FONT></TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">6000-6063</FONT></TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">X Window System</FONT></TD>
</TR>
<TR ALIGN="CENTER">
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">rcp/rshd</FONT></TD>
	<TD>&nbsp;</TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">Remote Copy/Remote Shell Daemon</FONT></TD>
</TR>
<TR ALIGN="CENTER">
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">nis</FONT></TD>
	<TD>&nbsp;</TD>
	<TD><FONT SIZE="3" FACE="Arial" COLOR="#FFC639">Network Information Services</FONT></TD>
</TR>
</TABLE>
<P>
A pr&oacute;xima parte deste artigo ir&aacute; focar daemons espec&iacute;ficos e as suas 
vulnerabilidades. 
Numa breve explica&ccedil;&atilde;o, as vulnerabilidades ser&atilde;o aqui abordadas. Para mais 
desenvolvimentos que est&atilde;o para al&eacute;m deste artigo, mais pesquisa dever&aacute; ser 
feita por parte do leitor.
<P>

<B>Ftp 21 File Tranfer Protocol</B>
<P>

FTP &eacute; um protocolo de transfer&ecirc;ncia de ficheiros. Os pedidos de FTP s&atilde;o 
respondidos por um daemon de ftp, ftpd. As vers&otilde;es abaixo do 2.2 "wuarchive's" 
 tem uma vulnerabilidade na qual se pode executar qualquer bin&aacute;rio, e pode-se 
ver com o comando 'site exec' fazendo-o correr relativamente do caminho com 
"../" no come&ccedil;o. Aqui fica um exemplo:
<P>
Entrando num sistema via ftp: 
<PRE>
        220 uswest.com FTP server (Version wu-2.1(1) ready.
        Name (uswest.com:waltman): waltman
        331 Password required for waltman.
        Password: jim
        230 User waltman logged in.
        Remote system type is UNIX.
        Using binary mode to transfer files.
        ftp> quote "site exec cp /bin/sh /tmp/.tno"
        200-cp /bin/sh /tmp/tno
        ftp> quote "site exec chmod 6755 /tmp/.tno"
        200-chmod 6755 /tmp/tno
        ftp> quit
        221 Goodbye.

</PRE>
<B>smtp 25 Simple Mail Transfer Protocol </B>
<P>
Ataques ao correio s&atilde;o uns dos m&eacute;todos mais antigos de atacar internet hosts.
O daemon, mais comum e menos seguro, &eacute; sendmail. Outros Daemons de correio 
incluem smail, MMDF, e IDA sendmail. Sendmail tem muitas vulnerabilidades para 
serem aqui todas listadas. Existe um FAQ escrita especialmente sobre as 
vulnerabilidades de sendmail mas n&atilde;o ser&aacute; muito abordado aqui.
<P>
Uma vulnerabilidade conhecida, mas &uacute;til apenas para efeitos hist&oacute;ricos &eacute; 
"Wizard Modo" Em modo Wizard  pode-se pedir uma shell pela port 25 ( SMP port). 
Nenhum dos sistemas modernos ser&aacute; vulner&aacute;vel a este ataque. Para explorar esta 
vulnerabilidade, ter&aacute;-se de fazer telnet para a port 25, escrever WIZ para 
entrar no modo Wizard e digitar a password. O problema relatado &eacute; a maneira de 
como as passwords encriptadas s&atilde;o armazenadas. Havia um erro (bug) que fazia 
com que o sistema pensa-se que nenhuma password seria melhor do que a passaword 
real.
<P>
Citando Steven Bellovin:
<BR>
A inten&ccedil;&atilde;o do comportamento do modo wizard era de que se fosse fornecida a 
password correcta, alguns comandos n&atilde;o standard SMTP fossem autorizados de 
forma a fornecerem uma shell. A password reutilizada -- de uma maneira 
encriptada e armazenada no ficheiro de sendmail  /etc/passwd. 
<P>
Em ordem de poupar o trabalho de ler e analisando de cada vez o ficheiro de 
configura&ccedil;&atilde;o, sendmail tem o que se chama de "ficheiro de configura&ccedil;&atilde;o 
congelado" "frozen configuration file". O conceito &eacute; bom mas a sua implenta&ccedil;&atilde;o 
n&atilde;o o &eacute;. Para congelar o ficheiro de configura&ccedil;&atilde;o, o sendmail apenas escreve 
no disco toda a &aacute;rea da mem&oacute;ria din&acirc;mica (usada por malloc) e pela &aacute;rea 
'bss' -- a &aacute;rea que n&atilde;o ocupou espa&ccedil;o no ficheiro execut&aacute;vel, mas foi 
inicializado para todos os zeros pelo UNIX kernel quando o programa foi 
executado. A &aacute;rea bss mant&eacute;m todas as vari&aacute;veis que n&atilde;o s&atilde;o dadas 
explicitamente pelp c&oacute;digo C. Naturalmente quando"entregamos" o mail, o 
sendmail apenas l&ecirc; isso em duas leituras gigantes. Foi ent&atilde;o necess&aacute;rio 
armazenar toda informa&ccedil;&atilde;o do ficheiro de configura&ccedil;&atilde;o nas &aacute;reas bss ou 
malloc, que exigem um pouco de cuidado na codifica&ccedil;&atilde;o.
<P>
A password do  modo wizard foi armazenada na mem&oacute;ria "malloc", para que fosse 
propriamente congelada. Mas o ponto explicito foi acertado para NULL na source. 
<P>
<DD>         char    +wiz=NULL
<P>
Significa que estava na &aacute;rea inicializada de informa&ccedil;&atilde;o, *n&atilde;o* a bss. E estava 
ali *n&atilde;o* gravado com a configura&ccedil;&atilde;o congelada. Ent&atilde;o -- quando o ficheiro de 
configura&ccedil;&atilde;o &eacute; parcialmente congelado, a password &eacute; lida, e escrita. A pr&oacute;xima 
vez que o sendmail for executado, pelo ponto ser&aacute; feito um reset para NULL. 
(Claro que a password est&aacute; presente, mas n&atilde;o h&aacute; maneira de a encontrar.) O 
c&oacute;digo acredita estupidamente no conceito de n&atilde;o haver password para a porta 
das traseira.
<P>

<B>Tftp 69 (Trivial File Transfer Protocol)</B>
<P>
tftp &eacute; Protocolo Trivial De Transferencia de Ficheiros. Tftp &eacute; usado para 
tentar gravar os ficheiros das passwords num sistema remoto. Os ataques de 
tftp s&atilde;o t&atilde;o simples e repetitivos que os scripts s&atilde;o escritos para que o 
processo de atacar dom&iacute;nios inteiros seja autom&aacute;tico. 
<P>

<B>finger 79 Finger</B>
<P>
O comando finger mostra a informa&ccedil;&atilde;o acerca de outro utilizador, como o nome do 
login, o nome completo, o nome do terminal, idle time, o tempo do login e a 
localiza&ccedil;&atilde;o se for conhecida. Os pedidos do finger s&atilde;o respondidos por um 
finger daemon.
<P>
Robert Tappan Morris Internet Worm usou o finger daemon. O finger daemon 
suportava mais de 512 bytes da m&aacute;quina remota como parte do pedido de finger. 
No entanto, sofria de um erro (bug) de sobrecarga causada pela falta de uma 
pr&oacute;pria verifica&ccedil;&atilde;o.<BR>
Tudo acima de 512 era interpretado pela m&aacute;quina como uma instru&ccedil;&atilde;o executar 
localmente, fossem quais fossem os privil&eacute;gios que o finger daemon tivesse.
<P>

<B>www-http 80 World Wide Web HTTP</B>
<P>
HTML ((HyperText Markup Language) permite que o utilizador da p&aacute;gina executar 
programas no sistema remoto. Se o Criador da p&aacute;gina deixar o utilizador inserir 
argumentos aos comandos, o sistema &eacute; vulner&aacute;vel aos problemas usuais associados 
com o sistema. Em adi&ccedil;&atilde;o existe uma vulnerabilidade que em alguma 
circunstancias dar&aacute; um X Term usando o UID em que o server est&aacute; a correr o WWW.
<P>

<B>sunrpc 111 SUN Remote Procedure Call</B>
<P>
Sun RPC  (Remote Procedure Call) permite que os utilizadores em computadores 
remotos executem comandos. RPC sofreu da falta de verifica&ccedil;&atilde;o de seguran&ccedil;a. 
Para explorar as vulnerabilidades do RPC, dever&aacute; ter um programa chamado "ont" 
que n&atilde;o &eacute; muito dif&iacute;cil de encontrar.
<P>
<B>login 513 Remote login</B>
<P>
Algumas vers&otilde;es do AIX e Linux sofrem de um bug de forma que o rlogind l&ecirc; os 
argumentos. Para explicar esta vulnerabilidade executa-se o seguinte comando de 
um sistema remoto:
<P>
<DD>            rlogin host -l -froot
<P>
Host &eacute; o nome do computador alvo e o username &eacute; aquele que se usa para fazer o 
rlogin (costuma ser root). Se este erro (bug) existe nos sistemas remotos, 
entrara nele sem ser pedida a password
<p>

<B>rsh-spx 222 Berkeley rshd with SPX auth</B>
<P>
Algumas vers&otilde;es do Dynic e Irix tem um erro (bug) no rshd que permite executar 
comandos como root. Para explorar esta vulnerabilidade executa-se o seguinte 
comando no sistema remoto:
<p>
rsh host -l "" /bin/sh
<P>

<B>netinfo 716-719 NetInfo</B>
<P>
NeXT implantou um protocolo conhecido por NetInfo para que uma m&aacute;quina com NeXT 
possa perguntar informa&ccedil;&atilde;o a outra NeXT. Um server NetInfo por padr&atilde;o ir&aacute; 
permitir acesso livre as bases de dados do sistema. Isto pode ser corrigido 
pelo o Administrador do sistema. Uma das informa&ccedil;&otilde;es que o netinfo dar&aacute; &eacute; o 
ficheiro da password.
<P>

<B>ibm-res 1405 IBM Remote Execution Starter</B>
<P>
rexd (execu&ccedil;&atilde;o remota de um daemon) permite executar um programa numa m&aacute;quina 
que contenha Unix. As vers&otilde;es do sitema AIX, NeXT e HPUX que tenham o rexd 
sofrem de uma vulnerabilidade que permite uma execu&ccedil;&atilde;o remota. O daemon rexd 
verifica o uid da m&aacute;quina de que se conecta, para isso t&ecirc;m de ser root na 
m&aacute;quina de que se faz o ataque do rexd. Para determinar a m&aacute;quina alvo est&aacute; a 
correr o rexd, usa-se o comando 'rcp -p '. T&ecirc;m de se pesquisar um programa 
conhecido como 'on' que est&aacute; dispon&iacute;vel em h/p boards everyhere.
<P>

<B>nfs 2049 Network File System</B>
<P>
NFS, o sistema de rede de ficheiros da Sun Microsystem sofreu de m&uacute;ltiplas 
vulnerabilidades na seguran&ccedil;a. Em adi&ccedil;&atilde;o muitos administradores configuraram o 
NFS, incorrectamente permitindo o acesso remoto n&atilde;o intencionado.
<P>
Usando o comando 'showmount -e' pode-se ver quais os ficheiros que s&atilde;o 
exportados de uma m&aacute;quina. Muitos administradores permitem o ler o direct&oacute;rio 
/etc, permitindo copiar o ficheiro da password. Outros administradores permitem 
ao utilizador escrever direct&oacute;rios, permitindo a cria&ccedil;&atilde;o de ficheiros rhosts e 
ganhar acesso a uma m&aacute;quina via rlogin ou rsh.
<P>
Em rela&ccedil;&atilde;o a assuntos de configura&ccedil;&atilde;o, NFS &eacute; vulner&aacute;vel a ataques que usem uid 
mask bug, a mknod bug, e o ficheiro geral que trata do ataque. V&aacute;rias vers&otilde;es 
hackadas do comando mount foram escritas para explicar vulnerabilidades 
conhecidas.
<P>

<B>x11 6000-6063 X Window System</B>
<P>
X-Windows sofreu e sofre de v&aacute;rias vulnerabilidades. Uma delas permite ter 
acesso ao que os outros utilizadores est&atilde;o a ver, permite tamb&eacute;m ver o que 
teclam. Existe uma vulnerabilidade que permite ao atacante remoto correr 
qualquer programa que o utilizador root comece na sua xsesion de ficheiros. 
Ainda existe outra vulnerabilidade que permite ao utilizador local de criar 
entradas root no ficheiro /etc/passwd.
<P>
  <B>rcp</B>
<P>
O utilit&aacute;rio SunOS 4.0.x rcp pode ser usado por qualquer host de confian&ccedil;a que 
esteja em /etc/host.equiv ou /.rhosts. para usar este buraco tem-se de correr 
NFS(Sistema de ficheiros de rede) (Network File System) num sistema Unix ou 
PC/NFS num sistema DOS.
<P>

<B>NIS</B>
<P>
Sun's NIS (Servi&ccedil;o de Informa&ccedil;&atilde;o de Rede) tamb&eacute;m conhecido com yp 
(Yellow Pages) (P&aacute;ginas Amarelas) tem a vulnerabilidade em que se pode pedir 
um mapa NIS de outro dom&iacute;nio NIS se souber o dom&iacute;nio NIS do sistema alvo. N&atilde;o 
existe maneira de perguntar ao sistema remoto pelo seu dom&iacute;nio NIS, mas muitos 
dom&iacute;nios NIS s&atilde;o facilmente deduzidos. Os NIS mais populares fazem um registo.
<P>



<B>Outros ataques</B>
<P>
Em adi&ccedil;&atilde;o a estes ataques baseados em daemons, muitos outros m&eacute;todos podem ser 
usados para se ganhar acesso a um computador remoto. Estes incluem mas n&atilde;o s&atilde;o 
limitados em: contas, adivinha&ccedil;&atilde;o da password, sniffing, source routing, DNS 
routing attacks, tcp sequence prediction and uucp configuration exploits. 
<P>
Isto dar&aacute; uma ideia de como os ataques baseados em daemons funcionam. Isto n&atilde;o 
quer dizer que seja uma lista completa de vulnerabilidades em privilegiados 
daemons da internet. Para descobrir mais informa&ccedil;&atilde;o acerca de como os daemons 
operam, e como explorar as suas vulnerabilidades, recomenda-se a leitura da 
source code, man pages e RFC's.

</FONT>
</BODY>
</HTML>