<HTML>
<HEAD>
<TITLE>.pt zine - Disclamer</TITLE>
</HEAD>
<BODY BGCOLOR="Black" TEXT="#000000" LINK="Green" VLINK="Red">
<IMG SRC="pt_small.gif" WIDTH=452 HEIGHT=81 BORDER=0>
<P>
<FONT SIZE="5" FACE="Arial" COLOR="#FFC639">
<B>Disclamer:</B><BR>
---------------- 
</FONT>
<P>
<FONT SIZE="3" FACE="Arial" COLOR="#FFC639">
&Eacute; bom um gajo dizer sempre estas cenas:
A informa&ccedil;&atilde;o contida nesta zine pode ser considerada de ilegal, por isso, n&atilde;o 
nos responsabilizamos com o que fa&ccedil;as com ela! A responsabilidade &eacute; toda tua.
<P>
Todo o material contido aqui deve ser exclusivamente usada para fins 
educacionais, blablabla, blablabla....
<P>
Se utilizares a informa&ccedil;&atilde;o contida nesta zine para actividades ilegais ficas 
desde j&aacute; avisado que n&oacute;s n&atilde;o nos responsabilizamos pelo o que te possa 
acontecer. 
<P>
Pronto, resumindo o que a gente est&aacute; a tentar-te explicar &eacute; que se fizeres 
asneiras n&atilde;o ponhas as culpas em n&oacute;s... se a bofia te aparecer em casa, n&atilde;o 
digas que a culpa &eacute; nossa. 
<P>
Para os meninos que acham que ser um hacker &eacute; "bue fixe", "radical", aqui fica 
uns pequenos excertos retirados da p&aacute;gina oficial da <A HREF="http://www.policiajudiciaria.pt">Pol&iacute;cia Judici&aacute;ria</A>:
<P>
--8<----------------------------------------------------------------------------
<P>
<B>SNIFFING</B>
<BR>
O crime de intercep&ccedil;&atilde;o ilegitima pune com pena de pris&atilde;o at&eacute; tr&ecirc;s anos quem,
seja de que forma for, interceptar a transmiss&atilde;o de informa&ccedil;&atilde;o, mesmo que s&oacute; o
tente fazer sem ter alcan&ccedil;ado qualquer resultado. 
<P>

<B>HACKING</B>
<BR>
Termo geralmente empregue para se fazer refer&ecirc;ncia &agrave; intrus&atilde;o em sistemas
inform&aacute;ticos. 
<BR>
As actividades de hacking s&atilde;o, &agrave; face da Lei portuguesa, crime de acesso
ileg&iacute;timo, e por isso punido com pena de pris&atilde;o. 
<BR>
Cabem nesta puni&ccedil;&atilde;o a utiliza&ccedil;&atilde;o sem autoriza&ccedil;&atilde;o pr&eacute;via de default accounts e
de passwords que lhes n&atilde;o perten&ccedil;am. 
<P>

<B>PHREAKING</B>
<BR>
Para al&eacute;m de se aplicarem os mesmos princ&iacute;pios relativos &agrave;s actividades de
blueboxing, a utiliza&ccedil;&atilde;o de redes de comunica&ccedil;&otilde;es com base na manipula&ccedil;&atilde;o de
centrais telef&oacute;nicas acedidas sem autoriza&ccedil;&atilde;o para o efeito, constitui o crime de
acesso ileg&iacute;timo. 
<P>

<B>BLACKBOXING E BLUEBOXING</B>
<BR>
Todas as formas de perturba&ccedil;&atilde;o de telecomunica&ccedil;&otilde;es, quer por injec&ccedil;&atilde;o de
frequ&ecirc;ncias nas linhas telef&oacute;nicas quer por ligar a estas dispositivos electr&oacute;nicos
cujo efeito, de entre outros, sejam o impedimento total ou a diminui&ccedil;&atilde;o da
taxa&ccedil;&atilde;o devida &agrave; operadora de telecomunica&ccedil;&otilde;es, constitui o crime de
perturba&ccedil;&atilde;o de telecomunica&ccedil;&otilde;es, punido pelo artº 277 al&iacute;nea d) do C&oacute;digo
Penal entre 1 e 8 anos de pris&atilde;o se o valor &eacute; elevado. 
<P>

<B>NUI's e VUI's</B>
<BR>
A utiliza&ccedil;&atilde;o indevida dos chamados NUI's e VUI's para acesso a redes x.25,
constituem crime de acesso ileg&iacute;timo, punido pela Lei da Criminalidade
Inform&aacute;tica.

<P>
<B>CRACKING</B>
<BR>
A descompila&ccedil;&atilde;o de programas &eacute; prevista e punida pelo artº 7º do Decreto-Lei
nº 252/94 de 20 de Outubro (Protec&ccedil;&atilde;o Jur&iacute;dica dos Programas de
Computador) e pelo artº 9º da Lei da Criminalidade Inform&aacute;tica (Lei nº 109/91
de 17 de Agosto). Esta legisla&ccedil;&atilde;o abrange os programas residentes em mem&oacute;ria,
(TSR's), que permitem a utiliza&ccedil;&atilde;o de software utilit&aacute;rio e de jogos violando
assim os direitos de autor.
<P>

<B>CARDING</B>
<BR>
Todas as formas de manipula&ccedil;&atilde;o de dados ou de elementos de identifica&ccedil;&atilde;o quer
na face quer contidos em bandas magn&eacute;ticas de cart&otilde;es de cr&eacute;dito, de d&eacute;bito ou
de telecomunica&ccedil;&otilde;es, bem como a implanta&ccedil;&atilde;o de dados ou de elementos de
identifica&ccedil;&atilde;o noutros suportes t&eacute;cnicos, constituem um crime de falsifica&ccedil;&atilde;o,
punido com pena de pris&atilde;o at&eacute; 3 anos. 
<BR>
A utiliza&ccedil;&atilde;o em mail orders de elementos de identifica&ccedil;&atilde;o ou de dados
banc&aacute;rios de terceiros, constitui um crime de burla, punido com a pena de pris&atilde;o
at&eacute; 3 anos e &eacute; agravada se o montante em causa for elevado ou se mantiverem
essa conduta mais que uma vez. 
<P>
--8<----------------------------------------------------------------------------
<P>
Agora n&atilde;o digam que n&oacute;s n&atilde;o vos avisamos!!!!


</FONT>
</BODY>
</HTML>
