<HTML>
<HEAD>
<TITLE>.pt zine - Introdu&ccedil;&atilde;o</TITLE>
</HEAD>
<BODY BGCOLOR="Black" TEXT="#000000" LINK="Green" VLINK="Red">
<IMG SRC="pt_small.gif" WIDTH=452 HEIGHT=81 BORDER=0>
<P>
<FONT SIZE="5" FACE="Arial" COLOR="#FFC639">
<B>Introdu&ccedil;&atilde;o:</B><BR>
-----------------
</FONT>
<P>
<FONT SIZE="3" FACE="Arial" COLOR="#FFC639">
Yo.. este &eacute; o  n&uacute;mero 1!!! Muitos achavam que a zine n&atilde;o passaria do 0, mas 
isso n&atilde;o se verificou gra&ccedil;as &agrave; contribui&ccedil;&atilde;o de alguns hackers lusitanos.
<P>
O feedback de encorajamento excedeu as nossas expectativas, recebemos mails 
de toda a parte; de Portugal, Brasil e at&eacute; dos Estados Unidos!!!
<P>
Muita coisa se passou desde o n&uacute;mero 0. 3 meses e tal se passaram.. f&eacute;rias, 
bebedeiras, alguns bons hack's, grandes ressacas, novidades quanto-baste e 
muita mulher boa de bikini ;).
<P>
Mas tambem houve momentos menos felizes onde se destacou a entrevista do m0xx 
ao Expresso, onde na opini&atilde;o de muito pessoal, tratou-se de uma entrevista 
auto-centrista que expressa bem o estado degradante em que infelizmente se 
encontra o esp&iacute;rito hacking em Portugal. Sempre fomos considerados uns ladr&otilde;es, 
uns gatunos sem escr&uacute;pulos, e esta entrevista s&oacute; veio refor&ccedil;ar essa ideia nas 
pessoas que n&atilde;o sabem o verdadeiro significado da palavra hacker.
<BR>
Chamem-me puritano, irreal ou ut&oacute;pico, mas pr'a mim um hacker n&atilde;o &eacute; um tipo 
que gama 600 contos s&oacute; porque a quem os roubou tinha 3000 no banco. A ideia 
de que se fores um hacker arranjas um emprego muita bem pago e muita fixe &eacute; 
totalmente irreal! Portugal &eacute; um pa&iacute;s de brandos costumes, mas j&aacute; faltou menos 
para que o primeiro hacker portugu&ecirc;s (no verdadeiro sentido da palavra) seja 
preso e condenado s&oacute; porque entrou num server, &eacute; que eu chamo de "o justo 
pagar pelo pecador".
<P>
Espero que todos reflictam nisto e tentem acabar com as guerrilhas entre grupos;
acabar com merdas do tipo "este gajo &eacute; mesmo lhamer"; acabar com "vou 
phoder este cabr&atilde;o porque ele pensa que sabe tudo", etc..
<P>
Necessitamos d'um WAKE UP TALL, de um renascer. E para isso &eacute; necessario o 
apoio de toda a comunidade. N&atilde;o basta meia d&uacute;zia de bacanos dizerem que 
"fazem" e tal e coisa... &eacute; preciso a uni&atilde;o do people.  
<P>

Bem, j&aacute; chega de "political stuff" (NOT), falemos do numero 1 da 
vossa .pt zine:
<P>
Ap&oacute;s v&aacute;rias considera&ccedil;&otilde;es, opini&otilde;es, e afins, decidimos mudar algumas coisas 
na zine.<P> 
Uma das mudan&ccedil;as &eacute; a cria&ccedil;&atilde;o de uma estrutura editorial para identificar cada 
um dos respons&aacute;veis das sec&ccedil;&ccedil;&otilde;es da zine. Com isto esperamos que seja mais f&aacute;cil 
para as pessoas que querem escrever um artigo falar logo com as pessoas mais 
indicadas. 
<P>
Decidimos tambem apostar somente na vers&atilde;o HTML da zine, com links, ficheiros 
compactados e gif's, etc...
<P>
Este n&uacute;mero excedeu as minhas expectativas, conseguimos ter artigos um pouco sobre tudo. Pessoalmente acho q este n&uacute;mero est&aacute; MUITA BOM!! Mas como eu sou um dos editores... eheheheeh... n&atilde;o sou muito isento para estar a dizer isto :)
<P>
Como sempre, estamos abertos &agrave;s vossas cr&iacute;ticas, opini&otilde;es, perguntas, etc..
<P>
Esta zine &eacute; feita pr'a voc&ecirc;s, por isso ajudem-nos a torna-la melhor.
<P>

Waves ppl,
<P ALIGN="RIGHT">
								secretos
</P>
</FONT>
</BODY>
</HTML>