<HTML>
<HEAD>
<TITLE>.pt zine - O caso m0xx</TITLE>
</HEAD>
<BODY BGCOLOR="Black" TEXT="#000000" LINK="Green" VLINK="Red">
<IMG SRC="pt_small.gif" WIDTH=452 HEIGHT=81 BORDER=0>
<P>
<FONT SIZE="5" FACE="Arial" COLOR="#FFC639">
<B>O caso m0xx:</B><BR>
---------------------
</FONT>
<BR>
<FONT SIZE="3" FACE="Arial" COLOR="#FFC639">
compiled by secretos
<P>
<FONT COLOR="Silver"><B>27/09/97</B></FONT>
<UL><TT><B>IN: Expresso, XXI</B></TT><BR>
<B>As aventuras de um hacker portugu&ecirc;s. </B>
<P>
Excertos da vida de m0xx, o respons&aacute;vel do grupo Toxyn
e talvez o «hacker» portugu&ecirc;s mais famoso. S&atilde;o curtos
epis&oacute;dios para reflectirmos todos, do cibernauta comum
ao administrador de sistemas. Contados na primeira
pessoa.
<P>
Ser «hacker» &eacute; a
 maneira como vivo. «Hackar» a vida. &Eacute; a forma como
encaro a sociedade. Um «hacker» &eacute; um bocado de tudo.
Ser «hacker» &eacute; perceber como &eacute; que as coisas
funcionam. Tens de perceber como funciona a m&aacute;quina. O
«hardware». O processador. O sistema. &Eacute; como conhecer
uma pessoa. Descobrir os seus pontos fracos. Um abutre
dos pontos fracos dos sistemas de computadores, sim, mas
que cumpre uma fun&ccedil;&atilde;o, investiga a sua seguran&ccedil;a. H&aacute;
os que entram em m&aacute;quinas e se divertem a destruir,
claro.
<p>
Mas enquadro-me no grupo
dos que passam dias de volta de uma m&aacute;quina, de um
programa, e quando descobrem um «bug», um erro,
informam o meio atrav&eacute;s dos canais pr&oacute;prios, como
alguns «newsgroups» da Internet. E, se for caso, avisa
o respons&aacute;vel do sistema: «Descobri um 'bug' nesse
sistema, usei este programa e est&aacute; aqui a solu&ccedil;&atilde;o».
 &Eacute; isso a filosofia «hacker». </p>
<p>Nunca «hackei» os computadores da <a href="http://www.telepac.pt/">Telepac</a>. 
Tenho um colega que entrou neles h&aacute; uns anos,
quando ainda n&atilde;o estavam ligados &agrave; Internet. Depois,
passeou pelo sistema da Direc&ccedil;&atilde;o Geral das
Contribui&ccedil;&otilde;es e Impostos. Mas n&atilde;o fez nada: limitou-se
a entrar. A Telepac &eacute; o «provider» portugu&ecirc;s em que
nunca entrei. Elogio muito a atitude deles face &agrave;
seguran&ccedil;a. S&atilde;o bons. J&aacute; aconteceu detectarmos falhas,
irmos a correr testar aquilo e eles j&aacute; tinham remendado
o buraco. Atentos, viram ao mesmo tempo que n&oacute;s e
corrigiram. Agora, os outros, &eacute; mentira. <p>
<p>
Mas todos os sistemas operativos s&atilde;o
fal&iacute;veis. Nenhum &eacute; cem por cento seguro. H&aacute; sempre uma
falha algures. H&aacute; sempre um lado desprotegido. H&aacute;, sim,
uns melhores que outros. Uns demoram mais tempo, outros
abrem-se num instante. O Linux, por exemplo, &eacute; muito
bonito mas tem grandes falhas de seguran&ccedil;a. Tamb&eacute;m &eacute;
verdade que s&atilde;o todas f&aacute;ceis de resolver e est&atilde;o
documentadas. O problema &eacute; que os respons&aacute;veis nem
sempre t&ecirc;m tempo para olhar para a documenta&ccedil;&atilde;o. 
<p>Qual &eacute; o mais inseguro? O NT tem-se
        revelado muito engra&ccedil;ado. Quem o usa n&atilde;o faz a menor
        ideia de que por detr&aacute;s daquelas janelinhas t&atilde;o bonitas
        existe um aut&ecirc;ntico buraco de seguran&ccedil;a. Foi feito para
        pessoas que n&atilde;o percebem patavina de redes nem de
        seguran&ccedil;a... As janelinhas explicam tudo, «clique aqui
        para p&ocirc;r no ar o servidor de Web», e ningu&eacute;m imagina
        como aquilo &eacute; do outro lado das janelinhas: est&aacute;
        absurdamente aberto. Dentro do universo Unix, o Irix tem
        grandes falhas, como o Linux. Mas o pior de todos &eacute; sem
        d&uacute;vida o NT. Um aut&ecirc;ntico logro. N&atilde;o &eacute; por custar
        muito dinheiro que um sistema &eacute; seguro. Os Macintosh
        s&atilde;o os mais seguros, por incr&iacute;vel que pare&ccedil;a. Havia um
        concurso de uma empresa sueca que oferecia milhares de
        d&oacute;lares a quem entrasse pelo seu Web, e era totalmente
        segur&iacute;ssimo. Sem «firewall», sem nada: directo.
        Ningu&eacute;m no mundo conseguiu. 
<p>
Existem v&aacute;rios grupos de «hackers»
        em Portugal. Conhe&ccedil;o o meu grupo, o Toxyn, e os Pulhas.
        S&atilde;o dois grupos muito restritos e que se respeitam.
        Depois, h&aacute; v&aacute;rios que gravitam &agrave; nossa volta, tentando
        sempre obter informa&ccedil;&otilde;es. Tamb&eacute;m os respeito. Podem
        at&eacute; ser melhores, mas ainda n&atilde;o chegaram ao ponto de
        fazer alguma coisa com o que sabem. Obter resultados. Um
        «hacker» pode contribuir para muita coisa. Mas
        aten&ccedil;&atilde;o, isto &eacute; recente. Depois da nossa ac&ccedil;&atilde;o da
        Indon&eacute;sia surgiram dezenas de grupos constitu&iacute;dos por
        putos de 15 anos e que s&oacute; daqui por uns anos ser&atilde;o
        bons. O que n&oacute;s fizemos foi, sobretudo, despertar uma
        corrente adormecida. Incentiv&aacute;mos muita gente. H&aacute;
        muitos individualistas. C&aacute; h&aacute; bons «hackers». Talvez
        uns 20 competentes. Mas grupos respeitados, s&oacute; Toxyn e
        Pulhas. 
<p>
Encontramo-nos todos os dias
        virtualmente. Nos canais pr&oacute;prios de IRC ou de outras
        formas. E fazemos reuni&otilde;es f&iacute;sicas, mas muito privadas.
        Somos muito organizados. Convoquei uma para a semana que
        vem. Estamos a elaborar um projecto. Queremos fazer uma
        campanha de seguran&ccedil;a em Portugal. Tudo o que seja
        m&aacute;quina portuguesa vai ser «hackada» e os resultados
        tornados p&uacute;blicos. 
<p>
Sabes, o nosso grupo &eacute; o verdadeiro
        &iacute;dolo de muita malta nova. Recebemos centenas de
        «mails» de gente que sentiu orgulho em n&oacute;s. Por sermos
        portugueses e capazes de fazer alguma coisa de jeito.
        Marcar presen&ccedil;a numa causa. Porqu&ecirc; Timor? Porque somos
        portugueses. E h&aacute; uma responsabilidade. Aquele povo
        long&iacute;nquo que n&atilde;o tem nada a ver connosco, &eacute;
        completamente ex&oacute;tico, vai &agrave; missa, fala Portugu&ecirc;s e
        t&ecirc;m orgulho em exibir a bandeira portuguesa.Tivemos um
        bocado de sorte nos resultados. Mas o acto de «hackar»
        foi lindo, tecnicamente dif&iacute;cil, lindo. 
<p>
Agora temos projectos. E muita coisa
        para gerir: dezenas de mi&uacute;dos que pedem para pertencer
        ao grupo; solicita&ccedil;&otilde;es de grandes empresas, algumas
        internacionais, para fazermos a seguran&ccedil;a dos seus
        «sites» e redes; h&aacute; administradores de «sites» a
        mandarem-nos «mails» para que tentemos penetrar nos
        seus computadores e testar este ou aquele aspecto de
        seguran&ccedil;a. E temos uma s&eacute;rie de problemas com a nossa
        exposi&ccedil;&atilde;o. O grupo ficou um bocado exposto, o que &eacute;
        contra a nossa filosofia. 
<p>
Benef&iacute;cios? Sim. Eu arranjei um
        emprego por causa disto. Os meus patr&otilde;es sabem bem quem
        sou e o que fa&ccedil;o. E dentro do grupo alguns acabam por
        arranjar emprego. Mas enquanto organiza&ccedil;&atilde;o n&atilde;o
        ganh&aacute;mos um tost&atilde;o. Pod&iacute;amos ter pedido dinheiro pelas
        entrevistas na altura da Indon&eacute;sia, em que fomos muito
        solicitados. N&atilde;o quisemos ganhar dinheiro &agrave; custa da
        causa de Timor. Se fosse uma coisa s&oacute; nossa, talvez o
        tiv&eacute;ssemos feito. Mas n&atilde;o somos uma empresa, somos um
        grupo. 
        <p>Em Portugal j&aacute; «hackei» de tudo,
        desde grandes empresas at&eacute; universidades. Coimbra, por
        exemplo, Instituto Superior T&eacute;cnico, Universidade do
        Minho, Aveiro... S&oacute; somos detectados quando cometemos
        algum erro. Mas nunca ningu&eacute;m teve problemas, porque
        nunca realiz&aacute;mos os ataques atrav&eacute;s das nossas
        m&aacute;quinas. Atacamos a partir de uma m&aacute;quina nos EUA, ou
        na Su&eacute;cia, e nunca nos rastreiam. Entre aspas, &eacute; tudo
        falso: n&oacute;s controlamos tudo, e mesmo que cheguem a uma
        dessas m&aacute;quinas n&atilde;o nos apanham, mesmo que estejamos
        l&aacute;. No caso da Indon&eacute;sia, nunca apareceu uma
        refer&ecirc;ncia sequer a m&aacute;quinas portuguesas... 
<p>A minha forma&ccedil;&atilde;o sempre foi no ramo
        inform&aacute;tico. Estou a acabar engenharia inform&aacute;tica.
        Tive um Spectrum e logo a&iacute; j&aacute; pirateava jogos.
        Publicava uma lista com quase quatro mil, alguns nunca
        editados em Portugal. Recebia-os, duplicava-os e
        distribu&iacute;a mundialmente. N&atilde;o fazia mais nada. Depois,
        veio o primeiro XT. L&aacute; comecei com o DOS, que era uma
        porcaria aut&ecirc;ntica, aprendi Pascal, vieram as BBS, tive
        o primeiro «modem». Sei programa&ccedil;&atilde;o. Basic, Pascal,
        Cobol, mas C e Perl &eacute; que contam actualmente. 
        <p>Nunca entrei num banco. Mas j&aacute; usei um
        Visa alheio. Que fiz? Comprei um dom&iacute;nio e mandei vir
        uns discos r&iacute;gidos dos EUA. Para experimentar. Assim uns
        600 contos de fraude. Mas o titular do cart&atilde;o tinha
        contas &agrave; ordem de tr&ecirc;s mil contos... Portanto, n&atilde;o
        tive pena dele. E fi-lo apenas para experimentar. N&atilde;o
        tenho interesse nisso, n&atilde;o sou ladr&atilde;o. Fizemos coisas
        muito mais fraudulentas, como usar linhas da Telecom e da
        Marconi para o estrangeiro durante seis meses - as contas
        eram de largos milhares de contos. N&atilde;o fomos apanhados,
        um outro grupo foi. Mas esses j&aacute; est&atilde;o bem empregados.
        Sabes, se algu&eacute;m entrar numa grande empresa, os
        respons&aacute;veis preferem contact&aacute;-lo e tentar alici&aacute;-lo.
        «Voc&ecirc; entrou, tudo bem, quanto &eacute; que quer para
        trabalhar para n&oacute;s?» &Eacute; melhor do que passar a vergonha
        de admitir publicamente que os seus sistemas,
        supostamente t&atilde;o fi&aacute;veis, foram invadidos por um puto
        de 14 anos. Foi assim que arranjei emprego. 
        <p>Como se processa uma opera&ccedil;&atilde;o?
        Come&ccedil;amos por definir o alvo, o dom&iacute;nio. Um pa&iacute;s
        inteiro, no caso da Indon&eacute;sia. Primeiro obtemos os nomes
        de todas as m&aacute;quinas debaixo desse dom&iacute;nio. Metemo-nos
        em cada m&aacute;quina e analisamos os seus processos. &Eacute;
        prefer&iacute;vel ent&atilde;o escolher uma m&aacute;quina de Web.
        Analisamo-la porta por porta, para descobrir que programa
        corre e se j&aacute; existem programinhas para neles entrar -
        se n&atilde;o, tentamos faz&ecirc;-los n&oacute;s. Se n&atilde;o conseguirmos
        entrar na m&aacute;quina-alvo, tentamos as que lhe est&atilde;o
        ligadas, ou seja, exploramos todos os pontos fracos em
        volta dela. Pode estar muito bem protegida de ataques
        frontais, mas uma outra que lhe d&aacute; acesso poder&aacute; n&atilde;o
        estar - e atrav&eacute;s da segunda entramos na primeira.
        Apanha-se ent&atilde;o todo o tr&aacute;fego dessa m&aacute;quina - e &eacute;
        meio caminho andado. Saca-se a lista de «passwords», e
        pronto. Voltando ao exemplo, a m&aacute;quina da Indon&eacute;sia
        estava muito bem protegida. Tinha um &uacute;nico ponto fraco -
        foi o bastante. Acedemos &agrave; informa&ccedil;&atilde;o classificada,
        como a lista das embaixadas indon&eacute;sias no mundo inteiro.
        Mas isso n&atilde;o interessava. Apenas alter&aacute;mos o c&oacute;digo da
        p&aacute;gina de entrada - e, em vez da p&aacute;gina oficial do
        Minist&eacute;rio dos Estrangeiros indon&eacute;sio, via-se a nossa
        propaganda &agrave; causa de Timor. 
        <p>O caso dos computadores militares foi
        mais engra&ccedil;ado, porque tinham um bom «firewall». N&atilde;o
        passava nada, s&oacute; porta 80. Mas o servidor tinha um
        «bug», era uma vers&atilde;o um bocado antiga, conseguimos
        abrir uma «shell» em Assembler para dentro da porta
        80... Esta, supostamente, s&oacute; dava sa&iacute;da a Web e n&oacute;s
        entr&aacute;mos por ela adentro. E o respons&aacute;vel ficou
        at&oacute;nito porque n&atilde;o conseguiu descobrir «logs»
        (ficheiros de registo) em lado nenhum, nem sequer da
        porta 80. N&atilde;o havia nada. Desligaram a m&aacute;quina
        simplesmente. E segundo informa&ccedil;&otilde;es de l&aacute; (temos
        amigos «hackers» indon&eacute;sios), o respons&aacute;vel passou um
        p&eacute;ssimo bocado antes de ser despedido. A pena para
        aquilo era fuzilamento. Se foi o caso temos pena, porque
        n&atilde;o quer&iacute;amos prejudicar ningu&eacute;m. Basicamente &eacute; isto.
        
        <p>Em Portugal h&aacute; bons «hackers», mas
        «ciberchuis» ainda n&atilde;o. A Pol&iacute;cia Judici&aacute;ria tem um
        dom&iacute;nio na Web mas ainda n&atilde;o anda a&iacute; atr&aacute;s do
        pessoal. Preocupam-se com os que traficam «software» e
        n&oacute;s n&atilde;o o fazemos. J&aacute; o SIS &eacute; diferente. Manobra pela
        calada. N&atilde;o me espantaria nada saber que t&ecirc;m arquivos
        com dados sobre n&oacute;s. Alguns de n&oacute;s estaremos nos
        pr&oacute;ximos anos a trabalhar para eles, n&atilde;o duvido... Mais
        vale contratar um gajo que saiba. Mas a&iacute; est&aacute;: n&oacute;s
        n&atilde;o somos criminosos. Somos um grupo restrito. Fazemos
        coisas possivelmente ilegais - possivelmente. Por isso &eacute;
        que somos muito reservados. Problemas em dizer isto
        publicamente? Como os Visas ou a Indon&eacute;sia? N&atilde;o. N&atilde;o
        fiz nada ilegal. H&aacute; algum risco, mas aceito-o. A
        hist&oacute;ria do Visa &eacute; crime - sim, mas banc&aacute;rio. N&atilde;o
        inform&aacute;tico. Confesso porque fi-lo apenas para
        experimentar, n&atilde;o sigo esse caminho. E uma confiss&atilde;o
        p&uacute;blica em nome de m0xx n&atilde;o basta. Podia estar a
        dizer-te um chorrilho de mentiras. Podia estar aqui um
        gajo qualquer a dizer-te «p&aacute;, sou um grande 'hacker' e
        fiz isto» e ser mentira. Isto &eacute; muito confuso. 
        <p>Onde est&aacute; o crime? Na pedofilia,
        rapto, aliciamento em «talkers», marcar encontro e
        abusar sexualmente. Ou piratear «software» e ganhar
        dinheiro com isso. Entrar num sistema n&atilde;o &eacute; crime.
        Entrar e alterar dados tamb&eacute;m n&atilde;o o &eacute; por si s&oacute;:
        ser&aacute; quando as altera&ccedil;&otilde;es prejudicarem terceiros.
        Admito que haja «hackers» profissionais, que trabalham
        pagos por servi&ccedil;os secretos ou pa&iacute;ses inimigos. Esses
        s&atilde;o criminosos, claro. 
		<P>
<I>&lt;END&gt;</I><P>
<FONT SIZE="5" FACE="Arial" COLOR="#FFC639">
<P>
<CENTER>
------------------------------
</CENTER>
</FONT>
<P>
<FONT SIZE="4" FACE="Arial" COLOR="#FFC639">
I WANT TO BE A 31337 HACKER TOO!<BR>
-------------------------------------------------------
</FONT>
<P>
by FractalG
<P>
<CENTER>Ok ! Aqui vai a minha opiniao sobre o artigo do nosso mais famoso
hacker que so tem prestigiado a nossa "comunidade"! Have  fun guys!<BR>
Flames,comentarios,etc etc dirigam para <A HREF="mailto:m0xx@toxyn.org">m0xx</A>@<A HREF="http://www.toxyn.org" NAME="Toxyn Org">toxyn.org</A> ele
e que os merece nao eu!<BR>
Como nao pertenco a nenhum grupo (ou se calhar pertenco mas tb nao interessa a  ninguem) as opinioes sao
pessoais...Quem nao gostar azar o dele!<BR>
Sabem muito bem aonde me encontrar...<BR>
Seguem aqui os excertos do artigo publico no Expresso e os meus comentarios a esta historica entrevista do mais famoso hacker portugues!<br>
</center>
<br>
<br>
<font color="yellow">As aventuras de um hacker portugu&ecirc;s
</font><br><font color="yellow">Excertos da vida de m0xx, o respons&aacute;vel do
grupo Toxyn e talvez o «hacker» portugu&ecirc;s mais
famoso. S&atilde;o curtos epis&oacute;dios para reflectirmos
todos, do cibernauta comum ao administrador
de sistemas. Contados na primeira pessoa
</font><br>

--> Que lindo... parece a Diana ! Ve la se nao tens um acidente como ela e so os paparazzi nao vao andar atras de ti!
Ja que es tao famoso ! Realmente isto e muito lindo... Ja nao bastava os quantos artigos que foram publicados e tv 
como agora tens que vir armar ainda em mais Hollywood Star... <BR>
<BR>

<font color="yellow">
Mas enquadro-me no grupo dos que passam dias de volta de uma m&aacute;quina, de um programa, e quando descobrem um «bug», um erro, informam o meio atrav&eacute;s dos canais pr&oacute;prios, como alguns «newsgroups» da Internet. E, se for caso, avisa o respons&aacute;vel do sistema: «Descobri um 'bug' nesse sistema, usei este programa e est&aacute; aqui a solu&ccedil;&atilde;o». &Eacute; isso a filosofia «hacker».<BR>
</font>

--> Ha sim... Quantos bugs ja descobriste tu?  A Bugtraq ta sempre cheia de bugs descobertos por ti ! E claro que tu avisas o responsavel do sistema... E tao lindo dizer coisas destas... Para ficar bem no jornal...Se descobrisses um bug importante que te desse possibilidade de entrar  em quase todas as maquinas e claro que ias a correr avisar os administradores dos sistemas ! Que palhacada do caracas... Comeca bem a entrevista com um bocado de filosofia a la m0xx ! Continua assim que ainda ficas rico a vender livros de filosoofia !

<br>
<br>
<font color="yellow">
 A Telepac &eacute; o «provider» portugu&ecirc;s em que nunca entrei. Elogio muito a atitude deles face &agrave; seguran&ccedil;a. S&atilde;o bons. J&aacute; aconteceu detectarmos falhas, irmos a correr testar aquilo e eles j&aacute; tinham remendado o buraco. Atentos, viram ao mesmo tempo que n&oacute;s e corrigiram. Agora, os outros, &eacute; mentira.<BR>
</font>

--> A dar graxa a ver se consegues la um emprego? Nunca entraste la? Entao esse elite hacking? Qualquer pessoa que ande neste mundo dos computadores ligados em rede sabe muito bem que e possivel manter uma maquina ligada a Internet com razoavel seguranca! Razoavel porque nada e 100%  infalivel ! Basta apenas que  tenham cuidado e que sejam responsaveis a administrar as maquinas! Os outros? Que eu saiba a Esoterica  tem filtros contra os nukes e tudo... Coisa que a Telepac nao tem nem parece vir a ter... Portanto deixa-te de tretas...<BR>

<br>
<font color="yellow">
Mas todos os sistemas operativos s&atilde;o fal&iacute;veis. Nenhum &eacute; cem por cento seguro. H&aacute; sempre uma falha algures. H&aacute; sempre um lado desprotegido. H&aacute;, sim, uns melhores que outros. Uns demoram mais tempo, outros abrem-se num instante. O Linux, por exemplo, &eacute; muito bonito mas tem grandes falhas de seguran&ccedil;a. Tamb&eacute;m &eacute; verdade que s&atilde;o todas f&aacute;ceis de resolver e est&atilde;o documentadas. O problema &eacute; que os respons&aacute;veis nem sempre t&ecirc;m tempo para olhar para a documenta&ccedil;&atilde;o.<BR>
</font>

--> Sim nao sao 100% seguros...Agora que o Linux e todo aberto como pareces querer dizer.. ai isso nao.. Consegues manter um Linux bem seguro se tiveres cuidado com ele. O Linux e publico ! Portanto ta exposto a toda a gente... Como sabes o Linux e um OS de hackers como muitos o  definem...Agora nem tanto...Simplesmente e preciso ter cuidado com o que  ta la dentro !  E a mesma coisa com os Irix,HP-UX (olha este ate tem um bug of the week),AIX e por ai fora... Sao todos muito vulneraveis se o administrador nao zelar por eles! A culpa e deles ! Sao pagos para isso.. Se nao querem arriscam-se a que lhes entrem no computador !<br>
<br>
<br>

<font color="yellow">
Os Macintosh s&atilde;o os mais seguros, por incr&iacute;vel que pare&ccedil;a. Havia um concurso de uma empresa sueca que oferecia milhares de d&oacute;lares a quem entrasse pelo seu Web, e era totalmente segur&iacute;ssimo. Sem «firewall», sem nada: directo. Ningu&eacute;m no mundo conseguiu.<br>
</font>

--> AHAAHAHAHAHH ! Sao os mais seguros? Olha entao tenta entrar aqui no meu Amiga a ver se consegues...Sem firewalls sem nada ! Se calhar ao Macintosh manda-lhes um nuke e la vai ele abaixo tipo um NT ! <br>
<br>
<br>

<font color="yellow">
Existem v&aacute;rios grupos de «hackers» em Portugal. Conhe&ccedil;o o meu grupo, o Toxyn, e os Pulhas. S&atilde;o dois grupos muito restritos e que se respeitam. Depois, h&aacute; v&aacute;rios que gravitam &agrave; nossa volta, tentando sempre obter informa&ccedil;&otilde;es. Tamb&eacute;m os respeito. Podem at&eacute; ser melhores, mas ainda n&atilde;o chegaram ao ponto de fazer alguma coisa com o que sabem. Obter resultados.<br>
</font>

--> Essa e muito linda... Antes dos Toxyn houve muitos e melhores se calhar ! Nao andavam e a fazer publicidade na televisao ! Sao grupos restritos pois....Como qualquer um de hackers.. Ha varios que gravitam a vossa volta? Fodax.. Voces sao os nossos idolos... Se calhar sao bem melhores....Se calhar fazem muito mais...So que nao vao e a merda da televisao armarem-se em bons! Essa e que e a diferenca entre o teu grupo e os restantes...
Os Toxyn tem la muita boa gente mas pelos vistos tambem tem la podres...Agora que os outros andam a procura de informacoes? Que lindo....Tamos sempre a espera que to nos des as tuas bugs que descobriste antes de irem para a Bugtraq para que assim possamos entrar em alguns sistemas ja que somos todos uns coitadinhos que nao sabem fazer nada <BR>
<br>
<br>

<font color="yellow">
Um «hacker» pode contribuir para muita coisa. Mas aten&ccedil;&atilde;o, isto &eacute; recente. Depois da nossa ac&ccedil;&atilde;o da Indon&eacute;sia surgiram dezenas de grupos constitu&iacute;dos por putos de 15 anos e que s&oacute; daqui por uns anos ser&atilde;o bons. O que n&oacute;s fizemos foi, sobretudo, despertar uma corrente adormecida. Incentiv&aacute;mos muita gente. H&aacute; muitos individualistas. C&aacute; h&aacute; bons «hackers». Talvez uns 20 competentes. Mas grupos respeitados, s&oacute; Toxyn e Pulhas.
</font>

--> De certeza que nao serve para andar ai a mostrar na televisao os hacks e a chamar atencao para este summundo! Isto e recente? Ate parece... Antes da vossa accao na Indonesia existiu um grupo chamado Fuck.ID que deu cabos dumas quantas maquinas da indonesia... Voces nao foram os primeiros! Simplesmente nos nao corremos a chamar a televisao!
Putos de 15 anos? So daqui a uns anos e que serao bons? Olha quando eu fui kickado la dos Toxyn como te fizeste questao de mostrar a toda a gente eu era um Warez-Kid que pouco percebia ainda de hack...Passado agora um ano com certeza que sei muito mais que tu. Devias era ir para estrela de cinema fazer um filme sobre isto! Depois chama-me para o papel de warez-boy.
Sim a bons hackers...E tambem gracas a ti a muitos lamers a quererem ser hackers. Uns 20 competentes? Se calhar a muitos mais ! Tu e que nao sabes da missa metade.. Se calhar 20 devem ser o total dos Toxicos e dos Pulhas nao?
Grupos respeitados so Toxyn & Pulhas? ahahhaha Que lindo...Nao a duvida que es um heroi tu. Olha eu nao preciso de grupo para nada. Se quisesse fama ja tinha tido.Ha algum respeito entre grupos ca? Depois deste artigo parece que nao. Se calhar deviamos todos e virar-nos contra as nossas estrelas Toxyn e hackar-lhes as maquinas deles! Ja que nenhuma e 100% e as vossas nao fogem a regra!<br>
<br>
<br>

<font color="yellow">
Estamos a elaborar um projecto. Queremos fazer uma campanha de seguran&ccedil;a em Portugal. Tudo o que seja m&aacute;quina portuguesa vai ser «hackada» e os resultados tornados p&uacute;blicos.<br>
</font>

--> Olha que coisa linda ? Qual e o objectivo disso? Mostrar ainda mais o quanto voces sao muito bons e? Portugal tem muitas maquinas faceis... Mas nao e so Portugal! E por todo o mundo... Mais uma palhacada vossa e da vossa super organizacao!
Campanha de seguranca ?!?! Vai servir de muito... Se os administradores ja tem aquilo numa merda nao vai ser agora que vao por muito melhor...<br>
<br>

<font color="yellow">
Sabes, o nosso grupo &eacute; o verdadeiro &iacute;dolo de muita malta nova. Recebemos centenas de «mails» de gente que sentiu orgulho em n&oacute;s. Por sermos portugueses e capazes de fazer alguma coisa de jeito. Marcar presen&ccedil;a numa causa. Porqu&ecirc; Timor? Porque somos portugueses. E h&aacute; uma responsabilidade. Aquele povo long&iacute;nquo que n&atilde;o tem nada a ver connosco, &eacute; completamente ex&oacute;tico, vai &agrave; missa, fala Portugu&ecirc;s e t&ecirc;m orgulho em exibir a bandeira portuguesa.<br>
</font>

--> Idolos?!?!? Vamos la erguer um monumento em homenagem aos Toxyn e fazer a rua m0xx em Lisboa!
Sao idolos e dos newbies que compraram um netpac e viram aquela merda na televisao! Desses sim ! Sao idolos ! Desses newbies que querem agora ser hackers! Tenho visto muitos ai por muita maquinas a fazer toneladas de asneiras! Sorte que a bofia nao liga ! 
Eu tambem ja fui newbie... E aprendi muito com as asneiras..O meu idolo? Eu proprio! Nao uns caralhos quaisqueres que apareceram na televisao...
O que voces fizeram la com a campanha faz-se diariamente por todo o mundo ! Vasta ir ver o www.hacked.net ! Nada de especial. Portanto nao tornes isso um feito historico<br>
<br>


<font color="yellow">
Tivemos um bocado de sorte nos resultados. Mas o acto de «hackar» foi lindo, tecnicamente dif&iacute;cil, lindo.<br>
</font>

--> Tiveram sorte? Ai pois tiveram! Porque sem a exploit do Savage voces nao entravam em metade do que entraram! Foi lindo? Foi lindo e quem descobriu a exploit ! Nao voces....
Sem ela voces tinham feito era chupar no dedo  porque nao hackavam o que hackaram<br>
<br>

<font color="yellow">
Agora temos projectos. E muita coisa para gerir: dezenas de mi&uacute;dos que pedem para pertencer ao grupo; solicita&ccedil;&otilde;es de grandes empresas, algumas internacionais, para fazermos a seguran&ccedil;a dos seus «sites» e redes; h&aacute; administradores de «sites» a mandarem-nos «mails» para que tentemos penetrar nos seus computadores e testar este ou aquele aspecto de seguran&ccedil;a. E temos uma s&eacute;rie de problemas com a nossa exposi&ccedil;&atilde;o. O grupo ficou um bocado exposto, o que &eacute; contra a nossa filosofia.<br>
</font>

--> Claro ! O que nao falta e putos por ai a quererem ser hackers ! Basta ir a pt.net ! Claro que as empresas vos solicitam... Com tanta publicidade e muito dificil de ter propostas dessas.
Ficou exposto o grupo? Nahhhh ! Que ideia...Esta entrevista nao vai nada contra a vossa filosofia! Ja agora qual e? So aparecer na televisao?<br>
<br>

<font color="yellow">
Benef&iacute;cios? Sim. Eu arranjei um emprego por causa disto. Os meus patr&otilde;es sabem bem quem sou e o que fa&ccedil;o. E dentro do grupo alguns acabam por arranjar emprego.<br>
</font>

--> Tambem eu vou  arranjar um emprego a custa de saber o que sei! O patrao tambem sabe o que faco e ate me agradece !
Nao e muito dificil arranjar um emprego assim...
Malificios: expuseste toda a pouca cena se hacking que existia, puseste centenas de putos a quererem ser hackers.
Nice job ! Sera que a PJ tem vagas para emprego? Se pagarem bem ate ia para la apanhar wannabee hackers ! Nao custa muito! <br>
<br>

<font color="yellow">
Em Portugal j&aacute; «hackei» de tudo, desde grandes empresas at&eacute; universidades. Coimbra, por exemplo, Instituto Superior T&eacute;cnico, Universidade do Minho, Aveiro... S&oacute; somos detectados quando cometemos algum erro. Mas nunca ningu&eacute;m teve problemas, porque nunca realiz&aacute;mos os ataques atrav&eacute;s das nossas m&aacute;quinas. Atacamos a partir de uma m&aacute;quina nos EUA, ou na Su&eacute;cia, e nunca nos rastreiam. Entre aspas, &eacute; tudo falso: n&oacute;s controlamos tudo, e mesmo que cheguem a uma dessas m&aacute;quinas n&atilde;o nos apanham, mesmo que estejamos l&aacute;. No caso da Indon&eacute;sia, nunca apareceu uma refer&ecirc;ncia sequer a m&aacute;quinas portuguesas...<br>
</font>

--> E pah! Es um super hacker ! Em Portugal ja hackas-te de tudo ! E muito dificil fazer isso nao? Fazes isso em Portugal como fazes noutro pais qualquer... Mas como pelos vistos so te gostas de gabar um gajo la deixa passar isto. Comeca a ficar habituado a  nossa super estrela que entra em todo o lado e nao deixa rastos!
Yeah.. vais por varias maquinas e o raio! Olha o Kevin Mitnick tambem ia e olha tambem foi caco.
<br>
<br>

<font color="yellow">
Nunca entrei num banco. Mas j&aacute; usei um Visa alheio. Que fiz? Comprei um dom&iacute;nio e mandei vir uns discos r&iacute;gidos dos EUA. Para experimentar. Assim uns 600 contos de fraude. Mas o titular do cart&atilde;o tinha contas &agrave; ordem de tr&ecirc;s mil contos... Portanto, n&atilde;o tive pena dele. E fi-lo apenas para experimentar. N&atilde;o tenho interesse nisso, n&atilde;o sou ladr&atilde;o. Fizemos coisas muito mais fraudulentas, como usar linhas da Telecom e da Marconi para o estrangeiro durante seis meses - as contas eram de largos milhares de contos. N&atilde;o fomos apanhados, um outro grupo foi. Mas esses j&aacute; est&atilde;o bem empregados. Sabes, se algu&eacute;m entrar numa grande empresa, os respons&aacute;veis preferem contact&aacute;-lo e tentar alici&aacute;-lo. «Voc&ecirc; entrou, tudo bem, quanto &eacute; que quer para trabalhar para n&oacute;s?» &Eacute; melhor do que passar a vergonha de admitir publicamente que os seus sistemas, supostamente t&atilde;o fi&aacute;veis, foram invadidos por um puto de 14 anos. Foi assim que arranjei emprego.<br>
</font>

--> Ja usaste um visa? E tiveste o que com isso ? Um orgasmo? Ena que elite que tu es! Usaste um visa ! Grande coisa... Todos os dias milhares de pessoas usam na net visas gamados para comprar acesso a tudo quanto e sitio !
La por ter 3 mil contos qual e o problema? Roubas-te o gajo ! E um crime como outro qualquer ! Ter muito ou pouco nao vai atenuar..
Andaste a gamar linhas? Pena nao teres sido apanhado que assim ja nao andavas a xatear como andas agora.
<br>
<br>

<font color="yellow">
Analisamo-la porta por porta, para descobrir que programa corre e se j&aacute; existem programinhas para neles entrar - se n&atilde;o, tentamos faz&ecirc;-los n&oacute;s.<BR>
</font>

--> HAHAHAHA ROTFL!!! Ma¡s um dos teus bugs que nao foram para a bugtraq nao !?!?! Dizes logo tu quando nao tens nada para entrar :"Savage aonde tas tu!?!??"
Es uma anedota m0xx ! So te gabas de coisas que nem sequer fazes!
<br>
<br>

<font color="yellow">
O caso dos computadores militares foi mais engra&ccedil;ado, porque tinham um bom «firewall». N&atilde;o passava nada, s&oacute; porta 80. Mas o servidor tinha um «bug», era uma vers&atilde;o um bocado antiga, conseguimos abrir uma «shell» em Assembler para dentro da porta 80... Esta, supostamente, s&oacute; dava sa&iacute;da a Web e n&oacute;s entr&aacute;mos por ela adentro. E o respons&aacute;vel ficou at&oacute;nito porque n&atilde;o conseguiu descobrir «logs» (ficheiros de registo) em lado nenhum, nem sequer da porta 80. N&atilde;o havia nada. Desligaram a m&aacute;quina simplesmente.<br>
</font>

--> E claro que foste tu que codaste o assembler que voces mandaram!!! Sem a exploit do savage voces nao faziam um caralho ! Tangas do caralho que es! Nao tinhas logs? Porra se voces tinham deixado entao eram mesmo muito lamers! Isso so mesmo os wannabe hackers da pt.net que tem como idolos os Toxyn e que andam a fazer merdas dessas por ai
<br>
<br>

<font color="yellow">
Mas a&iacute; est&aacute;: n&oacute;s n&atilde;o somos criminosos. Somos um grupo restrito. Fazemos coisas possivelmente ilegais - possivelmente.<br>
</font>

--> Possivelmente ilegais !?!?!? ROTFL!!! Yeah.. Ignorancia e uma coisa fodida e tu pareces ser um caso perdido nesse dominio! Has-de ler o DR para ver se aprendes qualquer coisa!
<br>
<br>

<font color="yellow">
Como os Visas ou a Indon&eacute;sia? N&atilde;o. N&atilde;o fiz nada ilegal. H&aacute; algum risco, mas aceito-o. A hist&oacute;ria do Visa &eacute; crime - sim, mas banc&aacute;rio. N&atilde;o inform&aacute;tico. Confesso porque fi-lo apenas para experimentar, n&atilde;o sigo esse caminho.<br>
</font>

--> Claro que nao fizeste nada de ilegal! Deixa ai os numeros dos visas e logs de entrada nas maquinas a policia e depois ve se eles no dia a seguir nao  tao a entrar por tua casa dentro ! Fizeste apenas para experimentar?
Ena... Isso andamos todos a fazer ! Que e crime ai isso e! Era bom se nao fosse ! Podiamos andar a dar cabo das maquinas.. Entrar em todo o lado sem preocupacoes... Mas infelizmente e crime ! Se um dia fores busted diz-lhes
que estavas apenas a experimentar! Que eles se calhar dao-te e a experimentar um bastao nos cornos!
<br>
<br>

<font color="yellow">
E uma confiss&atilde;o p&uacute;blica em nome de m0xx n&atilde;o basta. Podia estar a dizer-te um chorrilho de mentiras. Podia estar aqui um gajo qualquer a dizer-te «p&aacute;, sou um grande 'hacker' e fiz isto» e ser mentira. Isto &eacute; muito confuso.<br>
</font>

--> Mais mentiras e tretas ainda ? As que disseste ate aqui nao chegam? Pa sou um grande Hacker? hahahha O que raio andaste  a dizer a entrevista inteira!??! Que era um newbie qualquer ? Parece-me que  nao! E ja agora nao es um grande hacker! Es mas e um grande basofias que so anda
a dar cabo da scene de hacking em Portugal! Es mesmo aquele grande hacker que so ta pra qui  a gabar-se e a contar merdas.
Cresce e aparece m0xx! E olha que sou mais novo que tu mas tenho muito mais juizo e sou muito mais modesto ao contrario de ti que pareces um puto a querer mostrar que e alguma coisa!
<br>
<br>

<font color="yellow">
Admito que haja «hackers» profissionais, que trabalham pagos por servi&ccedil;os secretos ou pa&iacute;ses inimigos. Esses s&atilde;o criminosos, claro.<br>
</font>

--> Sao criminosos so por receberem dinheiro por aquilo que fazem? A diferenca entre  um hacker "amador" e eles e so o  dinheiro! O crime basicamente e  o mesm&oslash;!
Tanto rouba informacao um amador como um profissional! Oh well.. Mais uma das tuas merdices de filosofia.
<br>
<br>

<center>E ca chegamos nos ao fim desta entrevista vergonhosa para todos os interessados no hacking em  Portugal!
Chamar a atencao para o nosso submundo e muito interessante! Se calhar nao nos devem prender...So porque o m0xx ta convencido  que  nao eh crime!
E crime sim senhora! Todos nos o sabemos ! Mas la arriscamos na procura de mais conhecimentos!
Respeito para todos os hackers da scene portuguesa que o merecem!<br>
Desrespeito total para o m0xx que nao passa dum merdas que anda a dar cabo de toda a scene de  hacking! So para proveito proprio!<br>
Over & Out!<br>
<center>
Ja devem saber quem sou portanto no need de assinar!<br>
Sou apenas um puto de 20 anos como certa pessoa diz!<br>
Mais uma vez isto e uma opiniao pessoal mas que muita gente envolvida na scene de hacking pt deve concordar! Cada um que tire as suas conclusoes !<br>
</center>

<I>&lt;END&gt;</I><P>
<FONT SIZE="5" FACE="Arial" COLOR="#FFC639">
<P>
<CENTER>
------------------------------
</CENTER>
</FONT>
<P>
</CENTER>
<FONT SIZE="4" FACE="Arial" COLOR="#FFC639">
m0xx SuckZ<BR>
-----------------
</FONT>
<BR>
by WhiteKore
<P>


<CENTER><H3>O seguinte &eacute; uma lista de quotes do <A HREF="mailto:m0xx@toxyn.org">m0xx</A>@<A HREF="http://www.toxyn.org" NAME="Toxyn Org">toxyn.org</A>
 na sua bela
entrevista ao Expresso XXI</H3><BR></CENTER>


<CENTER><H4>Aten&ccedil;&atilde;o ao facto de eu n&atilde;o estar a falar pelos urbankaos
Embora todos os membros da nossa comunidade <BR>concordem com a opiniao de
que o m0xx al&eacute;m de sofrer ego muito grande e mal fundamentado
<BR>tah a fazer com que o "anonimato" que acompanha o que fazemos
deixe de existir</H4></CENTER><BR><P>

<CENTER><H4>And now on with the fun kidz!</H4></CENTER><BR><P><P>


<EM>-Quote</EM><BR>
<CENTER>
"Existem v&aacute;rios grupos de «hackers» em Portugal. Conhe&ccedil;o o meu grupo, o
Toxyn, e os Pulhas.<BR> S&atilde;o dois grupos muito restritos e que se respeitam
Depois, <STRONG>h&aacute; v&aacute;rios que gravitam &agrave; nossa volta</STRONG>,<BR> tentando sempre obter
informa&ccedil;&otilde;es. Tamb&eacute;m os respeito. Podem at&eacute; ser melhores, mas ainda n&atilde;o<BR>
chegaram ao ponto de fazer alguma coisa com o que sabem. Obter resultados."
</CENTER>
<EM>-End Quote</EM>

<BR><P>
Es um deus.. todos giram &aacute; tua volta. Dix-me o dia em que os Urbankaos
pediram alguma coisa aos toxicos que eu dou-te um doxe.
Quando aos resultados.. Obtemo-los mas ao contrario de ti. Nao os Publicitamos
E muito menos vamos pra jornais conta-los

<BR><P><BR>

<EM>-Quote</EM><BR>
<CENTER>
"Depois da nossa ac&ccedil;&atilde;o da Indon&eacute;sia surgiram dezenas de grupos constitu&iacute;dos<BR>
 <STRONG>por putos de 15 anos</STRONG> e que s&oacute; daqui por uns anos ser&atilde;o bons."
</CENTER>
<EM>-End Quote</EM>

<BR><P>
LOL os uK tem 1 miudo de 15 anos que deve saber mais que tu. E bons?
Haxes-te 4 machingas em id? N&oacute;s temos 30.


<BR><P><BR>
<EM>-Quote</EM><BR>
<CENTER>
"C&aacute; h&aacute; bons «hackers». Talvez uns 20 competentes. <STRONG>Mas grupos respeitados, s&oacute;
Toxyn e Pulhas</STRONG>." 
</CENTER>
<EM>-End Quote</EM>

<BR><P>
Respeitados? Por quem? pelos os lhamuz que nem a net sabem o que &eacute;?
Respeito membros dos toxicos.. quanto a ti tens o menos respeito 
que um cao. Bem te podes ter tornado Heroi do newbie. Dentro da
comunidade, tax no memo n&iacute;vel que um pj disfarcado


<BR><P><BR>
<EM>-Quote</EM><BR>
<CENTER>
"Sabes, o nosso grupo &eacute; o verdadeiro &iacute;dolo de muita malta nova."
</CENTER>
<EM>-End Quote</EM>

<BR><P>
LOL. es buehs de bom pah.. a malta adora-te.. ensina-me a haxar
latas de sardinha man. Ai tens imensa razao, quem percebe do que
fala considera-te merda.


<BR><P><BR>

<EM>-Quote</EM><BR>
<CENTER>
"Em Portugal <STRONG>j&aacute; «hackei» de tudo</STRONG>, desde grandes empresas at&eacute;
universidades.<BR> Coimbra, por exemplo, Instituto Superior T&eacute;cnico,
Universidade do Minho, Aveiro"
</CENTER>
<EM>-End Quote</EM>

<BR><P>
Mais uma vex dominas.. es um deus, um heroi. Haxing Univ's portuguesas
&eacute; buehs de hard. 



<BR><P><BR>
<EM>-Quote</EM><BR>
<CENTER>
"ve um Spectrum e logo a&iacute; j&aacute; <STRONG>pirateava</STRONG> jogos. Publicava uma lista com quase quatro mil,"
</CENTER>
<EM>-End Quote</EM>

<BR><P>
Cool. Admite a merda que fazes


<BR><P><BR>

<EM>-Quote</EM><BR>
<CENTER>
"<STRONG>Mas j&aacute; usei um Visa alheio</STRONG>. Que fiz? Comprei
um dom&iacute;nio e mandei vir uns<BR> discos r&iacute;gidos dos EUA. Para experimentar.
Assim uns 600 contos de fraude." 
</CENTER>
<EM>-End Quote</EM>

<BR><P>
Continua. Eu depois bebo uma beer quando tiveres a ser enrabado por um
gordo de 120kg na cadeia



<BR><P><BR>


<EM>-Quote</EM><BR>
<CENTER>
"Fizemos coisas muito mais fraudulentas, como usar linhas da Telecom e da Marconi
<BR>para o estrangeiro durante seis meses - <STRONG>as contas eram de largos milhares de contos</STRONG>."
</CENTER>
<EM>-End Quote</EM>

<BR><P>
Fizemos? Os Toxicos existiam em 92? E nao sei como nao foste dentro.. olha amigos
meus foram..  deves ter sido tu que expalhas-te pela visus e pela cats como se
fazia o blue boxing ou entao foste tu que deste as entrevistas - puta mediatica como es
<BR><P>



Enfim. Caso queiram, tirem as vossas proprias conclusoes das quotes. Todas 
elas s&atilde;o verdadeiras e podem ser confirmadas @ <A HREF="http://www.expresso.pt/ed1300/x81.asp" NAME="Expresso XXI">Expresso XXI</A>

Infelismente, n&atilde;o &eacute; s&oacute; o facto do m0xx estar a chamar aten&ccedil;&atilde;o demasiada pra scene em
si, mas tr&aacute;s mau nome para os t&oacute;xicos e para os seus membros. Um wise hacker consegue
ver que os toxicos tem bons membros que merecem respeito. Embora depois existam cancros
como o m0xx.
<BR><P><BR><P><BR><P>






</FONT>
</BODY>
</HTML>
