<HTML>
<HEAD>
<TITLE>.pt zine - Noticias</TITLE>
</HEAD>
<BODY BGCOLOR="Black" TEXT="#000000" LINK="Green" VLINK="Red">
<IMG SRC="pt_small.gif" WIDTH=452 HEIGHT=81 BORDER=0>
<P>
<FONT SIZE="5" FACE="Arial" COLOR="#FFC639">
<B>Noticias:</B><BR>
------------- 
</FONT>
<BR>
<FONT SIZE="3" FACE="Arial" COLOR="#FFC639">
by secretos
<P>
envia as noticias que aches interessantes para <A HREF="mailto:secretos@kaotik.complex-x.net">secretos@kaotik.complex-x.net</A>
<P>
<FONT COLOR="Silver"><B>17/10/97</B></FONT>
<UL><TT><B>IN: BUGTRAQ@NETSPACE.ORG</B></TT><BR>
From: Aleph One &lt;aleph1@DFW.NET&gt;<BR>
Subject:      Security Hole in Explorer 4.0<P>

<A HREF="http://www.jabadoo.de/press/ie4_us.html">http://www.jabadoo.de/press/ie4_us.html</A>

<P>
   Security Hole in Explorer 4.0
<P>
   Freiburg - 10/16/97 - A dangerous security hole in Internet Explorer
   4.0 was detected by Ralf Hueskes of Jabadoo Communications when he
   conducted a series of security tests for [3]c't computer magazine.
<P>
   His tests revealed that it is possible to spy on the contents of any
   text and HTML files on somebody else's computer. Not only local files
   are in danger, but also data on your company's intranet - even if it
   is protected by a firewall.
<P>
   The security hole exists even if users have activated the highest
   security level in their browser. The problem affects both the German
   and the English version of the Internet Explorer.
<P>
   The code needed for infiltrating your files can be hidden in any
   normal Web page or in an e-mail message.
<P>
   Technical Details
<P>
   The spy pages make use of JScript. If a user accesses a page or
   receives an e-mail containing this code, infiltration begins ...
<P>
   The spy page contains a so-called IFRAME sized 1 by 1 pixel. When a
   user accesses the page or opens the e-mail message, a small Jscript
   program loads the HTML or text file to be spied on into this frame.
   The contents of the frame can then be read using Dynamic HTML and sent
   as a parameter hidden in a URL to any Web server in the Internet.
<P>
   [4]demo page
<P>
   Protective Measures
<P>
   According to Ralf Hueskes of Jabadoo Communications, the security hole
   exploits an error in the Internet Explorer 4.0 that can be fixed only
   by the manufacturer. Microsoft is aware of the problem and will make
   available a patch for download from [5]http://www.microsoft.com/ie/ on
   October 17th 1997.
<P>
   Experienced users can protect themselves by completely deactivating
   the execution of Active Scripting in the security settings (menu item:
   Tools/Options/Security, Settings/Custom (for expert users)/Active
   Scripting/Disable) and by using the Security Zones feature in Internet
   Explorer 4.0.
<P>
   More Information
<P>
   For more information (press only), please contact Ralf Hueskes of
   Jabadoo Communications (ralf.hueskes@jabadoo.de). Additional
   information can also be found in c't magazine, vol. 12/97 (to be
   published on 10/27/97).
<P>
   Miscellaneous
<P>
   Trademarks, program names, company names etc. mentioned on this Web
   page may be protected by trademark law and international agreements.
   Although all information has been verified, we cannot guarantee its
   correctness.
<P>
References
<P>
<DD>   1. <A HREF="http://www.jabadoo.de/index.html">http://www.jabadoo.de/index.html</A>
<DD>   2. <A HREF="http://www.jabadoo.de/index.html">http://www.jabadoo.de/index.html</A>
<DD>   3. <A HREF="http://www.heise.de/ct/">http://www.heise.de/ct/</A>
<DD>   4. <A HREF="http://www.jabadoo.de/press/ie4demo.html">http://www.jabadoo.de/press/ie4demo.html</A>
<DD>   5. <A HREF="http://www.microsoft.com/ie/">http://www.microsoft.com/ie/</A>
</UL>

<FONT COLOR="Silver"><B>27/09/97</B></FONT>
<UL><TT><B>IN: Expresso, XXI</B></TT><BR>
<B>As aventuras de um hacker portugu&ecirc;s. </B>
<P>
Excertos da vida de m0xx, o respons&aacute;vel do grupo Toxyn
e talvez o «hacker» portugu&ecirc;s mais famoso. S&atilde;o curtos
epis&oacute;dios para reflectirmos todos, do cibernauta comum
ao administrador de sistemas. Contados na primeira
pessoa.
<P>
Ser «hacker» &eacute; a
 maneira como vivo. «Hackar» a vida. &Eacute; a forma como
encaro a sociedade. Um «hacker» &eacute; um bocado de tudo.
Ser «hacker» &eacute; perceber como &eacute; que as coisas
funcionam. Tens de perceber como funciona a m&aacute;quina. O
«hardware». O processador. O sistema. &Eacute; como conhecer
uma pessoa. Descobrir os seus pontos fracos. Um abutre
dos pontos fracos dos sistemas de computadores, sim, mas
que cumpre uma fun&ccedil;&atilde;o, investiga a sua seguran&ccedil;a. H&aacute;
os que entram em m&aacute;quinas e se divertem a destruir,
claro.
<p>
Mas enquadro-me no grupo
dos que passam dias de volta de uma m&aacute;quina, de um
programa, e quando descobrem um «bug», um erro,
informam o meio atrav&eacute;s dos canais pr&oacute;prios, como
alguns «newsgroups» da Internet. E, se for caso, avisa
o respons&aacute;vel do sistema: «Descobri um 'bug' nesse
sistema, usei este programa e est&aacute; aqui a solu&ccedil;&atilde;o».
 &Eacute; isso a filosofia «hacker». </p>
<p>Nunca «hackei» os computadores da <a href="http://www.telepac.pt/">Telepac</a>. 
Tenho um colega que entrou neles h&aacute; uns anos,
quando ainda n&atilde;o estavam ligados &agrave; Internet. Depois,
passeou pelo sistema da Direc&ccedil;&atilde;o Geral das
Contribui&ccedil;&otilde;es e Impostos. Mas n&atilde;o fez nada: limitou-se
a entrar. A Telepac &eacute; o «provider» portugu&ecirc;s em que
nunca entrei. Elogio muito a atitude deles face &agrave;
seguran&ccedil;a. S&atilde;o bons. J&aacute; aconteceu detectarmos falhas,
irmos a correr testar aquilo e eles j&aacute; tinham remendado
o buraco. Atentos, viram ao mesmo tempo que n&oacute;s e
corrigiram. Agora, os outros, &eacute; mentira. <p>
<p>
Mas todos os sistemas operativos s&atilde;o
fal&iacute;veis. Nenhum &eacute; cem por cento seguro. H&aacute; sempre uma
falha algures. H&aacute; sempre um lado desprotegido. H&aacute;, sim,
uns melhores que outros. Uns demoram mais tempo, outros
abrem-se num instante. O Linux, por exemplo, &eacute; muito
bonito mas tem grandes falhas de seguran&ccedil;a. Tamb&eacute;m &eacute;
verdade que s&atilde;o todas f&aacute;ceis de resolver e est&atilde;o
documentadas. O problema &eacute; que os respons&aacute;veis nem
sempre t&ecirc;m tempo para olhar para a documenta&ccedil;&atilde;o. 
<p>Qual &eacute; o mais inseguro? O NT tem-se
        revelado muito engra&ccedil;ado. Quem o usa n&atilde;o faz a menor
        ideia de que por detr&aacute;s daquelas janelinhas t&atilde;o bonitas
        existe um aut&ecirc;ntico buraco de seguran&ccedil;a. Foi feito para
        pessoas que n&atilde;o percebem patavina de redes nem de
        seguran&ccedil;a... As janelinhas explicam tudo, «clique aqui
        para p&ocirc;r no ar o servidor de Web», e ningu&eacute;m imagina
        como aquilo &eacute; do outro lado das janelinhas: est&aacute;
        absurdamente aberto. Dentro do universo Unix, o Irix tem
        grandes falhas, como o Linux. Mas o pior de todos &eacute; sem
        d&uacute;vida o NT. Um aut&ecirc;ntico logro. N&atilde;o &eacute; por custar
        muito dinheiro que um sistema &eacute; seguro. Os Macintosh
        s&atilde;o os mais seguros, por incr&iacute;vel que pare&ccedil;a. Havia um
        concurso de uma empresa sueca que oferecia milhares de
        d&oacute;lares a quem entrasse pelo seu Web, e era totalmente
        segur&iacute;ssimo. Sem «firewall», sem nada: directo.
        Ningu&eacute;m no mundo conseguiu. 
<p>
Existem v&aacute;rios grupos de «hackers»
        em Portugal. Conhe&ccedil;o o meu grupo, o Toxyn, e os Pulhas.
        S&atilde;o dois grupos muito restritos e que se respeitam.
        Depois, h&aacute; v&aacute;rios que gravitam &agrave; nossa volta, tentando
        sempre obter informa&ccedil;&otilde;es. Tamb&eacute;m os respeito. Podem
        at&eacute; ser melhores, mas ainda n&atilde;o chegaram ao ponto de
        fazer alguma coisa com o que sabem. Obter resultados. Um
        «hacker» pode contribuir para muita coisa. Mas
        aten&ccedil;&atilde;o, isto &eacute; recente. Depois da nossa ac&ccedil;&atilde;o da
        Indon&eacute;sia surgiram dezenas de grupos constitu&iacute;dos por
        putos de 15 anos e que s&oacute; daqui por uns anos ser&atilde;o
        bons. O que n&oacute;s fizemos foi, sobretudo, despertar uma
        corrente adormecida. Incentiv&aacute;mos muita gente. H&aacute;
        muitos individualistas. C&aacute; h&aacute; bons «hackers». Talvez
        uns 20 competentes. Mas grupos respeitados, s&oacute; Toxyn e
        Pulhas. 
<p>
Encontramo-nos todos os dias
        virtualmente. Nos canais pr&oacute;prios de IRC ou de outras
        formas. E fazemos reuni&otilde;es f&iacute;sicas, mas muito privadas.
        Somos muito organizados. Convoquei uma para a semana que
        vem. Estamos a elaborar um projecto. Queremos fazer uma
        campanha de seguran&ccedil;a em Portugal. Tudo o que seja
        m&aacute;quina portuguesa vai ser «hackada» e os resultados
        tornados p&uacute;blicos. 
<p>
Sabes, o nosso grupo &eacute; o verdadeiro
        &iacute;dolo de muita malta nova. Recebemos centenas de
        «mails» de gente que sentiu orgulho em n&oacute;s. Por sermos
        portugueses e capazes de fazer alguma coisa de jeito.
        Marcar presen&ccedil;a numa causa. Porqu&ecirc; Timor? Porque somos
        portugueses. E h&aacute; uma responsabilidade. Aquele povo
        long&iacute;nquo que n&atilde;o tem nada a ver connosco, &eacute;
        completamente ex&oacute;tico, vai &agrave; missa, fala Portugu&ecirc;s e
        t&ecirc;m orgulho em exibir a bandeira portuguesa.Tivemos um
        bocado de sorte nos resultados. Mas o acto de «hackar»
        foi lindo, tecnicamente dif&iacute;cil, lindo. 
<p>
Agora temos projectos. E muita coisa
        para gerir: dezenas de mi&uacute;dos que pedem para pertencer
        ao grupo; solicita&ccedil;&otilde;es de grandes empresas, algumas
        internacionais, para fazermos a seguran&ccedil;a dos seus
        «sites» e redes; h&aacute; administradores de «sites» a
        mandarem-nos «mails» para que tentemos penetrar nos
        seus computadores e testar este ou aquele aspecto de
        seguran&ccedil;a. E temos uma s&eacute;rie de problemas com a nossa
        exposi&ccedil;&atilde;o. O grupo ficou um bocado exposto, o que &eacute;
        contra a nossa filosofia. 
<p>
Benef&iacute;cios? Sim. Eu arranjei um
        emprego por causa disto. Os meus patr&otilde;es sabem bem quem
        sou e o que fa&ccedil;o. E dentro do grupo alguns acabam por
        arranjar emprego. Mas enquanto organiza&ccedil;&atilde;o n&atilde;o
        ganh&aacute;mos um tost&atilde;o. Pod&iacute;amos ter pedido dinheiro pelas
        entrevistas na altura da Indon&eacute;sia, em que fomos muito
        solicitados. N&atilde;o quisemos ganhar dinheiro &agrave; custa da
        causa de Timor. Se fosse uma coisa s&oacute; nossa, talvez o
        tiv&eacute;ssemos feito. Mas n&atilde;o somos uma empresa, somos um
        grupo. 
        <p>Em Portugal j&aacute; «hackei» de tudo,
        desde grandes empresas at&eacute; universidades. Coimbra, por
        exemplo, Instituto Superior T&eacute;cnico, Universidade do
        Minho, Aveiro... S&oacute; somos detectados quando cometemos
        algum erro. Mas nunca ningu&eacute;m teve problemas, porque
        nunca realiz&aacute;mos os ataques atrav&eacute;s das nossas
        m&aacute;quinas. Atacamos a partir de uma m&aacute;quina nos EUA, ou
        na Su&eacute;cia, e nunca nos rastreiam. Entre aspas, &eacute; tudo
        falso: n&oacute;s controlamos tudo, e mesmo que cheguem a uma
        dessas m&aacute;quinas n&atilde;o nos apanham, mesmo que estejamos
        l&aacute;. No caso da Indon&eacute;sia, nunca apareceu uma
        refer&ecirc;ncia sequer a m&aacute;quinas portuguesas... 
<p>A minha forma&ccedil;&atilde;o sempre foi no ramo
        inform&aacute;tico. Estou a acabar engenharia inform&aacute;tica.
        Tive um Spectrum e logo a&iacute; j&aacute; pirateava jogos.
        Publicava uma lista com quase quatro mil, alguns nunca
        editados em Portugal. Recebia-os, duplicava-os e
        distribu&iacute;a mundialmente. N&atilde;o fazia mais nada. Depois,
        veio o primeiro XT. L&aacute; comecei com o DOS, que era uma
        porcaria aut&ecirc;ntica, aprendi Pascal, vieram as BBS, tive
        o primeiro «modem». Sei programa&ccedil;&atilde;o. Basic, Pascal,
        Cobol, mas C e Perl &eacute; que contam actualmente. 
        <p>Nunca entrei num banco. Mas j&aacute; usei um
        Visa alheio. Que fiz? Comprei um dom&iacute;nio e mandei vir
        uns discos r&iacute;gidos dos EUA. Para experimentar. Assim uns
        600 contos de fraude. Mas o titular do cart&atilde;o tinha
        contas &agrave; ordem de tr&ecirc;s mil contos... Portanto, n&atilde;o
        tive pena dele. E fi-lo apenas para experimentar. N&atilde;o
        tenho interesse nisso, n&atilde;o sou ladr&atilde;o. Fizemos coisas
        muito mais fraudulentas, como usar linhas da Telecom e da
        Marconi para o estrangeiro durante seis meses - as contas
        eram de largos milhares de contos. N&atilde;o fomos apanhados,
        um outro grupo foi. Mas esses j&aacute; est&atilde;o bem empregados.
        Sabes, se algu&eacute;m entrar numa grande empresa, os
        respons&aacute;veis preferem contact&aacute;-lo e tentar alici&aacute;-lo.
        «Voc&ecirc; entrou, tudo bem, quanto &eacute; que quer para
        trabalhar para n&oacute;s?» &Eacute; melhor do que passar a vergonha
        de admitir publicamente que os seus sistemas,
        supostamente t&atilde;o fi&aacute;veis, foram invadidos por um puto
        de 14 anos. Foi assim que arranjei emprego. 
        <p>Como se processa uma opera&ccedil;&atilde;o?
        Come&ccedil;amos por definir o alvo, o dom&iacute;nio. Um pa&iacute;s
        inteiro, no caso da Indon&eacute;sia. Primeiro obtemos os nomes
        de todas as m&aacute;quinas debaixo desse dom&iacute;nio. Metemo-nos
        em cada m&aacute;quina e analisamos os seus processos. &Eacute;
        prefer&iacute;vel ent&atilde;o escolher uma m&aacute;quina de Web.
        Analisamo-la porta por porta, para descobrir que programa
        corre e se j&aacute; existem programinhas para neles entrar -
        se n&atilde;o, tentamos faz&ecirc;-los n&oacute;s. Se n&atilde;o conseguirmos
        entrar na m&aacute;quina-alvo, tentamos as que lhe est&atilde;o
        ligadas, ou seja, exploramos todos os pontos fracos em
        volta dela. Pode estar muito bem protegida de ataques
        frontais, mas uma outra que lhe d&aacute; acesso poder&aacute; n&atilde;o
        estar - e atrav&eacute;s da segunda entramos na primeira.
        Apanha-se ent&atilde;o todo o tr&aacute;fego dessa m&aacute;quina - e &eacute;
        meio caminho andado. Saca-se a lista de «passwords», e
        pronto. Voltando ao exemplo, a m&aacute;quina da Indon&eacute;sia
        estava muito bem protegida. Tinha um &uacute;nico ponto fraco -
        foi o bastante. Acedemos &agrave; informa&ccedil;&atilde;o classificada,
        como a lista das embaixadas indon&eacute;sias no mundo inteiro.
        Mas isso n&atilde;o interessava. Apenas alter&aacute;mos o c&oacute;digo da
        p&aacute;gina de entrada - e, em vez da p&aacute;gina oficial do
        Minist&eacute;rio dos Estrangeiros indon&eacute;sio, via-se a nossa
        propaganda &agrave; causa de Timor. 
        <p>O caso dos computadores militares foi
        mais engra&ccedil;ado, porque tinham um bom «firewall». N&atilde;o
        passava nada, s&oacute; porta 80. Mas o servidor tinha um
        «bug», era uma vers&atilde;o um bocado antiga, conseguimos
        abrir uma «shell» em Assembler para dentro da porta
        80... Esta, supostamente, s&oacute; dava sa&iacute;da a Web e n&oacute;s
        entr&aacute;mos por ela adentro. E o respons&aacute;vel ficou
        at&oacute;nito porque n&atilde;o conseguiu descobrir «logs»
        (ficheiros de registo) em lado nenhum, nem sequer da
        porta 80. N&atilde;o havia nada. Desligaram a m&aacute;quina
        simplesmente. E segundo informa&ccedil;&otilde;es de l&aacute; (temos
        amigos «hackers» indon&eacute;sios), o respons&aacute;vel passou um
        p&eacute;ssimo bocado antes de ser despedido. A pena para
        aquilo era fuzilamento. Se foi o caso temos pena, porque
        n&atilde;o quer&iacute;amos prejudicar ningu&eacute;m. Basicamente &eacute; isto.
        
        <p>Em Portugal h&aacute; bons «hackers», mas
        «ciberchuis» ainda n&atilde;o. A Pol&iacute;cia Judici&aacute;ria tem um
        dom&iacute;nio na Web mas ainda n&atilde;o anda a&iacute; atr&aacute;s do
        pessoal. Preocupam-se com os que traficam «software» e
        n&oacute;s n&atilde;o o fazemos. J&aacute; o SIS &eacute; diferente. Manobra pela
        calada. N&atilde;o me espantaria nada saber que t&ecirc;m arquivos
        com dados sobre n&oacute;s. Alguns de n&oacute;s estaremos nos
        pr&oacute;ximos anos a trabalhar para eles, n&atilde;o duvido... Mais
        vale contratar um gajo que saiba. Mas a&iacute; est&aacute;: n&oacute;s
        n&atilde;o somos criminosos. Somos um grupo restrito. Fazemos
        coisas possivelmente ilegais - possivelmente. Por isso &eacute;
        que somos muito reservados. Problemas em dizer isto
        publicamente? Como os Visas ou a Indon&eacute;sia? N&atilde;o. N&atilde;o
        fiz nada ilegal. H&aacute; algum risco, mas aceito-o. A
        hist&oacute;ria do Visa &eacute; crime - sim, mas banc&aacute;rio. N&atilde;o
        inform&aacute;tico. Confesso porque fi-lo apenas para
        experimentar, n&atilde;o sigo esse caminho. E uma confiss&atilde;o
        p&uacute;blica em nome de m0xx n&atilde;o basta. Podia estar a
        dizer-te um chorrilho de mentiras. Podia estar aqui um
        gajo qualquer a dizer-te «p&aacute;, sou um grande 'hacker' e
        fiz isto» e ser mentira. Isto &eacute; muito confuso. <
        <p>Onde est&aacute; o crime? Na pedofilia,
        rapto, aliciamento em «talkers», marcar encontro e
        abusar sexualmente. Ou piratear «software» e ganhar
        dinheiro com isso. Entrar num sistema n&atilde;o &eacute; crime.
        Entrar e alterar dados tamb&eacute;m n&atilde;o o &eacute; por si s&oacute;:
        ser&aacute; quando as altera&ccedil;&otilde;es prejudicarem terceiros.
        Admito que haja «hackers» profissionais, que trabalham
        pagos por servi&ccedil;os secretos ou pa&iacute;ses inimigos. Esses
        s&atilde;o criminosos, claro. 
		<P>
<I>&lt;END&gt;</I><P>
<B>NOTA</B>:<BR>
<UL>
Esta entrevista, devido &agrave; demonstra&ccedil;ao de egocentrismo e narcisismo,
gerou v&aacute;rios protestos na comunidade hacker portuguesa.<P>
Quem ler s&oacute; vai confirmar o que j&aacute; se diz...que somos
todos uns sacanas..e que n&atilde;o h&aacute; amigos c&aacute; dentro..todos querem ser os maiores
e s&oacute; se consegue phodendo o pr&oacute;ximo... k os grupos s&atilde;o 1 gajo que sabe e os outros
pra fazer n&uacute;mero..e por fim..que somos todos uns criminosos...que phodemos a vida a
quem trabalha..sysadmin e bofias..
<P>
A cena do cartao de cr&eacute;dito e da marconi &eacute; a descri&ccedil;&atilde;o tipica do que eles
pensam ser um haxor.. alguem que caga no proximo ("o gajo tinha 3 mil
contos..roubei lhe 600..e' merecido") e que n&atilde;o liga aos meios pra atingir os
fins.. Ser o mais temido na comunidade<BR>
Bem..se &eacute; assim um haxor ent&atilde;o acho que hoje muita gente chegou &agrave; conclusao que n&atilde;o s&atilde;o um.. e ficaram
felizes por n&atilde;o o ser

</UL>
</UL>
<P>

<FONT COLOR="Silver"><B>26/09/97</B></FONT>
<UL><TT><B>IN: News Flash Portugal</B></TT><BR>
<B>S-MIME - Standard de e-mail seguro - Crackado</B>

<BR><BR><BR>
O standard de e-mail seguro S-MIME, que permite
enviar e receber mensagens codificadas, foi
recentemente crackado.
<BR><BR>
Bruce Schneier, um perito em criptografia,
criou um programa para Windows 95 que permite
descodificar mensagens codificadas  usando
o S-MIME, standard de e-mail seguro usado
nos programas de e-mail do Netscape Communicator
4 e do Internet Explorer 4.
<BR><BR>
Este programa consegue descodificar uma mensagem
em aproximadamente 35 dias num Pentium a 166mhz.<BR><BR>

Para mais informa&ccedil;&otilde;es sobre este programa visite
<A HREF="http://www.counterpane.com/">http://www.counterpane.com/</A>
<BR>
</UL>

<FONT COLOR="Silver"><B>19/09/97</B></FONT>
<UL><TT><B>IN: PC WEEK</B></TT><BR>
<b>Hacker shocker: Research project reveals breaches galore</b><br>
<i>By Jonathan Littman, ZDNN</i><p>
Hackers call it "war dialing."<P>
A security expert has used this old hacker's technique to root out thousands of modem lines in Northern California that may be leaving corporations and individuals vulnerable to attack.<P>
Peter Shipley of Berkeley, Calif., has been letting his computer do the dialing. A whole lot of dialing: 1.4 million numbers or so; 500 an hour, 12,000 a day. Roughly 14,000 of the 1.4 million numbers Shipley's program randomly dialed were modem lines, a figure that translates to thousands of open doors for would-be hackers to wreak havoc.<P>
The huge research project has revealed case studies in bad security practices. Shipley's conclusion:  Today, many companies and individuals are unaware of the risk that one unprotected modem line can pose to an entire computer network.<P>
Shipley says that while many unaccounted-for modem lines are found in corporations, an increasing number of employees have direct dial-up access to corporate networks from home. And not surprisingly he notes, "a lot of the time they don't have good passwords."<P>
Some startling findings of the telecommunications vulnerability study:<P>
* An East Bay medical facility gives unrestricted modem access to patient records, making it easy for a hacker to steal, alter or delete private medical records;<P>
* An Internet company offering financial services does not require a password to modify its modem-accessible firewall, potentially permitting intruders to install backdoors and disable auditing routines; and<P>
* A Fortune 100 company's air conditioner and environmental control units can be easily changed by modem, enabling a hacker to overheat buildings or kill lights at will.<P>
Shipley has not attempted to access any of the 14,000 sites his war-dialing method has found in Northern California, but his research raises questions whether basic security is widely practiced.<P>
The security expert says he found numerous firewalls in Silicon Valley so poorly configured that intruders could easily gain total command of the firewall and the network behind it. Only three of every thousand modem lines he checked posted a warning banner, violating policy for many government sites and corporations.<P>
"Some of them had a welcome banner on the screen, gave the name of the operating system, the release number, even in many cases the name of the corporation," said Ken Kumasawa a security consultant for TeleDesign Management Inc. in Burlingame, Calif., who reviewed the data. "This has been a no-no for about five or six years."<P>
Instead of a welcome screen, Kumasawa says the modem line should have led to a warning screen -- or nothing. "To a certain extent it should be a blank screen," he said. "The person who is accessing it should know how to do it."<P>
War dialing was popularized by the 1983 hacker-classic movie "War Games," which featured Matthew Broderick dialing his way to a direct connection with a military computer. In days past, hackers would mass-dial tens of thousands of phone numbers to find open systems from which to make further assaults.<P>
But Shipley -- a security auditor who plans to publish a technical paper on his research -- says he's maintained a "look but don't touch" premise. He didn't attempt to access any of the systems his war dialer found, and for good reason. Unauthorized access carries criminal penalties.<P>
Recent studies showing that 39 percent of homes have PCs may extend the risk of hacking. "As more and more home-access software appears, say to synchronize your laptop with your desktop, the risk of dial-up information warfare will increase," said Shipley. "Badly configured systems can permit hackers to gain access to a hard drive or printer, read or delete files, even run programs on your machine."<P>
<I>Jonathan Littman is the author of "The Fugitive Game" and "The Watchman."</I><P>
</UL>






<FONT COLOR="Silver"><B>19/09/97</B></FONT>
<UL><TT><B>IN: News Flash Portugal</B></TT><BR>
Site da Coca-Cola hackado 
<P>
O site da Coca-Cola foi recentemente alterado por hackers.
Como consequ&ecirc;ncia o web site foi fechado durante dois dias. 
<P>
Um grupo de hackers alterou as p&aacute;ginas web da Coca-Cola,
nelas inscrevendo a mensagem "voc&ecirc;s v&atilde;o come&ccedil;ar a olhar
para o que bebem, olhar para o vossos Big Mac, e
compreender&atilde;o que s&atilde;o ovelhas..." 
<P>
A Coca-Cola confessou que foi a primeira vez que o seu web site
foi alvo dos hackers. 
<P>
Os respons&aacute;veis pelo acto ainda n&atilde;o foram identificados, mas o
caso est&aacute; a ser investigado. 
</UL>
<P>

<FONT COLOR="Silver"><B>13/09/97</B></FONT>
<UL><TT><B>IN: News Flash Portugal</B></TT><BR>
"Revelation" revela passwords no Windows 95
<BR><BR><BR>
Um novo utilit&aacute;rio chamado "Revelation"
permite descodificar as passwords
do Windows 95 guardadas no disco.
<BR><BR>
As passwords que os utilizadores usam para
se ligarem &agrave; Internet ou &agrave; rede local
ficam guardadas no disco, codificadas, quando
o utilizador escolhe a op&ccedil;&atilde;o "save password"
para que n&atilde;o tenha que a re-escrever sempre
que se liga &agrave; Internet.
<BR><BR>
Este novo utilit&aacute;rio permite l&ecirc;r o ficheiro
no disco onde as passwords se encontram, e
descodific&aacute;-las.
<BR>
No entanto &eacute; necess&aacute;rio ter acesso ao ficheiro
que cont&eacute;m as passwords.<BR>
Para os utilizadores de Internet este novo
programa n&atilde;o representa nenhuma amea&ccedil;a, uma vez
que n&atilde;o &eacute; poss&iacute;vel que esse ficheiro de passwords
seja obtido por estranhos quando navega na Internet.
<BR><BR>
Aos locais p&uacute;blicos que disponibilizam o acesso
&agrave; Internet, aconselha-se que tomem medidas para que
os utilizadores n&atilde;o possam ter acesso ao ficheiro
de passwords que se encontra no disco r&iacute;gido.
<BR><BR>
Este "revelation" foi criado pela empresa
Snadbody (<A HREF="http://www.snadboy.com">http://www.snadboy.com</A>)  e est&aacute;
dispon&iacute;vel gratuitamente.
<P>
</UL>



<FONT COLOR="Silver"><B>04/09/97</B></FONT>
<BR>
<UL>
&Agrave; 1:20 da manh&atilde; o server <A HREF="http://www.bapedal.go.id/" target="_top">www.bapedal.go.id/</A> foi hackado pelo _Phantom_:<P>
<CENTER>
</UL>
Antes<BR>
<IMG SRC="ph_hack2.gif" WIDTH=400 HEIGHT=289 BORDER=0>
<P>
Depois<BR>
<IMG SRC="ph_hack.gif" WIDTH=400 HEIGHT=289 BORDER=0>
</CENTER>
<BR>






<FONT COLOR="Silver"><B>02/09/97</B></FONT>
<BR>
<UL>
<a href="http://www.darkening.com/museum/nm-state.htm">New Mexico State Library</a>, hacked by MaxOut<br>
<a href="http://www.darkening.com/museum/zenscope.html">ZenScope
    Online</a>, hacked by OptikLenz of Legions of the Underground<br>
</UL>

<FONT COLOR="Silver"><B>02/09/97</B></FONT>
<BR>
<UL>
<a href="http://www.darkening.com/museum/altavista.html">Altavista Technology, Inc</a>. hacked by Intruder<br>
</UL>

<FONT COLOR="Silver"><B>01/09/97</B></FONT>
<BR>
<UL><TT><B>IN: P&uacute;blico, Suplemento Computadores</B></TT><BR>
Telepac e ASSOFT discutem pirataria na Internet<P>
Num "newsgroup" gerido pela Telepac forma disponibilizados c&oacute;pias ilegais de "software",
como o corrector ortogr&aacute;fico "Flip97", da Priberam. A Associa&ccedil;&atilde;o Portuguesa de Software 
(ASSOFT) exigiu &agrave; Telepac que actuasse no sentido de responsabilizar criminalmente os
autores desta vioal&ccedil;&atilde;o dos direitos de autor. A Telepac estuda a quest&atilde;o,
mas est&aacute; relutante em reconehcer que deve controlar os cone&uacute;dos disponibilizados
atrav&eacute;s da Internet e alerta para o caract&eacute;r pol&eacute;mico desta quest&atilde;o.<BR>
Respondendo aos pedidos da ASSOFT, a Telepac colocou, na semana passada, uma mensagem 
neste "newsgroup" - telepac.binarios - em que adverte contra a ilegalidade em 
que est&atilde;o a incorrer os seus utilizadores ao partilharem "software" n&atilde;o autorizado.
<BR>
Mas quanto &agrave; exig&ecirc;ncia de apagar os ficheiros ilegais a Telepac n&atilde;o a satisfez. "S&oacute; poderemos agir se tivermos ordem para isso do tribunal. A partir do momento que fa&ccedil;amos isso, como fornecedores de servi&ccedil;os, estamos a assumir responsabilidade pelo controlo de todos os conte&uacute;dos da Internet, que &eacute; humanamente incontrol&aacute;vel", disse ao P&Uacute;BLICO Arlindo Costa, director de "marketing" da Telepac.
<BR>
...
<BR>
</UL>
<P>










<FONT COLOR="Silver"><B>30/08/97</B></FONT>
<BR>
<UL><TT><B>IN: Urban Ka0s Homepage (<A HREF="http://www.urbanka0s.org">http://www.urbanka0s.org</A>)</B></TT><BR>
Our sysadm has received threats the local secret service advising him to close 
down urbanka0s.org. We believe indonesia is behind this, and is        
pressuring the local goverment close us down. Of course, these actions  
will receive retribution.
</UL>

<FONT COLOR="Silver"><B>28/08/97</B></FONT>
<BR>
<UL><TT><B>IN: CuD, Wed Aug 28, 1997  </B></TT><BR>
From: Jim Thomas &lt;jthomas@well.com&gt;<BR>
Subject: File 4--AOL Target of Credit Card Scam<P>

The Chicago Tribune (27 Aug '97, p. 3) reported a scam that
attempted to target AOL subscribers two weeks ago. The story
describes how e-mail, disguised as official correspondence from
AOL attempted to entice subscribers to divulge credit card numbers
and other sensitive information. The scam worked by inviting
subscribers to click on a link that took them to an official
looking homepage, where a letter, ostensibly by AOL's CEO Steve
Case described AOL's successes in fixing bugs.  Subscribers
where then asked to update their AOL accounts by supplying
confidential information.
<P>
When AOL users log on to AOL, a prominent note reminds them that
AOL personnel will *never* ask for such information.
It's not known how many users were victimized by the scam, and the
fraudulent homepage was apperently up only for a few hours.
<P>
Unlike sex-related crimes, there have been no screaming "INTERNET
BLAMED IN SCAM ATTEMPT" headlines.  That's encouraging. It's
hardly a surprise that the Net contains predators, just as do
churches, highschools, and police departments. The trick, which
the media seem to be slowly catching on to, is not to create
hysteria with clueless horror stories, but to stress a few basics.
In this case, one of the cardinal rules pertains: Do not give out
personal information to strangers on the Net. In this case,
however, the scam was sufficiently clever that it could easily
catch inexperienced (or even some experienced) netfolk.  A second
rule then pertains: Double check the sources - if something seems
odd, avoid it.
<P>
The text of "spam" letter setting up the scam was posted on The
Well (a public access community in California's Bay
Area--<A HREF="http://www.well.com">http://www.well.com</A> for info) on August 12 by
&lt;amicus@well.com&gt;.
<P>
  ============
<P>
Tue 12 Aug 97 04:51
<P>
 I just got what is apparent Spam that would seem to go far
 beyond illegal... it purports to be from AOL (address is
 something like "ServerUpdate@aol.com") and contains a letter
 from Steve Case, along with a URL on an IP-address-only site.
 When you go to the site, you're in a secure form, purporting to
 be a reregistration form for you with AOL, asking for various
 confidential information.  The page bears logos for both RSA and
 VeriSign... it seems to be crafted to *look* legit, for those
 folks who merely understand that the Internet *can* be secured,
 somehow.  Checking headers, the thing seems to have come from
 UUNet (surprise!).  For those who want to check it out, the URL
 is <A HREF="http://209.41.43.223/index.htm">http://209.41.43.223/index.htm</A>
<P>
       -------------
<P>
 here's what I got... NB the bogus domain (aoI.com) and the
 "Authenticated server is..." comment.  Clever enough to catch
 newbies, certainly.
<P>
&lt;begin letter&gt;
<P>
 From AOL-ServerUpdate@aol.com Tue Aug 12 08:22:50 1997<BR>
 Received: from relay6.UU.NET (relay6.UU.NET [192.48.96.16])<BR>
           by embassy.org (8.8.4/8.8.4) with ESMTP<BR>
 	  id FAA18670 for <director@embassy.digex.net>; Tue, 12 Aug 1997 05:24:13
 -0400 (EDT)<BR>
 From: AOL-ServerUpdate@aol.com<BR>
 Received: from mail.uu.net by relay6.UU.NET with SMTP<BR>
 	(peer crosschecked as: slip129-37-52-122.ca.us.ibm.net [129.37.52.122])
 	id QQdcgj02863; Tue, 12 Aug 1997 05:24:11 -0400 (EDT)<BR>
 Received: from mail.aoI.com (alt.aoI.com (207.34.342.246)) by aoI.com
 (8.8.5/8.6.5) with SMTP id GAA01943 for &lt;ServerUpg@aol.com&gt;; Tue, 12 Aug 1997
 05:18:19 -0600 (EST)<BR>
 To: ServerUpg@aol.com<BR>
 Message-ID: &lt;173840394782.GAA73847@aoI.com&gt;<BR>
 Date: Tue, 12 Aug 97 05:18:19 EST<BR>
 Subject - Important AOL Information! Please Read.  --)<br>
 Reply-To: AOL-ServerUpdate@aol.com<BR>
 X-PMFLAGS: 34078848 0<BR>
 X-UIDL: 268493654736a37aeb4b67463529878e<BR>
 Comments: Authenticated sender is &lt;AOL-ServerUpdate@aol.com&gt;
 <P>
 Special News Bulletin:
<P>
 August 12, 1997
<P>
 Dear Members:
<P>
 As you know, the number one priority for all of us at America
 Online continues to be meeting our obligation to provide you with
 the best possible service. We have been working day and night to
 fix the busy signal problem and to catch up with the incredible
 surge in demand for AOL. In this month's letter, I'd like to give
 you an update on how we are doing.
<P>
 When it became clear to us that unlimited use pricing stimulated
 more demand for AOL than we had anticipated, we announced a $350
 million expansion program and made four commitments to you:
<P>
<DD> - To expand system capacity as quickly as possible<BR>
<DD> - To serve our existing members before adding new members<BR>
<DD> - To work extremely hard to maintain the loyalty of members
   who've had problems with busy signals<BR>
<DD> - To communicate frequently about the steps we are taking to improve AOL
<P>
 So let me update you on what we're doing to meet each of those
 commitments, including the development of a new server which
 offers a higher system capacity.
<P>
 You may either take a moment to read in depth about the steps we
 have taken, or just complete the required update of your
 information on our new servers.
<P>
 Please Click &lt;A HREF="http://209.41.43.223/index.htm"&gt;HERE&lt;/A&gt; to
 Continue.
<P>
 All you have to do is click on the text above with your left
 mouse button and it will take you directly to our new information
 screen.
<P>
 Thank you for your Cooperation,<BR>
 AOL Member Services
<P>
 Below are the Headers used by AOL's newly developed servers.<BR>
 Please Disregard these they are of no importance.<BR>
 &lt;end letter&gt;
</UL>









<FONT COLOR="Silver"><B>25/08/97</B></FONT>
<BR>
<UL>
Mudamos de server, outra vez! Agora estamos em <A HREF="http://www.complex-x.net/kaotik/">http://www.complex-x.net/kaotik/</A>
<BR>
Esperem grandes novidades!! Guestbook, NewsBoard e um Hack Search Engine ser&atilde;o apenas algumas das novidades!
<BR>
Um agradecimento ao ppl da Complex-x por nos terem oferecido o WebSpace. Thanks ppl :)
</UL>

<FONT COLOR="Silver"><B>25/08/97</B></FONT>
<BR>
<UL><TT><B>IN: CuD, Mon Aug 25, 1997  </B></TT><BR>
From: "noah@enabled.com" &lt;noah@enabled.com&gt;<BR>
3--When you do this, don't forget your friends! (fwd)<P>
Source  -noah
<P>
Hackers' Paradise: Get Wealthy Legally By Cracking a Code --- Crypto-Logic
Offers to Pay $1 Million to the Breaker
<P>
The Wall Street Journal via Dow Jones
<P>
  A start-up company would like you to hack your way to $1 million.
  Crypto-Logic Corp. of Austin, Texas, claims to have created an encryption
system for electronic mail so foolproof that it can't be broken. If someone
can  figure out a special encrypted e-mail message within a year, the company
says it  will pay a reward of $1 million.
<P>
  But wait. The technology Crypto-Logic is using for the contest hasn't
exactly  been foolproof. The three computers needed to create the contest's Web
site  unexpectedly scrambled data in the site last week, said David Neeley,
vice  president and chief operating officer.
<P>
  The breakdown forced him to backtrack from last week's announcement that the
contest would begin last Friday. Instead, he spent several days attempting to
fix the computers, but to no avail. On Monday, he had to get replacement
computers. "I've got thousands of dollars worth of machinery that's not worth
blowing up," he grouses. But he adds, "I regard this as my screw-up. In this
world, there are no excuses." He finally got the contest running Wednesday, at
<A HREF="http://www.ultimateprivacy.com">www.ultimateprivacy.com</A>.
<P>
  On the bright side, cryptologists agree that the decades-old encryption
method  that Crypto-Logic is claiming to use -- called a "one-time pad" -- is
theoretically unbreakable. Each "pad" has a set of uniquely random digital
symbols that are coded to the actual message. The recipient uses the same
symbols to decrypt the message. The pads are used only once.
  To limit the possibility of leaks, Crypto-Logic Chairman Stan Spence is the
only person who knows the message that was encrypted. The solution is kept in
a  NationsBank vault in Austin, Mr. Spence says. In addition, Mr. Neeley says
the  $1 million is backed by an insurance company he won't name.
  Several other companies have held similar contests, typically offering more
modest sums.
<P>
  Jim Bidzos, president of RSA Data Security Inc. in Redwood City, Calif.,
says  his company frequently holds break-the-code contests to test how tough
certain  encryption systems are. But he and other security experts are
skeptical of  Crypto-Logic's assertions. "Anyone who says their system is
bulletproof is  either a liar or stupid," says Winn Schwartau, a Largo, Fla.,
security expert.
  Mr. Neeley admits his integrity is on the line. "If I'm wrong," he notes,
"we're out of business."
<P>
  WSJviaNewsEDGE
</UL>



<FONT COLOR="Silver"><B>25/08/97</B></FONT>
<BR>
<UL><TT><B>IN: CuD - Mon, 25 Aug 1997 21:04:52 -0500  </B></TT><BR>
From: Jon Lebkowsky &lt;jonl@onr.com&gt;<BR>
6--Cyber Rights '97
<P>
Cyber Rights '97
September 21, 1997 1pm - 6pm
Joe C. Thompson Conference Center
26th and Red River, Austin, Texas
Admission is Free
<P>
Featured speakers:
<P>
Ann Beeson, attorney for the ACLU and part of the legal team for
ACLU vs. Reno
<P>
Ed Cavazos, Sr. VP, General Counsel of Interliant, Inc. and
co-author of Cyberspace and the Law
<P>
Gene Crick, president of the Metropolitan Austin Interactive
Network and Editor of the Texas Telecommunications Journal
<P>
Mike Godwin, counsel for the Electronic Frontier Foundation
<P>
Pete Kennedy, attorney with George, Donaldson, and Ford
<P>
David Smith, vice-president of EFF-Austin and member of the
Central Texas Civil Liberties Union Board of Directors
<P>
Dr. Sharon Strover, director of the Texas Telecommunications
Policy Institute
<P>
Moderated by Rich MacKinnon, with an Introduction by Jon Lebkowsky

<P>
On the plate:
<P>
How Internet rating and filtering systems can stifle free speech
on the Net
<P>
Why public libraries can't use filters, including a discussion of
the use of CyberPatrol by the Austin Public Library
<P>
The future of state regulation of the Internet, including Texas
HB1300, which requires ISPs to link information about filtering
software to their home pages
<P>
_ACLU v. Reno_ (Supreme Court overturns Communications Decency
Act)
<P>
Intellectual and Copyright issues in the civil liberties/freedom
of expression framework, including the increasing capitalization
of ideas, and the erosion of "fair use"
<P>
Children and the Internet
<P>
Telecommunications infrastructure and the state's role in
regulating telecommunications systems computers and networks in
schools
<P>
Spam -- the need for, and dangers of, regulating commercial speech
on the internet regulating commercial speech on the internet
<P>
Encryption and communications privacy
<P>
Sponsored by<BR>
The Texas Telecommunications Policy Institute<BR>
George, Donaldson, and Ford<BR>
EFF-Austin<BR>
ACLU of Texas
<BR>
--<BR>
Jon Lebkowsky		<A HREF="http://www.well.com/~jonl">http://www.well.com/~jonl</A><BR>
jonl@onr.com                  cdb, wfm, vb et al
</UL>

<FONT COLOR="Silver"><B>24/08/97</B></FONT>
<UL>
Self Induced Negativity [SIN] (<A HREF="http://www.sinnerz.com/">http://www.sinnerz.com/</A>) hacked! 
<DD><A HREF="b41.gif">Antes do ataque</A><BR>
<DD><A HREF="sin2.gif">Depois do ataque</A>
</UL>


<FONT COLOR="Silver"><B>22/08/97</B></FONT>
<BR>
<UL><TT><B>IN: BUGTRAQ - Mon, 25 Aug 1997 </B></TT><BR>
From: Peter Shipley &lt;shipley@DIS.ORG&gt;<BR>
Subject:      Active X exploit.<P>
There is a new expliot  for active X<P>
    <A HREF="http://www.network-security.com/activex/" target=_top">http://www.network-security.com/activex/</A>
<P>
    <A HREF="http://www.dis.org/maglite/" TARGET="_top">http://www.dis.org/maglite/</A>
<P>
This is a very interesting hole since this is the first time that
someone actually published the source code for examination.  The
code was stolen by maglite from a recent 2600 meeting from the
author, a dude named Toby . But the attack is very interesting in
the sense that allows you to turn off the security restrictins of
Internut Explainer 3.2 using activeX just by connecting to a WWW
page.
<P>
Check it out.  It is bundled with the getadmin stuph published by
the Russian named Sokolov (?)
<P>
                -Pete
</UL>

<FONT COLOR="Silver"><B>22/08/97</B></FONT>
<BR>
<UL><TT><B>IN: BUGTRAQ - Fri, 22 Aug 1997 </B></TT><BR>
From: "Andre L. Dos Santos" &lt;andre@CS.UCSB.EDU&gt;
Subject:      Netscape Communicator 4.01a and 4.02 for Windows 95/NT allows
              disclosure of your passwords<P>
Using the latest Netscape Communicator we are able to get your credit card
number, password for online banking or online brokerage order, etc, only
restricted by the imagination of the malicious server implementer. This is
due to a flaw in Javascript identified by the Reliable Software Group at
University of California Santa Barbara. It enables a malicious site to
track all activities of a user in the Internet. Besides being able to get
this information, which violates the user's privacy, by using an ingenious
technique we are able to target chosen pages and use a fake server to
convince the user to type in privileged information. We submitted a
security bug report to Netscape, but we believe that this is a very
serious threat, which is easy to implement. As such it should be widely
disseminated. This flaw was tested in Netscape Communicator 4.01a, the
latest version of Netscape, and it is described, together with other
attacks in our paper at http://www.cs.ucsb.edu/~andre/attacks.ps.<P>
        Netscape has released a new version of Communicator for Windows
95/NT. It is Netscape Communicator 4.02. In this version our attack is
much more threatening. This is because on the previous version the access
on the location object was better implemented and in order to get a string
value to this object we had to close a second browser we opened. Using the
new version of Netscape we are able, using an infinite loop, to access the
string that represents the location object, against the security policy of
Javascript.  Therefore, using  this version, we don't even need to close
the second browser. We are still investigating which other security
policies are badly implemented in this new version of Netscape
Communicator.<P>
  Andre L. dos Santos<BR>
  Reliable Software Group<BR>
  University of California Santa Barbara<BR>
</UL>

<FONT COLOR="Silver"><B>15/08/97</B></FONT>
<BR>
<UL><TT><B>IN: News Flash, 15 de Agosto de 1997</B></TT><P>
"Atalho" encontrado nas leis de encripta&ccedil;&atilde;o
<BR><BR><BR>
Foi recentemente encontrado um "atalho"
legal, que permitiu exportar a vers&atilde;o 
americana do popular programa de 
encripta&ccedil;&atilde;o (codifica&ccedil;&atilde;o de dados) PGP,
sem quebrar nenhuma lei americana sobre
esta mat&eacute;ria.
<BR><BR>
As leis americanas sobre a exporta&ccedil;&atilde;o
de software de encripta&ccedil;&atilde;o limita
a exporta&ccedil;&atilde;o a software bastante fraco,
deixando o popular e fort&iacute;ssimo PGP
sem qualquer hip&oacute;tese.<BR>
Mas recentemente este mesmo PGP
foi colocado no web site de uma universidade
de Oslo sem quebrar qualquer lei.
<BR><BR>
Este "feito" foi conseguido ao imprimir
todo o "c&oacute;digo fonte" do PGP, transform&aacute;-lo
num livro, export&aacute;-lo para a Europa,
e transformado de novo em software
com a ajuda de um "scanner" e software
de reconhecimento de caracteres.
<BR><BR>
Um porta voz da companhia respons&aacute;vel
pelo PGP disse "n&oacute;s acreditamos que as portas
devem ser abertas &agrave; exporta&ccedil;&atilde;o de software
de encripta&ccedil;&atilde;o" acrescentando que "n&atilde;o
estiv&eacute;mos de modo nenhum relacionados com
esta 'brincadeira' ".<BR>
</UL>


<FONT COLOR="Silver"><B>15/08/97</B></FONT>
<BR>
<UL><TT><B>IN: News Flash, 15 de Agosto de 1997</B></TT><P>
Mais um bug no Internet Explorer<P>

A Microsoft est&aacute; a investigar mais um
bug descoberto na implementa&ccedil;&atilde;o do Java
no Internet Explorer vers&otilde;es 3 e 4.
<P>
Hoje em dia parece que os bugs nos browsers
(programas para ver p&aacute;ginas web) n&atilde;o param
der ser descobertos.<BR>
Este novo bug, descoberto por um programador
do Colorado, e que afecta as vers&otilde;es 3 e 4
do Microsoft Internet Explorer, permite
que algumas "applets" java possam enviar
e receber imagens de e para o computador
do utilizador.
<P>
Mas o potencial "hacker" que
queira tirar partido deste bug precisa de
saber o nome e localiza&ccedil;&atilde;o exacta da(s) imagem(s)
que pretende obter e/ou alterar do computador 
do utilizador.
<P>
No entanto o bug pode tornar-se s&eacute;rio no caso
de trabalhadores de empresas que queiram causar
algum dano &agrave; rede da empresa, uma vez que esses
trabalhadores poderiam saber as localiza&ccedil;&otilde;es
exactas dos ficheiros de imagem que pretendia
obter e/ou alterar.
<P>
A Microsoft est&aacute; a estudar o bug atentamente
e ir&aacute; publicar mais informa&ccedil;&atilde;o em
<A HREF="http://www.microsoft.com/security">http://www.microsoft.com/security</A>
</UL>


<FONT COLOR="Silver"><B>14/08/97</B></FONT>
<BR>
<UL>
Date: Thu, 14 Aug 1997 14:34:40 +0100<BR>
To: kaotik@mail.org<BR>
From: Yyyyyyy &lt;yyyyy@mail.terravista.pt&amp;<BR>
Subject: A sua pagina no Terravista - Meco 1199<P>
Caro marujo,<P>

Depois da alegre troca de correspondencia com o meu colega Xxxxxxxx Xxxxxx
pensamos que retiraria a sua pagina de livre iniciativa.
<P>
Como e evidente nao podemos albergar uma pagina que retrata nao so o
Terravista como os seus apoiantes de forma abusiva e caluniante, ja para
nao falar da linguagem utilizada.
<P>
Agradecemos que nao volte a colocar conteudos deste tipo no Terravista.
<P>
Atentamente
</UL>


<FONT COLOR="Silver"><B>11/08/97</B></FONT>
<BR>
<UL><TT><B>IN: Netly News, 11 de Agosto de 1997</B></TT><P>
by <A HREF="mailto:noah@pathfinder.com">Noah Robischon</A>
August 11, 1997<BR><BR>
Nothing makes hackers happier than breaking into a computer that another hacker set up, especially when an appreciative audience is watching. Small surprise, then, that there were plenty of grins at last weekend's <A HREF="http://www.hope.net/" TARGET="_new">Beyond HOPE</A> hacker convention in New York City.
<P>
The first break-in attempt came at about 4 a.m. on Friday when a huge, tattoo-encrusted Englishman named Cyberjunkie ran a utility that probed the network of HOPE's Dutch sister conference, <A HREF="http://www.campsite.hip97.nl" TARGET="_new">Hacking In Progress</A>. The plan: to expose any weaknesses, then peel away the security measures of the target computer like the layers of an onion. The program quickly found several obvious security holes. "So I had to do something," Cyberjunkie says. "It's a bit like waving a red flag at a bull, isn't it?" Like the <i>encierro</i> <A HREF="http://www.eunet.es/InterStand/cyberagentes/cyber_14/s_fermin.htm" TARGET="_new">at Pamplona</A>, Cyberjunkie sent a stampede of null information into one of the server's memory buffers until it choked and overloaded. Quietly attached at the end was a simple script that granted him the access he wanted. (In hacker argot, this is known as an <A HREF="http://www.fc.net/phrack/files/p49/p49-14" TARGET="_new">IMAP exploit</A>.)
<P>
Because hacking is not only encouraged but rewarded at HOPE -- which conference organizer Emmanuel Goldstein revived this summer after a three-year hiatus -- each of the thousands of participants received an IP address with which they could glom onto the Puck Building's 10-megabit network and connect to the rest of the world. The Pittsburgh-based <A HREF="http://www.dhp.com/" TARGET="_new">DataHaven Project</A> provided 15 public terminals, but Ethernet hub plugins were plentiful. Confused? No problem. The 13-year-old with braces in the next chair was glad to help out. After all, he'd already hooked his ancient DEC, Hewlett-Packard or portable IBM onto the Net and was busily trying to gain root access.
<P>
When you'd tired of chatting on IRC #hope (topic at 4:11 p.m. on Saturday: "HOPE is a commercial enterprise full of bullshit"), you could browse through the various kinds of phone equipment, T-shirts or software that were on sale. Ether Bunny sold $250 worth of lineman's equipment (including several Southwestern Bell hard hats) in just over an hour. There was, of course, a constant stream of panels to attend: Tiger Teaming (better known as security consulting); cryptography; how to hack Windows NT; Metrocard hacking; a prisoner panel that included Bernie S. and Phiber Optik; and an amazing talk on privacy given by investigator Steve Rambam.
<P>
Best known for <A HREF="http://www1.gazette.com/gtonline/archive/96-11-28/wor060.html" TARGET="_new">tracking down</A> 161 Nazi war criminals hiding in Canada, Rambam is a consummate connoisseur of databases. "It is true that I can go online and reliably determine if you are a homosexual or a lesbian.  It is true that I can go online and determine your religion. I can go online and, without breaking a sweat or getting carpal tunnel syndrome, find what movies you rent at Blockbuster," he said.
<P>
Yet Rambam takes an unlikely stance on the privacy issue, especially in a room full of paranoids. Closing off databases, he says, will not adversely affect his work -- since he'll always be able to buy the information from someplace. "It will harm the ability of the average person to control their lives; to check up on government to see if they are lying to him, to check up on big business to see if they are lying to him, to check up on the guy next door and see if he is an ax murderer," he said.
<P>
Now Rambam may be biased, for he operates a billion-record database that is accessible online to subscribers (he refused to give the URL for fear of hacking attacks). Nevertheless, it was rare to see so many teenagers taking copious notes, noted fellow attendee Shabbir Safdar. The audience couldn't get enough of Rambam, who looked more like a fed than a hacker in his custom-made Hong Kong suit. (A big hit was when he detailed how to turn a dead man's identity into your own.) But ultimately, Rambam questioned why anyone would want to: "The fact of the matter is that there is no real reason to hide most of who you are and what you do."
<P>
It's an unfortunate but true statement about the state of hacking today. Where have all the good hacks gone? Three years later and the flimsy <A HREF="http://www.nytimes.com/library/cyber/hackstock/081197metrocard.html" TARGET="_new">Metrocard</A> is still impenetrable. A panel of hackers turned security consultants showed that one of the biggest challenges for today's data cowboys was changing the preconceived notions of hackers held by the corporations they work for.
<P>
Keynote speaker <A HREF="http://cyberwerks.com/1/cyberwire/" TARGET="_new">Brock Meeks</A>, went so far as to admonish the crowd for their low hacker batting average (only 20 percent of all government computer systems have been hacked). His address was putatively a history of hacking in America, but it sounded more like a call to arms for the audience. "You're going to have to learn how to hack the media, because you haven't been doing a good job of it," Meeks said.
<P>
Indeed, hackers get their share of bad press, and they gripe about it to no end. And HOPE highlighted the split personality hackers bring to their relationship with the media. Like most groups, they lambaste journalists. Yet their keynote speaker wasn't an agent provocateur, but a member of the press (albeit an esteemed one who champions the hacker cause). There was a panel discussion (which I participated in) where hackers could finally turn the tables on the media in attendance. "No weapons allowed," said the schedule of events. Yet only one of the audience's questions criticized the press, specifically noting John Markoff and his book on Kevin Mitnick. There was even a "Media Portrayal of Hackers" survey being distributed by a University of Tennessee sociology student as part of his master's thesis.
<P>
Perhaps it's useless to analyze hacker-vs.-media steretypes. After all, the hacker community has shown that it can successfully run its own magazines, pirate radio stations and web sites. If it's true that information technology is going to obliterate old media, the horsemen of the apocalypse are more likely riding from alt.2600 than from Wired. "The whole <A HREF="http://www.2600.com" TARGET="_new">2600</A> thing is a media hack," admitted Goldstein. And the success of this year's HOPE showed not only that Goldstein knows how to co-opt the media but that he might be a damn good entrepreneur as well.
</UL>

<FONT COLOR="Silver"><B>09/08/97</B></FONT>
<BR>
<UL>
Depois de nos terem censurado mais uma p&aacute;gina na Terr&agrave;vista decidimos
construir uma p&aacute;gina de protesto. Encontra-se em
<A HREF="http://www.terravista.pt/meco/1199/">http://www.terravista.pt/meco/1199/</A>
(que j&aacute; foi censurada, por isso j&aacute; n&atilde;o l&aacute; est&aacute;) e em 
 <A HREF="http://secretos.home.ml.org/censuravista/">http://secretos.home.ml.org/censuravista/</A>
</UL>
<FONT COLOR="Silver"><B>08/08/97</B></FONT>
<BR>
<UL>
Date: Fri, 08 Aug 1997 11:03:24 +0100<BR>
From: XXXXX XXXX &lt;xxxxxxx@mail.terravista.pt&gt;  <BR>  
Subject: A sua pagina no Terravista<P>
Caro marujo,
<P>
A sua pagina em 
http://www.terravista.pt/mussulo/1141/ptzine00.txt
encontra-se em clara violacao das regras que aceitou ao imigrar para o
Terravista.
<P>
Lamentavelmente e por esse motivo, somos forcados a anular o seu registo.
<P>
Sera' sempre bem vindo, desde que respeite as regras de alojamento neste site.
<P>
Obrigado
<P>
</UL>




<FONT COLOR="Silver"><B>08/08/97</B></FONT>
<BR>
<UL>
Crime and Crypto: A Report Shaded Gray<br><br>
<A HREF="mailto:news_feedback@wired.com">by Wired News Staff</A><BR>
5:02am&nbsp;&nbsp;7.Aug.97.PDT<P>
The reports sound ominous:

<P>&nbsp; &nbsp; In Italy, the Mafia is downloading PGP to help ward off investigators.

 <P>&nbsp; &nbsp; In Colombia, the Cali cocaine cartel maintains encrypted personnel files - complete with lists of relatives to be leaned on when necessary - and has scrambled some of its telecommunications.

<P>&nbsp; &nbsp; In Japan, the Aum Shinri Kyo cult kept RSA-encrypted plans for launching a chemical and nuclear campaign of mass murder both at home and in the United States.

<P>A study by two authorities on the US encryption debate lists many more incidents in which cops have faced down criminals armed with the cryptographic means to hide what they're doing. But amid the discussion of all that these developments imply, the doom scenario one might be tempted to cut to in a report by government-friendly crypto experts is remarkably missing.

<P>Instead, the authors - Georgetown University computer scientist <a href="http://guru.cosc.georgetown.edu/~denning/">Dorothy Denning</a> and William Baugh, vice president of Science Applications International Corp. and former assistant director of the FBI - conclude that strict export controls and key-management systems are unlikely to stop criminals.

<p>"No approach to encryption will be foolproof. Whereas export controls clearly have an impact on product lines, they do not keep unbreakable encryption out of the hands of criminals entirely," says the report, which Denning and Baugh developed over the past six months and began circulating late this spring. It was published last week.

<p>The report is part of a series by the National Strategy Information Center's US Working Group on Organized Crime, a group that includes academics, congressional staffers, and officials from the Defense Department, FBI, Drug Enforcement Administration, and Federal Reserve. 

<p>Sifting through accounts of criminal cases involving encryption - some from law officers or security professionals, some from academic or government studies, some from journalists' accounts - Denning and Baugh estimate the total number of criminal cases involving encryption worldwide is at least 500, with an annual growth rate of 50 percent to 100 percent. But the report's collected anecdotes suggest that so far, though, encrypted files have sometimes slowed investigations and made them more expensive, and that law officers have found ways to crack ciphers or used other evidence to complete prosecutions.

<p>Denning, known in the past as a backer of strict controls on encryption and of systems such as the Clipper chip to afford government access to data, said she's given pause by the report's finding that prosecutors have not been derailed by encrypted evidence.

<p>"It's put me in a greater state of doubt than at the beginning," she said in an interview last week. But the report noted that currently, criminals often use off-the-shelf technology and other methods that are often easily cracked, as in the case of former CIA agent Aldrich Ames, who was convicted of espionage in part because of a easily breakable commercial program he used to encrypt data.

<p>"Not everyone wants to spend their time messing around with technology; then there are others who are willing to do it," Denning said. "It will go in both directions."

<p>The report also says that although the spread of strong cryptography "could become a serious threat to law enforcement and national security," police and prosecutors face plenty of challenges from  technologies that help criminals hide data (such as compression and steganography) and spy on adversaries.

<p>"One thing that was discussed when the paper was presented to the group is that you can forget about encryption - there are more basic problems law enforcement has to deal with," like staffing and basic technologies, says Jeff Berman, executive director of the National Strategy Information Center. 

<p>For instance, some big drug dealers were not encrypting phone calls, but instead swapped phones to stay ahead of the police. In one Keystone Kops-type episode, the DEA noticed a large number of calls to Columbia on their phone bill, and realized that the Cali cartel had cloned the DEA's own number. 

<p>The report concludes that export controls have had a double-edged negative effect: It has prevented businesses and law enforcement outside the United States from getting strong encryption, but has not stopped determined criminals from obtaining it.

<P>Conversely, the report says, "One effect of lifting export controls is likely to be increased availability and use of encryption to protect sensitive information from organized crime." Although criminals would also have greater access to crypto programs, the report argues, market demand for key recovery systems could lead to a situation in which police will be able to retrieve keys to crime-related data.

<p>The report cuts across lines of the current legislative-executive debate on encryption and how it should be regulated. Since last year, both houses of Congress have worked on bills that would reverse the Clinton administration's export controls and ban mandatory key recovery systems.

<P>In the House, Virginia Republican Bob Goodlatte's Security and Freedom through Encryption Act has gained a majority of members as co-sponsors. However, a parallel bill in the Senate has been shouldered aside by John McCain and Bob Kerrey's Public Network Security Act, which offers industry incentives for participating in a key recovery system and preserves the current export controls on the technology. The current handicapping of the battle of the bills - despite an <A HREF="http://www.crypto.com/member/">August-long lobbying campaign</A> by civil liberties and Internet users groups - is that any final legislation will significantly weaken the House provisions.

<p>The study also faults key recovery systems on several points, perhaps most importantly the fact that they themselves could be abused either by criminals or government officials. Another <A HREF="http://www.crypto.com/key_study/">widely publicized study</A> of large-scale key-management infrastructures, put out in May by a team of cryptographers and computer scientists opposed to controls, concluded that such systems would be so expensive and technically complex that they are simply impractical.

<p>So if strict export controls don't work and key recovery systems open up a whole new Pandora's box of criminal activities, what's the best encryption policy?

<p>"It's a hard, hard, hard question," Denning said. "To me, a lot of it boils down to whether trying to regulate it is a good idea, and I'm not convinced either way."   
</UL>

<FONT COLOR="Silver"><B>01/08/97</B></FONT>
<BR>
<UL><TT><B>IN: BUGTRAQ, Fri, 1 Aug 1997</B></TT><P>
From: Aleph One <A HREF="mailto:aleph1@DFW.NET">aleph1@DFW.NET</A><BR>
Subject:      Netscape Communicator Bug<BR>
To: BUGTRAQ@NETSPACE.ORG<P>
<A HREF="http://www.iti.gov.sg/iti_people/iti_staff/kcchiang/bug/">
http://www.iti.gov.sg/iti_people/iti_staff/kcchiang/bug/</A>
<P>
Netscape Communicator Bug demonstration
<P>
This bug affects netscape communicator (even version 4.01a) with Java
and Javascript enabled. I've tested it on
Windows 95/NT and Linux.
<P>
This bug lets a mailicious site achieve the same effects as the recently
reported JavaScript bug. However, the
mechanism to achieve the effect is different. Unlike the reported
JavaScript bug, this exploit doesn't spawned off
a separate window, and is thus more "invisible" to the user.
<P>
After leaving this page, any web site that you subsequently visit will
be captured by this web server. The
information you enter into forms will be captured too, but this will
sometimes not work (I've no idea why). To
view the information captured on you, simply visit
<A HREF="http://www.iti.gov.sg/cgi-bin/track.cgi">http://www.iti.gov.sg/cgi-bin/track.cgi</A>
 when you're done going to other sites.
<P>
You may want to turn off Java/JavaScript until Netscape resolved this
bug.
<P>
Update<BR>

     Netscape has confirmed the bug, and has a fix for it. I don't know
when the new release will be available
     (check out their web site).<BR>
     ZDnet has a report on this bug. You may want to check out their
site:
     <A HREF="http://www5.zdnet.com/zdnn/content/zdnn/0725/zdnn0005.html">
	 http://www5.zdnet.com/zdnn/content/zdnn/0725/zdnn0005.html</A>
<P>
Kuo Chiang (kcchiang@iti.gov.sg)<BR>
Assoc Member of Technical Staff,<BR>
Information Technology Institute (Singapore).<BR>
</UL>







<FONT COLOR="Silver"><B>17/07/97</B></FONT>
<BR>
<UL><TT><B>IN: NTsecurity mailing list</B></TT><P>
From: Aleph One <BR>
Subject:      Another hole poked in Communicator<BR>
To: BUGTRAQ@NETSPACE.ORG<BR>


<A HREF="http://www.news.com/News/Item/0.4.12840,00.html?latest">
http://www.news.com/News/Item/0.4.12840,00.html?latest</A>
<P>
                Another hole poked in
                Communicator
                By Alex Lash
                July 25, 1997, 7:10 p.m. PT
<P>
                Netscape Communications (NSCP) today
                confirmed that another hole has been
                punched in its Communicator browser, the
                fourth one since the product shipped in June.
<P>
                Discovered by Kuo Chiang of the Singapore's
                Information Technology Institute, the security
                flaw affects both Macintosh and Windows
                versions of Communicator. It produces
                identical results to two previous flaws related
                to JavaScript, a scripting language Netscape
                invented and uses in its browsers. It allows a
                Web site administrator to place a
                nearly-invisible applet on a user's hard drive
                then track the user's progress across the
                Web, including any data the surfer types into
                the browser such as credit card numbers.
<P>
                The company knew about the bug yesterday
                and has already fixed it, according to senior
                security product manager David Andrews. A
                new version of Communicator will be
                available in two weeks to coincide with a
                scheduled software upgrade. Users will have
                to download the entire suite to patch the
                security flaw.
<P>
                Despite having identical results to two
                previous JavaScript holes, the latest bug is
                due to the company's use of LiveConnect, a
                separate language used to connect Java and
                JavaScript, Andrews said.
<P>
                "LiveConnect is the way Java and JavaScript
                communicate with each other. It's exposing
                information that it shouldn't be."
<P>
                Not nearly as scrutinized as Java and ActiveX,
                JavaScript and other scripting languages are
                nonetheless used extensively to deliver
                information to browsers. Andrews insisted
                that the architecture of JavaScript and
                LiveConnect are not problematic, but their
                implementation in the browser software has
                created security breaches.
<P>
                Microsoft's browsers were also affected by
                the previous JavaScript bugs. The company
                released a patch for Internet Explorer 3.0
                earlier this week. It is unclear if the latest bug
                affects Explorer as well.
                Another hole poked in
                Communicator
                By Alex Lash
                July 25, 1997, 7:10 p.m. PT
<P>
                Netscape Communications (NSCP) today
                confirmed that another hole has been
                punched in its Communicator browser, the
                fourth one since the product shipped in June.
<P>
                Discovered by Kuo Chiang of the Singapore's
                Information Technology Institute, the security
                flaw affects both Macintosh and Windows
                versions of Communicator. It produces
                identical results to two previous flaws related
                to JavaScript, a scripting language Netscape
                invented and uses in its browsers. It allows a
                Web site administrator to place a
                nearly-invisible applet on a user's hard drive
                then track the user's progress across the
                Web, including any data the surfer types into
                the browser such as credit card numbers.
<P>
                The company knew about the bug yesterday
                and has already fixed it, according to senior
                security product manager David Andrews. A
                new version of Communicator will be
                available in two weeks to coincide with a
                scheduled software upgrade. Users will have
                to download the entire suite to patch the
                security flaw.
<P>
                Despite having identical results to two
                previous JavaScript holes, the latest bug is
                due to the company's use of LiveConnect, a
                separate language used to connect Java and
                JavaScript, Andrews said.
<P>
                "LiveConnect is the way Java and JavaScript
                communicate with each other. It's exposing
                information that it shouldn't be."
<P>
Not nearly as scrutinized as Java and ActiveX,
JavaScript and other scripting languages are
nonetheless used extensively to deliver
information to browsers. Andrews insisted
that the architecture of JavaScript and
LiveConnect are not problematic, but their
implementation in the browser software has
created security breaches.
<P>
Microsoft's browsers were also affected by
the previous JavaScript bugs. The company
released a patch for Internet Explorer 3.0
earlier this week. It is unclear if the latest bug
affects Explorer as well.
Another hole poked in
Communicator
By Alex Lash
July 25, 1997, 7:10 p.m. PT
<P>
Netscape Communications (NSCP) today
confirmed that another hole has been
punched in its Communicator browser, the
fourth one since the product shipped in June.
<P>
Discovered by Kuo Chiang of the Singapore's
Information Technology Institute, the security
flaw affects both Macintosh and Windows
versions of Communicator. It produces
identical results to two previous flaws related
to JavaScript, a scripting language Netscape
invented and uses in its browsers. It allows a
Web site administrator to place a
nearly-invisible applet on a user's hard drive
then track the user's progress across the
Web, including any data the surfer types into
the browser such as credit card numbers.
<P>
The company knew about the bug yesterday
and has already fixed it, according to senior
security product manager David Andrews. A
new version of Communicator will be
available in two weeks to coincide with a
scheduled software upgrade. Users will have
to download the entire suite to patch the
security flaw.
<P>
Despite having identical results to two
previous JavaScript holes, the latest bug is
due to the company's use of LiveConnect, a
separate language used to connect Java and
JavaScript, Andrews said.
<P>
"LiveConnect is the way Java and JavaScript
communicate with each other. It's exposing
information that it shouldn't be."
<P>
Not nearly as scrutinized as Java and ActiveX,
JavaScript and other scripting languages are
nonetheless used extensively to deliver
information to browsers. Andrews insisted
that the architecture of JavaScript and
LiveConnect are not problematic, but their
implementation in the browser software has
created security breaches.
<P>
Microsoft's browsers were also affected by
the previous JavaScript bugs. The company
released a patch for Internet Explorer 3.0
earlier this week. It is unclear if the latest bug
affects Explorer as well.



</UL>


<FONT COLOR="Silver"><B>17/07/97</B></FONT>
<BR>
<UL>
O server <A HREF="http://neuro.pidt.bppt.go.id" target="_top">neuro.pidt.bppt.go.id</A> foi hackado pela 
<A HREF="http://www.catalao.pt/coders/UrBaNKa0s/" taget="_top">UrBaN Ka0s Org</A>.
</UL>
</UL>
<P>


<FONT COLOR="Silver"><B>14/07/97 </B></FONT>
<BR>
<UL>
<TT><B>IN: NTsecurity mailing list</B></TT><P>
From: Weld Pond <A HREF="mailto:weld@l0pht.com">weld@l0pht.com</A><BR>
To: ntsecurity@iss.net<BR>
Subject: [NTSEC] Announce - L0phtCrack 1.5 available<P>

L0phtCrack 1.5<BR>
Released 7/12/97<P>

Available at <A HREF="http://www.l0pht.com/advisories.html">http://www.l0pht.com/advisories.html</A>
<P>
mudge@l0pht.com<BR>
weld@l0pht.com 
<P>
OVERVIEW
<P>
L0phtCrack 1.5 is a tool for turning Microsoft LANMAN and NT password
hashes back into the original clear text passwords.  The program
does this using dictionary cracking and also brute force.  L0phtCrack
1.5 returns not just the LANMAN passord but the NT password up to 14
characters in length.
<BR>
Version 1.0 of L0phtCrack was deficient because the graphical version
of the program did not support the brute force method.  This has been
fixed for version 1.5.  The brute force efficiency has been improved
and an option to select the character set that makes up the password
has been added.
<BR>
The default behavior of L0phtCrack is to do a dictionary attack on the
password file and then brute force the remaining uncracked passwords.
Sample password files are named pwfile.txt, pwfile2.txt, pwfile3.txt
and pwfile4.txt.  A 28000 word dictionary file is included named
wfile.txt.  You can dump passwords directly from L0phtCrack if you have
administrator rights.
<BR>
L0phtCrack 1.5 includes the ability to dictionary attack or brute force
the network NT server challenge that is used to prevent the OWF from
going across the wire in its plaintext format.  Sample network sniffed
challenges are in files sniff.txt and sniff2.txt.  This means you
can get NT passwords without administrator privileges if you have network
access between the client and the server.
<BR>
You can build the sniff files by hand using your favorite network analyzer
or wait for our tool which sniffs the network and builds these files.
The sniffing tool will be made available shortly.  
<BR>
Also to be made available shortly is a commercial multiprocessor version,
L0phtCrack/SMP 1.5 for NT and Solaris.  Contact l0phtcrack@l0pht.com for
more information. 
<BR>
...............
</UL>
<P>




<FONT COLOR="Silver"><B>14/07/97 </B></FONT>
<BR>
<UL>
<TT><B>IN: P&uacute;blico - Sec&ccedil;&atilde;o Computadores</B></TT><P>

Piratas "roubam" tempo de acesso &agrave; Internet<BR>
O nome da Telepac foi usado por um grupo de utilizadores dos "newsgroups", que 
em nome da empresa, solicitaram aos clientes o envio da identifica&ccedil;&atilde;o e da respectiva 
"password". A solicita&ccedil;&atilde;o apareceu no "newsgroup" IRC a 23 de Junho, com os "piratas" 
a amea&ccedil;arem o corte da liga&ccedil;&atilde;o para quem n&atilde;o divulgasse estas informa&ccedil;&otilde;es 
sigilosas. "S&oacute; em dois ou tr&ecirc;s casos os clientes forneceram as passwords, mas solicitaram 
imediatamente &agrave; Telepac que fossem mudadas, antes de serem usadas", disse ao P&uacute;blico 
Jose Silva Lopes, director de comunica&ccedil;&atilde;o da empresa. "A sitau&ccedil;&atilde;o est&aacute; sobre controlo",
disse o mesmo responsavel, adiantando que a Pol&iacute;cia Judici&aacute;ria j&aacute; est&aacute; a investigar 
o caso para tentar descobrir os autores desta tentativa de burla que visava o 
uso em proveito pr&oacute;prio dos cr&eacute;ditos de tempo das vitimas para acesso &agrave; Net.
</UL>
<P>






<FONT COLOR="Silver"><B>12/07/97 </B></FONT>
<BR>
<UL>
<TT><B>IN: RECORTES - 10/Julho/1997</B></TT><P>

CASO MAIL.TELEPAC.PT: NOVAS REVELA&Ccedil;&Otilde;ES<BR>
	Segundo uma fonte bem informada da Telepac, a explica&ccedil;&atilde;o oficial dada
para justificar os problemas no server de correio n&atilde;o est&atilde;o totalmente
correctas (ver Recortes do dia 3 de Julho). Recordamos que explica&ccedil;&atilde;o
oficial para o server ter estados quase tr&ecirc;s dias em baixo foi originado
por um ataque de spamming (ou "spuming", como foi noticiado no jornal
P&uacute;blico :). No entanto, a nossa fonte garantiu que tal nunca aconteceu
tendo o problema sido originado pela sobrecarga dos dois servers. De
facto, os servers de mail da Telepac j&aacute; sofreram diversas actualiza&ccedil;&otilde;es de
hardware para gerir o aumento de tr&aacute;fego mas o software nunca foi
actualizado. Nos &uacute;ltimos tempos j&aacute; haveria sintomas de colapso - sobretudo
nos fins de semana onde o tr&aacute;fego &eacute; maior. Segundo a mesma fonte, a
Digital Portuguesa apenas respondeu aos pedidos insistentes de assist&ecirc;ncia
t&eacute;cnica ao fim de 27 horas - contrariando o estipulado no contrato de
assist&ecirc;ncia que obriga a um tempo de resposta m&aacute;ximo de 4 horas. Na altura
de fecho desta edi&ccedil;&atilde;o da Recortes n&atilde;o nos foi poss&iacute;vel contactar nenhum
respons&aacute;vel da Digital. Nos dias seguintes ao "estouro" e visto que os
backups n&atilde;o funcionaram como era suposto, a recupera&ccedil;&atilde;o de dados fez-se
duma forma quase manual - o que, ali&aacute;s, explica a morosidade e o que se
passou com alguns leitores da Recortes: uns nunca receberam um n&uacute;mero da
Recortes, outros receberam-no v&aacute;rias vezes e outros receberam texto
misturado com uma s&eacute;rie de lixo.
<P>
CIENTISTAS DA IBM PROP&Otilde;EM NOVO M&Eacute;TODO DE ENCRIPTA&Ccedil;&Atilde;O <BR>
	Dois investigadores do IBM Almaden Research Center em San Jos&eacute;,
Calif&oacute;rnia, desenvolveram uma nova aproxima&ccedil;&atilde;o &agrave; criptografia de chave
p&uacute;blica baseada em constru&ccedil;&otilde;es matem&aacute;ticas chamadas lattices (em Portugu&ecirc;s
significa algo como "janela de grade"). O sistema &eacute; gerado numa s&eacute;rie de
hiper planos que constituem a chave privada e um m&eacute;todo de gera&ccedil;&atilde;o de
pontos pr&oacute;ximos de um dos hiper planos para a chave p&uacute;blica. A seguran&ccedil;a
do sistema assenta na dificuldade de computar a menor dist&acirc;ncia que liga
quaisquer dois pontos numa dada lattice. N&atilde;o se preocupe se n&atilde;o percebeu a
explica&ccedil;&atilde;o matem&aacute;tica - o que isto significa no fundo &eacute; que este algoritmo
&eacute; extremamente dif&iacute;cil de partir atrav&eacute;s de for&ccedil;a bruta conferindo assim
um grau de seguran&ccedil;a superior aos algoritmos existentes.
</UL>
<P>


<FONT COLOR="Silver"><B>10/07/97</B></FONT>
<BR>
<UL>
Hackers causaram preju&iacute;zo de US$ 100 milh&otilde;es<BR>
Fonte: ZAZ/IDG
<P>
     Se voc&ecirc; ainda acredita que hacker &eacute; apenas uma inven&ccedil;&atilde;o da ind&uacute;stria cinematogr&aacute;fica, est&aacute; na hora de mudar de opini&atilde;o.
     Estudo conduzido pelo FBI junto ao Computer Security Institute (CSI), aponta que 75% de 563 especialistas em sistemas de
     seguran&ccedil;a das maiores companhias americanas entrevistados relataram perdas financeiras no &uacute;ltimo trimestre devido a
     brechas nos sistemas de seguran&ccedil;a das empresas em que trabalham. 
<P>
     As invas&otilde;es dos hackers foram realizadas com inten&ccedil;&atilde;o de fraudes financeiras, roubos de informa&ccedil;&otilde;es sigilosas e
     sabotagens usando v&iacute;rus de computador. A soma dos danos a 249 companhias entrevistadas totalizou mais de US$ 100
     milh&otilde;es - em estimativa conservadora. "Boa parte das empresas ainda n&atilde;o sabe como reportar esse tipo de crime &agrave;s
     autoridades e muitas n&atilde;o identificam sequer o ataque de hackers a seus sistemas", disse Patrice Rapalus, diretor do CSI. 
<P>
     H&aacute; outros dados importantes apontados pelo estudo. Aumentou em 10% o n&uacute;mero de gerentes de CDP que citam a conex&atilde;o
     de Internet como freq&uuml;ente ponto de ataque dos hackers. Enquanto 43% dos entrevistados aponta que suas empresas foram
     atacadas por agentes externos entre 1 e 5 vezes, 45% dos question&aacute;rios n&atilde;o esclarecem se esses ataques foram realizados
     interna ou externamente. 
<P>
     Mais de 60% das pessoas que responderam aos question&aacute;rios dizem que n&atilde;o existe em suas companhias um respons&aacute;vel
     para agir em caso de emerg&ecirc;ncia contra um ataque de hackers. Outra estat&iacute;stica gritante: apenas 17% dos casos de ataques
     contra os sistemas das empresas foram relatados &agrave;s autoridades do pa&iacute;s. 
</UL>
</UL>
<P>


<FONT COLOR="Silver"><B>09/07/97</B></FONT>
<BR>
<UL>
O server <A HREF="http://www.ejikman.go.id" target="_top">www.ejikman.go.id</A> foi hackado pela 
<A HREF="http://www.urbankaos.org">UrBaN Ka0s Org</A>.
</UL>
</UL>
<P>


</FONT>
</BODY>
</HTML>