<HTML>
<HEAD>
<TITLE>.pt zine - O Hacker Portugu&ecirc;s</TITLE>
</HEAD>
<BODY BGCOLOR="Black" TEXT="#000000" LINK="Green" VLINK="Red">
<IMG SRC="pt_small.gif" WIDTH=452 HEIGHT=81 BORDER=0>
<P>
<FONT SIZE="5" FACE="Arial" COLOR="#FFC639">
<B>O Hacker Portugu&ecirc;s:</B><BR>
------------------------------------------ 
</FONT>
<BR>
<FONT SIZE="3" FACE="Arial" COLOR="#FFC639">
by secretos
<P>

Ap&oacute;s uma investiga&ccedil;&atilde;o de 3 meses, a recolher informa&ccedil;&otilde;es, finalmente consegui 
finalizar a primeira estat&iacute;stica sobre a comunidade hacker Portuguesa.
A primeira conclus&atilde;o foi que a maioria dos hackers portugueses usam nicknames 
ingleses, buscando influencias aos computadores, &agrave; Net, a filmes ou grupos 
musicais.  &Eacute; raro encontrar hackers com "alcunhas" puramente portuguesas.<BR>
A faixa et&aacute;ria em que se encontram a maior parte dos hacker's &eacute; entre os 17 
e os 23 anos. <BR>
52,3% dos hackers portugueses vive na zona da Grande Lisboa, 32% na 
zona do Grande Porto e 15,7% no restante territ&oacute;rio nacional.<BR>
Um hacker lusitano tem computador &agrave; 10/11 anos e passa em m&eacute;dia entre 4 a 9 
horas por dia em frente ao computador. <BR>
50% dos hackers s&atilde;o Universit&aacute;rios, 40% est&aacute; a estudar no secund&aacute;rio e os 
restantes 10% trabalham.<BR>
Quase todos os hackers gostam de ler. Por ordem decrescente costumam ler 
as seguintes revistas, jornais ou zines: Cyber.net, Exame Inform&aacute;tica, 
Phrack, .pt zine (!!!), Linux Journal, PC Magazine, Blitz, Wired, 2600, etc...<BR>
Os Portugas nos seus computadores usam em "plena harmonia" o windows95 e  
Linux, sendo de igual n&uacute;mero o pessoal que usa RedHat e Slackware. Tambem 
existe hacker's que usam o Windows NT em vez do 95 e outros SO's tais como 
SunOS, NOVELL, SCO Openserver, etc....<P>
No que toca a gostos musicais, eles s&atilde;o muito dispersos, mas quase todos 
gostam de ouvir musica "pesada" tal como Metal, Gothic, Punk e Industrial.
Para citar alguns grupos preferidos: Prodigy, Marylin Manson, Metallica,
Moonspell, Nirvana, Garbage, etc...
<P>

O hacker standard Portugu&ecirc;s:<BR>
<DD>	- tem em m&eacute;dia 19/20 anos;
<DD>	- mora nos grandes centros urbanos de Lisboa ou Porto;
<DD>	- &eacute; estudante universit&aacute;rio;
<DD>	- usa computador h&aacute; 10 anos;
<DD>	- passa em m&eacute;dia entre 6 a 8 horas em frente ao computador;
<DD>	- Usa um Pentium a correr Windows95 e Linux (RedHat ou Slackware);
<DD>	- para ele hacker &eacute; auto-aprendizagem;
<DD>	- costuma ler a Cyber.net, a Phrack e a Exame Inform&aacute;tica
<DD>	- Gosta de m&uacute;sica "pesada" e adora Prodigy;

<P>
Saindo fora das "estat&iacute;sticas" obtidas e passando para minha a conviv&ecirc;ncia IRL 
(IN Real Life) com alguns hackers, posso-vos adiantar algumas particularidades.
<P>
Um hacker &eacute; uma pessoa normal, veste-se como uma pessoa normal, tem amigos, 
tem hobbies (alem dos computadores, claro), tem namorada, estuda ou trabalha 
honestamente.<BR>
O conceito de o hacker ser um tipo magrinho, com &oacute;culos, de jeans, T-shirt, 
sapatilhas e ser um solit&aacute;rio &eacute; pura fantasia de certos media e das pessoas 
que n&atilde;o est&atilde;o dentro deste meio.
<P>
A diferen&ccedil;a que noto entre um hacker e uma pessoa normal &eacute; que o hacker se 
n&atilde;o sabe alguma coisa vai procurar info sobre ela, investiga, explora at&eacute; 
ficar satisfeito com as respostas, enquanto a pessoa normal pede a algu&eacute;m 
que lhe explique ou paga a algu&eacute;m que lhe explique. &Eacute; este gosto pela 
auto-aprendizagem, pela investiga&ccedil;&atilde;o e explora&ccedil;&atilde;o dos problemas que torna 
um hacker uma pessoa especial.
<P>
</FONT>

<P>
&nbsp;
<P>
<A HREF="http://www.complex-x.net/kaotik/"><IMG SRC="kaotikm1.gif" WIDTH=147 HEIGHT=50 BORDER=1></A>

</BODY>
</HTML>
