<HTML>
<HEAD>
<TITLE>.pt zine - Web Spoofing</TITLE>
</HEAD>
<BODY BGCOLOR="Black" TEXT="#000000" LINK="Green" VLINK="Red">
<IMG SRC="pt_small.gif" WIDTH=452 HEIGHT=81 BORDER=0>
<P>
<FONT SIZE="5" FACE="Arial" COLOR="#FFC639">
<B>Web Spoofing:</B><BR>
----------------------
</FONT>
<BR>
<FONT SIZE="3" FACE="Arial" COLOR="#FFC639">
Documento traduzido e adaptado por Mag00<BR>
Fonte: Web Spoofing: An Internet Con Game<BR>
por Edward W. Felten, Dirk Balfanz, Drew Dean e Dan S. Wallach
<P>


    Aqui iremos descrever um ataque que pode por em perigo a privacidade dos 
utilizadores da World Wide Web. <P>
    O ataque, designado por Web Spoofing, consiste em criar uma "c&oacute;pia sombra" 
de toda a WWW. Os acessos &agrave; WWW sombra s&atilde;o transmitidos atrav&eacute;s da maquina de 
onde est&aacute; a ser lan&ccedil;ado o ataque, permitindo ao hacker observar todas as
actividades da v&iacute;tima, incluindo quaisquer passwords ou n&uacute;meros de conta que a 
v&iacute;tima envie atrav&eacute;s da WWW. O hacker pode tamb&eacute;m modificar quaisquer 
informa&ccedil;&otilde;es que sejam enviadas da v&iacute;tima para o server ou vice-versa. Em 
resumo, o hacker observa e controla tudo o que a v&iacute;tima faz na Web. <P>
    A falsa WWW &eacute; criada pelo hacker de forma a que seja igual &agrave; verdadeira 
WWW: ela contem exactamente as mesmas p&aacute;ginas e links; no entanto, o hacker 
controla tudo o que se passa entre o browser da v&iacute;tima e a Web. <P>
    O hacker pode actuar de duas maneiras, ao usar a t&eacute;cnica de web spoofing: 
pode ser apenas um observador (observa&ccedil;&atilde;o passiva) ou pode alterar os dados 
que circulam entre a vitima e a verdadeira Web (manipula&ccedil;&atilde;o). <P>
    Observa&ccedil;&atilde;o passiva: O hacker pode passivamente observar o tr&aacute;fico, gravando 
as p&aacute;ginas que a v&iacute;tima visita e os conte&uacute;dos dessas mesmas p&aacute;ginas. Quando a 
v&iacute;tima preenche um formul&aacute;rio (form), os dados inseridos s&atilde;o transmitidos para 
o servidor da Web, portanto o hacker pode gravar isso tamb&eacute;m, assim como a 
resposta enviada pelo servidor. Como a maioria do comercio on-line &eacute; feito por 
interm&eacute;dio de formul&aacute;rios, significa que o hacker pode observar quaisquer 
numeros de conta ou passwords que a v&iacute;tima envie para o servidor da Web. Como 
iremos ver mais &agrave; frente, o hacker pode observar os dados enviados pela v&iacute;tima 
mesmo que esta tenha uma liga&ccedil;ao segura (normalmente por interm&eacute;dio de Secure 
Sockets Layer) ao server, ou seja, mesmo que no browser da v&iacute;tima apare&ccedil;a o 
&iacute;cone indicador de uma liga&ccedil;&atilde;o segura (normalmente a imagem de uma fechadura 
ou de uma chave). <P>
    Manipula&ccedil;&atilde;o: O hacker pode tambem modificar quaisquer dados que viagem em 
qualquer direc&ccedil;&atilde;o entre a v&iacute;tima e a Web. Pode modificar os dados de um 
formul&aacute;rio preenchido pela v&iacute;tima, mudando, por exemplo, o endere&ccedil;o para o 
qual um determinado produto deve ser enviado. Pode tamb&eacute;m modificar a 
resposta ao formul&aacute;rio (ou outra coisa qualquer) enviada pelo servidor da 
Web. 
  <P>
    Ao contr&aacute;rio do que se possa pensar, spoofar toda a WWW n&atilde;o constitui 
grande dificuldade. O hacker n&atilde;o precisa de armazenar todo o conte&uacute;do da 
Web, uma vez que esta se encontra dispon&iacute;vel on-line; o servidor que o hacker 
usa para o ataque apenas necessita de trazer as p&aacute;ginas da verdadeira Web 
quando precisa de providencia-la &agrave; v&iacute;tima na falsa Web. 
  <P>
  
Como funciona o ataque...
<P>
    A chave para este ataque &eacute; o server de Web do hacker ficar entre a v&iacute;tima 
e o resto da Web. Chama-se a isto "homem no meio do ataque" 
("man in the middle attack") na giria de seguran&ccedil;a. 
    Em primeiro lugar deve proceder-se &agrave; reescrita de todos os URLs numa p&aacute;gina 
da Web, de modo a que elas apontem para o server do hacker em vez de um 
qualquer servidor real. Assumindo que o server do hacker est&aacute; na maquina 
www.hacker.pt, o hacker reescreve uma URL adicionando http://www.hacker.pt &agrave; 
frente do URL. Por exemplo,  http://free.east.timor.id fica 
http://www.hacker.pt/http://free.east.timor.id 
(a t&eacute;cnica de reescrita de URLs foi usada por outras raz&otilde;es em v&aacute;rios sites da 
Web, incluindo o Anonymizer - http://www.anonymizer.com - e o 
Zippy filter - http://www.metahtml.com/apps/zippy/welcome.mhtml) 
    Quando a v&iacute;tima pede uma p&aacute;gina da Web, os seguintes passos ocorrem: 
<P>
<DD>   1. O browser da v&iacute;tima pede a p&aacute;gina ao servidor do hacker 
<DD>   2. O servidor do hacker pede a p&aacute;gina ao servidor real 
<DD>   3. O servidor real fornece a p&aacute;gina ao servidor do hacker 
<DD>   4 .O servidor do hacker reescreve a p&aacute;gina, mudando todos os URLs do 
   documento, colocando http://www.hacker.pt antes de cada um deles 
<DD>   5. O servidor do hacker fornece a vers&atilde;o reescrita da p&aacute;gina &agrave; v&iacute;tima. 
<P>
    Como todos os URLs na p&aacute;gina reescrita apontam agora para 
http://www.hacker.pt, se a v&iacute;tima seguir um link na nova p&aacute;gina, a p&aacute;gina ser&aacute; 
trazida outra vez atrav&eacute;s do servidor do hacker. A v&iacute;tima continua presa na 
falsa Web do hacker e pode seguir links para sempre sem dela sair. 
<P>
    Tamb&eacute;m os formul&aacute;rios (forms) podem ser alterados, uma vez que estes se 
encontram integrados nos protocolos b&aacute;sicos da Web: as submiss&otilde;es dos 
formul&aacute;rios s&atilde;o codificadas nos pedidos da Web e as respostas s&atilde;o em vulgar 
HTML; como qualquer URL pode ser spoofado, ent&atilde;o os formul&aacute;rios tambem podem. 
O hacker pode assim modificar quaisquer dados enviados num formul&aacute;rio para o 
verdadeiro servidor da Web e tamb&eacute;m alterar a resposta do servidor &agrave; submiss&atilde;o 
do formul&aacute;rio. 
<P>  

As liga&ccedil;&otilde;es "seguras" n&atilde;o servem de nada...
<P>
    Mesmo que a v&iacute;tima traga uma p&aacute;gina por interm&eacute;dio de uma liga&ccedil;&atilde;o "segura" 
(usando normalmente o Secure Sockets Layer), o ataque funciona na perfei&ccedil;&atilde;o e 
tudo parece normal &agrave; v&iacute;tima. Isto acontece porque, na verdade, existe uma 
liga&ccedil;&atilde;o "segura"; no entanto, essa liga&ccedil;&atilde;o &eacute; ao servidor do hacker 
(http://www.hacker.pt) e n&atilde;o ao local a que a v&iacute;tima pensa que &eacute;.
O browser da v&iacute;tima pensa que tudo est&aacute; bem: foi-lhe indicado que acedesse a 
um URL em http://www.hacker.pt, portanto ele fez uma liga&ccedil;&atilde;o "segura" a 
http://www.hacker.pt. O indicador de liga&ccedil;&atilde;o-segura (a chave ou a fechadura) da 
&agrave; v&iacute;tima apenas um falso juizo de seguran&ccedil;a. 
  <P>

Come&ccedil;ando o ataque...
<P>
    Para come&ccedil;ar um ataque, o hacker tem que, de algum modo, atrair a v&iacute;tima 
para a sua falsa Web. Existem diversas maneiras de fazer isso: o hacker pode 
por um link para a falsa Web numa p&aacute;gina popular da WWW; pode mandar um e-mail 
&agrave; v&iacute;tima com um link para a falsa Web, ou mesmo com os conte&uacute;dos da p&aacute;gina da 
falsa Web; pode,  tamb&eacute;m, fazer com que um mecanismo de busca da Web indicie 
parte da falsa Web. <BR>
    No entanto, o ataque descrito at&eacute; agora est&aacute; ainda longe de ser perfeito. 
&Eacute; necess&aacute;rio "disfar&ccedil;a-lo", para que a v&iacute;tima n&atilde;o descubra que esta a "passear" 
na falsa Web. <BR>
    O hacker pode, virtualmente, eliminar todas as pistas que restam da 
exist&ecirc;ncia do ataque. Isso &eacute; conseguido devido aos browsers mais modernos serem 
altamente customizaveis, sobretudo depois da inclus&atilde;o do Java nestes. 
<P>
A linha de status - esta linha aparece no fundo do browser e exibe varias 
mensages, normalmente estat&iacute;sticas de transfer&ecirc;ncias da Web que est&atilde;o a 
ocorrer. O ataque descrito at&eacute; agora deixa dois tipos de marcas na linha de 
status: primeiro, quando o ponteiro do mouse &eacute; levado para cima de um link, a 
linha de status mostra o URL para que esta a apontar - logo, a v&iacute;tima 
pode verificar que o URL foi reescrito; segundo, quando a p&aacute;gina est&aacute; a ser 
trazida, a linha de status indica resumidamente o servidor que est&aacute; a ser 
contactado - assim, a v&iacute;tima pode verificar que www.hacker.pt &eacute; o que aparece 
quando outro nome era esperado. <P>
    N&atilde;o &eacute; dif&iacute;cil esconder estas marcas - basta adicionar um programa em 
JavaScript a cada p&aacute;gina reescrita. Isto porque os programas em JavaScript 
s&atilde;o capazes de escrever na linha de status, permitindo ao hacker que a linha 
de status mostre &agrave; v&iacute;tima o que deveria aparecer na linha de status se esta 
estivesse na verdadeira Web. A linha de localiza&ccedil;&atilde;o - esta linha indica o URL 
da p&aacute;gina que est&aacute; a ser vista. A v&iacute;tima pode tamb&eacute;m escrever o URL na
linha de localiza&ccedil;&atilde;o (location line), enviando o browser para esse URL. O 
ataque descrito at&eacute; agora faz com que o URL reescrito apare&ccedil;a na linha de 
localiza&ccedil;&atilde;o, dando possivelmente &agrave; vitima a indica&ccedil;&atilde;o de que um ataque est&aacute; em 
progresso. <P>
    Esta marca pode ser escondida usando tamb&eacute;m o JavaScript. Um programa em 
JavaScript pode esconder a verdadeira linha de localiza&ccedil;&atilde;o, repondo-a por uma 
falsa que parece verdadeira e que est&aacute; exactamente no mesmo local. A falsa 
linha de localiza&ccedil;&atilde;o pode mostrar o URL que a v&iacute;tima espera ver, para alem de 
aceitar input do teclado, permitindo &agrave; v&iacute;tima escrever URL's normalmente. O 
programa em JavaScript pode reescrever as URL's que a v&iacute;tima inseriu antes de 
elas serem acedidas, "trancando" completamente a v&iacute;tima na falsa Web. 
A fonte do documento (document source) - os browsers mais populares oferecem 
um item no menu que permite ao utilizador examinar o c&oacute;digo de HTML da p&aacute;gina 
que est&aacute; a ser vista. Deste modo, o utilizador pode procurar URLs reescritas 
no c&oacute;digo de HTML e descobrir o ataque. <P>
    Mais uma vez, pode-se eliminar esta marca usando o JavaScript para esconder 
a barra do menu, substituindo-a por outra parecida com a original. Se a v&iacute;tima 
escolher a op&ccedil;&atilde;o "view document source" da barra de menu spoofada, o hacker 
pode abrir uma nova janela para mostrar o c&oacute;digo original (n&atilde;o reescrito) de 
HTML. A informa&ccedil;ao do documento - relacionado com o anterior esta a op&ccedil;&atilde;o do 
menu do browser "view document information". Esta mostra a informa&ccedil;&atilde;o incluindo 
o URL do documento. Esta marca pode ser spoofada como a anterior, repondo a 
barra do menu do browser. 
<P>
    Fica assim explicado como fazer um Web Spoofing limpo, sem deixar quaisquer 
marcas que possam permitir &agrave; v&iacute;tima descobrir o ataque. <P>
    Deve-se ainda referir que, como &eacute; obvio, n&atilde;o deve ser usado o computador do 
hacker (o vosso), pois uma eventual detec&ccedil;&atilde;o do ataque poderia trazer algumas 
consequ&ecirc;ncias indesejadas... 
<P>





</FONT>
</BODY>
</HTML>
