

<HTML>
<HEAD>
<META NAME="GENERATOR" CONTENT="Trhuchedit 2.0 DOS">
<TITLE>Correo</TITLE>
</HEAD>
<BODY text="#000000" bgColor=#ffffff link="#0000EE" vlink="#551A8B" alink="#FF0000"  background="http://303.ubik.to/S_frm.jpg">


<H1><CENTER>Correo<BR>
</CENTER></H1>
<BR><BR>


Esta secci&oacute;n est&aacute; dedicada a intercambiar ideas y
opiniones de todo tipo con nuestros lectores. Escriban a:
Virus Report, Guemes 160 of. 2 (1704) Ramos Mej&iacute;a, Prov.
de Buenos Aires, Argentina. E-Mail:
ubik@ubik.to Fido: 4:901/303
<BR><BR>
Hackers en Argentina
<BR><BR>
Veo que en la revista se dedican muchas lineas al tema
del hacking, entrevistando a hackers de todo el mundo y
describiendo los ingeniosos sistemas que utilizan en sus
pr&aacute;cticas.<BR><BR>
Si te pones a pensar, la Argentina es una verdadera
tierra de hackers, y si no se nota es porque todav&iacute;a no
hay en el pa&iacute;s cosas importantes para hackear. Fijate que
una de las m&aacute;s nefastas herencias que los inmigrantes
Argentinos les dejaron a los Espa&ntilde;oles es la de truchar
los tel&eacute;fonos p&uacute;blicos para hacer llamadas
internacionales, cosa que motiv&oacute; el odio de Telef&oacute;nica,
ya que los galleguitos (que no son tan brutos) siguen
usando los m&eacute;todos criollos.<BR><BR>
Sin ir m&aacute;s lejos, en Buenos Aires, La Plata, y todo lugar
que tenga universidades, se concentran grandes cantidades
de phreackers que utilizando los m&aacute;s diversos m&eacute;todos (el
broche, la birome, el clip con el cable etc) hacen
llamadas a larga distancia, a sus familias, y en algunos
casos llegan a bloquear los tel&eacute;fonos p&uacute;blicos de tal
manera que se forman colas en los mismos para poder
hablar horas sin paga un sope.<BR><BR>
Y hay m&aacute;s, en cierta ocasi&oacute;n, como recordar&aacute;s, el
gobierno de los E.E.U.U envi&oacute; a la embajada nuestra all&aacute;
una factura por algo m&aacute;s de dos palos verdes por llamadas
telef&oacute;nicas que nuestros compatriotas hab&iacute;an hecho
utilizando unas moneditas argentinas (de esas que ac&aacute;
ten&iacute;an un m&iacute;nimo valor) y que eran aceptadas por los
tel&eacute;fonos yanquis.<BR><BR>
En otras &aacute;reas, como ver televisi&oacute;n por cable, reducir el
consumo el&eacute;ctrico artificialmente (m&eacute;todo del im&aacute;n, o
invertir el medidor) usarle la linea telef&oacute;nica al vecino
que tiene tel&eacute;fono inal&aacute;mbrico, te aseguro que tambi&eacute;n
somos campeones. Como t&eacute;cnico electr&oacute;nico trabaj&eacute; en la
f&aacute;brica de juegos electr&oacute;nicos Florencia (Juegos Plaza,
Sacoa, ac&aacute; en Mardel) y no te das una idea de las cosas
que utilizan los pichones de hackers para jugar sin
pagar.<BR><BR>
En fin, no quiero emplomarte m&aacute;s, solo te digo que si
hicieran una investigaci&oacute;n se dar&iacute;an cuenta que cada
Argentino es un hacker en potencia y que si esto no se
manifiesta en la inform&aacute;tica es que esta esta todav&iacute;a
alejada del uso popular.
<BR><BR>
Daniel Flor&iacute;n, Mar del Plata
<BR><BR>
PD.: Ya est&aacute;n disponibles los m&eacute;todos para truchar los
boletos magn&eacute;ticos a implementarse en el transporte
urbano de pasajeros, que pr&oacute;ximamente se instalar&aacute; en
nuestra ciudad.
<BR><BR>

VR: Esto de que todo argentino es un hacker en potencia
es algo que ya hab&iacute;amos hablado con algunos de los que
escribimos en la revista. Justamente el caso de los
espa&ntilde;oles que mencion&aacute;s me hace acordar a un argentino
que conoc&iacute; en Barcelona, al cual le hab&iacute;an pasado la
receta para meterle un clip al tel&eacute;fono p&uacute;blico para
llamar gratis. Lo us&oacute; como vos dec&iacute;s, para pasarse horas
hablando con sus parientes en Buenos Aires. Por supuesto,
y como siempre sucede con estas cosas, al poco tiempo en
Telef&oacute;nica se dieron cuenta de lo que hac&iacute;an y el sistema
dej&oacute; de funcionar.<BR><BR>
Con respecto a los juegos de Sacoa, es una de los blancos
preferidos de las especulaciones de los hackers
adolescentes, m&aacute;s ahora con el sistema de tarjetas
magn&eacute;ticas. De todas formas ese sistema no parece f&aacute;cil
de hackear.
<BR><BR>
Interrogantes
<BR><BR>
I. Pregunta. Te escribo porque soy un lector de Virus
Report y en el numero 15 entrevist&aacute;s a los operadores de
Satanic Brain (creo que ya hab&iacute;as hecho una menci&oacute;n en un
numero anterior al BBS de intercambio de virus) y a mi me
interesar&iacute;a saber cual es el numero del mismo.<BR><BR>
II. Pregunta. Por otro lado, me falta un numero de VR y
me gustar&iacute;a saber como hacer para poder conseguirlo. En
realidad lo que quiero que me digas es si hay alguna otra
forma que no sea ir hasta Ramos Mej&iacute;a.<BR><BR>
III. Pregunta. El bar de San Jose aparece como sede de
reuniones de CACyF, 2600, etc. Me gustar&iacute;a que me
contaras brevemente que es lo que hacen. Yo estudio en la
Universidad CAECE que queda en San Jose y Av. de Mayo,
as&iacute; que me queda cerca. Lo que pasa es que los viernes a
la tarde tengo clase.<BR><BR>
IV. Dato. Por si te interesa, me entere de que hay dando
vuelta CDROM's (valga la met&aacute;fora) con c&oacute;digo fuente y
documentaci&oacute;n de virus.<BR><BR>
V. Felicitaci&oacute;n. Me parece muy buena la parte de an&aacute;lisis
de virus de la revista. Tambi&eacute;n es muy buena toda la
informaci&oacute;n que brindan sobre cosas que no est&aacute;n muy
difundidas.<BR><BR>

Un abrazo. Dr. Mork. (Carlos Gaudio)
<BR><BR>
VR:<BR><BR>
I. El n&uacute;mero de Satanic Brain preferimos no darlo a
conocer, ya que se dedican a distribuir virus.<BR><BR>
II. Para conseguir n&uacute;meros atrasados de Virus Report lo
m&aacute;s pr&aacute;ctico es venirse hasta Ramos Mej&iacute;a. Si no, pod&eacute;s
venirte un viernes a la reuni&oacute;n del CACyF en el bar de
San Jos&eacute; 05, a partir de las 19 horas, preferentemente el
primer viernes de cada mes. Conviene antes arreglar
telef&oacute;nicamente. Por correo no estamos enviando n&uacute;meros
atrasados.<BR><BR>
III. En ese bar de San Jos&eacute; y Rivadavia se re&uacute;nen todos
los viernes a partir de las 19 horas los socios del CACyF
(C&iacute;rculo Argentino de Ciencia Ficci&oacute;n y Fantas&iacute;a) Los
primeros viernes de cada mes a partir de las 17 horas se
re&uacute;nen los lectores de 2600, que casualmente son tambi&eacute;n
lectores de Virus Report en su mayor&iacute;a. La reuni&oacute;n de los
primeros viernes de cada mes es ahora una reuni&oacute;n de 2600
y de Virus Report, donde pod&eacute;s encontrarte a algunos de
los que escriben en esta revista.<BR><BR>
IV. Ya lo sab&iacute;amos. Tenemos dos de ellos. En cualquier
momento sale una rese&ntilde;a.<BR><BR>
V. Gracias.
<BR><BR>

<BR>
<hr>
<p align="center"><a href="http://www.ubik.to"><img src="http://303.ubik.to/S_uwdlogo.gif" alt="Logo de Ubik World Domination"  idth=  align=BOTTOM></a>
<hr>
</BODY>

</HTML>

