

<HTML>
<HEAD>
<META NAME="GENERATOR" CONTENT="Trhuchedit 2.0 DOS">
<TITLE>Publicaciones Non Sanctas </TITLE>
</HEAD>
<BODY text="#000000" bgColor=#ffffff link="#0000EE" vlink="#551A8B" alink="#FF0000"  background="http://303.ubik.to/S_frm.jpg">


<H1><CENTER>Publicaciones Non Sanctas <BR>
Por Aldo B. Castelar </CENTER></H1>
<BR><BR>





En esta entrega vamos a ver una revista muy pol&eacute;mica:
Computer Virus Development Quarterly.
<BR><BR>
Ya en un n&uacute;mero anterior habl&aacute;bamos del libro 'The Little
Black Book of Computer Viruses'. El mismo autor, gracias
al &eacute;xito que este libro tuvo, sac&oacute; una revista para
continuar con el tema. La revista sale cuatro veces al
a&ntilde;o, y se vende por subscripci&oacute;n en Estados Unidos.
De la misma manera que el libro, est&aacute; dedicada a la
difusi&oacute;n de los virus inform&aacute;ticos, a explicar c&oacute;mo
hacerlos, y a distribuir c&oacute;digo fuente completo de virus.
Cada ejemplar tiene 16 p&aacute;ginas, en un tama&ntilde;o similar a
Virus Report, pero con la diferencia de que cada n&uacute;mero,
con el disco, cuesta $25. Los &uacute;ltimos n&uacute;meros fueron
creciendo hasta 28 p&aacute;ginas del 2 del a&ntilde;o 2. Dec&iacute;amos que
el libro ten&iacute;a una parte 'pol&iacute;tica' donde el autor
aclaraba sus ideas sobre por qu&eacute; se deben escribir virus,
y otra parte t&eacute;cnica, donde ense&ntilde;aba con ejemplos
concretos a hacer virus sencillos. Ninguno de los virus
del libro es complicado, excepto uno que usa un poco de
stealth. La revista se promociona como que 'empieza donde
el libro termin&oacute;', y es una excelente descripci&oacute;n de la
misma. Con cada ejemplar hay un diskette que lo acompa&ntilde;a,
con el c&oacute;digo fuente de lo que se presenta en la revista
y programas de ejemplo, as&iacute; como virus ejecutables. En
los sucesivos n&uacute;meros va ahondando en las t&eacute;cnicas de
escritura de virus. Cada n&uacute;mero est&aacute; dedicado a alg&uacute;n
tipo de virus en especial. El n&uacute;mero 1 del a&ntilde;o 1 explica
c&oacute;mo hacer virus que enga&ntilde;en a los antivirus en forma
directa, con ejemplos, y un virus completo que muestra
esas t&eacute;cnicas. El segundo n&uacute;mero explica los virus que
atacan c&oacute;digo fuente, y tiene una rese&ntilde;a del Virus
Creation Lab. En el disco que acompa&ntilde;a este n&uacute;mero est&aacute;
el VCL completo. El n&uacute;mero tres viene con una nota muy
explicativa de las Mutation Engines. Incluye un
comentario sobre la MtE de Dark Avenger, la TPE de
Trident, y explica con todo detalle la Visible Mutation
Engine, creada especialmente por Mark Ludwig para su
revista, con fines did&aacute;cticos. La nota se llama
'dise&ntilde;ando una Mutation Engine', y explica paso a paso
c&oacute;mo hacer un virus polim&oacute;rfico. Adem&aacute;s de esta nota,
tiene informaci&oacute;n sobre el Microsoft Anti Virus y c&oacute;mo
falla en las pruebas que le hizo. Por supuesto, el
diskette incluido trae una copia de cada una de las
mutation engines rese&ntilde;adas, incluso la VME con fuente
completa en varias versiones.<BR><BR>
El n&uacute;mero 4 est&aacute; dedicado a los virus de modo protegido.
Explica c&oacute;mo usar el modo protegido del 386 para evitar
que los antivirus detecten a un virus, a&uacute;n en memoria.
Para explicarlo, da un tutorial sobre modo protegido,
bastante completo. Tambi&eacute;n provee de programas de ejemplo
para experimentar. Junto con esta nota sobre modo
protegido y su uso en virus, presenta un nuevo concepto
en virus, seg&uacute;n &eacute;l. Es un virus que pretende dar un
servicio a la persona que tiene su m&aacute;quina infectada con
&eacute;l, por lo tanto ser&iacute;a un virus 'bueno' o &uacute;til. Esa idea
ya hab&iacute;a sido presentada por Fred Cohen hace a&ntilde;os, pero
Mark Ludwig la presenta como implementada por primera
vez, aunque ya exist&iacute;a un virus que usaba esta idea, el
Cruncher, que comprime ejecutables. El virus, llamado
Potassium Hidroxide, escrito por King of Hearts (KOH,
s&iacute;mbolo qu&iacute;mico del hidr&oacute;xido de potasio), es un virus de
boot que encripta discos y diskettes. Es tan benigno que
hasta pide permiso antes de infectar. La discusi&oacute;n acerca
de si un virus es bueno o malo va m&aacute;s all&aacute; del alcance de
esta nota, pero sin duda trajo mucha pol&eacute;mica en Internet
y en muchos lugares. El virus est&aacute; incluido en el disco
en forma ejecutable, pero no en c&oacute;digo fuente. El fuente
fue reservado para publicaci&oacute;n posterior, y se distribuy&oacute;
en el n&uacute;mero 2 del a&ntilde;o 2, el &uacute;ltimo que sali&oacute; hasta el
momento.<BR><BR>
Tambi&eacute;n en este n&uacute;mero tenemos a Urnst Krouch, el editor
de Crypt Newsletter, rese&ntilde;ando cuatro BBS de virus de
Estados Unidos, y publicando su n&uacute;mero de tel&eacute;fono. Para
terminar, encontramos un discurso pol&iacute;tico sobre los
virus y su uso para luchar contra la tiran&iacute;a del
gobierno. Ese texto fue el que present&oacute; en un congreso de
Hackers en Las Vegas en 1993. Vale la pena detenernos
para ver la ideolog&iacute;a de Ludwig un momento. Lo que piensa
es que el gobierno est&aacute; cobrando impuestos, pidiendo
dinero por esto y por lo otro, dando permisos para operar
imprentas o neg&aacute;ndolos, dando permisos para operar radios
o neg&aacute;ndolos. Tambi&eacute;n el gobierno est&aacute; atacando contra la
privacidad. Seg&uacute;n &eacute;l el gobierno est&aacute; queriendo controlar
todo. Lo que dice es que el gobierno est&aacute; poni&eacute;ndose por
encima de dios, y que eso est&aacute; expresamente en contra de
la constituci&oacute;n de los Estados Unidos. Para eso dice que
est&aacute; apoyando el desarrollo del virus Potassium
Hidroxide, para darle a la gente el derecho de la
privacidad. Plantea un plan de acci&oacute;n que incluye: Luchar
en contra de los impuestos, y dejar de pagarlos.
Involucrarse en un grupo religioso que ponga a dios sobre
todas las cosas. Renunciar al concepto de 'licencia'.
Manejar sin licencia de conducir, etc&eacute;tera, para sacarle
al gobierno la autoridad de pedir licencia para esas
cosas. Piensa que el virus es la mejor forma de
distribuir programas o ideas en una sociedad controlada.
Indudablemente Ludwig es una persona muy metida en
pol&iacute;tica, y lo demuestra dando tanto espacio a esta
discusi&oacute;n. No es absolutamente claro por qu&eacute; los virus
son tan importantes en su esquema, ni, para pasar a un
plano m&aacute;s pol&iacute;tico, cu&aacute;l es la alternativa de gobierno
que plantea. Este tipo de discusiones abundan en su obra.
El n&uacute;mero 1 del segundo a&ntilde;o habla sobre virus para
Windows. Explica el funcionamiento de un ejecutable de
Windows y c&oacute;mo hacer un virus espec&iacute;fico para este tipo
de ejecutables. Tambi&eacute;n habla sobre tunneling,
presentando el m&eacute;todo del Dark Avenger (b&uacute;squeda de
strings determinados en el c&oacute;digo del BIOS, uno de los
m&eacute;todos que vimos en el n&uacute;mero anterior de VR), y
presentando dos m&eacute;todos m&aacute;s. Uno es usando el modo paso a
paso del procesador, como el virus Predator, y otro
usando el modo protegido. Ambos fueron explicados en
Virus Report 15. Para ambos presenta ejemplos completos,
no virus sino simples programas de demostraci&oacute;n, pero
f&aacute;cilmente adaptables a virus. Incluye tambi&eacute;n una nota
sobre Hacking at the End of the Universe, donde se queja
amargamente de que no se hizo ning&uacute;n tipo de hacking en
el evento.<BR><BR>
El n&uacute;mero 2 del a&ntilde;o 2 empieza con una entrevista a un
administrador de seguridad anti virus de una compa&ntilde;&iacute;a
grande de Estados Unidos. En esta nota trata de
desmitificar la problem&aacute;tica de los virus. En otra nota
expande la informaci&oacute;n sobre virus para Windows. Da la
impresi&oacute;n, por momentos, de que el autor va publicando
las cosas a medida de que las aprende o experimenta,
porque si no, no se explicar&iacute;a que nos presente a los
virus para Windows en tan c&oacute;modas cuotas. En este n&uacute;mero,
como ya dij&eacute;ramos, presenta el c&oacute;digo fuente completo del
virus Potassium Hidroxide y una descripci&oacute;n detallada de
c&oacute;mo funciona.<BR><BR>
En este n&uacute;mero tenemos otro discurso pol&iacute;tico hablando de
que la revista Computer Shopper les neg&oacute; el derecho de
publicar avisos pagos. Ludwig ve esto como 'censura', y
dice que Computer Shopper promociona productos
'pornogr&aacute;ficos' (se refiere a CD ROMs y programas
pornogr&aacute;ficos). Obviamente este es un caso de conflicto
de definiciones de qu&eacute; es malo y qu&eacute; es bueno, para la
Computer Shopper los virus son algo peligroso, para
Ludwig la pornograf&iacute;a es peligrosa.
<BR><BR>
Otros productos
<BR><BR>
La compa&ntilde;&iacute;a que edita la revista y los libros, American
Eagle Publications, se est&aacute; expandiendo y vendiendo otros
productos relacionados con el tema virus, manteniendo lo
que parece ser su pol&iacute;tica de precios altos y temas
discutidos. En su &uacute;ltimo cat&aacute;logo vemos un CD ROM lleno
de virus, con c&oacute;digo fuente. El segundo libro de la
colecci&oacute;n de Ludwig, 'Computer Viruses, artificial life
and evolution', tambi&eacute;n se ofrece, junto con el primero.
Tambi&eacute;n est&aacute; el virus Potassiun Hidroxide, en fuete y
ejecutable. Ofrece el libro Heiland, una ficci&oacute;n donde se
ve el uso de virus en la guerra, otro de los temas
favoritos de Ludwig. Otros &iacute;tems son notas t&eacute;cnicas sobre
virus y anti virus, y libros sobre encripci&oacute;n y libros
t&eacute;cnicos sobre la PC.
<BR><BR>
En definitiva, Mark Ludwig descubri&oacute; la parte comercial
de los virus, estando del otro lado, o sea, vendiendo
virus e informaci&oacute;n sobre c&oacute;mo hacerlos, y est&aacute; haciendo
plata con ellos.
<BR><BR>
Aldo B. Castelar es consultor en inform&aacute;tica en varias
empresas, y se desempe&ntilde;a en el campo de las
comunicaciones y de la programaci&oacute;n a bajo nivel. Tambi&eacute;n
es redactor de Virus Report. Ha cursado estudios no
formales en filosof&iacute;a y en literatura. Puede ser
contactado en aldo@ubik.to
<BR><BR>


<BR>
<hr>
<p align="center"><a href="http://www.ubik.to"><img src="http://303.ubik.to/S_uwdlogo.gif" alt="Logo de Ubik World Domination"  idth=  align=BOTTOM></a>
<hr>
</BODY>

</HTML>

