

<HTML>
<HEAD>
<META NAME="GENERATOR" CONTENT="Trhuchedit 2.0 DOS">
<TITLE>EN EL JARDIN DE LAS DELICIAS DIGITALES </TITLE>
</HEAD>
<BODY text="#000000" bgColor=#ffffff link="#0000EE" vlink="#551A8B" alink="#FF0000"  background="http://303.ubik.to/S_frm.jpg">


<H1><CENTER>EN EL JARDIN DE LAS DELICIAS DIGITALES <BR>
por Mart&iacute;n Sal&iacute;as </CENTER></H1>
<BR><BR>







Un film cyberpunk sobre realidades virtuales y el
desarrollo de inteligencias artificiales sobre hardware
biol&oacute;gico, con las secuencias generadas por computadora
m&aacute;s ambiciosas hasta hoy.

<BR><BR>

Esta pel&iacute;cula, que pas&oacute; pr&aacute;cticamente desapercibida por
las pantallas de los cines locales hace alrededor de una
a&ntilde;o, en el momento de su estreno, lleg&oacute; ahora al circuito
del video, y fue emitida recientemente por TV de cable.
Aunque su t&iacute;tulo original era "Stephen King's The
Lawnmower man" (lawnmower es la m&aacute;quina cortadora de
c&eacute;sped), los productores tuvieron que retirar el nombre
de King, autor del cuento en el que supuestamente se
basaba el argumento, por una querella que &eacute;ste mismo les
iniciara aduciendo que su historia nada ten&iacute;a que ver con
el resultado final. Esta diferenciaci&oacute;n, seg&uacute;n muchos
observadores tal vez no demasiado fan&aacute;ticos del prol&iacute;fico
escritor, en realidad benefici&oacute; a la pel&iacute;cula.
Ignorante de ese relato corto en cuesti&oacute;n, debo decir que
el film, si bien dista de ser una obra maestra, tiene
muchos puntos interesantes. Quiz&aacute; uno de los m&aacute;s
importantes, los detalles tecnol&oacute;gicos de su realizaci&oacute;n,
que concuerdan absolutamente con la historia que se
narra.<BR><BR>
El argumento, en forma sucinta, es una versi&oacute;n cyberpunk
del mito de Frankenstein. Si el cient&iacute;fico de Mary
Shelley era el 'Prometeo moderno', el doctor Angelo, en
este caso, bien podr&iacute;a ser el 'Prometeo posmoderno'. &Eacute;l
ha descubierto, experimentando con monos, un m&eacute;todo para
desarrollar la inteligencia a partir de drogas
espec&iacute;ficas, y ejercicios de estimulaci&oacute;n utilizando
realidades virtuales. Como es de esperar, en el devenir
de la trama el experimento pasa de los babuinos a un ser
humano, y el elegido en este caso es el jardinero que da
nombre al film.<BR><BR>
Lo cierto es que los equipos de realidad virtual
mostrados en la pantalla son la combinaci&oacute;n directa de
los &uacute;ltimos desarrollos y las m&aacute;s puras obsesiones cyber:
Headmounts (monitores est&eacute;reo montados en el casco),
data-gloves (guantes con sensores), y en los laboratorios
del gobierno donde trabaja el Dr.Angelo, vemos incluso
arneses completos girosc&oacute;picos para todo el cuerpo, y a
los participantes enfundados en Hotsuits (trajes enteros
con sensores para todo el cuerpo).<BR><BR>
Pero m&aacute;s atractivo que el hard que se muestra, es el
entorno virtual en el que se sumergen los protagonistas.
Las impactantes im&aacute;genes son en gran mayor&iacute;a producto del
estudio de animaci&oacute;n Xaos, liderado por Michael Tolson.
El equipo de animadores, artistas y programadores de
Tolson trabaj&oacute; durante muchos meses en sus workstations
Silicon Graphics para lograr SU visi&oacute;n particular de un
mundo virtual extraordinariamente surreal y detallado,
con efectos tremendos y una est&eacute;tica uniforme, que encaja
perfectamente con las ideas expuestas en la pel&iacute;cula.
As&iacute;, por ejemplo, podemos ver la mano del cient&iacute;fico
representada en un entorno virtual en el que selecciona
opciones de un men&uacute; formado por ventanas dispuestas a su
alrededor, o controla escalas y par&aacute;metros de sus
experimentos trabajando directamente sobre gr&aacute;ficos
tridimensionales.<BR><BR>
De esta forma el film gana en riqueza, al expresar una
idea altamente tecnol&oacute;gica con los recursos expresivos
m&aacute;s adecuados. La idea central es la de una mente
desarroll&aacute;ndose en forma similar a una inteligencia
artificial, pero sobre un cerebro humano. O sea que
estamos ante una mezcla entre el cyberespacio de Gibson,
el Wetware de Rudy Rucker (el componente org&aacute;nico de un
sistema inform&aacute;tico: el cerebro), y la avanzada expansiva
de esta inteligencia sobre la red de las comunicaciones
humanas, como en Neuromante, o en Synners, de Pat
Cadigan.<BR><BR>
El gran logro del director Leonard es el de conseguir el
equipo capaz de llevar a im&aacute;genes todo esto sin caer en
posturas absurdas o excesivamente ingenuas. La pel&iacute;cula,
si bien se extiende en terrenos menos formales como la
telekin&eacute;sis, y dem&aacute;s poderes mentales, nunca traiciona la
veta 'realista' desde el punto de vista t&eacute;cnico. Aqu&iacute; no
hay computadoras que exploten por sobrecargas de
informaci&oacute;n ni nada similar. En todo caso, hay posturas
extremas pero expuestas en forma difusa, al mejor estilo
Gibson, que no comprometen la veracidad del relato. Por
ejemplo, en el momento en que el jardinero intenta
integrar su inteligencia con la red, el Dr. Angelo
intentar&aacute; detenerlo con un virus que (al rev&eacute;s que el de
Neuromante, que romp&iacute;a las barreras defensivas de los
sistemas), le cierra al monstruo el acceso a las l&iacute;neas
de comunicaci&oacute;n con la red de la computadora en la que se
ha sumergido.<BR><BR>
En definitiva, El hombre del jard&iacute;n es un pel&iacute;cula
sumamente interesante para quienes se interesan en el
devenir de la tecnolog&iacute;a y los medios de comunicaci&oacute;n, y
a la vez un espect&aacute;culo digno de ser visto. Y, para los
que perdieron la oportunidad de verlo en cine, queda la
de conseguir la pantalla de TV m&aacute;s grande posible y
disfrutarlo en video, con el adicional de poder pegar un
repaso de algunas de las escenas m&aacute;s logradas. Queda
mencionar, para terminar, que el trabajo de la gente de
Xaos en su totalidad nos est&aacute; vedado, ya que muchas
escenas fueron suprimidas de la versi&oacute;n definitiva del
film, pero no por temas de la producci&oacute;n o el montaje,
sino porque en las primeras exhibiciones, gran parte del
p&uacute;blico expres&oacute; que ciertas escenas eran demasiado
"inquietantes"...
<BR><BR>
El hombre del jard&iacute;n, EE.UU., 1992<BR>
T&iacute;tulo original: The lawnmower man<BR>
Director: Brett Leonard.          <BR>
Int&eacute;rpretes: Pierce Brosnan, Jeff Fahey y Jenny Wright.<BR>
<BR>

Mart&iacute;n Sal&iacute;as trabaj&oacute; en Investigaci&oacute;n y Desarrollo en
una importante empresa nacional, dirigi&oacute; departamentos de
capacitaci&oacute;n y soporte, y hoy tiene su propia consultora,
Merino Aller & Asociados. Tambien es miembro del C&iacute;rculo
Argentino de Ciencia Ficci&oacute;n y Fantas&iacute;a (CACyF). A&ntilde;os
atr&aacute;s dirigi&oacute; la revista de ciencia ficci&oacute;n GURBO,
durante 12 n&uacute;meros, y posteriormente ha colaborado en
Otros Mundos, y otras publicaciones. Puede ser contactado
a trav&eacute;s de FidoNet  en 4:901/303.11 o Internet en
martin@ubik.satlink.net
<BR><BR>


<BR>
<hr>
<p align="center"><a href="http://www.ubik.to"><img src="http://303.ubik.to/S_uwdlogo.gif" alt="Logo de Ubik World Domination"  idth=  align=BOTTOM></a>
<hr>
</BODY>

</HTML>

