

<HTML>
<HEAD>
<META NAME="GENERATOR" CONTENT="Trhuchedit 2.0 DOS">
<TITLE>Cuando el Chaos Computer Club hacke&oacute; a la NASA </TITLE>
</HEAD>
<BODY text="#000000" bgColor=#ffffff link="#0000EE" vlink="#551A8B" alink="#FF0000"  background="http://303.ubik.to/S_frm.jpg">


<H1><CENTER>Cuando el Chaos Computer Club hacke&oacute; a la NASA <BR>
Por Fernando Blanco Dopazo </CENTER></H1>
<BR><BR>






El Chaos Computer Club es uno de los grupos de hackers
m&aacute;s famosos del mundo. En esta nota vemos por qu&eacute; su fama
es merecida.
<BR><BR>
Existe mucha controversia acerca del Chaos Computer Club
(CCC), el que sin duda fue el m&aacute;s c&eacute;lebre grupo de
hackers de toda la historia. Cont&oacute; entre sus miembros a
los m&aacute;s selectos hackers de aquella generaci&oacute;n. Su
"cuartel central" est&aacute; en la ciudad de Hamburgo
(Alemania), y a&uacute;n continua en actividad. Muchos de los
miembros m&aacute;s destacados de sus &eacute;pocas doradas, mediados y
fines de los '80, se han retirado de las actividades y
algunos de ellos son actualmente consultores en seguridad
inform&aacute;tica o asesores de grandes empresas en este tema.
El hecho que los destaca entre todos los distintos grupos
de hackers es el haber sido quienes pudieron ingresar m&aacute;s
profundamente a los "supersecretos" sistemas de la NASA.
Hay quienes los ensalzan hasta colocarlos en un nivel
m&iacute;tico, otros los defenestran sin piedad. Pero en general
lo que existe es un gran desconocimiento de quienes
fueron sus miembros y cuales sus actividades. Voy a
tratar de ofrecer en este art&iacute;culo algunos detalles
t&eacute;cnicos acerca de este espectacular hecho en la historia
del hacking.<BR><BR>
Todo esto sucedi&oacute; en m&aacute;quinas DEC, que corren bajo el
sistema operativo VMS. Para quienes no la conocen,
Digital Equipment Corporation (DEC) es una empresa l&iacute;der
en el mercado de las computadoras, y cuenta entre sus
usuarios una gran cantidad de empresas privadas e
instituciones gubernamentales en todo el mundo. Fue a
principios de 1987 o fines de 1986, cuando DEC lanz&oacute; al
mercado la versi&oacute;n 4.4 de su sistema operativo VAX/VMS.
Esta versi&oacute;n inclu&iacute;a algunas novedosas funciones de
seguridad. Una de estas funciones ten&iacute;a un horrible
agujero, a trav&eacute;s del cu&aacute;l los usuarios sin nivel de
acceso pod&iacute;an obtener privilegios para los que no estaban
autorizados. Si bien este bug fue corregido en las
versiones posteriores del sistema operativo, no voy a dar
m&aacute;s precisiones ya que hay todav&iacute;a algunas empresas e
instituciones en muchos pa&iacute;ses del mundo que todav&iacute;a
utilizan la versi&oacute;n 4.4.<BR><BR>
El CCC no realiz&oacute; el acceso a las computadoras de la NASA
a trav&eacute;s de un llamado directo. Sabemos de las medidas de
seguridad que tienen, que enseguida identificar&iacute;an a un
usuario extra&ntilde;o tratando de acceder a sus sistemas. Como
dice el viejo refr&aacute;n, que es ley para muchos hackers, "La
cadena se corta por el eslab&oacute;n m&aacute;s d&eacute;bil". As&iacute; fue que
los miembros del CCC pudieron acceder a la NASA, por
medio de la red DECnet. Los miembros del CCC consiguieron
obtener privilegios en una m&aacute;quina miembro de la red que
no estaba bien protegida en alg&uacute;n lugar de Alemania. A
trav&eacute;s de esta m&aacute;quina consiguieron introducir un gusano
muy simple que se copiaba a todas las m&aacute;quinas a las que
ten&iacute;a acceso. Si bien el sistema de propagaci&oacute;n era un
tanto rudimentario, han quedado algunos fragmentos del
c&oacute;digo de ataque que, por el contrario, era brillante. A
trav&eacute;s del estudio de este c&oacute;digo puede verse que los
autores conoc&iacute;an a fondo la nueva versi&oacute;n del sistema
operativo. Demostraron tambi&eacute;n amplios conocimientos en
el uso de equipos DEC. Este fascinante c&oacute;digo de ataque
se basaba en el ya citado bug en los servicios de
seguridad, por medio del cual obten&iacute;a los privilegios.
Luego modificaba (patcheaba) varias de las im&aacute;genes del
sistema y se autoeliminaba. Estos patches son realmente
interesantes. Modificaba las im&aacute;genes de los programas
MONITOR, SHOW y LOGINOUT y agregaba un nombre de usuario
especial al archivo de autorizaci&oacute;n del VMS. Los patches
a MONITOR y SHOW consegu&iacute;an que esos utilitarios
ignoraran el nombre de usuario especial que el c&oacute;digo de
ataque hab&iacute;a agregado al archivo de autorizaci&oacute;n. Esto
les permit&iacute;a a los miembros del CCC permanecer invisibles
mientras estaban logeados con ese nombre de usuario
especial.<BR><BR>
El patch sobre LOGINOUT serv&iacute;a para poder acceder con el
nombre de usuario agregado. Adem&aacute;s, tomaba todos los
passwords con los cuales los usuarios validados se
registraban, los encriptaba con un algoritmo simple y los
guardaba en una porci&oacute;n muy poco conocida y utilizada del
registro de autorizaciones.<BR><BR>
Una vez m&aacute;s vemos los profundos conocimientos que los
ten&iacute;an los autores del c&oacute;digo de ataque acerca de este
tipo de sistemas. Luego de un tiempo, y loge&aacute;ndose con el
nombre agregado, pod&iacute;an acceder al registro de
autorizaciones, tomar los passwords encriptados que all&iacute;
hab&iacute;a colocado el patch a LOGINOUT y desconectarse. En
casa pod&iacute;an desencriptar los passwords (tarea muy
sencilla ya que ellos mismos hab&iacute;an sido quienes los
encriptaron) y a partir del pr&oacute;ximo acceso ya pod&iacute;an
ingresar por medio de la red a una cuenta leg&iacute;tima sin
despertar ning&uacute;n tipo de sospechas como cualquier usuario
normal. Peri&oacute;dicamente se utilizaba el nombre de usuario
especial para ir a buscar los nuevos passwords que se
hab&iacute;an recolectado en el registro de autorizaciones.
Usaban el nombre de usuario especial agregado para que
esto pasara inadvertido.<BR><BR>
Al contar con diversos passwords, se consegu&iacute;a distribuir
el tiempo de uso del sistema entre diversos usuarios sin
recargar demasiado ninguna de las cuentas leg&iacute;timas, ya
que si alguna cuenta aparec&iacute;a demasiado utilizada pod&iacute;a
despertar sospechas. El patch de LOGINOUT registraba
todos los passwords ingresados, as&iacute; consiguieron algunos
de m&aacute;xima seguridad del sistema atacado. Por otra parte,
si los encargados de seguridad cambiaban los passwords,
solo hab&iacute;a que esperar unos d&iacute;as para que los nuevos se
acumularan en el registro de autorizaciones.<BR><BR>
Como vemos, el circulo cerraba completamente, y el plan
era pr&aacute;cticamente perfecto. De hecho, por medio de este
sistema los miembros del CCC pudieron utilizar gran parte
de las m&aacute;quina de la red DECnet, entre las cuales hay,
como ya he se&ntilde;alado, m&aacute;quinas de grandes empresas
privadas y tambi&eacute;n de muchas instituciones p&uacute;blicas.
Fueron descubiertos a principios de Abril de 1987 en la
NASA, tal vez por un exceso de confianza o de ansiedad de
uno de sus miembros. En vez de realizar un acceso breve
para verificar si ya hab&iacute;a conseguido otros nuevos
passwords leg&iacute;timos y retirarse, este joven miembro pas&oacute;
largo tiempo husmeando los archivos secretos de la NASA
con el nombre especial agregado, en lugar de utilizar un
password v&aacute;lido. Uno de los system managers de los
sistemas DEC de la NASA vio que se estaban consumiendo
muchos recursos de su m&aacute;quina (por ejemplo ciclos de
CPU), y para intentar ver que era lo que estaba
sucediendo, ejecut&oacute; los utilitarios SHOW y MONITOR (que
ya estaban patcheados). As&iacute; descubri&oacute; muy sorprendido que
"nadie" estaba utilizando la m&aacute;quina. Encontrando esta
situaci&oacute;n muy extra&ntilde;a, este system manager, del que nunca
pudo conocerse el nombre, ejecut&oacute; un utilitario llamado
SDA. El SDA (System Dump Analyser) es un utilitario de
las m&aacute;quinas que corren sistemas operativos VMS que
ofrece vuelcos de memoria, es muy poco utilizado ya que
son realmente pocas las personas que pueden interpretar
un dump (vuelco de memoria). Utilizando el dump, el
system manager pudo tener una idea de lo que estaba
sucediendo. Si bien el ataque fue descubierto por la
imprudencia de uno de los miembros del CCC, debemos
tambi&eacute;n reconocer la calidad t&eacute;cnica de este system
manager an&oacute;nimo, que demostr&oacute; conocer muy bien su oficio,
resolviendo la situaci&oacute;n con solvencia t&eacute;cnica y
demostrando grandes conocimientos. El system manager
inform&oacute; de los hechos, y los t&eacute;cnicos de la NASA, junto a
especialistas de DEC, pudieron solucionar este problema
r&aacute;pidamente. Se agregaron al sistema nuevos m&eacute;todos de
seguridad que imposibilitaron el acceso a los miembros
del CCC, y el error fue corregido.<BR><BR>
La NASA dio informaciones ambiguas sobre este hecho.
Seg&uacute;n los voceros que las anunciaran, a veces neg&aacute;ndolo,
a veces se&ntilde;alando que solo hab&iacute;an accedido a niveles muy
bajos, lo que no es verdad. Si bien nunca los pusieron a
conocimiento p&uacute;blico por temor a las represalias, los
miembros del CCC pudieron acceder a los proyectos m&aacute;s
secretos de la NASA y tuvieron los password de los m&aacute;s
altos miembros de dicha instituci&oacute;n. Se dice que algunos
de sus miembros y ex-miembros todav&iacute;a guardan algunos
archivos de la NASA como "trofeos de guerra" de aquella
legendaria acci&oacute;n.

<BR><BR>
Fernando Blanco Dopazo es Analista de Sistemas (graduado
en ORT), y se ha especializado en seguridad inform&aacute;tica.
Actualmente trabaja en una renombrada consultora
internacional, desempe&ntilde;&aacute;ndose como auditor de sistemas
bancarios.
<BR><BR>


<BR>
<hr>
<p align="center"><a href="http://www.ubik.to"><img src="http://303.ubik.to/S_uwdlogo.gif" alt="Logo de Ubik World Domination"  idth=  align=BOTTOM></a>
<hr>
</BODY>

</HTML>

