<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Trenchcoat Legion">
   <meta name="GENERATOR" content="Mozilla/4.72 [en] (Win98; I) [Netscape]">
   <title>Anarquia !!</title>
</head>
<body text="#00CC00" bgcolor="#000000" link="#33FF33" vlink="#99FF99" alink="#FF0000">
<font face="Courier New,Courier"><font color="#FFFFFF">SECCI&Oacute;N
DE ANARQU&Iacute;A</font></font>
<br>&nbsp;
<br>&nbsp;
<p><font face="Courier New,Courier"><font color="#FFFFFF">HOW TO KILL YOUR
PARENTS</font></font>
<br><font face="Courier New,Courier"><font color="#FFFFFF">THE COMPLETE
GUIDE</font></font>
<br><font face="Courier New,Courier"><font color="#FFFFFF">BY: DizzIE&nbsp;&nbsp;&nbsp;&nbsp;
&copy;1999</font></font>
<br>&nbsp;
<p><font face="Courier New,Courier"><font color="#FFFFFF">THE BORING DISCLAIMER:</font></font>
<br><font face="Courier New,Courier">&nbsp;Aqui esta la mierda legal usual:
No soy responsable por nada de lo tu hagas con la informaci&oacute;n presentada
aqu&iacute;. Es de prop&oacute;sito informativo y quizas humoristico, &uacute;nicamente.
En otras palabras no puedes decirle al juez que yo te influenci&eacute;
a matar tus padres. Gracias a la primera enmienda y la libertad de expresi&oacute;n
yo puedo escribir sobre lo que quiera, hehe. Entonces ve adelante y lee,
con prop&oacute;sitos informativos solamente.</font>
<br>&nbsp;
<p><font face="Courier New,Courier"><font color="#FFFFFF">LA INTRODUCCI&Oacute;N:</font></font>
<p><font face="Courier New,Courier">Todos quieren matar a sus padres en
alg&uacute;n momento de sus vidas.</font>
<br><font face="Courier New,Courier">Si tu nunca quisiste matar a tus padres
por que diablos estas leyendo esto?</font>
<p><font face="Courier New,Courier">&nbsp; Aqui abajo hay algunas bonitas,
simples y creativas maneras de matar a tus padres, pero primero si estas
un poco inseguro de si vas a matar a tus padres o no o tu solo necesitas
un buen motivo para darle al Mr.Sheriff, aqui hay algunas buenas razones
para matar a tus padres (o cosas que hacen tus padres para sacarte de quicio):</font>
<p><font face="Courier New,Courier">. Ellos te incomodan</font>
<p><font face="Courier New,Courier">. Ellos te averguenzan</font>
<p><font face="Courier New,Courier">. Ellos te hacen enojar</font>
<p><font face="Courier New,Courier">. Ellos intentan limitar tus libertades
(Como no tv y no computador)</font>
<p><font face="Courier New,Courier">. Ellos te castigan (cuando te cogen
y ten mandan a tu cuarto sin comer)</font>
<p><font face="Courier New,Courier">. Ellos te sobrealimentan forzandote
a comer hasta que tu estomago explota y la sanger empieza a chorrear por
tu boca.</font>
<p><font face="Courier New,Courier">&middot; They bug you about your grades</font>
<p><font face="Courier New,Courier">&middot; Ellos son ignorantes</font>
<p><font face="Courier New,Courier">&middot; Ellos te golpean</font>
<p><font face="Courier New,Courier">&middot; Ellos se emborrachan pero
no te dejan tener una.</font>
<p><font face="Courier New,Courier">&middot; Etc etc etc</font>
<p><font face="Courier New,Courier">Ahora que tienes un motivo o dos (o
tres, o cuatro) aqui estan los metodos a actuales de matarlos:</font>
<p><font face="Courier New,Courier"><font color="#FFFFFF">ELECTROCUCI&Oacute;N:</font></font>
<p><font face="Courier New,Courier">Este metodo es usualmente usado en&nbsp;
padres mujeres, tambi&eacute;n conocidas como "la mama". Cuando tu mam&aacute;
este tomando un ba&ntilde;o, lleva el sterio al ba&ntilde;o y conectalo,
si la perra te pregunta que diablos est&aacute;s haciendo, dile que se
joda y entonces solo tira el sterio (el que esta conectado y prendido)
en la ba&ntilde;era. Entonces solo sientate y observa los juegos artificiales.</font>
<p><font face="Courier New,Courier">PROS: Tu mam&aacute; morira r&aacute;pidamente
y casi silenciosamente.</font>
<p><font face="Courier New,Courier">CONTRAS: Tendr&aacute;s que ver a tu
mam&aacute; desnuda, no muy placentero a menos que te gusten ese tipo de
cosas. Tendr&aacute;s que conseguir un nuevo sterio. Los cad&aacute;veres
muertos cocinados no huelen muy bien.</font>
<br>&nbsp;
<p><font face="Courier New,Courier"><font color="#FFFFFF">SHOOTING:</font></font>
<p><font face="Courier New,Courier">Este es un bello simple concepto hasta
para todos ustedes estudiantes de secundaria abandonados. Todo lo que necesitas
es una pistola, algunas municiones (DUH, que pensaste?) y un silenciador,
o algo mas para evitar el ruido, como una almohada. Como sea tu no necesitas
un silenciador si vives en una area remota como Australia (si eso fue una
broma). Entonces cuando tengas todas las cosas, solo arrastrate detr&aacute;s
de tus padres y disparales en el coraz&oacute;n o en el cuello, o para
todos ustedes s&aacute;dicos bastardos, disparenle en la cabeza multiples
veces (hehe). Tambi&eacute;n, si quieres poner tristes a tus padres, espera
hasta que se volteen y te vean entonces diparales primero en la pierna
y entonces podr&aacute;s verlos sufrir.</font>
<p><font face="Courier New,Courier">PROS: Este m&eacute;tod matar&aacute;
absolutamente a tus padres a menos que sea un REALMENTE mal tirador.</font>
<p><font face="Courier New,Courier">CONTRAS: Alguien puede escucharte (disparar
el arma). O alguien puede escuchar a tus padres gritando.</font>
<br>&nbsp;
<p><font face="Courier New,Courier"><font color="#FFFFFF">AHOGANDO:</font></font>
<p><font face="Courier New,Courier">El mejor momento de ahogar a tus padres
es cuando estan durmiendo, a menos que seas realmente fuerte y puedas dominarlos
mientras estan despiertos. Entonces, asumiendo que estan dormidos, tu necesitas
arrastrarte en su cuarto y amarrarlos a su cama, estando seguro de que
no se puedan mover. Entonces todo lo que tienes que hacer es poner unas
bolsas plasticas en sus cabezas (estando segura de que no hay ningun roto
en las bolsas) y ammarrar las bolsas con cuerdas alrededor de sus cuellos
de manera que no puedan quitarselo. Tambien por silencio extra encinta
sus bocas con cinta aislante antes de ponerles las bolsas plasticas. Hay
tambi&eacute;n una variedad de formas de ahogar a tus padres como poner
uan almohada en sus cabezas.</font>
<br>&nbsp;
<p><font face="Courier New,Courier">PROS: Este es un metodo realmente silencioso,
a menos que tu lo eches a perder, claro.</font>
<p><font face="Courier New,Courier">CONTRAS: Tus padres se pueden despertar
mientras estas atandolos (llevando a una cantidad de explicaciones que
dar y una posible hospitalizaci&oacute;n psiqui&aacute;trica para ti) solo
diles que te dijeron que lo hicieras en la escuela o algo as&iacute;.</font>
<p><font face="Courier New,Courier"><font color="#FFFFFF">ASUSTANDO:</font></font>
<p><font face="Courier New,Courier">Este metodo usualmente solo funciona
si tus padres son realmente viejos, tienen un coraz&oacute;n malo, toman
medicamentos para el coraz&oacute;n o tienen un debil sistema nervioso.
Su tus padres tienen todo lo anterior estoy realmente sorprendido de que
a&uacute;n no esten muertos. Todo lo que tienes que hacer es esperar a
la vuelta de una esquina hata que tu mam&aacute; y/o tu pap&aacute; vengan
y entones brinca afuera y grita "BOO!" o "AAAAGH!" estar&aacute;s sorprendido
de que tan a menudo esto funciona ;)</font>
<p><font face="Courier New,Courier">PROS: Si este m&eacute;todo funciona
tus padres morir&aacute;n ahi mismo sin ning&uacute;n ruido.</font>
<p><font face="Courier New,Courier">CONTRAS: Tus padres podr&iacute;an
no morirse pero solo desmayarse, entonces esta seguro de cortar sus cabezas
cuando esten inconcientes o "muertos". Si no tienes un hacha (ninguna casa
esta completa sin una) entonces puedes saltar encima de sus cabezas con
tus dos pies. Pero debes estar seguro de usar unas lindas pesadas botas.</font>
<p><font face="Courier New,Courier"><font color="#FFFFFF">ENVENENAMIENTO:</font></font>
<p><font face="Courier New,Courier">Este m&eacute;todo puede ser f&aacute;cil
o dificil. Esto depende en la moyor&iacute;a de ti y que tan grande es
tu obsesi&oacute;n por el perfeccionismo. Si tu nivel es alto entonces
necesitar&aacute;s encontrar por ti mismo algo de cianuro o alg&uacute;n
otro veneno popular de clase alta. Intenta preguntando al Dr.Kevorkian
(Yo sigo tratando de encontrar su n&uacute;mero telef&oacute;nico) De cualquier
manera, cuando consigas el cianuro o cualquier cosa para colocar en la
comida de tus padres, asegurate que ellos lo smallow. Si lo hacen estaran
muertos en nada de tiempo (bueno en 5 minutos).&nbsp; If you don't want
to shell out the dough for the cyanide todo lo que tienes que hacer es
poner algo de drano o alg&uacute;n otro limpiador/secador/limpiador en
la comida de tus padres. Tan pronto ellos lo coman, empezaran a babear
y si tiene algo de cerebro al final (estar&aacute;s sorprendido de cuanto)
intentar&aacute;n alcanzar el tel&eacute;fono para marcar al 911 o a la
casa de tu abuela para decirle (a la abuela o el operador del 911) que
ellos (tus padres) estan muriendo. Entonces lo que tienes que hacer es
asegurarte de que el tel&eacute;fono este desconectado.</font>
<p><font face="Courier New,Courier">Volviendo al cianuro por un momento
aqui hay una interesante cuestion que encontr&eacute; no hace mucho tiempo:
las semillas de manzanas tienen un peque&ntilde;o porcentaje de cianuro
en ellas. Entonces lo que puedes hacer es conseguir por ahi 200 semillas
de manzana echarlas en una licuadora a&ntilde;adir algo de crema de helado
y leche, mezclarlo todo y entonces decirle a tu mami y a tu papi que encontraste
que es genial para la salud el batido de leche. Esto funciona mejor su
tus padres son enfermos de la la comida saluidable.</font>
<p><font face="Courier New,Courier">Otra t&eacute;cnica de envenenamiento
es conseguir algunos hongos venenosos y si tus padres estan cocinando algo
con hongos pon los venensosos tambi&eacute;n. Tu tamb&iacute;en puedes
darles a tus padres algo a lo que sean al&eacute;rgicos, por ejemplo si
son alergicos a cosas picantes pon algo de pimienta roja en su ensalada
o lo que sea. Si son intolerantes a la lactosa (no pueden comer productos
hechos con leche) pon algo de queso en sus espaguetis. Solo recuerda desconectar
el tel&eacute;fono, entonces tus padres no podran llamar a nadie.</font>
<p><font face="Courier New,Courier">PROS: Si tu usas el m&eacute;todo del
cianuro tus padres moriran en unos 5 minutos a menos que comienzen a a
meterse 2 dedos en sus gargantas y a sacarse todo, (pero podemos prevenir
eso cortando sus dedos, no podemos?</font>
<p><font face="Courier New,Courier">CONTRAS: Algunas veces su tu alimentas
a tus padres con cosas a las que son alergicas, puede que no se mueran,
pero experimentaran algunas incomodidas que pueden ser realmente divertidas
de observar.</font>
<p><font face="Courier New,Courier"><font color="#FFFFFF">TRAMPAS DEL BOBO:</font></font>
<p><font face="Courier New,Courier">Hay una cantidad de trampas bobas que
puedes hacer. Hay tambi&eacute;n una cantidad de archivos How-to de</font>
<br><font face="Courier New,Courier">trampas bobas en el genial underground.
Por eso yo no me meter&eacute; con todas esas trampas mec&aacute;nicas
y el&eacute;ctricas porque hay suficientes sitios que ya las tienen.</font>
<p><font face="Courier New,Courier">Solo manten en mente que el principio
b&aacute;sico es cablear algo, entonces cuando tus padres abran una puerta
o algo o enciendan una luz se complete im circuito y los haga volar (tus
padres). De cualquier manera, aqu&iacute; hay una bonita simple trampa
que hice un d&iacute;a. Todo lo que necesitas es un martillo (uno de verdad,
no uno de esos pl&aacute;sticos de juguete). Si no tienes un martillo puedes:</font>
<br><font face="Courier New,Courier">a) Ir y robar uno, b) Usar una roca
pesada, o c) usar otro objeto pesado. Entonces cuando consigas el martillo,
necesitas una puerta que abra hacia dentro (hacia el cuarto) (si tus padres
van a entrar al cuarto) o una puerta que abra hacia afuera (si tus padres
van a salir del cuarto). Cuando ya encontraste la puerta correcta, balancea
el martillo o la roca encima de la puerta. Dejando una parte recostada
en la pared contigua a la puerta. Entonces cuando tus padres abran la puerta,
el martillo o la roca caera en sus cabezas y aplastar&aacute; sus craneos
instantaneamente (haciendo un sonido crujido genial, como el de todos esos
viejos comerciales de crujidos).</font>
<p><font face="Courier New,Courier">PROS: Si este m&eacute;tod funciona
tus padres moriran instantaneamente y silenciosamente (excepto por el crujido,
hehe).</font>
<p><font face="Courier New,Courier">CONTRAS: Algunas veces si tus padres
tienen un craneo realmente espeso este m&eacute;todo no los matar&aacute;
pero les dar&aacute; una conmoci&oacute;n. Entonces tan pronto ellos est&eacute;n
inconcientes y tu creas que ellos estan muertos salta en sus cabezas o
usa el martillo para pegarles unos cuantos fuertes golpes, como en esos
juegos de arcade donde tu golpeas lagartos o marmotas. Cuando est&eacute;s
saltando en sus cabezas usa esas botas con p&uacute;as en las zuelas, de
escalar monta&ntilde;as para diversi&oacute;n extra!</font>
<p><font face="Courier New,Courier"><font color="#FFFFFF">DREPESION/SUICIDIO:</font></font>
<p><font face="Courier New,Courier">Primero que todo quiero que TU memorizes
algo: depresi&oacute;n = suicidio. Recuerda esa f&oacute;rmula cient&iacute;fica.
Este m&eacute;todo usualmente toma algo de planeaci&oacute;n y paciencia.
Ahora lo que haces es dejar una nota de suicidio pegada del refrigerador
diciendo algo como esto:</font>
<p><font face="Courier New,Courier">Queridos Mam&aacute; y Pap&aacute;,</font>
<br><font face="Courier New,Courier">&nbsp;Gracias por hacer de mi vida
un infierno, un infierno para mi. Usteds me hicieron comprender que la
vida no vale la pena, entonces debo&nbsp; terminarla ahora mismo. Estoy
enfermo y cansado de usteds gritandome y alegandome. Yo solo no puedo soportar
mas toda esa mierda. No puedo seguir viviendo con ustedes y no puedo soportarlos!
Por eso, siento que esta es la &uacute;nica salida, entonces he decidido</font>
<p><font face="Courier New,Courier">(Escoge un m&eacute;todo de suicidio
o a&ntilde;ade uno propio)</font>
<p><font face="Courier New,Courier">a) Vayan al oc&eacute;ano y ahoguense</font>
<p><font face="Courier New,Courier">b) Salta de--------(escribe el nombre
de un lugar alto en tu area, como un desfiladero o algo.</font>
<p><font face="Courier New,Courier">Entonces gracias otra vez, queridos
madre y padre por hacerme entender que cochino/desagradable es el mundo.
Si as&iacute; no fuera por ustedes, yo estar&iacute;a vivo en este fucking
mundo.</font>
<p><font face="Courier New,Courier">p.s. En el momento que ustedes lean
esto yo ya estar&eacute; libre (muerto) entonces no se preocupen en buscar
mi cuerpo.</font>
<p><font face="Courier New,Courier">Sinceramente su hijo(a) muerto,</font>
<br><font face="Courier New,Courier">______________(firma con tu nombre)</font>
<p><font face="Courier New,Courier">La idea principal de la carta es hacerlos
sentir responsables por tu muerte. Esta carta crear&aacute; un efecto mas
fuerte en tus padres a&uacute;n que haber tenido un gran vuelo la noche
antes con ellos. No olvides escribir la cartya a mano para que ellos sepan
que es genuina.</font>
<p><font face="Courier New,Courier">Apenas termines de escribir esta carta
y la pongas en un punto visible necesitar&aacute;s encontrar un lugar para
esconderte por un tiempo, como la casa de un &aacute;rbol. Aseurate de
tener suficiente agua y alimento (para alrededor de una semana porque usualmente
no toma mas de una semana que tus padres lo hagan). Entonces si tienes
suerte tus padres pronto decidir&aacute;n que la vida no vale la pena sin
su hijo y se matan,(si tu no eres hijo &uacute;nico mata a tu(s) hermano(s)
y a tu(s) hermana(s) y a&ntilde;ade sus firmas a la nota de suicidio).
Ahora si escuchas un disparo o 2 en los pr&oacute;ximos d&iacute;as, significa
que has triunfado y tu misi&oacute;n esta completa. Si no escuchas un disparo
puede significar que tus padres escogieron una manera diferente de morir
o que necesitas tomar medidas m&aacute;s dr&aacute;sticas.</font>
<p><font face="Courier New,Courier">Entonces lo que haces es tarde en la
noche o temprano en la ma&ntilde;ana (alrededor de las 2-3 am, o cuando
sea que tus padres esten doprmidos) vistete de blanco, haz tu piel palida
usando maquillaje o con harina. Tambi&eacute;m oscurece tus ojos usando
un delineador de ojos o cualquier cosa y untate salsa de tomate por todo
el cuerpo para que parezca sangre. Entonces ve al dormitirio de tus padres
y comenza a decir despacio y en voz baja, "Unanse a mi, mami y papi, unanse
a mi, esto esta solitario. Estoy triste y estoy solo. Esta haciendo mucho,
mucho frio." Haz esto repetidamente por una semana o algo y entonces esto
definitivamente llevara a tus padres "al borde del abismo".</font>
<p><font face="Courier New,Courier">PROS: Este m&eacute;tod es realmente
divertido de intentar y esto te dara la oportunidad de meterte con las
cabezas de tus padres, sin mencionar que mejoras tus habilidades de actuaci&oacute;n.</font>
<p><font face="Courier New,Courier">CONTRAS: Este m&eacute;todo toma un
poco de tiempo, entonces como yo dije, necesitas paciencia. Otro contra
es que tus padres pueden insistir en encontrar tu cuerpo entonces pueden
dar al peque&ntilde;o Johny un funeral. Entonces lo que tienes que hacer
es ordenar un cadaver del cat&aacute;logo de ciencia/biolog&iacute;a o
conseguir uno (robar uno en t&eacute;rminos de un hombre de la ley) de
la morgue local.</font>
<br>&nbsp;
<p><font face="Courier New,Courier"><font color="#FFFFFF">QUE HACER CON
LOS CUERPOS</font></font>
<p><font face="Courier New,Courier">Ok, entonces finalmente mataste a tus
padres, pero ahora tienes 2 cad&aacute;veres tirados por ah&iacute; en
el cuarto de estar. No es exactamente el tipo de muebles que buscabas?
Bueno aqu&iacute; hay un par de maneras de desacerte de esas 2 cosas muertas
en tu casa:</font>
<p><font face="Courier New,Courier">&Oslash; Arr&aacute;stralos afuera
y botalos en la basura. Solo asegurate de colocar algunas bolsas de basura
sobre ellos para que no sean visibles.</font>
<p><font face="Courier New,Courier">&Oslash; Si eres muy d&eacute;bil para
hacer el anterior m&eacute;todo, debes empezar a trabajar ya, pero puedes
cortar los cuerpos en pedazos de tama&ntilde;os decentes con una linda
hacha o un cuchillo de carnicero. Entonces pon los pedazos en una bolsa
plastica, entonces pon la bolsa plastica en una bolsa marr&oacute;n y entonces
tira las bolsas en el el basurero. O puedes comer la carne si estas metido
en ese tipo de cosas.</font>
<p><font face="Courier New,Courier">&Oslash; Tira los cuerpos en el oc&eacute;ano,
cuando la marea se esta llendo.</font>
<p><font face="Courier New,Courier">&Oslash; Entierra los cuerpos en tu
patio. Solo asegurate de enterrarlo lo suficientemente hondo (Los standar
6 pies deben hacerlo bien). Tambi&eacute;n puedes sembrar algunas flores
para disimularlo como un jardin.</font>
<p><font face="Courier New,Courier">Well that's the end of this phile look
for other philez by me</font>
<br><font face="Courier New,Courier">wherever you got this one.</font>
<p><font face="Courier New,Courier">ps. Mandame un email con todas tus
tareas a xcon0@yahoo.com o puedes mandarme un fax al 1-559-663-4067</font>
<p><font face="Courier New,Courier">Tootles everyone</font>
<br><font face="Courier New,Courier">-DIzzIE</font>
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<div align=right><font face="Courier New,Courier"><font color="#FFFFFF">Traducido
por Kacimiro</font></font></div>

<hr WIDTH="100%">&nbsp;
<div align=right>
<br><font face="Courier New,Courier"><font color="#FFFFFF"><a href="index.html">--IR
AL MEN&Uacute; PRINCIPAL--</a></font></font></div>

</body>
</html>
