<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Trenchcoat Legion">
   <meta name="GENERATOR" content="Mozilla/4.72 [en] (Win98; I) [Netscape]">
   <title>Nimrod de Aglie</title>
</head>
<body text="#00CC00" bgcolor="#000000" link="#33FF33" vlink="#99FF99" alink="#FF0000">
<font face="Courier New,Courier"><font color="#FFFFFF">By
Nimrod de Aglie</font></font>
<p><font face="Courier New,Courier">Quisiera ir al infierno, tiene que
ser mejor que esto.</font>
<p><font face="Courier New,Courier">No los necesito, s&oacute;lo los cree
para disfrutar de su dolor, para tener el colmo de todas las respuestas
y nunca decirles la verdad, tal vez los destruya despu&eacute;s de que
lean estas l&iacute;neas, pero eso no importa, no saben de que les hablo,
nunca lo han sabido, nunca lo sabr&aacute;n, ya ni existen, pero son tan
idiotas que YO aseguro no lo han notado. No entiendo porque contin&uacute;an
a&uacute;n esperando la noche, o esperando el d&iacute;a, si todos est&aacute;n
muertos, ayer fue el fin del mundo, &iquest;o es que acaso no lo vieron
en cenizas?</font>
<br><font face="Courier New,Courier">Sus vidas nunca han valido tan poco
como ahora, siempre sosteniendo la farsa del muy bien gracias, por la represi&oacute;n
de la m&aacute;s tierna infancia, pero la ira crece y se esparce como un
c&aacute;ncer, yo soy un c&aacute;ncer, Yo soy el C&aacute;ncer, REPRIMANSE!
han oido, no caguen, controlen los esfinteres, han oido, pero yo os digo:
CAGUEN, callen la racionalidad que les impide el placer de derramar sangre,
caguen</font>
<br><font face="Courier New,Courier">la racionalidad, callen la mente torpe,
caguen la mente torpe, solo la mierda destruye el Kitsch, rompan, golpeen,
destajen cabezas de ra&iacute;z, y entraran a un nuevo estado de conciencia
superior, y cuando vean a un hombre recordaran como los cromagnon destruyeron
a los neandertales, y as&iacute; todos ser&aacute;n simos a su lado. Hasta
que no lo hagan nadie entiende nada, son sordos, as&iacute; que olv&iacute;denlo,
no est&aacute;n preparados, son peque&ntilde;os e inofensivos, es m&aacute;s,
olv&iacute;denlo del todo porque no es importante; no para ustedes, no
lo podr&iacute;an entender ni en un mill&oacute;n de a&ntilde;os; s&oacute;lo
en el momento en que me suicide, y desaparezca a mi paso el mundo deforme
que me idee, conocer&aacute;n a sucreador, rey, se&ntilde;or y destructor:</font>
<p><font face="Courier New,Courier">NIMROD DE AGLIE</font>
<p><font face="Courier New,Courier">&nbsp;Ese es quien soy yo, qui&eacute;n
tenga alg&uacute;n problema con eso, no dude en escribirme, su opini&oacute;n
me importa menos que un culo, pero lo matar&eacute; sin duda con mas gusto
sabiendo de sus rencores, que como lo har&eacute; al fin de cuentas a todos
los dem&aacute;s por mi adicci&oacute;n a la sangre derramada sin motivo
alguno.</font>
<p><font face="Courier New,Courier">No pensaba escribir nada, ya que tengo
una gran pelea en contra de los idiotas que me traten de interpretar y
conocer algo de lo que les digo, es simplemente una blasfemia intentar
entender a Dios con f&uacute;tiles mentalidades humanas, pero me decid&iacute;
ya que las contrapartes de la trinidad divina me mostraron su favor para
humillar orangs lectores que creen saber algo de nada, y disfruto</font>
<br><font face="Courier New,Courier">de torturar a mis inferiores, principalmente,
por el hecho que puedo, y como todos lo son, simplemente los golpear&eacute;,
no traten de defenderse, nacieron solo para ser mis sparings, y en cierta
medida disfrutar&eacute; m&aacute;s que hacerlo con el resto de humanos
y animales, puesto que son una deficiente mezcla entre los dos.</font>
<p><font face="Courier New,Courier">Me he tomado la molestia de sobrevalorarlos
y esperar que entender&aacute;n lo que les diga en los t&eacute;rminos
m&aacute;s simples que me sean permitidos en medio de mi omnisapiencia,
de suerte tal que</font>
<br><font face="Courier New,Courier">comenzara mi explicaci&oacute;n de
conocimiento taxon&oacute;mico de su especie por el d&iacute;a de hoy.
Es veros&iacute;mil que estas observaciones hayan sido enumeradas alguna
vez y, quiz&aacute; muchas veces; la discusi&oacute;n de su</font>
<br><font face="Courier New,Courier">novedad me interesa menos que su verdad.
Los naturalistas franceses de finales del siglo XIX basados especialmente
en la Zoolog&iacute;a Anal&iacute;tica de Dumeril consideraban al hombre
como un g&eacute;nero &uacute;nico, del orden de los Bimanos, mas al pasar
el tiempo, Bory de Saint-Vincent se vio en la necesidad de a&ntilde;adir
a este el g&eacute;nero Orang, y si bien les es permitido a los zo&oacute;logos
enmarcar a todos los mam&iacute;feros hominidos de treinta y dos v&eacute;rtebras
con mayor n&uacute;mero de pliegues en los hemisferios cerebrales que cualquier
otro animal, la capacidad del habla y un no muy demostrado razonar dentro
de la especie humana, debo recalcar que aparte de las diferencias por ellos
aceptadas (las dadas por la influencia de los climas que ha suministrado
la nomenclatura de quince especies cuyos nombres cient&iacute;ficos no
valdr&iacute;a la pena citar por la nimia capacidad racional del lector)
se marcan unas que se hacen muchisimo mas obvias que las anteriores, vi&eacute;ndose
el fisi&oacute;logo obligado a establecer nuevos g&eacute;neros y subg&eacute;neros
respecto al orden de grados de inteligencia y ciertas condiciones de existencia
de poder y pecuniaria.</font>
<br><font face="Courier New,Courier">Ahora bien, de los seis mil millones
de humanos, se han de distanciar de los bimanos, por lo menos unos cinco
mil ochocientos millones de orangs, fenotipicamente imposibles de diferenciar
de los mencionados bimanos, poseen todos lo caracteres que se le atribuyen
en general a la especie humana: tienen el hueso hioides, el caracoides,
el acromi&oacute;n y la arcada zig&oacute;matica, y si eso les basta para
generalizarlos como iguales, les permito a los se&ntilde;ores del jard&iacute;n
bot&aacute;nico clasificarlos dentro del g&eacute;nero bimano, pero, &iquest;c&oacute;mo
no tener en cuenta los grados mencionados anteriormente seg&uacute;n su
inteligencia, poder y dinero?, si esto se deja a un lado, &iquest;podr&iacute;an
grandes y desagradables grupos ser llamados humanos?, y si es as&iacute;,
&iquest;d&oacute;nde quedan las mujeres?, yo particularmente para el grado
&iacute;nfimo al nivel evolutivo de los que lucen humanoides tiendo a denominarlos
como: los Orang Descoloridos, (solo para citar un ejemplo: los idiotas
metaleros de mierda de tercera mano de putas</font>
<br><font face="Courier New,Courier">E-Zines que ponen un cr&aacute;neo
muy violento con los textos mas insulsos e hijodeputamente fucking lamers,
como los de la gu&iacute;a del hacking mayormente inofensivo, adem&aacute;s
que incluso le a&ntilde;aden errores</font>
<br><font face="Courier New,Courier">ortogr&aacute;ficos de ni&ntilde;os
de kinder como escribir: aber, matesen, fok you y otros muchos que aprenden
mientras ven a su &iacute;dolo la doctora Laura en Am&eacute;rica y le
dan por el culo a sus putas madres que a&uacute;n</font>
<br><font face="Courier New,Courier">tienen mi semen en la boca de la noche
anterior, y piden permiso para salir a la esquina ya que son tan malos
que se le reportan a papi a las ocho de la noche y les toca desquitarse
violando el gato) y a los seres que por su exceso de raz&oacute;n se salen
del nivel bimano, quienes seguramente apenas y son una millon&eacute;sima
de la poblaci&oacute;n humana total (esto en el caso supuesto que ya existan)</font>
<br><font face="Courier New,Courier">tiendo a llamarles Superhombres, Metahumanos,
Homo Supirior, el hombre virtuoso, entre otros, a ellos es a quienes les
escribo, s&oacute;lo con la esperanza de ser el puente por el cual el hombre
del</font>
<br><font face="Courier New,Courier">ma&ntilde;ana camine para llegar a
su senda, "Amo a los que son como gotas pesadas que caen una a una de la
sombr&iacute;a nube suspendida sobre los hombres, anuncian el rel&aacute;mpago
que viene y desaparecen como</font>
<br><font face="Courier New,Courier">anunciadores. Ved: yo soy un anuncio
del rayo y una pesada gota procedente de la nube; pero ese rayo se llama
el Superhombre".</font>
<p><font face="Courier New,Courier">Empero, odio con todas mis fuerzas
al Orang, y para &eacute;l, desde ya he de demostrar mi repudio inmisericorde,
inexpugnable e inigualable, nada me hace radical, ya que mi indeterminismo
me lo proh&iacute;be, todos son igualmente nada para mi.</font>
<p><font face="Courier New,Courier">O&iacute;d y temed:</font>
<p><font face="Courier New,Courier">Cuando tiraron todo bajo la alfombra,
no creyeron que sus vicios crecieran y el tapete fuera peque&ntilde;o para
cubrir sus porquer&iacute;as, fui su salvador y decidieron hacerme de esta
manera, con una</font>
<br><font face="Courier New,Courier">personalidad amorfa y a medio terminar,
soy m&aacute;s que todo porque soy nada, ex nihilo, tengo tanta sabidur&iacute;a
que no tengo criterios, a todos los odio y desprecio por igual, soy el
ant&iacute; m&aacute;s, soy el anti: vida, muerte, dios, dioses, demonio,
sat&aacute;n, infiernos, cielos, nirvanas , s&aacute;msaras, realidad,
fantas&iacute;a, universos, planetas, mundos, nacionalidades, raz&oacute;n,
conocimientos, ignorancia, sentimientos, insensibilidad, noches, d&iacute;as,
elecciones, humanos, hombres, negros, amarillos, indios, mujeres, blancos,
zambos, mulatos, colombianos, luz, oscuridad, creencias, fe, gente, amor,</font>
<br><font face="Courier New,Courier">nacionalismos, norteamericanos, europeos,
asi&aacute;ticos, africanos, sies, noes, paz, heterosexuales, gays, bisexuales,
familias, esposas, hijos, violadas, violadores, paramilitares, jud&iacute;os,
fascistas, socialistas, cat&oacute;licos, protestantes, cristianos en general,
satanistas, drogas, licores, mierda, felicidad, tristezas, dinero, progenitores,
presidentes, papas, hinduistas, musulmanes, religiosos en general, ateos,
agn&oacute;sticos, putas, cosas, todo, nada, armas, tolerancias, solidaridades,
sectas, poetas, dibujantes, artistas, cr&iacute;ticos, guerrilleros, mimos,
arlequines, payasos, ricos, pobres, m&uacute;sica, alternomochilerosquierocambiarelmundo,
neo hippies, skinheads, vampiros, lamias, hombres lobo, chunkies, ni&ntilde;os,
ancianos, fresas, bonitos, feos, inteligentes, tontos, toreros, ecologistas,
alcoh&oacute;licos, abstemios, pol&iacute;ticos, anarquistas, asesinos
en serie, polic&iacute;as, indios, mis&aacute;ntropos,</font>
<br><font face="Courier New,Courier">fil&aacute;ntropos, indios, anglosajones,
drogadictos, rehabilitados, buseteros, taxistas, publicistas, dise&ntilde;adores,
abogados, actores, modelos, reinas de belleza, reyes, profetas, monjas,
prostitutas,</font>
<br><font face="Courier New,Courier">monjas prostitutas, proxenetas, bur&oacute;cratas,
deportistas, sedentarios, gordos, flacos, chistosillos, amargados, enfermos,
sanos, bibliotecarios, adolescentes, cuarentones, lamers, hackers, metaleros,
punketos, new waves, rockers, alternativos, tecnos, dancers, trancers,
ravers, grunges, skaters, rollers, rastafarios, raperos, g&oacute;ticos,
skatal&iacute;ticos, salseros, vallenateros, yuppies, chicheros, rancheros,
rasperos, sonidos, silencios, sistemas, gobiernos, masas, panes, panaderos,
creadores y defensores de cultura, descubre talentos, optimistas, pesimistas,
cuenteros, historiadores,&nbsp; deformes, defectuosos, cineastas, m&uacute;sicos,
escritores, programadores, asesinos, defensores de la vida, paidofilicos,
gerontrofilicos, voyeuristas, s&aacute;dicos, masoquistas, inventores de
historias que se creen, los que creen en los j&oacute;venes, los que creen
en los adultos, ustedes y todo hijo de puta malparido que se me escape.
Recuerden esto en cada cosa que hagan, nadie tiene derecho a existir, ni
siquiera yo, anti m&iacute;. Matense!, y a sus amigos, familiares y dem&aacute;s
de paso, pero lo m&aacute;s pronto posible, sientan el vac&iacute;o de
caer y &uacute;nanse a m&iacute; en el dolor y en la nada, all&iacute;
donde ya no existe algo peor, porque el vac&iacute;o no tiene un fondo
que tocar para buscar una salida a manera de escape feliz en el Kitsch.
Lo &uacute;nico que les ofrezco es la realidad, s&oacute;lo eso, ning&uacute;n
juego idiota de vivir, cortar la vida ahora y para siempre.</font>
<br><font face="Courier New,Courier">Am&eacute;n.</font>
<p><font face="Courier New,Courier">1587</font>
<div align=right>
<p><font face="Courier New,Courier">Nimrod de Aglie / Trenchcoat Legion</font></div>

<p>
<hr WIDTH="100%">
<div align=right>
<p><font face="Courier New,Courier"><font color="#FFFFFF"><a href="index.html">--IR
AL MEN&Uacute; PRINCIPAL--</a></font></font></div>

</body>
</html>
