<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Author" CONTENT="Bill G.">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.03 [fr] (Win95; I) [Netscape]">
   <TITLE>2020hac2.htm</TITLE>
</HEAD>
<BODY>
<IMG SRC="ra.gif" HEIGHT=48 WIDTH=48>
<CENTER><FONT SIZE=+4>HACKER 2020</FONT></CENTER>

<CENTER><FONT SIZE=+2>ISSUE N&deg;2</FONT></CENTER>
&lt;Disclaimer>
<BR>1- N.D.A.
<BR>2- Introduction
<BR>3- Les trucs utiles
<BR>4- Programmation en C (petit cours tir&eacute; de Back-Side)
<BR>5- Piratage d'un site
<BR>&nbsp;

<P><B><U>DISCLAIMER:</U></B> <FONT COLOR="#FF0000">Toutes les informations
contenues dans ce fanzine n'y sont qu'&agrave; titre purement informatif!
Il vous est d&eacute;conseill&eacute; de les appliquer, sous risques d'amendes
et de poursuites judiciaires. Moi ou mon serveur (actuellement Multimania),
ne seraient &ecirc;tre tenus responsables de ce que vous ferez de ces informations!</FONT>
<BR>&nbsp;
<CENTER><FONT COLOR="#000000"><FONT SIZE=+2>&lt;&lt;&lt;1- N.D.A.>>></FONT></FONT></CENTER>
<FONT COLOR="#000000">&nbsp;&nbsp; Pour ceux qui ont d&eacute;j&agrave;
lu mon <A HREF="http://www.multimania.com/clad2/2020hac.htm">premier fanzine</A>,
vous pourrez remarquer un changement de style, l'apparition de liens etc...
Vous pourrez me dire que je peux toujours mettre des liens dans mon premier
fanzine. Mais non... Je n'ai pas trop envie d'y faire des retouches (nan,
nan! Ce n'est pas de la f&eacute;n&eacute;antise!). Sinon, je conseille
aux autres d'aller le lire!</FONT>
<BR><FONT COLOR="#000000">&nbsp;&nbsp; Je tiens quand m&ecirc;me &agrave;
signaler que je fais pas partie de l'&eacute;lite (c.f. <A HREF="http://www.multimania.com/clad2/2020hac.htm">issue
1</A> ), et que j'exposerais ici: d'une part: mes connaissances dans ce
domaine, d'autre part les connaisssances des autres. Ca veut dire quoi
les connaissances des autres!? Ca vaut tout simplement dire que certaines
de ces infos sont tous simplements, tir&eacute;s d'autres fanzines, E-mags
etc... Mais il n'y a que comme &ccedil;a qu'on progresse, non? (comment
&ccedil;a "NON"?).</FONT>
<BR>&nbsp;
<CENTER><FONT COLOR="#000000"><FONT SIZE=+2>&lt;&lt;&lt;2-</FONT>&nbsp;</FONT>
<FONT SIZE=+2>Introduction>>></FONT></CENTER>
<FONT COLOR="#000000">&nbsp;</FONT>
<BR>&nbsp;&nbsp; Je ne vais pas r&eacute;expliquer ce que c'est qu'un hacker,
un cracker etc... Car vous pouvez le savoir en lisant le <A HREF="http://www.multimania.com/clad2/2020hac.htm">premier
N&deg; de Hacker 2020</A>. Mais je vais &eacute;clairer votre lanterne
en vous expliquant, quels cons&eacute;quences peut avoir le hacking sur
le monde informatique, et quels but ont les hackers!
<BR>&nbsp;&nbsp; Prenons un exemple: vous avez pirat&eacute; un site quelconque,
pris quelques infos modifi&eacute; une page HTML en mettant des images
pornos &agrave; la place, etc... En g&eacute;n&eacute;ral le r&eacute;sultat
ne se fait pas attendre: mise &agrave; jour du site, modifications et autres...
Mais le cr&eacute;ateur de ce site sait tr&egrave;s bien par ou vous &ecirc;tes
entr&eacute; si il fait une recherche plus appronfondie! Vous pouvez &ecirc;tre
certain que si tel est le cas, au bout de deux jours, le chemin que vous
avez emprunt&eacute; pour rentrer sur le site sera inaccessible. Mais si
vous hacker un site plus important, tels les providers ou les sites de
l'&eacute;tat... Il y aura un soul&egrave;vement au niveax des Webmasters.
Ils trouveront la faille. De plus vous risquez d'&ecirc;tre trac&eacute;!
donc selon la gravit&eacute; de la faute vous pourrez rester peinard sur
votre chaise, ou vous retrouvez dans la m&ecirc;me cellule que K.Mitnick
(fa&ccedil;on de parler!). Maintenant &agrave; la cr&eacute;ation d'un
nouveau virus, ou d'un nouveau trojan (comme cela a &eacute;t&eacute; le
cas pour Back Orifice!), celui-ci sera mis a votre disposition sur le net!
Au d&eacute;part aucun anti-virus ne pourra le d&eacute;tecter! Ensuite
des ant-virus et autres no-trojans auronts pour but de l'arr&ecirc;ter,
enfin, si il est dangereux, ils sera d&eacute;clar&eacute; comme illicite...
Petit &agrave; petit les gens seront oblig&eacute;s de s'immuniser, encore
et toujours contre une menace invisible, donc incontr&ocirc;lable... certains
sont de vrais paranos du net! Je ne dis pas qu'il ne faut pas s'immuniser!
Mais &eacute;viter de tomber dans une parano&iuml;a! Bien que ces protections
soit n&eacute;fastes pour les hackers, elles sont bien entendu b&eacute;n&eacute;fiques
pour les entreprises et particuliers... La cr&eacute;ation de virus et
de trojans cr&eacute;&eacute; une immunit&eacute; g&eacute;n&eacute;rale!
Si le monde d'internet reste passif et ignorant &agrave; cet menace, le
jour ou y'aura un gros trojan, vous s'rez pas dans la merde! Vous &ecirc;tes
en quelques sorte prot&eacute;g&eacute; pour l'avenir! Comme une maladie
dont on trouve par la suite le rem&egrave;de! Que penser donc...?
<BR>&nbsp;&nbsp; Quel but ont les hackers (en g&eacute;n&eacute;ral!)...
Il faut d'abord savoir que certains se pr&eacute;tendent hackers, car ils
savent juste nuker, d'autres se disent hacker alors que ils ne sont que
des crashers, etc... Le hacker pour une grande partie des hackers, hacke
surtout par simple plaisir, et par renfrognement &agrave; se trouver face
&agrave; une protection qui semblerait infranchissable. Par d&eacute;fi
aussi. Si on regroupe les 3 ensembles on pourrait dire que c'est le plaisir
d'affronter un d&eacute;fi, qui est celui de passer une protection... Les
hackers trouvent &ccedil;a assez grisant! Ils tiennent aussi &agrave; prouver
par leurs explois, que rien n'est infaillible! Qu'&agrave; chaque nouveau
programme, il y a une faille! Que chaque nouveau syst&egrave;me d'exploitation
a une faille... Que TOUT a une faille (rien n'est infaillible, si vous
pr&eacute;f&eacute;rez). Certains (minorit&eacute;) essayeront de faire
progresser les d&eacute;butants dans ce domaine (en &eacute;crivant des
E-mags, par l'envoi de mails, par icq etc...). Certains essayent aussi
de casser les pr&eacute;jug&eacute;s que certains hackers ont sur d'autres!
Je prends l'exemple d'un mec du nom de Mx (raccourci pour garder en toute
int&eacute;gralit&eacute; son anonymat). Je l'ai intercept&eacute; par
icq, en ayant son UIN gr&acirc;ce &agrave; un de mes contacts (il est important
d'avoir des contacts). Donc j'ai fais 3 requ&ecirc;tes de chat, ensuite
je suis venu il m'a presque "eject&eacute;"... J'ai essay&eacute; de lui
parler, mais c'est une vraie t&ecirc;te d'&acirc;ne! J'ai eut le droit
a tous les compliments: lamer, d&eacute;butant, t'es louche, je te fais
pas confiance, qui tu es pour m'aborder comme &ccedil;a??? Ce mec l&agrave;
devait avoir des pr&eacute;jug&eacute;s du tonnerre de dieu! J'ai bien
essay&eacute; de lui montrer qu'il ne devait pas se m&eacute;fier de tout
le monde, mais j'en suis toujours au m&ecirc;me stade avec lui... Bon,
d'accord ce n'est qu'un exemple et y'en a d'autres. Ah oui! Dernier point
pour clore cette introduction: un hacker a pour habitude de ne pas faire
chier les gens, sauf n&eacute;cessit&eacute;, avec ses techniques de hack
et ses programmes! Donc si un jour un mec se ram&egrave;ne vous mena&ccedil;ant
de tout et n'importe quoi, et en pr&eacute;tendant &ecirc;tre hacker, ne
vous y trompez pas: ce n'est point un hacker, mais un emmerdeur! pig&eacute;?
<BR>&nbsp;
<CENTER><FONT SIZE=+2>&lt;&lt;&lt;3- Les trucs utiles>>></FONT></CENTER>
<U><FONT SIZE=+1>- Acc&eacute;der aux comptes ftp d'un site</FONT></U>:
je vous explique uniquement comment acc&eacute;der au ftp: je ne vous dis
ni comment avoir les passwords, ni les noms d'utilisateurs! On verra &ccedil;a
apr&egrave;s...
<BR>Aller sous DOS puis &eacute;crire (les ">" ne sont pas &agrave; &eacute;crire!):
<BR>> ftp
<BR>> open
<BR>> www.nomdusite.com
<BR>ENTREE
<BR>Et voil&agrave; le tour est jou&eacute;! L'exemple en images, avec
Mygale:

<P><IMG SRC="ftpmyg.jpg" HEIGHT=184 WIDTH=643>
<BR>On peut faire &ccedil;a avec l'adresse IP d'un site? Je r&eacute;ponds
oui! La commande est la m&ecirc;me mais &agrave; la place du www.nomdusite.com
vous mettez son adresse IP, d&eacute;monstration en images sur le site
de zymark:

<P><IMG SRC="ftp.jpg" HEIGHT=296 WIDTH=591>

<P>L&agrave;, l'acc&egrave;s a &eacute;t&eacute; r&eacute;ussi, mais c'est
un acc&egrave;s autoris&eacute;: il est pr&eacute;vus &agrave; cet effet!
Je vous expliquerais apr&egrave;s comment faire.

<P><FONT SIZE=+1><U>- L'adresse de l'U.S Navy par telnet:</U> </FONT>pirater
la marine am&eacute;ricaine par telnet! AAARRRRFFF! Ca vous tente? Vous
avez telnet? Alors voici son adresse: navobs1.usnogps.navy.mil
<BR>Faites gaffe! Un de mes potes a essay&eacute; avec la NASA! Ca a pas
tard&eacute;! Vous &ecirc;tes trac&eacute;s! Mon pauvre copain a re&ccedil;u
un mail de menace comme quoi il ne devait plus se reconnecter &agrave;
la NASA par telnet!

<P><FONT SIZE=+1><U>- Tracer un site ou un particulier:</U> </FONT>Tracer
un site ou un particulier, est une chose assez utile parfois, il faut l'avouer!
Je vous expliquerais apr&egrave;s dans, piratage d'un site comment l'utiliser
&agrave; son maximum de possibilit&eacute;s! 'abord pour tracer il faut
aller sous DOS, puis &eacute;crire (les ">" ne sont pas &agrave; &eacute;crire!):
<BR>> tracert 123.123.123.123
<BR>ENTREE
<BR>123.123.123.123 n'est qu'un exemple: vous pouvez savoir comment avoir
l'IP d'un particulier dans <A HREF="http://www.multimania.com/clad2/2020hac.htm">l'issue
1 de HACKER2020,</A> et vous aurez le tra&ccedil;age de sa b&eacute;cane,
par ou passe le signal!
<BR>Et pour les sites? Prenons l'exemple de Mygale:
<BR>faites (toujours sous Dos et les ">" ne devant pas &ecirc;tre &eacute;crit):
<BR>> tracert www.mygale.org
<BR>ENTREE
<BR>Et voil&agrave; le r&eacute;sultat en image:

<P><IMG SRC="tracert.jpg" HEIGHT=305 WIDTH=647>

<P>La premi&egrave;re ligne (avant la liste) donne, le nom du serveur et
son IP entre crochets (utile pour avoir l'IP du serveur).
<BR>La 1ere ligne de la liste, donne l'adresse IP d'ou part le signal,
les autres lignes les rooteurs ou serveurs interm&eacute;diaires, et la
derni&egrave;re ligne la cible atteinte, donc fin du tra&ccedil;age!
<BR>Pour obtenir d'autres utilisations du tracert faites (toujours sous
Dos et les ">" ne devant pas &ecirc;tre &eacute;crit):
<BR>> tracert
<BR>ENTREE
<BR>Et vous aurez une s&eacute;rie d'infos &agrave; faire sur le tracert.

<P><FONT SIZE=+2>&nbsp;</FONT><FONT SIZE=+1><U>- Pinger sous DOS:</U> </FONT>Pinger
sert &agrave; savoir, si oui ou non, la cible &agrave; pinger existe et
si la connexion est de bonne qualit&eacute; et pas trop lente. Pour pinger
faites (toujours sous Dos et les ">" ne devant pas &ecirc;tre &eacute;crit):
<BR>> ping 123.123.123.123
<BR>ENTREE

<P><IMG SRC="ping.jpg" HEIGHT=220 WIDTH=450>

<P>Pour connaitre d'autres fonctions du ping faites (toujours sous Dos
et les ">" ne devant pas &ecirc;tre &eacute;crit):
<BR>> ping
<BR>ENTREE
<BR>Et une s&eacute;rie d'infos sur le ping vous sera donn&eacute;es.
<BR>En g&eacute;n&eacute;rant un flood de ping vous pouvez faire ralentir
la vitesse de connection de la cible, voir m&ecirc;me la d&eacute;connecter!

<P><FONT SIZE=+1><U>- Un outil tr&egrave;s utile: WS_PINGPR:</U> </FONT>Essayez
de le trouver sur le net et de le t&eacute;l&eacute;charger (sa taille
en zip est de: 69ko). Malgr&eacute; sa petite taille, ce pinger, tracer,
et autres.... peut vous &ecirc;tre tr&egrave;s tr&egrave;s utile! Je m'explique:
Supposons que vous cherchiez &agrave; avoir les N&deg; de tel des mec de
Multimania, avec leurs e-mails, les infos sur Multimania etc... a premi&egrave;re
vue, cel&agrave; parait impossible si on ne vous les donne pas! Faux. Ce
petit engin vous le garantit! Une petite image pour mieux comprendre et
je vous explique:
<BR>&nbsp;
<BR><IMG SRC="wsping.gif" HEIGHT=433 WIDTH=609>

<P>Donc ici, vous avez les infos sur Multimania: nom des contacts, adresse
IP du site, date de la cr&eacute;ation, etc... Vous remarquez que vous
avez des noms, leurs tels et leurs adresses e-mails.
<BR>Vous pouvez aussi tracer, pinger etc... Si vous essayez sur un particulier
vous obtiendrez uniquement son adresse IP et son adresse TCP. Cet outil
est tr&egrave;s utile dans le domaine du hacking.

<P><FONT SIZE=+1><U>- Internet , Structure :</U> </FONT>Internet est avant
tout un ensemble de reseaux interconnectes par divers moyens : cartes reseaux,
fibres optiques, sattelites ... Tel que l'utilisateur le voit, il ne saura
jamais comment sont connectees ces differentes machines: en effet, afin
d'etablir une compatibilite,un protocole de haut niveau a ete etablis:
le TCP/IP (Transfert Control Protocol/ Internet Protocol).Il recouvre de
nombreux protocoles non visibles par l'utilisateur:chaque machine possede
une adresse IP,soit fixe, soit variable selon la connexion; ainsi un serveur
Web aura toujours une IP fixe puisqu'il doit etre consultable en permanence
et que celui qui consulte ne doit pas avoir a retrouver l'adresse a chaque
fois.Les http (les adresses de la forme www.truc.com, www.machine.org...)
correspondent en fait a des adresses IP;elles n'ont ete creees que dans
un but de simplification:il est plus simple de retenir www.zymark.com que
198.199.168.4 pour le site de la societe Zymark. Ainsi lorsque vous tapez
une http dans un logiciel internet quelconque,lors de la consultation d'un
site,celle-ci sera convertie enune IP par un serveur; ce sont les tables
de routage qui referencent les correspondances http/IP. Les IP variables
sont en fait utilisees par les connectes ponctuels a Internet comme vous
ou moi.Ainsi a chaque connexion a Internet,votre provider vous delivre
une IP au "hasard". Une IP est en fait un champ de 32 bits: les 8 premiers
determinent la classe du reseau et l'identifient,les 24 suivants identifient
des sous-reseaux et des machines.

<P><IMG SRC="bk1.jpg" ALT="bk1.jpg (10902 octets)" HEIGHT=100 WIDTH=200>

<P>&nbsp;

<P>Ces 32 bits sont, pour l'utilisateur courrant,repartis en 4 champs de
8 bits separes par des points donc une adresse IP pourrait varier de 0.0.0.0
a 255.255.255.255. Toutes ces IP ne servent pas, et certaines ont des significations
particulieres. Ainsi l'adresse 127.0.01 est en fait l'adresse de la machine
elle-meme. Exemple:Si votre IP est 152.148..68.32,vous pourrez identifier
votre machine par 152.148.68.32 mais aussi par 127.0.0.1 pour vous connecter
sur vous-meme. Cependant, si quelqu'un d'autre se connecte sur le 127.0.0.1,
il se connectera sur sa propre machine.S'il se connecte sur le 152.148.68.32,
il se connectera sur votre machine
<BR>TCP/IP est un protocole de haut niveau dans la mesure ou il recouvre
plusieurs autres protocoles .

<P><IMG SRC="bk2.jpg" ALT="bk2.jpg (13403 octets)" HEIGHT=100 WIDTH=500>

<P>Votre connexion passera en fait par plusieurs machines qui regulent
et dirigent les informations entre les reseaux meme si vous ne voyez pas
ces machines. Si en passant entre tous ces reseaux, vos informations aura
probablement ete transferees sous differents protocoles et sur differents
types de reseaux physiques, mais pour vus, tout est reste transparent comme
si un fil etait tendu entre la machine distante et la votre. Bref aper&ccedil;u
sur les classes de reseaux: Les classes de reseaux ont en fait ete definies
lors de l'augmentation prodigieuse du nombre de machine connectees a Internet
de maniere quasi permanente.voici les diff&eacute;rentes classes:Classe
:
<TABLE BORDER WIDTH="574" HEIGHT="52" >
<TR>
<TD WIDTH="60" HEIGHT="29"></TD>

<TD WIDTH="202" HEIGHT="29">Domaine d'IP</TD>

<TD WIDTH="288" HEIGHT="43">Sp&eacute;cificit&eacute;s :</TD>
</TR>

<TR>
<TD WIDTH="60" HEIGHT="22">A</TD>

<TD WIDTH="202" HEIGHT="22">0.0.0.0 / 127.255.255.255</TD>

<TD WIDTH="288" HEIGHT="44">1 bit d'identification de classe&nbsp;
<BR>7 bits d'identification du reseau&nbsp;
<BR>24 bits d'identification de la machine</TD>
</TR>

<TR>
<TD WIDTH="60" HEIGHT="46">B</TD>

<TD WIDTH="202" HEIGHT="46">128.0.0.0 / 191.255.255.255</TD>

<TD WIDTH="288" HEIGHT="40">2 bits d'identification de classe&nbsp;
<BR>14 bits d'identification du reseau&nbsp;
<BR>16 bits d'identification de la machine</TD>
</TR>

<TR>
<TD WIDTH="60" HEIGHT="31">C</TD>

<TD WIDTH="202" HEIGHT="31">192.0.0.0 / 207.255.255.255</TD>

<TD WIDTH="288" HEIGHT="25">3 bits d'identification de la classe&nbsp;
<BR>21 bits d'identification du reseau&nbsp;
<BR>8 bits d'identification de la machine</TD>
</TR>

<TR>
<TD WIDTH="60" HEIGHT="29">D/E</TD>

<TD WIDTH="202" HEIGHT="29">208.0.0.0 / 255.255.255.255</TD>

<TD WIDTH="288" HEIGHT="27">Reservees a des applications particulieres&nbsp;
<BR>et ulterieures en vu de l'accroissement&nbsp;
<BR>du reseau Internet.</TD>
</TR>
</TABLE>
&nbsp;(texte tir&eacute; de Back-Side issue1).

<P>&nbsp;<U><FONT SIZE=+1>- Exploiter un syt&egrave;me:</FONT></U> L'exploitation
du systeme est ce qui devient r&eacute;ellement interessant: en penetrant
un systeme, vous ne serez probablement pas root du premier coup ... Essayez
quand meme de choper le fichier /etc/passwd (par les ftp d'un site avec
le navigateur. C.f.: issue1) si vous ne l'avez pas ... Puis regardez de
quel systeme d'exploitation il s'agit. En effet, de nombreux systemes poss&egrave;dent
des bugs qui sont exploitables.C'est a dire qu'une s&eacute;rie de commandes
mal configur&eacute;es sur le systeme peuvent vous donner l'acc&egrave;s
root apres leur execution: cela va des scripts aux programmes. Cette serie
de commandes s'appelle un exploit;vous en trouverez plein sur le Net avec
ftpsearch . Essayez d'abord ces commandes . Il est n&eacute;cessaire a
ce niveau de connaitre la programmation en C et sous les shells. Le shell
est l'interpreteur de commandes: cela correspond au Dos; vous savez probablement
que l'ont peut programmer des fichier batch avec un langage restreint sous
Dos.. C'est pareil sous Unix ... Je ne m'&eacute;tendrais pas plus sur
les exploits cette fois-ci ... essayez deja un peu tout ce qui a &eacute;t&eacute;
expliqu&eacute; ici ...
<BR>&nbsp;
<CENTER><FONT SIZE=+2>&lt;&lt;&lt;&lt;&lt;4- Programmation en C>>>>></FONT></CENTER>

<CENTER>Tir&eacute; de Back-Side</CENTER>
Avant de programmer,il est necessaie de comprendre ce qu'est un algorythme.En
bref, c'est un ensemble d'instructions ou d'op&eacute;rationjs qui conduisent
&agrave; un r&eacute;sultat donn&eacute;. Au fil des No de Back-SiDe, j'essaierais
de vous enseigner en partie le C.Pour cela,je vais commencer par la syntaxe
generale du C, puis au fur et a mesure ,j'expliquerais les fonctions de
chaque librairie,d'abord disponibles sur les compilateurs pour les processeurs
de la famille i86 puis celles de Unix.
<BR>Le C a la reputation d'etre assez dur et redibitoire,heu, je sais pas
trop d'ou elle vient.Je n'ai pas trouve que le C etait un langage plus
difficile qu'un autre.Voila c'etait le preambule =).
<BR>Alors comment ca marche le C ? Un programme comporte plusieurs parties:une
premiere destinee au compilateur, puis apres le programme lui-meme qui
se compose d'une fonction principale et eventuellement d'autres fonctions.Je
claque tout de suite l'exemple classique:
<BLOCKQUOTE>#include &lt;stdio.h>

<P>void main(void)
<BR>{
<BR>puts("Desole pour un exemple pourri comme celui-la.");
<BR>}</BLOCKQUOTE>
Alors les parties ?
<BR>La premiere partie destinee au compilateur contient juste la commande
#include &lt;stdio.h>
<BR>Ca veut dire quoi ? En fait, en C, la plupart des fonctions de bases
sont deja preprogrammees et stockees dans des librairies de fonctions.Cette
commande va donc inclure dans votre programme toutes les fonctions deja
preprogrammees et stockees dans le fichier stdio.h .stdio.h, bizarre ce
nom ...ca correspond a STanDart&nbsp; Input Ouput.Il comprend la plupart
des fonctions d'entree/sortie.&nbsp; Ensuite, le programme lui-meme: Ici
il ne contient qu'une fonction,la fonction principale: main .Tout programme
en C contient obligatoirement une fonction main:c'est elle qui sera lancee
au demarrage de votre programme. Cette fonction principale ne contient
qu'une&nbsp; fonction: puts qui est definie dans stdio.h . Pour abreger,
puts renvoit une chaine de caracteres sur la sortie standard (en l'occurence,
l'ecran). Une fonction est un ensemble d'instructions;pour montrer ou commence
cette ensemble, on le debute par une accolade ouverte:{ et pour la fermer,
une accolade fermee:} Une instruction est en fait une operation simple
directement executable par le processeur:une addition,une affectation memoire...
Cela explique donc que main soit suivi directement d'une accolade et qu'une
autre fermee se trouve juste apres puts. Une fonction peut admettre des
parametres. Si vous voulez afficher quelque chose a l'ecran, il faut preciser
quoi: les parametres sont donc transmis a la fonction par le biais de parentheses
juste apres ,comme dans le cas de puts.
<BR>Enfin,une fonction peut renvoyer une information: si vous desirez calculer
la racine d'un nombre, la fonction doit pouvoir vous renvoyer la valeur
de la racine.

<P>Ainsi, une fonction est definie de la maniere suivante:valeur_renvoyee
fonction(parametres). puts est en fait define de cette maniere:
<BR>int puts(string);
<BR>Important en C sauf cas particulier, une instruction ou une fonction
est toujours suivie d'un point-virgule.int correspond a un entier: c'est
un type de variable: en effet;lors de la programmation ,la manipulation
de parametres s'effectue par le biais de variables. Il existe plusieurs
types de variables selon le type de parametres a utiliser :selon que cela
sera une chaine de caracteres, un nombre entier de&nbsp; petite taille
ou un reel de grande taille, nous n'utiliserons pas le meme type de variable.
<BR>Une variable correspond en fait a un emplacement memoire d'une certaine
taille selon la valuer que nous vouons lui attribuer . Il est necessaire
en C de declarer vos variables de chaque fonction au debut de celles-ci
.Vos variables vont dependre des donnees que vous vooulez stocker a l'interieur.Ainsi,
si vous voulez stocker des entiers de petite taille&nbsp;&nbsp; (compris
entre -128 et 127 ),vous choisirez le type char;si votre entier est plus
grand (compris entre -32768 et 32767), vous choisirez le type int ... De
plus ,une variable peut-etre signee ou pas;cela varie en fait de&nbsp;
l'utilisation que vous comptez en faire.Par defaut, les variables sont
signees mais si vous&nbsp; choisissez qu'elle ne le soit pas,cela changera
l'encadrement de votre variable. Par exmple, si vous decidez de declarer
une variable non&nbsp; signee de type char, celle-ci sera alors comprise
entre 0 et 255 . Une fois vos variables declarees, il faut encore que vous
puissiez les&nbsp; exploiter: soit les modifier, soit les afficher.
<BR>Pour attribuer une valeur a une variable, la sequence est la suivante
:
<BR>variable=valeur;
<BR>De meme, pour attribuer a une variable la valeur d'une autre variable,on
utilise la syntaxe suivante:
<BR>variable1=variable2;
<BR>Vous pouvez ensuite effectuer les differentes operations de base sur
vos variables: les multiplier,les additionner ...
<BR>variable1=varible2*3; va mettre dans la variable1 le contenu de la
variable2 multiplie par 3.
<BR>Enfin, pour afficher une variable( eventuellement integree a une chaine
de caracteres...), on utilise la fonction printf():
<BR>int printf(chaine,parametre);
<BR>Supposons que je veuille afficher la chaine Hello,j'utiliserais la
sequence suivante:
<BR>printf("Hello");
<BR>Pour y integrer des variables, on utilise le signe %suivie de type
de variable a afficher puis apres la chaine, on met une virgule et la variable
en question ce qui donne si la variable est de type int:
<BR>printf("Valeur de la variable = %i .",variable);
<BR>Les types de variables sont:char (%c),int (%i),float(%f),double (%d),long
(%l) quant aux chaines de caracteres, il faut declarer un tableau de variables.
<BR>La declaration s'effectue alors ainsi: char chaine[12]; qui va vous
emettre un tableau de 12 caracteres... Vous pouvez acceder ensuite a chaque
caractere independemment par chaine[i] ou i est le caractere auquel vous
desirez acceder Attention,l'indice du premier caractere est 0,celui du
second 1 etc... jusqu'a 11 pour l'indice du douzieme caractere.Supposons
que notre variable vaille 2035, nous obtenons l'affichage suivant: Valeur
de la variable = 2035 . Par ailleurs, il peut etre interessant de mettre
en forme l'affichage de nos chaines de caracteres;ceci se fait au moyen
de caracteres particuliers precedes de \ inseres directement dans la chaine
de caracteres:Par exemple, le n sert a effectuer un saut de ligne et un
retour chariot,le a emet un bip sur le haut-parleur,le t marque une tabulation
horizontale ...
<BR>Regardez donc les exemples fournis avec ce zine:exemple2.c,exemple3.c
.Vous aurez remarquez les lignes commencant par /* et finissant par */,
ce sont des lignes de commentaires:le compilateur n'en tient pas compte
lorsqu'il compile votre programme;cela permet de mieux se retrouver dans
un gros listing.
<BR>Dans le dernier exemple, nous executons plusieurs fois la meme fonctions
ce qui nous contraint a taper de nombreuses fois la meme ligne et augmente
de plus la taille de notre programme inutilement. Nous allons donc voir
les structures conditionnelles. Si vous avez lu la partie sur les algorythmes,ca
ira vite a expliquer:le principe est d'effectuer une operation, d'incrementer
une variable et de tester la valeur de cette variable . La structure la
plus connue est if(condition) then instructions end. Voici un exemple rapide:
supposons que l'on recherhe le premier caractere espace dans une chaine
de 8 caracteres:
<BR>cela donnerait :
<BLOCKQUOTE>if(chaine[0]= =' ') trouve();
<BR>if(chaine[1]= =' ') trouve();
<BR>...
<BR>if(chaine[6]= =' ') trouve();
<BR>if(chaine[7]= =' ') trouve();
<BR>pastrouve();</BLOCKQUOTE>
C'est une facon de proceder cependant, la taille du fichier reste importante,
et c'est assez astreignant a taper.Voyons une forme plus optimisee: i est
ici une variable de type unsigned char.
<BLOCKQUOTE>i=0
<BR>processus:
<BR>if(char[i]==' ')
<BR>trouve();
<BR>else pastrouve();
<BR>i=i+i;
<BR>if(i&lt;=7)
<BR>goto processus;</BLOCKQUOTE>
Nous avons ici une instruction de saut : goto processus; elle signifie
que lorsqu'elle est executee, le programme continue a la suite de la ligne
processus: . Je vais un peu mieux expliquer la structure if(condition).
Si vous n'avez qu'une instruction a effectuer dans le cas ou la condition
est verifiee, alors la syntaxe est:
<BLOCKQUOTE>if(condition) instruction;</BLOCKQUOTE>
Cependant vous pouvez avoir plus d'une instruction a exectuer si cette
condition est verifiee auquel cas, vous devrez utiliser la syntaxe :
<BLOCKQUOTE>if(condition){instruction_1;instruction_2;...instruction_n;}</BLOCKQUOTE>
Mais un autre cas de figure peut se presenter:lorsque selon la condition,
vous souhaitez executer differentes instructions.Cela donne:
<BLOCKQUOTE>if(condition) instruction_1;
<BR>else instruction;
<BR>instructions_suivantes;</BLOCKQUOTE>
Dans ce cas de figure,le programme va tester la condition,si elle est vrai,
il va executer l'instruction 1 ,puis les instructions suivantes;si la condition
est fausse,il va executer l'instruction 2 puis les instructions suivantes.
Dans ce cas, vous pouvez aussi utiliser des accolades pour des suites d'instructions.Ces
formes de d'instructions conditionnelles sont les plus basiques qui soient;j'introduirais
plus tard d'autres formes plus efficaces au niveau du code...
<BR>Nous avons vu comment afficher des variables ou comment les modifier
... mais l'utilisateur doit avoir la possibilite de specifier ses propres
valeurs lors des calculs.Pour l'inviter a entrer le contenu d'une variable,on
utilise la fonction scanf.Supposons que nous donnions a l'utilisateur la
possibilite de multiplier pi par un nombre de son choix,nous allons lui
demander d'entrer un entier de type float avec lequel le programme travaillera
apres... Cela donnerait:
<BLOCKQUOTE>float valeur;
<BR>scanf("%f",&amp;valeur);
<BR>printf("Le resultat est %f",(3.14159*valeur));</BLOCKQUOTE>
Le symbole &amp; precedant valeur dans la fonction scanf est important
dans la mesure ou &amp;valeur ne concerne pas le contenu de valeur mais
l'adresse memoire de la variable valeur.En fait scanf attribue a l'emplacement
memoire de valeur une donnee de type float...Il n'y a qu'un cas ou il ne
faut pas mettre le &amp;, c'est quand on demande a l'utilisateur de saisir
une chaine de caractere:
<BLOCKQUOTE>char chaine[10];
<BR>scanf("%s",chaine);</BLOCKQUOTE>
Nous avons vu comment entrer des donnes,les modifier.Je vais tacher d'expliquer
un autre mode d'adressage:l'adressage memoire direct par les pointeurs.Nous
avons vu que scanf lors de l'entree de donnees les attribuer a un emplacement
memoire par le biais du symbole &amp;.Un pointeur correspond en fait a
l'adresse memoire d'une variable.On declare un pointeur en meme temps que
les donnes mais en rajoutant le signe * devant son nom: int *pointeur;
pointeur va alors contenir non pas un entier mais l'adresse d'un entier.
Exemple:
<TABLE BORDER WIDTH="606" HEIGHT="4" >
<TR>
<TD WIDTH="175" HEIGHT="3">int entier;</TD>

<TD WIDTH="419" HEIGHT="3">Declaration d'une variable de type int</TD>
</TR>

<TR>
<TD WIDTH="175" HEIGHT="10">int *pointeur;</TD>

<TD WIDTH="419" HEIGHT="10">D&eacute;claration d'un pointeur sur une donn&eacute;e
de type int</TD>
</TR>

<TR>
<TD WIDTH="175" HEIGHT="12">entier = 12;</TD>

<TD WIDTH="419" HEIGHT="12">Adressage direct : Entier contient 12</TD>
</TR>

<TR>
<TD WIDTH="175" HEIGHT="1">pointeur = &amp;entier ;</TD>

<TD WIDTH="419" HEIGHT="1">Attribution &agrave; pointeur de l'adresse m&eacute;moire
de la variable entier</TD>
</TR>

<TR>
<TD WIDTH="175" HEIGHT="47">*pointeur = 45 ;</TD>

<TD WIDTH="419" HEIGHT="47">Attribution &agrave; l'emplacement m&eacute;moire
r&eacute;f&eacute;renc&eacute; par pointeur de la valeur 45 . Comme pointeur
contient l'adresse de la variable entier, celle- ci contient donc la valeur
45 .</TD>
</TR>

<TR>
<TD WIDTH="175" HEIGHT="7">*pointeur = 45 ;</TD>

<TD ROWSPAN="2" WIDTH="419" HEIGHT="4">Ces deux expressions sont donc &eacute;quivalentes
.</TD>
</TR>

<TR>
<TD WIDTH="175" HEIGHT="6">entier = 45 ;</TD>
</TR>
</TABLE>
&nbsp;On peut donc afficher la valeur de entier soit par
<BR>printf("%i",entier);
<BR>ou par
<BR>printf("%i",*pointeur);

<P>Pour entrer la valeur de entier par scanf, on pourra soit utiliser :
<BR>scanf("%i",&amp;entier);
<BR>soit
<BR>scanf("%i",pointeur);

<P>Il est necessaire de bien maitriser le principe des pointeurs car ils
servent dans la gestion des chaines de caracteres. La plupart des fonctions
de gestion des chaines de caracteres sont placees dans le fichier stream.h.Une
des plus importantes est probablement strcmp() qui compare 2 chaines de
caracteres et renvoit un valeur selon les differences On l'utilise de cette
maniere:
<BR>comp=strcmp(*chaine1,*chaine2);
<BR>comp sera nul si les 2 chaines sont egales,positif si la chaine1 est
superieur chaine2,negatif si la chaine1 est inferieure a la chaine2.La
comparaison s'ffectue caractere par caractere.Pour comparer "albert" et
"alfred", la fonction strcmp compare d'abord la premiere lettre de chaque
mot puis la seconde ... Ici,la chaine "albert" est inferieure a la chaine
"alfred" car "b" est inferieur a "f".Pour 2 chaines de longueurs differentes,par
exemple "mais" et "maison", la chaine "mais" est alors inferieure.Enfin,pour
une majuscule et une minuscule, c'est toujours la majuscule qui est superieure
a la minuscule .Quant aux chiffres,ils sont inferieures au majuscules mais
superieurs aux minuscules. Nous avons vu que un programme se composait
principalement d'appel a des fonctions deja definies: main() pour la fonction
principale ou alors strcmp(), printf(),scanf() ...On ne trouve pas forcement
de fonction deja definie pour operation que nous souhaitons effectuer:il
faut alors la realiser a partir de ses propres ensembles d'instructions.
Cette fonction peut alors renvoyer une valeur, admettre des parametres.
Une fonction se definit alors de cette maniere:
<BLOCKQUOTE>&lt;type de valeur renvoyee> fonction(&lt;parametres>)
<BR>{
<BR>ensemble des instructions...
<BR>}</BLOCKQUOTE>
Ainsi si votre fonction doit retourner comme valeur un entier et ne recevoir
aucun parametre, vous la definirez comme suit:
<BLOCKQUOTE>int fonction(void)
<BR>{
<BR>int i;
<BR>instructions
<BR>return(i);
<BR>}</BLOCKQUOTE>
Voici une bonne introduction au C... Je vous laisse potasser ca pour le
moment.
<BR>&nbsp;
<CENTER><FONT SIZE=+2>&lt;&lt;&lt;&lt;&lt;5- Piratage d'un site>>>>></FONT></CENTER>


<P>&nbsp;&nbsp; Le site que nous prendrons comme exemple sera hacker.com.
La premi&egrave;re chose &agrave; faire, avant de ce mettre &agrave; cette
t&acirc;che ardue, est de v&eacute;rifier que l'on a le "mat&eacute;riel
n&eacute;cessaire", ce qui revient &agrave; dire:
<BR>-Telnet
<BR>- DOS et les tracert, ping, etc...
<BR>- Un crackpass (puissant)
<BR>- WS_PINGPR (de pr&eacute;f&eacute;rence)
<BR>- Une connaissance sous Linux ou Unix (ou m&ecirc;me aucune)
<BR>- L'url du site &agrave; pirater (&ccedil;a parait b&eacute;nin, mais...
)
<BR>&nbsp;&nbsp; Pour commencer il faut obtenir le maximum d'infos sur
le site et les r&eacute;pertorier sur un carnet ou sur une feuille: elles
sont nombreuses.
<BR>Avoir l'url du site, son adresse IP et TCP: pour avoir ces infos aller
sous dos, taper (les ">" ne devant pas &ecirc;tre &eacute;crit):
<BR>> tracert www.hacker.com
<BR>ENTREE
<BR>- Vous n'avez pas l'adresse TCP du site, vu qu'il n'en a pas. L'adresse
IP est: 209.195.130.87.
<BR>- Les infos sur les utilisateurs (gr&acirc;ce &agrave; WS_PINGPR):
<BR>Administrative Contact, Technical Contact, Zone Contact:Beckett, Jodi&nbsp;
(JB11383)&nbsp; jodi@NAUTICOM.NET
<BR>412-449-4600 (FAX) 412-449-4659

<P>Billing Contact:Beckett, Jodi&nbsp; (JB11383)&nbsp; jodi@NAUTICOM.NET
<BR>412-449-4600 (FAX) 412-449-4659
<BR>- Ensuite essayez (ce n'est pas le cas pour ce site), essayez sur le
navigateur: ftp://www.nomdusite.com ou ftp://ftp.nomdusite.com. ensuite
vous cherchez la rubrique password, si l'acc&egrave;s aux ftp par ce chemin
n'est pas prot&eacute;g&eacute; (rare). cette rubrique password vous donnera
les logins (pas les pass) pour les utilisateurs, sinon par d&eacute;faut
sortez votre crackpass... mais dans quelles conditions doit dont mettre
un nom d'utilisateur et un password, et o&ugrave;? On verra &ccedil;a un
peu apr&egrave;s.
<BR>- Puis acc&eacute;der aux autres adresses IP qui sont les plus proches
du site. En faisant un tracert, l'adresse juste au dessus du site, vous
donne l'adresse du routeur du site (en g&eacute;n&eacute;ral, sinon scannez
le r&eacute;seau). Vous prenez son adresse IP ou l'adresse locale (Local
Host), vous prenez Telnet et vous rentrez l'adresse IP, port SNMP. Vous
voil&agrave; connect&eacute; au router par telnet. On vous demandera le
nom d'utilisateur et son password.

<P>Voil&agrave;! ca c'est pour le d&eacute;marrage! Ensuite... Vous allez
sous DOS et vous fa&icirc;tes (les ">" ne devant pas &ecirc;tre &eacute;crit):
<BR>> ftp
<BR>> open
<BR>> www.hacker.com
<BR>On vous demandera&nbsp; un nom d'user. Vous pouvez rentrer en anonymous
si le serveur le permet, et t&eacute;l&eacute;charger les pages, mais ce
ne sera pas du hack, je vous dis comment faire:
<BR>vous rentrez comme nom d'user: anonymous, ensuite vous tapez n'importe
quel password et vous tapez: ls
<BR>Donc vous regardez les infos obtenus avec WS_PINGPR et vous avez plusieurs
noms qui vous sont donn&eacute;s: Beckett et Jodi.
<BR>Vous essayez les 2 noms d'utilisateurs et vous remarquez que "Jodi"
r&eacute;pond! Tr&egrave;s bien! vous venez de faire la moiti&eacute;:
vous avez trouvez un nom d'user, il vous faut maintenant le password...
Inutile de vous casser la t&ecirc;te! Si la personne est prudente vous
n'avez aucune chance de le trouver. Sortez votre meilleur Crackpass et
essayez. Par d&eacute;faut rabattez-vous sur le(s) routeurs par telnet.
Bonne chance!

<P>Voil&agrave;! Cet&nbsp; E-mag est bel et bien fini! Je pense en sortir
encore d'autres, mais il faudra attendre un peu! Pour tout commentaires
vous pouvez &eacute;crire &agrave; : <A HREF="mailto:clad_strife@hotmail.com">clad_strife@hotmail.com</A>
<BR>&nbsp;
<DIV ALIGN=right><IMG SRC="bigepee.gif" HEIGHT=189 WIDTH=249></DIV>
&nbsp;
<BR>&nbsp;
<BR>&nbsp;

<P>&nbsp;
<BR>&nbsp;
<BR>&nbsp;

<P><FONT SIZE=+2>&nbsp;</FONT>
<BR>&nbsp;
<BR>&nbsp;
<BR>&nbsp;
</BODY>
</HTML>
