<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.61 [en] (Win98; I) [Netscape]">
   <meta name="Author" content="Clad Strife">
   <meta name="Description" content="nothing to say on the hack">
   <title>bios et net</title>
</head>
<body text="#CCCCCC" bgcolor="#000000" link="#0000EE" vlink="#551A8B" alink="#FF0000">

<center><font color="#FF0000"><font size=+3>CRACKER UN PASSWORD BIOS</font></font></center>
<font color="#FFCCFF"><b><u>DISCLAIMER:</u></b> L'intrusion dans des syst&egrave;mes
informatiques et la modification des donnes sont condamn&eacute;es par
la loi. les peines peuvent aller jusqu'&agrave; 3 ans de prison et 30.000
F d'amende. Pour plus d'informations; veuillez vous reporter notamment
aux articles 311, 322, 335 du nouveau Code P&eacute;nal.</font>
<br>Je remercie d'avance<font color="#33CCFF"> Gregory Heinrich du <a href="http://www.acbm.com">Pirates
Mag</a> </font>qui m'a aid&eacute; &agrave; faire cet article (cracker
un password Bios)
<br>Bon... Il y a trois solutions pour buter son ch'tit password Bios.
<ol>
<li>
En d&eacute;vissant le boitier, en trouvant la batterie du Bios, en faisant
&eacute;jecter celle-ci. Ou encore trouver le cavalier qui permet d'effacer
de la m&eacute;moire le contenu de la carte m&egrave;re et le faire commuter.
Cel&agrave; peut ne pas marcher si le boitier est ferm&eacute; &agrave;
clefs, si la batterie est int&eacute;gr&eacute;e au composant qui stocke
le contenu des r&eacute;glages etc...</li>

<li>
On peut aussi essayer de d&eacute;crypter le password du Bios, l&agrave;
il faudra faire appel &agrave; des programmes ou &agrave; des techniques
diff&eacute;rentes...</li>

<li>
H&eacute;h&eacute;, la vraie technique que l'on va aborder: modifier le
CONTENU&nbsp; de la m&eacute;moire du Bios, avec un programme fourni le
plus souvent avec le syst&egrave;me d'exploitation... Mais n'oubliez pas
de lancer le programme avec le pc allum&eacute; ici!</li>
</ol>
&nbsp;&nbsp; En fait le Bios dispose d'une m&eacute;moire appel&eacute;e
CMOS. En g&eacute;n&eacute;ral ils ont &agrave; leur disposition une proc&eacute;dure
de contr&ocirc;le qui v&eacute;rifie au d&eacute;marrage l'int&eacute;grit&eacute;
des donn&eacute;es de la m&eacute;moire... regardez sur votre &eacute;cran
au d&eacute;marrage: un message tel que Bios Installed Succesfully devrait
g&eacute;n&eacute;ralement s'afficher. Cette proc&eacute;dure s'appelle
la "CMOS Cheksum" et donne donc lieu &agrave; une "CMOS Cheksum Error",
si il y a des blems! Dans ces cas le Bios va tenter de r&eacute;initialiser
la CMOS avec des valeurs par d&eacute;faut. Justement: en <u>g&eacute;n&eacute;ral</u>
l'option par d&eacute;faut pour le mot de passe est de ds&eacute;activer
celui-ci! Il existera mais ne sera pas demand&eacute; &agrave; l'amor&ccedil;age.
Mais ceci valable non seulement avec le mot de passe standard mais aussi
avec le mot de passe qui permet de rentrer dans le Setup. Alors comment
modifier le CMOS??? Eh ben via les ports d'entr&eacute;e-sortie, c'est
&agrave; dire les ports peremettant directement de communiquer avec un
&eacute;l&eacute;ment mat&eacute;riel sans passer par l'OS. Les ports qui
nous int&eacute;resse sont les ports 70h et 71 h . Pour acc&eacute;der
en lecture ou en &eacute;criture &agrave; un octet de la CMOS, il faut
d'abord indiquer au Bios quel octet on d&eacute;sire atteindre. Ceci se
fait par un acc&egrave;s en &eacute;criture sur le port 70h avec le num&eacute;ro
de l'octet. Un acc&egrave;s en lecture ou en &eacute;criture au port 71h
permettra alors de lire ou d'&eacute;crire sur l'octet consid&eacute;r&eacute;...
H&eacute;h&eacute;, on a besoin de programmes pour &ccedil;a nan? eh oui!
Microsoft est assez con pour filer de quoi pirater ses propres utilitaires.
Car nous allons utiliser <font color="#FFFF00">Debug</font>, fourni avec
Ms-Dos. Probl&egrave;me! Certains Bios semblerait immunis&eacute;s contre
le Cheksum Error. Impossible d'op&eacute;rer alors. Ce sont essentiellement
des Bios de marque comme les Bios qui &eacute;quipent les HP Vectra&nbsp;
et dont les informations relatives au mot de passe ne se trouvent pas dans
la CMOS mais dans un autre m&eacute;moire de m&ecirc;me type.
<br>&nbsp;
<p><font color="#009999">MODIFIER LE CMOS AVEC DEBUG:</font>
<br><font color="#009999">Depuis la ligne de commande sous Ms-Dos tapez:
DEBUG.</font>
<br><font color="#009999">Pour avoir de l'aide tapez '?'. La commande &agrave;
utiliser pour r&eacute;aliser un acc&egrave;s en &eacute;criture sur un
port est: O port valeur (les valeurs sont &agrave;rentrer en h&eacute;xad&eacute;cimal
et sans le 'h'). Essayer de taper dans l'intervalle standard avec un truc
du genre:</font>
<br><font color="#009999">O 70 20</font>
<br><font color="#009999">O 71 66</font>
<br><font color="#009999">Si &ccedil;a ne marche pas essayez d'autres octets</font><font color="#367374">.</font>
<center>
<p><font color="#FF0000"><font size=+3>DECRYPTER DES IMAGES XXX</font></font></center>

<p>Chaque fichier image est crypt&eacute;e avec une clef diff&eacute;rente.
Pour la retrouver, on effectue un XOR entre le premier octet du fichier
et la premi&egrave;re valeur de l'ent&ecirc;te d'un fichier JPG. Le r&eacute;sultat
est la clef. Il suffit ensuite de l'appliquer &agrave; tous les octets
du fichier et enregistrer cette transformation dans un nouveau fichier.
tapez ce programme dans Qbasic et lancez-le! Indiquez lui le chemin du
fichier &agrave; d&eacute;coder et l'emplacement o&ugrave; sauvegarder
ma version d&eacute;cod&eacute;e avec l'extension JPG. L'image sera maintenant
visible avec n'importe quel visualiseur.
<pre>20 COMMON LONGUEUR AS LONG
30 INPUT"Nom du fichier &agrave; d&eacute;coder";NOM$
40 IMPUT"Nouveau Nom du fichier";NOUV$
50 OPEN NOM$ FOR RANDOM AS#1 LEN=1
60 OPEN NOUV$ FOR OUTPOUT AS#2
70 FIELD#1, 1 AS A$
80 LONGUEUR=LOF(1)
90 GET 1 'lecture du premier octet que l'on stocke dans la variable A$
100 LU=1SC(A$)
110 CLAF=LU XOR 255 'On calcule la clef d'apr&egrave;s le premier octet d'un en-t&ecirc;te JPEG :255
120 PRINT#2, CHR$(255);
'On lit le fichier octet par octet jusqu'&agrave; sa fin
130 FOR I=2 TO LONGUEUR
140 GET 1
150 LU=ASC(A$)
160 CLAIR=(LU XOR CLEF) 'On effectue le XOR entre la clef et l'octet lu
170 PRINT#2, CHR$(CLAIR);'On &eacute;crit le r&eacute;sultat dans le deuxi&egrave;me fichier
180 NEXT I
190 CLOSE</pre>

<center><font color="#FF0000"><font size=+3>LES VIRUS</font></font></center>

<p><br>
<p>&nbsp;&nbsp; Nanananan! Avant de se faire de grosses illusions du style
que je vais vous donner les code sources de virus, sachez que je vais juste
parler de son aspect technique et bien d'autres informations...
<br>&nbsp;&nbsp; Un Virus est un programme susceptible d'entra&icirc;ner
des perturbations dans le fonctionnement d'un ordinateur en d&eacute;naturant
ses programmes ex&eacute;cutables ou ses fichiers syst&egrave;me. Il se
transmet g&eacute;n&eacute;ralement par l'interm&eacute;diaire de disquettes
ou encore par t&eacute;l&eacute;chargement. La plupart des virus informatiques
ajoutent quelques lignes de commandes dans le fichier cible lorsqu'ils
sont charg&eacute;s en m&eacute;moire. Ces commandes ont g&eacute;n&eacute;ralement
pour cons&eacute;quence de ralentir ou d'emp&ecirc;cher l'ex&eacute;cution,
voire de d&eacute;truire certains fichiers. La seule mani&egrave;re de
s'en pr&eacute;munir efficacement consiste &agrave; tester toute nouvelle
information ins&eacute;r&eacute;e dans la machine au moyen d'un logiciel
antivirus. N&eacute;anmoins, de nouveaux virus apparaissant chaque jour,
ce logiciel se doit d'&ecirc;tre le plus r&eacute;cent et le plus actualis&eacute;
possible, sachant qu'il existe toujours un d&eacute;lai entre l'apparition
d'un nouveau virus et l'&eacute;laboration de la parade. Actuellement,
il existe de nombreux types de virus informatiques, toujours plus sournois
et moins visibles. Un virus capable de se propager &agrave; travers des
r&eacute;seaux informatiques est parfois appel&eacute; ver, en particulier
lorsqu'il se compose de plusieurs segments dispers&eacute;s &agrave; travers
le r&eacute;seau. Un "cheval de Troie" est un dangereux virus se pr&eacute;sentant
sous la forme d'un programme utile, par r&eacute;f&eacute;rence au c&eacute;l&egrave;bre
cheval de Troie de la mythologie grecque. En cours d'ex&eacute;cution,
ce type de virus met en œuvre des actions destructrices &agrave; l'encontre
du syst&egrave;me, alors qu'il para&icirc;t accomplir une t&acirc;che totalement
anodine. Un virus peut rester dans la m&eacute;moire de l'ordinateur, constituant
dans ce cas un programme terminate-and-stay-resident (TSR) : on dit alors
qu'il s'agit d'un virus r&eacute;sident m&eacute;moire. Il peut en outre
&ecirc;tre encrypt&eacute;, rendant ainsi sa d&eacute;tection et sa r&eacute;sorption
plus d&eacute;licates. Enfin, il peut &ecirc;tre polymorphe, &eacute;vitant
d'&ecirc;tre d&eacute;cel&eacute; gr&acirc;ce &agrave; un changement interne
de sa structure. Le Virus a un cycle de vie divis&eacute; en trois &eacute;tapes:
<ul>
<li>
L'&eacute;x&eacute;cution:phase d'introduction du virus dans le syst&egrave;me.</li>

<li>
La propagation:pendant laquelle le virus cherche &agrave; se multiplier
le plus possible.</li>

<li>
L'action: &eacute;tape finale durant laquelle le virus met en oeuvre des
fonctions de dommages perturbantes et/ou destructices. Durant les phases
d'&eacute;x&eacute;cution et de propagation,le virus cherchera &agrave;
se faire le plus discret possible. La surprise n'en sera que plus grande
lors de l'action destructrice finale.</li>
</ul>

<ol>
<li>
&nbsp;<font color="#FFFF00"><font size=+1>Portrait d'un tueur en S&eacute;rie:
C I H</font></font></li>

<br>&nbsp;
<p>&nbsp;
<p>Nom&nbsp; Win95.CIH
<br>Autres variantes Chernobyl, PE_CIH, WIN95, CIH 1.x, Win95.CIH, Win32/CIH,W95/CIH.1003
<br>Taille 1 k
<br>Fichier infect&eacute; .exe
<br>Platefrome Windows 95 - windows 98
<br>Mode d'infection r&eacute;sident m&eacute;moire
<br>Date d'activation 26 du mois, 26 avril, 26 Juin (suivant version )
<br>D&eacute;g&acirc;t caus&eacute; efface le disque dur et dans certains
cas corruption du BIOS
<br>&nbsp;
<p><u>Version:</u>
<br>&nbsp;
<p>CIH 1.2 la plus r&eacute;pondue aussi connue sous le nom de Tchernobyl
en r&eacute;f&eacute;rence a la date de son activation.. S'active le 26
avril..
<br>CIH 1.3 date d'activation 26 juin (attention donc ).
<br>CIH 1.4 date d'activation chaque 26 du mois pas tr&egrave;s r&eacute;pondue
mais la plus dangereuse.
<br>&nbsp;
<p><u>Origine:</u>
<br>&nbsp;
<p>D'apr&egrave;s les &eacute;diteurs d'antivirus il serait originaire
de Taiwan.
<br>&nbsp;
<p>29 avril 1999
<br>D'apr&egrave;s AP, un institut d'ing&eacute;nieur &agrave; Taiwan a
d&eacute;clar&eacute; que virus CIH qui a frapp&eacute; cette semaine les
disques de millier de PC a &eacute;t&eacute; &eacute;crit par un de ses
ancien &eacute;tudiant, a rapport&eacute; l' Asoccited Press jeudi.
<br>Le virus CIH, cr&eacute;e par Chen Ing-hau, a frapp&eacute; les micro-ordinateurs
de TIT ( Tatung Institut of Technology ) en avril 1998. Chen, majeur de
sa promotion, a re&ccedil;u un bl&acirc;me mais n'a pas &eacute;t&eacute;
exclu de l'institut, a d&eacute;clar&eacute; le charg&eacute; des affaires
estudiantines. L'institut ne l'a pas punit plus s&eacute;v&egrave;rement
car Chen a demand&eacute; aux &eacute;tudiants de ne pas propager le virus.
<br>Chen a termin&eacute; ses &eacute;tudes en 1998 et actuellement il
passe son service militaire de 2 ans.
<br>Les initiales du virus CIH repr&eacute;sentent les initiales de Chen
(Chen Ing-hau ).
<br><img SRC="cheninhau.jpg" height=108 width=80>
<br>&nbsp;
<p><u>Description:</u>
<br>&nbsp;
<p>CIH est un virus qui infecte les fichiers ex&eacute;cutables Windows.
Quand un programme infect&eacute; est utilis&eacute; le virus s'installe
en m&eacute;moire et infectera tout les fichiers ouverts et consult&eacute;s
(lors d'une ex&eacute;cution ou de la copie ). Il faut donc imp&eacute;rativement
d&eacute;marrer tous micro infect&eacute; &agrave; partir d'une diskette
syst&egrave;me non infect&eacute; avant de commencer la d&eacute;sinfection
sinon le virus infecteras tous les fichiers scann&eacute; par un anti-virus.
<br>&nbsp;
<p>Les fichiers infect&eacute; ont la m&ecirc;me taille que les fichiers
originaux gr&acirc;ce au mode unique d'infection du CIH. Le virus scanne
le fichier avant de l'infecter pour d&eacute;tecter les espaces non utilis&eacute;
et se divise alors en plusieurs morceaux qui vont se cacher dans l'espace
inutilis&eacute;.
<br>&nbsp;
<p>Chaque 26 du mois, ou comme pour la variante Tchernobyl le 26 avril,
le programme entre dans sa phase destructive qui est devis&eacute; en deux
parties : Le Virus va d'abord essayer de modifier et de corrompre le BIOS.
Certains type de BIOS Flash seulement sont affect&eacute;. En corrompant
le BIOS qui sert &agrave; initialiser et g&eacute;rer les entr&eacute;es
sorties des p&eacute;riph&eacute;riques, il emp&ecirc;che ainsi le PC de
d&eacute;marrer lorsqu'on le met sous tension. La seconde phase et la plus
destructive pour vos donn&eacute;es consiste &agrave; &eacute;crire sur
le premier 1 MO de votre disque des donn&eacute;es al&eacute;atoire ce
qui entraine la perte des donn&eacute;es du disque dur.
<br>&nbsp;
<p>Ecran affich&eacute; lors de l'activation du Virus:
<br><img SRC="cih12.jpg" height=218 width=440>
<br>&nbsp;
<br>&nbsp;
<ol>
<li>
<font color="#FFFF00"><font size=+1>UN VIRUS A METTRE EN QUARANTAINE: MELISSA</font></font></li>
</ol>
Depuis vendredi dernier, de nombreuses soci&eacute;t&eacute;s am&eacute;ricaines
(dont l'Empire) ont &eacute;t&eacute; contraintes &agrave; couper leurs
serveurs de messagerie &eacute;lectronique. La raison? Un simple virus
baptis&eacute; Melissa qui utilise le couple Word-Outlook pour se propager
&agrave; la vitesse de la lumi&egrave;re...
<p>Tout commence par un anodin courrier &eacute;lectronique titr&eacute;
"Important message from..." contenant uniquement un document word en pi&egrave;ce
jointe. En ouvrant le fichier, l'utilisateur qui n'est pas prot&eacute;g&eacute;
contre Melissa engendre automatiquement l'envoi de 50 e-mails identiques
&agrave; celui qu'il a re&ccedil;u aux 50 premi&egrave;res personnes figurant
dans son carnet d'adresses. Une bonne surprise pour tous
<p>Les effets du virus ne sont pas tr&egrave;s dangereux en eux-m&ecirc;mes.
Melissa se contente d'ins&eacute;rer des citations extraites de la s&eacute;rie
"Les Simpsons" lorsque le nombre de minutes affich&eacute;es par l'horloge
est &eacute;gal au jour du mois (aujourd'hui 30 mars, c'est &agrave; 8h30,
14h30 ou encore 18h30 qu'il se d&eacute;clenchera). En parall&egrave;le,
le virus r&eacute;duit les param&egrave;tres de s&eacute;curit&eacute;
Internet de Windows &agrave; leur plus bas niveau. Rien de grave en soi,
les donn&eacute;es des utilisateurs ne sont normalement pas touch&eacute;es.
<p>Mais le virus, en se r&eacute;pandant toujours plus, utilise les ressources
de bande passante des entreprises et des fournisseurs d'acc&egrave;s &agrave;
Internet.
<p>En attendant, la plupart des soci&eacute;t&eacute;s infect&eacute;es
ont interdit l'exp&eacute;dition de messages ext&eacute;rieurs. Trend-Micro
a d&eacute;j&agrave; post&eacute; un anti-Melissa sur son site et les administrateurs
de r&eacute;seaux chassent actuellement la petite b&ecirc;te sur leurs
machines mais sont contraints de r&eacute;ajuster les param&egrave;tres
de s&eacute;curit&eacute; manuellement sur toutes les machines infect&eacute;es.
L'ensemble des &eacute;diteurs d'anti-virus devraient poster tr&egrave;s
rapidement une mise &agrave; jour de leur logiciels sur leurs sites web.
<p>En esp&eacute;rant que certains petits malins ne vont pas adapter Melissa
&agrave; leur sauce et ne lui donnent des capacit&eacute;s plus destructrices...
<br>&nbsp;
<br>&nbsp;
<ol>
<li>
&nbsp;<font color="#FFFF00"><font size=+1>HAPPY99: C'EST PAS LA JOIE!</font></font></li>
</ol>
&nbsp;Ce virus se manifeste depuis quelques mois dans le courrier &eacute;lectronique.
Le fichier HAPPY99.EXE est attach&eacute; &agrave; un courrier et s’il
est ex&eacute;cut&eacute;, il affichera sur l’&eacute;cran un feu d’artifice…
pendant qu’il profite de cette diversion pour aller inscrire 3 fichiers
pirates dans votre dossier WINDOWS. Ces fichiers seront activ&eacute;s
chaque fois que vous enverrez un courrier en y attachant, &agrave; votre
insu, le fameux fichier HAPPY99.EXE. Sans le savoir, vous venez de polluer
l’ordinateur de votre destinataire si celui-ci ex&eacute;cute le fichier
attach&eacute;.
<p>HAPPY99.EXE ne d&eacute;truit aucun fichier sur l’ordinateur… il n’est
donc pas trop m&eacute;chant. Il vise tout simplement &agrave; se propager
sur tous les ordinateurs de la plan&egrave;te pour finir par cr&eacute;er
un embouteillage monstre sur le Web. Ce qui est particuli&egrave;rement
vicieux c’est que celui qui en est atteint ne le sait m&ecirc;me pas et
qu’il continue ainsi &agrave; contaminer les autres &agrave; son insu…
<p>Pour v&eacute;rifier si HAPPY99.EXE a &eacute;lu domicile sur son ordinateur,
on doit aller dans le dossier WINDOWS pour rechercher si l’un des 3 fichiers
suivants s’y retrouve : ska.exe, ska.dll ou Wsock32.ska. Si c’est le cas,
il existe une proc&eacute;dure pour &eacute;radiquer le virus car il n’est
pas suffisant de supprimer seulement les 3 fichiers pirates.
<br>&nbsp;
<br>&nbsp;
<br>
<center>
<p>&nbsp;<font color="#FF0000"><font size=+3>LES MOUCHARDS</font></font></center>

<br>&nbsp;</ol>
&nbsp;&nbsp; Anonymes sur le www (World Wide Web)? Pas si sur! Voyez par
vous m&ecirc;me sur le site du <a href="http://www.cnil.fr">cnil</a>, ou
lisez cette article... Eh oui! Vous vous croyez tranquilous derri&egrave;re
votre &eacute;cran, mais il existe des moyens de surveillance... Prenons
un exemple REEL: une personne suspect&eacute;e de piratage informatique
sera surveill&eacute;e et sera "fich&eacute;e"... &ccedil;a peut aller
jusqu'&agrave; vous traquer: savoir quand-est-ce que vous vous connectez...
Mais comme on peut pas surveiller la moiti&eacute; de la plan&egrave;te...
En g&eacute;n&eacute;ral vous risquez pas grand chose... Sauf si:
<ol>
<li>
<font color="#FFFF00">Vous avez Shockwave7.</font> Il y avait une faille
dans ce logiciel que les &eacute;diteurs ont corrig&eacute;. Cette faille
permettait de r&eacute;cup&eacute;rer les mots de passe et les donn&eacute;es
personnelles des intrenautes. Pour voir les pages anim&eacute;es par Shockwave,
on devait t&eacute;l&eacute;charger un plug-in qui normalement devait s'installer
sur le navi. Au d&eacute;part le plug-in devait envoyer &agrave; l'&eacute;diteur
les donn&eacute;es li&eacute;es aux sites visit&eacute;s. Mais dans d'autre
cas il &eacute;tait possible de r&eacute;cup&eacute;rer les mots de passes
d'acc&egrave;s des sites!</li>

<li>
<font color="#FFFF00">Vous avez MSIE5 (Microsoft Internet Explorer 5)</font>.
Celui-ci envoie des infos aux serveurs des sites qu'on inscrit dans nos
signets. Et en plus c'ets pas un bug, c'est une fonctionnalit&eacute; voulue,
elle permet aux administrateurs de sites d'ins&eacute;rer leur logo &agrave;
c&ocirc;t&eacute; de leur nom dans la liste. Ca permettrait &agrave; certaines
soci&eacute;t&eacute;s de remplir leurs bases de donn&eacute;es de multi-informations
concernant leurs visiteurs. Le pire est qu'on ne peut actuellement RIEN
faire. Mais en se procurant le proxy des Junkbusters (<a href="http://www.junkbusters.com">http://www.junkbusters.com</a>),
ils pourront placer une ligne <font color="#FFFF00">/favicon.ico</font>
dans le fichier de filtres et r&eacute;gler le probl&egrave;me.</li>

<li>
Vous utilisez SmartCenter (de Netscape!!!). On regarde ou vous vous d&eacute;placez
pour vos recherches. Mais l&agrave; c'est d&eacute;j&agrave; moins un secret,
et on est au courant de l'endroit ou transitent les requ&ecirc;tes.</li>

<li>
<font color="#FFFF00">Vous avez le Minitel.</font> Le minitel poss&egrave;de
aussi (au moment ou l'on parle du PentiumIII justement) une puce num&eacute;rot&eacute;e...</li>

<li>
<font color="#FFFF00">Vous utilisez Netscape Communicator.</font> Un bug
dans le navigateur Netscape Communicator serait responsable d'une faille
de s&eacute;curit&eacute; susceptible de trahir les internautes surfant
anonymement sur le web gr&acirc;ce &agrave; des services comme Anonymizer.com.
Ces derniers sont en effet capables de d&eacute;sactiver les scripts contenus
dans les pages visit&eacute;es, afin d'emp&ecirc;cher un site web d'ins&eacute;rer
des cookies ou de prendre connaissance de certaines donn&eacute;es sur
l'internaute en vadrouille. Or, avec Netscape Communicator, des commandes
Javascript ins&eacute;r&eacute;es dans les champs texte des formulaires
permettent de passer outre la protection offerte par des services comme
Anonymizer.com. Anonymizer.com devrait proposer dans les prochains jours
un correctif &agrave; ses utilisateurs utilisant Communicator. En attendant,
il leur est conseill&eacute; de d&eacute;sactiver Javascript dans le menu
de configuration du navigateur.</li>

<li>
<font color="#FFFF00">Vous avez Windows98. </font><font color="#CCCCCC">Microsoft
vient de proposer un programme permettant d'&eacute;liminer le GUI, le
num&eacute;ro unique qui marque votre disque dur et tous les documents
que vous produisez si vous avez install&eacute; Windows 98 (voir HNT-Mag
by mail n&deg;9). Les utilisateurs de Windows 98 peuvent t&eacute;l&eacute;charger
ce programme &agrave; partir du module Windows Update (Menu D&eacute;marrer,
puis Param&egrave;tres), les autres pouvant le trouver sur le site de Microsoft.
L'actualit&eacute; r&eacute;cente a d&eacute;montr&eacute; la redoutable
efficacit&eacute; de ce mouchard, puisqu'il est un des &eacute;l&eacute;ments
qui ont permis au FBI de retrouver le p&egrave;re pr&eacute;sum&eacute;
du virus Melissa (voir HNT-Mag by mail n&deg;12) en quelques jours seulement.
Or si l'on peut admettre que son utilisation soit dans un tel cas justifi&eacute;e,
il est cependant impossible de garantir que le GUI ne puisse &ecirc;tre
employ&eacute; dans des dessins plus obscurs. Sa d&eacute;tection pourrait
ainsi &ecirc;tre facilement incluse dans des programmes de hacking "pr&eacute;-m&acirc;ch&eacute;s"
tels qu'il en circule abondamment, et il suffirait alors d'une intrusion
r&eacute;ussie chez Microsoft pour donner acc&egrave;s aux noms des utilisateurs
et autres renseignements correspondants &agrave; chaque GUI. C'est en cela
qu'il constitue une menace s&eacute;rieuse pour la vie priv&eacute;e...</font></li>

<li>
<font color="#FFFF00">Vous utilisez Lotus Notes 4.5 et 4.6. </font><font color="#CCCCCC">Lotus
a confirm&eacute; l'existence d'un bug compromettant la confidentialit&eacute;
du courrier &eacute;lectronique dans son logiciel de messagerie Notes.
Selon le magazine en ligne CNet, qui rapporte l'information, ce bug rend
lisibles des mails cens&eacute;s &ecirc;tre crypt&eacute;s. Il affecte
les versions Ltus Notes 4.5 et 4.6. On n'oublie pas que le gouvernement
su&eacute;dois a d&eacute;couvert que le syst&egrave;me de cryptage Lotus
Notes comporte une faille destin&eacute;e &agrave; &ecirc;tre exploit&eacute;e
par les services secrets am&eacute;ricains pour espionner les entreprises
europ&eacute;ennes. Bugs involontaires???</font></li>

<li>
<font color="#FFFF00">Vous utilisez Real ou Media Player. </font><font color="#CCCCCC">Lorsque
vous vous enregistrez en ligne pour utiliser l'un des logiciels, des informations
&agrave; votre propos sont imm&eacute;diatement transf&eacute;r&eacute;es
chez les &eacute;diteurs (RealNetworks ou Kro). des informations telles
que le type de brouteur utilis&eacute;, la derni&egrave;re page visit&eacute;e,
sont collect&eacute;es et votre activit&eacute; enregistr&eacute;e lorsque
vous l'utilisez.</font></li>
</ol>

<p>&nbsp;Cet E-mag n'aura pas pas &eacute;t&eacute; aussi long que pr&eacute;vu
mais il est assez complet. En esp&eacute;rant qu'il vous ait plu, vous
pouvez faire vos r&eacute;clamations &agrave; <a href="mailto:clad_strife@hotmail.com">clad_strife@hotmail.com</a>,
Mon N&deg; ICQ est: 22350168
<br>L'auteur et le r&eacute;alisateur de ces articles est Clad Strife.
Cet e-zine est prot&eacute;g&eacute; par le copyright. Pri&egrave;re de
demander l'avis &agrave; son auteur (Clad Strife) ou &agrave; Pirates Mag
(Cracker un password Bios) pour en faire une autre utilisation.
</body>
</html>
