<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
  <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
  <META NAME="GENERATOR" CONTENT="Mozilla/3.01Gold (WinNT; I) [Netscape]">
  <TITLE>Barata Eletrica numero 26 </TITLE>
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFFF" LINK="#FF8000" VLINK="#008000">
<P>
<!-- name="Derneval R.Rodrigues da Cunha" --><!-- email="BarataEletrica@bigfoot.com"



    --><!-- subject="BARATA ELETRICA - numero 2 - fevereiro/2000" -->
<PRE>&nbsp;____&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; _&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ______ _&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; _&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; _&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
|&nbsp; _ \&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; | |&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; |&nbsp; ____| |&nbsp;&nbsp;&nbsp; | |&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (_)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
| |_) | __ _ _ __ __ _| |_ __ _&nbsp; | |__&nbsp; | | ___| |_ _ __ _&nbsp; ___ __ _&nbsp;&nbsp;
|&nbsp; _ &lt; / _` | '__/ _` | __/ _` | |&nbsp; __| | |/ _ \ __| '__| |/ __/ _` |&nbsp;
| |_) | (_| | | | (_| | || (_| | | |____| |&nbsp; __/ |_| |&nbsp; | | (_| (_| |&nbsp;
|____/ \__,_|_|&nbsp; \__,_|\__\__,_| |______|_|\___|\__|_|&nbsp; |_|\___\__,_|&nbsp;


BARATA ELETRICA, numero 26&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Sao Paulo, 22/02/2002

Cidade Universit&aacute;ria
 <HR WIDTH="100%">

</PRE>
<CENTER>
  <IMG SRC="bar.jpg" ALT="" HEIGHT=190 WIDTH=177 ALIGN=CENTER> <BR>
  P&aacute;gina Inicial
  <A HREF="http://www.inf.ufsc.br/barata">http://www.inf.ufsc.br/barata</A>
  Email <A HREF="mailto:derneval@bigfoot.com">derneval@bigfoot.com</A>
</CENTER>
<UL>
  <LI>
    &Iacute;ndice
  <LI>
    Introdu&ccedil;&atilde;o
  <LI>
    <A HREF="credi.html">Cr&eacute;ditos</A>
  <LI>
    <A HREF="zonav26.html">Perigos da &nbsp;"Zona" Virtual</A>
  <LI>
    <A HREF="softlivre26.html">A Pol&iacute;tica do Software Livre: Confer&ecirc;ncia
    em Porto Alegre</A>
  <LI>
    <A HREF="transge26.html">Qual a amea&ccedil;a dos transg&ecirc;nicos?</A>
  <LI>
    <A HREF="roteiro26.html">Roteiro para se ler o Fanzine</A>
  <LI>
    <A HREF="iniciante26.html">Para iniciantes totais: como fazer p&aacute;ginas
    na geocities, copiar disquetes, etc</A>
  <LI>
    <A HREF="ftpsite26.html">Fazendo um ftp site no seu micro</A>
  <LI>
    <A HREF="news26.html">NEWS- DICAS</A>
</UL>
<CENTER>
    <HR>
</CENTER>
<P>
Puxa, dessa vez foi dif&iacute;cil. N&atilde;o que eu n&atilde;o tivesse
o material pronto. Mas &eacute; que atualizar o fanzine sempre me distrai
a aten&ccedil;&atilde;o. Levanta muito o astral. Chato &eacute; que quando
voc&ecirc; est&aacute; correndo atr&aacute;s de uma disserta&ccedil;&atilde;o
de mestrado, com a data de conclus&atilde;o batendo &agrave; sua porta, a
coisa muda de figura. Parece que se voc&ecirc; olhar para o lado, tudo vai
despencar. Quando terminei, a primeira coisa que fiz foi ir para Porto Alegre,
no F&oacute;rum Social Mundial. Encontrei muita gente interessante. Al&eacute;m
da rataiada de l&aacute; (os que n&atilde;o foram pra praia), tive a chance
de servir de int&eacute;rprete para o Stallman, que foi explicar o Software
Livre numa palestra na PUC. Teve uma parte "chata" (s&oacute; para deixar
a mo&ccedil;ada que est&aacute; lendo com inveja). Um dos caras da rataiada
me levou para a casa noturna mais famosa da cidade, at&eacute; tiraram fotos
de mim junto com uma mo&ccedil;ada. Me diverti pacas. Fazer um ezine tem
dessas &agrave;s vezes voc&ecirc; fica famoso e embora n&atilde;o fique rico,
chega na "Pas&aacute;rgada" e vira amigo do rei.
<P>
A&iacute; na volta foi uma luta para me concentrar de novo. Ainda chego l&aacute;.
Para o futuro, entrei nessa onda de blog. Que rid&iacute;culo, ficar expondo
a vida pessoal. Mas.. at&eacute; que tem sua utilidade. No meu caso, n&atilde;o
vale muito a pena. Eu sei como uma informa&ccedil;&atilde;o pequena pode
alterar a vida da pessoa. Claro que nem todo mundo tem essa capacidade de
interpretar detalhes e se aproveitar deles. Que bom! Mas acho besteira. Enfim,
pelo menos agora posso informar qualquer coisa que n&atilde;o cabe no Barata
El&eacute;trica.
<P>
O artigo sobre "zona" virtual foi baseado em fatos reais, &oacute;bvio. Internet
deixou de ser um lugar freq&uuml;entado por gente politicamente correta,
portadora de diploma de n&iacute;vel superior e o escambau. Fiquei tentado
a dar mais detalhes sobre o assunto, mas achei o tema muito podre. Provavelmente
tamb&eacute;m eu teria o conte&uacute;do do artigo "pirateado" ent&atilde;o
deixa para l&aacute;. As imagens do artigo foram encontradas num computador
da USP. O programinha n&atilde;o funcionou por que o micro n&atilde;o usava
modem.
<P>
O artigo sobre "Software Livre e Linux" &eacute; uma velha id&eacute;ia minha,
mas que s&oacute; agora fiquei realmente a par do que isso significa. Quer
dizer, da diferen&ccedil;a entre o Linux e o GNU. Todo mundo usa GNU sem
saber que ele &eacute; parte do Linux. Poucos entendem a raz&atilde;o por
tr&aacute;s de cada um. No mesmo estilo o lance dos transg&ecirc;nicos. O
que est&aacute; em jogo &eacute; a patente da vida, ia transformar isso em
outro artigo relativo ao tema hacking, mas achei que valia a pena comentar.
<P>
"Iniciantes Totais": Comecei nova faculdade e fiquei espantado com a quantidade
de coisas que a mo&ccedil;ada desconhece ao come&ccedil;ar o terceiro grau.
J&aacute; estou come&ccedil;ando a achar que o ensino de inform&aacute;tica
deveria fazer parte do ensino do 2o grau e do Vestibular. Ent&atilde;o vou
fazendo alguns artigos bem b&aacute;sicos para a mo&ccedil;ada. Na pior das
hip&oacute;teses, aumento o n&uacute;mero de acessos.
<P>
"Roteiro para se ler o Barata El&eacute;trica" &eacute; uma antiga id&eacute;ia.
Vamos ver se o pessoal evolui com essa leitura.
<P>
"Fazendo um FTP site" &eacute; algo interessante. Melhor que um web site
em v&aacute;rios aspectos. O pessoal de hoje nem sabe o que significa ftp.
Mas para a rataiada, &eacute; 10!
<P>
A p&aacute;gina de Not&iacute;cias e Dicas fica dependendo de tempo e
disposi&ccedil;&atilde;o. Se voc&ecirc; chegou l&aacute; e est&aacute; em
branco, aguenta que um dia ela volta..
<P>
&Eacute; isso. Espero atualizar com mais freq&uuml;&ecirc;ncia e trazer
not&iacute;cias mais interessantes. Fiquem ligados no
<A HREF="http://barataeletrica.blogspot.com">http://barataeletrica.blogspot.com</A>
para pequenas dicas, truques, besteiras e fofocas..
</BODY></HTML>
