<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>Software Livre e Linux: a grande diferen&ccedil;a</TITLE>
   <META NAME="Author" CONTENT="Derneval R.R. Cunha">
   <META NAME="GENERATOR" CONTENT="Mozilla/3.01Gold (WinNT; I) [Netscape]">
   <META NAME="Description" CONTENT="Uma breve introdução às diferenças entre o GNU e o Linux">
   <META NAME="KeyWords" CONTENT="Software Livre, GNU, Linux, Stallman, Linus Torvalds">
</HEAD>
<BODY TEXT="#FFFF00" BGCOLOR="#400040" LINK="#80FFFF" VLINK="#FF8000" ALINK="#FF0000">
<CENTER>
  P&aacute;gina
  Inicial<A HREF="http://www.inf.ufsc.br/barata">http://www.inf.ufsc.br/barata</A>
  Email <A HREF="mailto:derneval@bigfoot.com">derneval@bigfoot.com</A> &Iacute;ndice
  <A HREF="http://www.inf.ufsc.br/barata/barata26.html">barata26.html </A>
  <P>
    <HR>
</CENTER>

<CENTER><P><B><FONT SIZE=+1>Software Livre e Linux: a grande diferen&ccedil;a</FONT></B></P></CENTER>

<CENTER><P><IMG SRC="stallman.jpg" ALT="Richard Stallman and the author, who served as translator in a talk about Free Software - Richard Stallman e o autor, que serviu como intérprete numa palestra" HEIGHT=73 WIDTH=100></P></CENTER>

<P>Derneval R.R. Cunha</P>

<P>OBS: Como coloquei na introdu&ccedil;&atilde;o, estive dando um passeio
em Porto Alegre e assisti a uma confer&ecirc;ncia sobre Software Livre,
com o Richard Stallman. Para ser mais exato, fiz tradu&ccedil;&atilde;o
consecutiva da palestra. Por isso consegui a foto acima. Como nunca falei
sobre isso no fanzine, aqui vai.. o texto abaixo foi todo baseado na palestra
e alguma coisa retirado da Free Software Foundation.</P>

<P>O que &eacute; Software Livre:</P>

<P>Para entender essa diferen&ccedil;a, o melhor &eacute; primeiro pensarmos
em termos de COZINHA. &Eacute;, receita de bolo mesmo. N&atilde;o as &quot;receita
de bolo&quot; que s&atilde;o os passos para se fazer isso ou aqui, mas
uma receita para se fazer doces, seja num fog&atilde;o ou num forno de
microondas. Se voc&ecirc; n&atilde;o sabe do que estou falando, pergunte
para algu&eacute;m que realmente faz comida de verdade (comida pr&eacute;-fabricada
n&atilde;o serve). Bom, receita de bolo &eacute; a melhor coisa.</P>

<P>A n&atilde;o ser que estejamos falando daquelas receitas onde se adiciona
leite e pronto, voil&aacute;, a culin&aacute;ria existe e para mim pelo
menos consiste na arte de cozinhar (que n&atilde;o tem muito a ver com
inform&aacute;tica, per si). Ent&atilde;o o que &eacute; uma receita? &Eacute;
um conjunto de ingredientes, tipo farinha, a&ccedil;&uacute;car, etc, que
se mistura de determinada forma, mexe, coloca-se no forno e depois serve
para alguma v&iacute;tima experimentar e falar se est&aacute; bom. Algumas
pessoas fazem &oacute;timos doces e bolos apartir de alguma receita que
pegou na internet ou nos jornais. E qual o barato dessa receita? A pessoa
pode passar adiante. Se eu fa&ccedil;o mudo alguns ingredientes da receita,
posso fazer um bolo diferente. Se meus amigos sobreviverem e gostarem do
bolo, posso escrever num papel e passar a receita para eles. Que poder&atilde;o
repetir em casa o que fiz. Sem nenhum problema. </P>

<P>O mesmo n&atilde;o acontece na inform&aacute;tica. Se eu configuro meu
Windows ou Word para Windows em casa, de um forma X, com um visual super
legal, n&atilde;o posso legalmente copiar esse software que modifiquei
para meus amigos, presumindo-se que eu tenha pago por ele (claro, imagina
se vou fazer pirataria). Tudo bem que a instala&ccedil;&atilde;o do Windows
no meu computador ficou &oacute;tima: n&atilde;o posso copi&aacute;-la
para meu vizinho (mesmo se conhecesse). Tudo bem que meu Windows est&aacute;
totalmente protegido contra invas&otilde;es. N&atilde;o posso fazer um
CD com ele e distribuir para que meus amigos fiquem protegidos (claro,
posso ir na casa deles e colocar as mesmas prote&ccedil;&otilde;es, talvez
at&eacute; cobrar pelo servi&ccedil;o, mas copiar para o micro deles, LEGALMENTE,
n&atilde;o posso).</P>

<P>Ent&atilde;o, o que &eacute; que est&aacute; pegando? Com a culin&aacute;ria,
sou livre para trocar ou alterar receitas de bolo ou qualquer outra comida.
Com a inform&aacute;tica, n&atilde;o. Se fa&ccedil;o com a inform&aacute;tica
aquilo que fa&ccedil;o com receitas de bolo (n&atilde;o confundir com &quot;receita
de bolo&quot; da inform&aacute;tica) ou de qualquer comida, posso ser processado
por viola&ccedil;&atilde;o de direitos autorais. Ningu&eacute;m precisa
pagar um tost&atilde;o pela f&oacute;rmula de se fazer arroz com feij&atilde;o.
Cada pessoa faz comida das mais variadas maneiras, ganha dinheiro como
cozinheiro ou n&atilde;o e precisa prestar contas a uma Microsoft da vida?
N&atilde;o. </P>

<P>Pensando nisso &eacute; que se iniciaram os trabalhos da Free Software
Foundation. O &quot;Free&quot; a&iacute; no caso, n&atilde;o significa
gr&aacute;tis (apenas). Significa &quot;Livre&quot;, como na palavra liberdade.
Qual liberdade?</P>

<UL>
<LI>&quot;A liberdade de executar o programa, para qualquer prop&oacute;sito
(liberdade no. 0)&quot; </LI>

<LI>&quot;A liberdade de estudar como o programa funciona, e adapta-lo
para as suas necessidades (liberdade no. 1). Aceso ao c&oacute;digo-fonte
&eacute; um pr&eacute;-requisito para esta liberdade&quot;. </LI>

<LI>&quot;A liberdade de redistribuir c&oacute;pias de modo que voc&ecirc;
possa ajudar ao seu pr&oacute;ximo (liberdade no. 2)&quot;.</LI>

<LI>&quot;A liberdade de aperfei&ccedil;oar o programa, e liberar os seus
aperfei&ccedil;oamentos, de modo que toda a comunidade se beneficie (liberdade
no. 3). Acesso ao c&oacute;digo-fonte &eacute; um pr&eacute;-requisito
para esta liberdade&quot;. </LI>
</UL>

<P>(obs: tudo acima est&aacute; dispon&iacute;vel no URL <A HREF="http://www.gnu.org/philosophy/free-sw.pt.html">http://www.gnu.org/philosophy/free-sw.pt.html</A>
)</P>

<P>O que pesa nisso tudo &eacute; que todo e qualquer programa de inform&aacute;tica
se baseia num ambiente operacional. Quer dizer, n&atilde;o adianta programar
em C, Pascal ou Ada. Ainda assim, o programa ter&aacute; que rodar num
sistema operacional. O primeiro passo consiste em projetar um sistema operacional
que tenha as caracter&iacute;sticas acima. O sistema operacional &eacute;
a base para que outros programas GNU. Qualquer programa desenvolvido ter&aacute;
que ter o c&oacute;digo fonte dispon&iacute;vel para as pessoas que ir&atilde;o
utiliz&aacute;-lo. Essas pessoas poder&atilde;o alterar, implementar ou
simplesmente usar os programas, como lhes der na telha. Poder&atilde;o
at&eacute; mesmo comercializar, desde que o c&oacute;digo fonte v&aacute;
junto.</P>

<P>O que que isso tem a ver com o Linux? Bom, Linus Torvalds come&ccedil;ou
seu projeto de Linux com um pensamento vagamente semelhante, mas a id&eacute;ia
era de que seria algo divertido de se fazer. Difere portanto como op&ccedil;&atilde;o
pol&iacute;tica. Ao usar GNU, est&aacute; se dizendo N&Atilde;O &agrave;
Microsoft. &Eacute; uma op&ccedil;&atilde;o pol&iacute;tica de se recusar
a entrar no jogo de pagar pelo uso de um software sem quebrar a lei. J&aacute;
no Linux, tem uma quest&atilde;o de Ego e tamb&eacute;m de fazer um software
para se aprender mais sobre inform&aacute;tica. N&atilde;o h&aacute; uma
quest&atilde;o de n&atilde;o pagamento de royalties e sim de como construir
algo que funcione. N&atilde;o entendeu?</P>

<P>Bom, vejamos de outra forma (minha id&eacute;ia, n&atilde;o o que foi
explicado na palestra): todo mundo usa computadores para fazer servi&ccedil;o
s&eacute;rio, em qualquer lugar. Quando se monta uma empresa, precisa-se
de software legalizado. E software como o da Microsoft cedo ou tarde necessita
de atualiza&ccedil;&atilde;o. N&atilde;o se pode &quot;remendar&quot; um
programa velho para continuar funcionando no micro novo. Conseq&uuml;&ecirc;ncia:
Muita gente usa software pirata por achar que nunca sofrer&aacute; conseq&uuml;&ecirc;ncias
disso. Convive-se com a id&eacute;ia de burlar a lei. Mas o que acontece?
A pessoa acaba pagando pelo software, cedo ou tarde. Basta precisar legalizar
aquilo que faz com o software.</P>

<P>O pessoal que fundou ou ajudou no que seria o GNU estava interessado
nesse detalhe: poder usar um software sem se preocupar com os direitos
autorais ou a legaliza&ccedil;&atilde;o de qualquer esp&eacute;cie. O pessoal
que ajudou a construir o Linux estava preocupado com algo mais ou menos
parecido como ajudar s&oacute; para poder dizer &quot;&oacute;, meu nome
est&aacute; l&aacute;, eu tamb&eacute;m fiz isso, &eacute; obra minha&quot;.
Ou por divers&atilde;o. N&atilde;o estou criticando, s&oacute; demonstrando,
eu tamb&eacute;m gostaria de ser um dos respons&aacute;veis pelo Linux,
um dia me inscrevo num dos dois grupos.</P>

<P>Bom, como foi a jun&ccedil;&atilde;o? O pessoal do GNU j&aacute; tinha
feito parte do trabalho (um sistema operacional semelhante ao UNIX n&atilde;o
&eacute; brincadeira de se fazer). O pessoal do Linux j&aacute; havia feito
outro. Mas o Linux foi distribu&iacute;do &agrave; torto e a direito sem
se explicitamente divulgar que o chamado Linux era &nbsp;&quot;GNU + Linux&quot;.
O que deixa o pessoal da Free Software Foundation meio p&ecirc; da vida,
mas que tamb&eacute;m n&atilde;o pode reclamar muito, j&aacute; que est&aacute;
previsto que o &quot;software livre GNU&quot; pode ser distribu&iacute;do
sem essa preocupa&ccedil;&atilde;o de ficar dando nome aos bois. Dura lex,
sed lex (Dura lei, mas &eacute; a lei). Ent&atilde;o, s&oacute; falar Linux
n&atilde;o est&aacute; errado, mas sem o GNU, talvez o Linux ainda n&atilde;o
estivesse pronto, talvez n&atilde;o existisse.</P>

<P>&Eacute; isso o que entendi da palestra, que foi curta. Os mais interessados,
podem acessar a p&aacute;gina abaixo, que tem inclusive tradu&ccedil;&atilde;o
para o portugu&ecirc;s:</P>

<P>GNU n&atilde;o &eacute; UNIX: O projeto GNU e a Funda&ccedil;&atilde;o
do Software Livre</P>

<P><A HREF="http://www.gnu.org/home.pt.html">http://www.gnu.org/home.pt.html</A>
</P>

</BODY>
</HTML>
