<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>Qual a amea&ccedil;a dos transg&ecirc;nicos?</TITLE>
   <META NAME="Author" CONTENT="Derneval R.R. Cunha">
   <META NAME="GENERATOR" CONTENT="Mozilla/3.01Gold (WinNT; I) [Netscape]">
   <META NAME="Description" CONTENT="Um resumo do que aprendi sobre os transgênicos numa palestra do Fórum Social Mundial">
   <META NAME="KeyWords" CONTENT="transgênicos, Fórum Social Mundial, multinacionais, globalização, reserva de mercado, legislação, patenteamento da vida">
</HEAD>
<BODY TEXT="#FFFF00" BGCOLOR="#400040" LINK="#0000EE" VLINK="#129494" ALINK="#FF0000">

<CENTER><P>P&aacute;gina Inicial<A HREF="http://www.inf.ufsc.br/barata">http://www.inf.ufsc.br/barata</A>
Email <A HREF="mailto:derneval@bigfoot.com">derneval@bigfoot.com</A> &Iacute;ndice
<A HREF="http://www.inf.ufsc.br/barata/barata26.html">barata26.html </A></P></CENTER>

<CENTER><P>
<HR></P></CENTER>

<CENTER><P><B>QUAL A AMEA&Ccedil;A DOS TRANSG&Ecirc;NICOS?</B></P></CENTER>

<P>Derneval R.R. Cunha</P>

<P>Esse texto foi resultado da ida &agrave; uma palestra na PUC de Porto
Alegre, durante o F&oacute;rum Social Mundial.</P>

<P>Muitas vezes li textos sobre os transg&ecirc;nicos e n&atilde;o consegui
entender muito bem, qual o risco que as pessoas correm. Alguns textos come&ccedil;am
a falar das a&ccedil;&otilde;es contra e, quando se trata de falar o qu&ecirc;
que motiva todo aquele agito, resumem numa frase do g&ecirc;nero &nbsp;&quot;eles
s&atilde;o contra porqu&ecirc; os cientistas ainda n&atilde;o conseguiram
determinar os riscos para a sa&uacute;de humana&quot;. N&atilde;o explicam
muito. Apenas d&atilde;o a entender que algum dia, os cientistas podem
descobrir alguma coisa ruim advinda do consumo de nutrientes contendo transg&ecirc;nicos,
da mesma forma (quem sabe) que hoje ou amanh&atilde; aparece uma not&iacute;cia
no jornal dizendo que, por exemplo, maconha provoca c&acirc;ncer. N&atilde;o
&eacute; isso. A coisa &eacute; um pouco mais complicada.</P>

<P>O que &eacute; transg&ecirc;nico, em primeiro lugar, falado de forma
simples? Bom, vamos levar a coisa pro lado do ser humano, que, de certa
forma, &eacute; um ser transg&ecirc;nico: somos todos resultados da mistura
gen&eacute;tica ao longo de anos e anos de evolu&ccedil;&atilde;o. Por
que a mulher brasileira (algumas, n&atilde;o todas) teria uma derri&eacute;re
mais acentuada do que a europ&eacute;ia? Bom, isso &eacute; resultado da
sele&ccedil;&atilde;o natural e da miscigena&ccedil;&atilde;o. Alguns podem
at&eacute; comentar que isso vem da influ&ecirc;ncia africana no nosso
povo. Temos ent&atilde;o um gene, respons&aacute;vel pelo &nbsp;bumbum,
que est&aacute; mais presente nas brasileiras. Coisa &oacute;tima, vide
a Carla P&eacute;rez.</P>

<P>Voltando ao lance dos transg&ecirc;nicos na comida, que s&atilde;o o
tema do texto. Qual &eacute; o problema ent&atilde;o? Calma. Vamos antes
de pensar na comida na mesa, vamos pensar na fabrica&ccedil;&atilde;o da
comida. Ou seja, no plantio da soja ou outros produtos agr&iacute;colas,
que ir&atilde;o mais tarde virar comida. Para se plantar, &eacute; preciso
terra, &aacute;gua e um certo cuidado, qualquer um que tenha plantas em
casa vai concordar. Mas plantas tamb&eacute;m sofrem problemas como ervas
daninhas e o pior, pragas, como larvas de insetos, que comem as plantas.
Imagine voc&ecirc;, homem, numa ilha deserta cheia de mulher e vai entender
o que &eacute; que um bichinho da soja sente quando chega numa dessas gigantescas
planta&ccedil;&otilde;es de soja (ou qualquer outro produto de monocultura)
que tem por a&iacute;.</P>

<P>&quot;Chato&quot;, n&eacute;? N&atilde;o se pode contratar gente em
n&uacute;mero suficiente para ficar matando bichos. Ent&atilde;o o que
&eacute; que o pessoal costuma fazer? Inseticida. Usam quantidades e quantidades
de inseticida para matar esses bichos e garantir a produ&ccedil;&atilde;o.
At&eacute; a&iacute;, nenhum grande problema. S&oacute; que os bichos que
sobreviverem, v&atilde;o se adaptar a quantidades enormes de inseticida.
Em outras palavras, &quot;o que n&atilde;o mata, os torna mais fortes&quot;.
Puxa, o que fazer?</P>

<P>Houve uma iniciativa de se fazer &quot;guerra biol&oacute;gica&quot;
com essas larvas. S&oacute; por que &eacute; praga, n&atilde;o quer dizer
que &eacute; imune &agrave; doen&ccedil;as, certo? Larva de inseto tamb&eacute;m
adoece e morre. Qual a solu&ccedil;&atilde;o? Analisaram, testaram e descobriram
doen&ccedil;as de larva. A&iacute; como faziam? Pegavam um monte de larvas
doentes, botavam num liquidificador (especial pra isso). O l&iacute;quido
ent&atilde;o era borrifado na planta&ccedil;&atilde;o. As larvas ali existentes
adoeciam e morriam. Sem inseticida. O agricultor s&oacute; teria que pegar
algumas larvas mortas, conservar na geladeira e .. na pr&oacute;xima vez,
colocar de novo esses &nbsp;&quot;cad&aacute;veres&quot; no liquidificador,
repetindo o processo. </P>

<P>Onde est&aacute; o problema? Boa pergunta. Nenhum. Ecologicamente perfeito.
Barato, s&oacute; da primeira vez &eacute; que se paga pela &quot;guerra
biol&oacute;gica&quot;. Tendo uma geladeira, o fazendeiro nunca mais teria
que pagar pelo inseticida para se livrar de pragas daquele tipo. Isso seria
o final da hist&oacute;ria, s&oacute; que s&oacute; uma min&oacute;ria
dos homens do campo est&atilde;o ligados a internet. Ent&atilde;o pouca
gente sabe que um estudo desse tipo foi conduzido em laborat&oacute;rio,
com sucesso. Mesmo se soubesse, como chegar ao homem do campo? Existe a
necessidade de se pagar pela divulga&ccedil;&atilde;o do produto, treinamento
de pessoal para se fazer essa &quot;guerra biol&oacute;gica&quot;, uma
f&aacute;brica para produzir o material e at&eacute; mesmo gente disposta
a ir convencer gente teimosa de que essa solu&ccedil;&atilde;o seria a
melhor. N&atilde;o &eacute; barato e nem f&aacute;cil mudar os h&aacute;bitos
de um monte de gente. Voc&ecirc; n&atilde;o acredita? Por que acha ent&atilde;o
que h&aacute; gente se contaminando com Aids at&eacute; hoje, por falta
de uso da camisinha? Mesmo com tanta campanha? Pois &eacute;.</P>

<P>Mas at&eacute; a&iacute;, n&atilde;o comecei a falar ainda dos transg&ecirc;nicos.</P>

<P>Continuando: um produto como essa &quot;guerra biol&oacute;gica&quot;
n&atilde;o forneceria grandes lucros para as empresas. S&oacute; seria
vendido uma vez. Mais ou menos como a l&acirc;mina de barbear. A pessoa
que usa navalha, pode usar a mesma navalha talvez a vida inteira. D&aacute;
mais trabalho, precisa de um certo cuidado, mas dura bastante. Ningu&eacute;m
compra duas, tr&ecirc;s, quatro. Os fabricantes ent&atilde;o fizeram a
gilete, que &eacute; mais f&aacute;cil de usar. Mas dura pouco, ent&atilde;o
&eacute; aquele bando de lan&ccedil;amentos, todo ano tem giletes com uma,
duas, tr&ecirc;s l&acirc;minas. Pra qu&ecirc;? Para fazer o consumidor
comprar.</P>

<P>Voltando &agrave; agricultura: existe a quest&atilde;o das sementes.
Se voc&ecirc; j&aacute; comeu milho ou arroz, sabe o que &eacute; semente.
Basta enfiar na terra e ela cresce, se tiver sol e &aacute;gua o suficiente.
Mas para o agricultor, existem sementes especiais. Selecionadas, ent&atilde;o
j&aacute; vem sem pragas. Mais ou menos a mesma coisa que a mulher faz
quando quer ter um beb&ecirc; de cabelos louros, tenta s&oacute; namorar
gente de cabelo louro. A Dinamarca faz uma fortuna exportando s&ecirc;mem
desse tipo, diga-se de passagem, mas estou mudando o assunto.</P>

<P>O agricultor acaba usando sementes selecionadas para garantir uma produ&ccedil;&atilde;o
de melhor qualidade (o risco de doen&ccedil;as ou pragas &eacute; menor,
dizem que o rendimento &eacute; maior). Ent&atilde;o h&aacute; empresas
que lucram em cima das sementes que vendem. E lucram muito, diga-se de
passagem. Para garantir que v&atilde;o continuar lucrando, algumas empresas
d&atilde;o jeito (h&aacute; formas) de garantir que o agricultor n&atilde;o
plante uma parte da produ&ccedil;&atilde;o para economizar na pr&oacute;xima
safra: as sementes produzidas pelas sementes plantadas s&atilde;o est&eacute;reis.
Claro que &eacute; f&aacute;cil passar por cima disso, &eacute; s&oacute;
mudar de fabricante de sementes ou usar o produto natural.</P>

<P>A grande maioria das pessoas n&atilde;o pensa nesses detalhes. Okay,
vamos j&aacute; chegar nos transg&ecirc;nicos, d&aacute; um tempo. </P>

<P>O fabricante precisa inventar uma semente melhor para o cara continuar
comprando. O agricultor s&oacute; vai comprar semente que garanta a produ&ccedil;&atilde;o.
Para garantir a produ&ccedil;&atilde;o o truque &eacute; fazer a &quot;super-semente&quot;,
livre de problemas. Como fazer isso?</P>

<P>Contei acima, a hist&oacute;ria da larva que come a produ&ccedil;&atilde;o,
certo. E que &eacute; combatida usando inseticida, certo? Pois bem, h&aacute;
uma quantidade m&aacute;xima de inseticida que a planta aguenta. At&eacute;
&aacute;gua em grande quantidade faz mal (pense nuns 80 litros descendo
pela sua goela) imagina ent&atilde;o veneno. As plantas morrem de excesso
de inseticida, mas as larvas dos insetos aprendem a sobreviver com altas
quantidades. Os fabricantes ent&atilde;o inventam as sementes cujas plantas
aguentam grandes quantidades de inseticida sem morrer. O que significa
que a pessoa comum pode at&eacute; estar comendo inseticida junto com o
arroz e feij&atilde;o, mas isso &eacute; detalhe. &quot;Tudo bem&quot;.
</P>

<P>Chegamos ent&atilde;o aos transg&ecirc;nicos. Os cientistas das f&aacute;bricas
de sementes resolveram mudar de rumo. Primeiro, fizeram um estudo da bact&eacute;ria
que causa a doen&ccedil;a da larva. Descobriram o que a bact&eacute;ria
produz que mata a larva, qual a toxina, o veneno. Poderiam fazer um inseticida
com isso, mas resolveram o problema de outra forma. Qual o objetivo? Vender
inseticida? N&atilde;o, o objetivo &eacute; vender a semente. A semente
&eacute; um amontoado de genes, cada qual com uma caracter&iacute;stica.
A bact&eacute;ria que mata a larva tamb&eacute;m &eacute; um amontoado
de genes. N&atilde;o d&aacute; para fazer o cruzamento de uma bact&eacute;ria
com uma semente de milho. Mas atrav&eacute;s de engenharia gen&eacute;tica,
&eacute; poss&iacute;vel pegar o material gen&eacute;tico respons&aacute;vel
pela morte da larva e jogar dentro da semente do milho (por exemplo). O
resultado &eacute; um milho que n&atilde;o &eacute; comest&iacute;vel pela
larva. Comeu, a larva morre. &Eacute; uma super semente. Ali&aacute;s,
temos uma nova planta &agrave; prova de larvas, j&aacute; que n&atilde;o
houve um processo natural. </P>

<P>Qual a desvantagem nisso? Como &eacute; que a gente descobre que muito
chocolate d&aacute; diarr&eacute;ia? Como &eacute; que a gente descobre
que beber demais d&aacute; cirrose. Como &eacute; que a gente descobre
que fumar faz mal? Quantos anos leva para uma pessoa descobrir que o cigarro
faz mal. Ela pode morrer atropelada antes de descobrir isso. Ningu&eacute;m
sabe quantos anos de consumo de transg&ecirc;nicos produz efeitos negativos.
E se descobrirem que a toxina que mata a larva que come a produ&ccedil;&atilde;o
do agricultor causa impot&ecirc;ncia? Pode levar anos para descobrirem
isso. Ou n&atilde;o. Levou-se anos para descobrir a Aids, exatamente por
que ela tinha um tempo de matura&ccedil;&atilde;o longo.</P>

<P>Mas esse n&atilde;o &eacute; o &uacute;nico problema dos transg&ecirc;nicos.
A planta &quot;transg&ecirc;nica&quot; produz p&oacute;lem. Sabe o que
&eacute; p&oacute;lem? &Eacute; aquele pozinho, transportado pelo ar, as
vezes at&eacute; pelas borboletas, que assegura a miscigena&ccedil;&atilde;o
entre as esp&eacute;cies. Seria o equivalente ao esperma e o &oacute;vulo,
de certa forma. A planta polinizada produz sementes que ir&atilde;o gerar
plantas que v&atilde;o gerar outras sementes. O p&oacute;lem produzido
por um planta transg&ecirc;nica &eacute; transg&ecirc;nico. Se temos duas
planta&ccedil;&otilde;es, uma transg&ecirc;nica e outra n&atilde;o-transg&ecirc;nica,
lado a lado, dentro de pouco tempo teremos as duas planta&ccedil;&otilde;es
produzindo frutos transg&ecirc;nicos, mesmo que n&atilde;o usem as mesmas
sementes. E isso &eacute; problema?</P>

<P>Para a pessoa que vai consumir, n&atilde;o vai haver diferen&ccedil;a.
Mas para quem produz, sim. Por que est&aacute; quebrando a lei. A f&aacute;brica
de sementes pode processar o agricultor por vender frutos transg&ecirc;nicos.</P>

<P>Como? Simples. Vou mudar de assunto para explicar.</P>

<P>Por que as pessoas compram soda limonada e n&atilde;o suco de lim&atilde;o
engarrafado? Simples: o suco de lim&atilde;o (transg&ecirc;nico ou n&atilde;o),
qualquer um pode fazer. &Eacute; s&oacute; comprar lim&atilde;o, a&ccedil;&uacute;car,
&aacute;gua e pronto. Temos limonada. D&aacute; trabalho, mas nem tanto.
Os fabricantes, para vender algo vagamente parecido com suco de lim&atilde;o,
pegaram o sabor do lim&atilde;o, fizeram uma mistura diferente, usaram
ingredientes diferentes, montaram uma empresa, PATENTEARAM a f&oacute;rmula,
colocaram a mistura numa garrafa e venderam por a&iacute;. Se algu&eacute;m
fizer uma soda limonada imitando a mistura que eles fizeram, estar&aacute;
cometendo o crime de pirataria. Se abrirem a garrafa para colocar outro
produto (raz&atilde;o pela qual as bebidas s&atilde;o vendidas em garrafas
lacradas) ser&aacute; o crime de fraude. O que era suco de lim&atilde;o
foi modificado, virou um produto industrial e est&aacute; protegido pela
lei.</P>

<P>O transg&ecirc;nico deixou de ser um produto da natureza. A partir do
momento que foi modificado geneticamente, passou a ser um produto industrial,
protegido pela legisla&ccedil;&atilde;o. H&aacute; formas de se determinar
que este ou aquele fruto foi produzido de determinada forma e cont&eacute;m
determinado gen. A planta n&atilde;o tem culpa. Ela n&atilde;o faz que
nem a mulher e fica testando para ver se o cara tem dinheiro antes de casar.
A planta recebe o p&oacute;lem e com ele produz o fruto (que pode ser mam&atilde;o,
ma&ccedil;&atilde;, milho, etc). O p&oacute;lem &eacute; carregado pelos
insetos, p&aacute;ssaros, gente (aqueles carrapichos na sua cal&ccedil;a
quando andamos no mato), vento, etc.. n&atilde;o d&aacute; para impedir
que uma planta receba o p&oacute;lem de outra, se est&atilde;o pr&oacute;ximas.
&Eacute; dessa forma que o agricultor pode ser (e j&aacute; houve casos
em que foi) processado por produzir frutos &quot;transg&ecirc;nicos&quot;
sem ter comprado a semente do fabricante. Pois s&oacute; quem compra a
semente do fabricante pode produzir frutos transg&ecirc;nicos. </P>

<P>Ent&atilde;o, se o feij&atilde;o que voc&ecirc; consome em casa for
transg&ecirc;nico, aquela experi&ecirc;ncia de botar uma semente num potinho,
para ensinar o seu filho como &eacute; que acontece a gera&ccedil;&atilde;o
de uma planta, estar&aacute; sendo uma infra&ccedil;&atilde;o penal. N&atilde;o
vai ser a mesma coisa que atropelar algu&eacute;m, mas ser&aacute; crime.
O interessante nessa hist&oacute;ria &eacute; que uma empresa de sementes
pode ficar dona de parte dos rendimentos de todos os grandes produtores
agr&iacute;colas de um pa&iacute;s. Basta que algumas planta&ccedil;&otilde;es
dispersem o p&oacute;lem em quantidade suficiente. Aquele p&oacute;lem
estar&aacute; sempre nas pr&oacute;ximas safras. A empresa ficar&aacute;
sendo a &uacute;nica fornecedora de sementes (j&aacute; que pode ir na
organiza&ccedil;&atilde;o mundial do com&eacute;rcio exigir os seus direitos)
e ent&atilde;o ter direito a uma parte dos dividendo das exporta&ccedil;&otilde;es
agr&iacute;colas daquele pa&iacute;s onde o p&oacute;lem desses produtos
transg&ecirc;nicos se disseminou. Quando a empresa comprovar que os produtos
agr&iacute;colas tem aquele p&oacute;lem, pode exigir indeniza&ccedil;&atilde;o
e entrar em acordo obrigando a compra de sementes. Tenta mudar a lei. Leis
como legisla&ccedil;&atilde;o de propriedade industrial ou o c&oacute;digo
penal n&atilde;o s&atilde;o t&atilde;o f&aacute;ceis de mudar quanto a
Constitui&ccedil;&atilde;o(basta contar o n&uacute;mero de constitui&ccedil;&otilde;es
que o pa&iacute;s j&aacute; teve). </P>

<P>Tudo isso, sem falar no fato que, algum dia, algu&eacute;m pode descobrir
que o consumo de produtos agr&iacute;colas pode gerar um ac&uacute;mulo
de veneno no sangue que mata a pessoa ap&oacute;s X anos. Ou outra coisa
qualquer. A possibilidade existe. Mas ningu&eacute;m pode estudar se isso
vai ou n&atilde;o acontecer, sabe porqu&ecirc;? Por que dentro da legisla&ccedil;&atilde;o
de propriedade industrial, produtos patenteados precisam da permiss&atilde;o
do dono da patente para estudos. O dono da patente pode escolher n&atilde;o
divulgar uma pesquisa que fale mal de seu produto. Ou pode processar por
danos quem fizer propaganda &quot;danosa&quot; &agrave;s vendas. Ah, mas
seu produto mata as pessoas. Pois &eacute;, cigarro tamb&eacute;m, mas
continuam vendendo. Para um governo &quot;ruim&quot;, o aumento no n&uacute;mero
de mortes significa maior n&uacute;mero de oportunidades no mercado de
trabalho. Menos aposentadorias. Talvez algum dia se fa&ccedil;am seres
humanos transg&ecirc;nicos, com data de validade. O sonho da Previd&ecirc;ncia
Social: o trabalhador geneticamente modificado, que s&oacute; contribua
para a Previd&ecirc;ncia, nunca falte por doen&ccedil;a, mas mesmo assim
morre antes da aposentadoria. Engenharia gen&eacute;tica &eacute; isso.</P>

<P>Sim, uma empresa pode processar a revista ou jornal que divulgar que
seu produto gen&eacute;ticamente modificado faz mal a sa&uacute;de. Mas
elas n&atilde;o precisam se dar ao trabalho. Bastam pagar ou n&atilde;o
pagar an&uacute;ncios. An&uacute;ncios em revistas custam fortunas. Se
a revista publica que transg&ecirc;nicos d&atilde;o c&acirc;ncer (exemplo
fict&iacute;cio), o departamento de rela&ccedil;&otilde;es p&uacute;blicas
da empresa que produz sementes pode decidir que aquela revista n&atilde;o
merece o dinheiro da f&aacute;brica. E pior, o departamento jur&iacute;dico
da f&aacute;brica (que fica bastante rica quando pode ser propriet&aacute;ria
da venda de sementes at&eacute; de um pa&iacute;s inteiro) pode resolver
que seria bom calar esta ou aquela revista que atrapalha seus neg&oacute;cios.
Tudo isso &eacute; fic&ccedil;&atilde;o (j&aacute; que n&atilde;o disponho
de provas, apesar que h&aacute; p&aacute;ginas na internet falando nisso,
essas com provas). Fic&ccedil;&atilde;o que pode se tornar realidade.</P>

<P>Voc&ecirc;, leitor, n&atilde;o acredita que isso &eacute; poss&iacute;vel?
Eu te digo, isso acontece todo dia. J&aacute; ouviu falar de contamina&ccedil;&atilde;o
por chumbo. Chumbo &eacute; um veneno horr&iacute;vel. Por que &eacute;
cumulativo. Entra no corpo e n&atilde;o sai. Precisa de exame de sangue
especial para constatar contamina&ccedil;&atilde;o por chumbo. Sabia que
usa-se chumbo nos encanamentos? E que o encanamento que usa chumbo acaba
contaminando a &aacute;gua com chumbo tamb&eacute;m? Pois &eacute;, me
falaram que essa &eacute; a situa&ccedil;&atilde;o nos encanamentos de
algumas cidades do Brasil, incluindo talvez at&eacute; o Rio de Janeiro.
A &aacute;gua l&aacute; teria alto teor de chumbo em alguns bairros por
que o encanamento antigo foi feito de chumbo. Claro que tem muita prefeitura
por a&iacute; que nem vai querer ouvir falar nesse tipo de coisa, j&aacute;
que &aacute;gua contaminada com chumbo em excesso gera deformidades em
fetos e m&aacute; forma&ccedil;&atilde;o dos ossos, quando se trata de
gente em crescimento. Imagina esburacar a cidade (e os pr&eacute;dios)
para se trocar os encanamentos. Ent&atilde;o o problema do chumbo nos encanamentos
n&atilde;o aparece em programas como o &quot;Fant&aacute;stico&quot;. Mas
&eacute; s&oacute; pesquisar na internet que aparece esse problema. E a
solu&ccedil;&atilde;o, que seria acrescentar um produto qu&iacute;mico
&agrave; &aacute;gua.</P>

<P>Sou da opini&atilde;o que metade do problema dos transg&ecirc;nicos
(voltando ao assunto principal) &eacute; a falta de informa&ccedil;&atilde;o.
Falar que transg&ecirc;nicos provocam c&acirc;ncer (exemplo fict&iacute;cio
de propaganda &quot;terrorista&quot;) n&atilde;o &eacute; a solu&ccedil;&atilde;o.
Por que o consumo decai, por um tempo. A&iacute;, a empresa contrata gente
para ir nas escolas explicar que n&atilde;o est&aacute; comprovado e tudo
fica at&eacute; pior do que antes. Pior do que antes por que o povo n&atilde;o
vai mais acreditar em qualquer not&iacute;cia de que transg&ecirc;nicos
provocam c&acirc;ncer, mesmo se um cientista comprovar isso. E mesmo que
comprove, as pessoas podem acabar consumindo do mesmo jeito, da mesma forma
que se consome cigarro. Existem p&aacute;ginas que falam mais sobre isso,
vide a bibliografia. De acordo com os t&iacute;tulos da p&aacute;gina do
Greenpeace, os transg&ecirc;nicos:</P>

<UL>
<LI>Podem aumentar a resist&ecirc;ncia a antibi&oacute;ticos </LI>

<LI>Podem causar alergias </LI>

<LI>S&atilde;o ilegais no Brasil por n&atilde;o respeitarem a Leis de Bioseguran&ccedil;a
e o C&oacute;digo de Defesa do Consumidor</LI>
</UL>

<P>O que se pode fazer a respeito? Se voc&ecirc; leu at&eacute; aqui este
artigo, n&atilde;o tenha d&uacute;vida. Mande esse artigo para algu&eacute;m,
pergunte a seu pol&iacute;tico local o que ele acha, se n&atilde;o acha,
mande ele pesquisar. Tomara que seja do tipo de pol&iacute;tico que se
importe com o que seus filhos v&atilde;o consumir. Melhor do que isso,
alerta todo mundo que puder para que se informe sobre o assunto. Boca a
boca &eacute; a melhor estrat&eacute;gia. Eu mesmo confesso, s&oacute;
comecei a levar a s&eacute;rio quando fui numa palestra do F&oacute;rum
Social Mundial sobre o assunto. A&iacute; fiquei por dentro. E olha que
j&aacute; tinha lido v&aacute;rios textos antes, desde textos na Folha
de S&atilde;o Paulo (as not&iacute;cias que li sobre o tema n&atilde;o
me informaram desse perigo adequadamente) at&eacute; textos produzidos
para cursinhos de vestibular. A quest&atilde;o da contamina&ccedil;&atilde;o
por chumbo, isso eu fiquei sabendo no SBPC, conversando com um pessoal
que est&aacute; tentando trazer aten&ccedil;&atilde;o para o problema na
cidade do Rio de Janeiro.</P>

<P>Quais os perigos para o futuro?</P>

<P>Voltando o exemplo do chumbo. No final do Imp&eacute;rio Romano, os
romanos descobriram a &aacute;gua encanada. &Oacute;timo. S&oacute; os
ricos podiam ter, por que os encanamentos eram de chumbo. Os pratos e copos
mais trabalhados tamb&eacute;m eram feitos de chumbo. O&nbsp;&nbsp;&quot;a&ccedil;&uacute;car&quot;
que eles usavam eram um composto de chumbo. Muita gente morria por envenenamento
por chumbo. Muita gente na nobreza sofria por envenamento por chumbo. Os
filhos nasciam deformados, havia redu&ccedil;&atilde;o da taxa de natalidade.
Menos gente podia servir o ex&eacute;rcito. Pessoas enlouqueciam (mesma
raz&atilde;o, a dem&ecirc;ncia &eacute; um dos sintomas de envenenamento).
Talvez se descubra que os transg&ecirc;nicos tamb&eacute;m tem essas caracter&iacute;sticas
(algumas j&aacute; est&atilde;o sendo descobertas). S&oacute; que as consequ&ecirc;ncias
para o Imp&eacute;rio Romano foi a invas&atilde;o pelos b&aacute;rbaros
e o in&iacute;cio da Idade M&eacute;dia, que foi a idade das trevas. Se
a hist&oacute;ria se repetir, se prepara!</P>

<P><B>Bibliografia:</B></P>

<P>Apostila sobre transg&ecirc;nicos de uma ONG:</P>

<P><A HREF="http://www.syntonia.com/textos/textosnatural/textosagricultura/apostilatransgenicos/">http://www.syntonia.com/textos/textosnatural/textosagricultura/apostilatransgenicos/</A>
</P>

<P>P&aacute;gina do Greenpeace sobre Transg&ecirc;nicos:</P>

<P><A HREF="http://www.greenpeace.org.br/transgenicos/home.asp">http://www.greenpeace.org.br/transgenicos/home.asp</A></P>

<P>Meio resumida, pode ser boa:</P>

<P><A HREF="http://www.transgenico.hpg.ig.com.br/">http://www.transgenico.hpg.ig.com.br/</A>
</P>

<P>Outra p&aacute;gina legal:</P>

<P><A HREF="http://transgenicos.web-page.net/">http://transgenicos.web-page.net/</A></P>

<P>Excelente p&aacute;gina</P>

<P><A HREF="http://www.brasil.terravista.pt/Ipanema/3888/transgenicos.htm">http://www.brasil.terravista.pt/Ipanema/3888/transgenicos.htm</A></P>

<P>Mais uma:</P>

<P><A HREF="http://intermega.globo.com/comidatransgenica/">http://intermega.globo.com/comidatransgenica/</A>
</P>

<P>Saiba mais sobre os transg&ecirc;nicos:</P>

<P><A HREF="http://www.pt-rs.org.br/bohngass/transgenicos/">http://www.pt-rs.org.br/bohngass/transgenicos/</A>
</P>

<P><A HREF="http://www.pt-rs.org.br/bohngass/transgenicos/saiba.htm">http://www.pt-rs.org.br/bohngass/transgenicos/saiba.htm</A>
</P>

<P>Sobre contamina&ccedil;&atilde;o por chumbo e metais pesados</P>

<P><A HREF="http://www.fiocruz.br/ccs/novidades/11chumbo_lui.htm">http://www.fiocruz.br/ccs/novidades/11chumbo_lui.htm</A>
</P>

<P><A HREF="http://www.cve.saude.sp.gov.br/htm/chumbo_b.htm">http://www.cve.saude.sp.gov.br/htm/chumbo_b.htm</A>
</P>

<P><A HREF="http://www.greenpeace.org.br/toxicos/metais.asp">http://www.greenpeace.org.br/toxicos/metais.asp</A>
</P>

<P><A HREF="http://www.usp.br/fo/lido/patoartegeral/patoartepig2.htm">http://www.usp.br/fo/lido/patoartegeral/patoartepig2.htm</A>
</P>

</BODY>
</HTML>
