<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>Parece, mas n&atilde;o &eacute;: Sexo Virtual e outros perigos</TITLE>
   <META NAME="Author" CONTENT="Derneval R.R. Cunha">
   <META NAME="GENERATOR" CONTENT="Mozilla/3.01Gold (WinNT; I) [Netscape]">
   <META NAME="Description" CONTENT="Alguns escambos e golpes passíveis de acontecer tanto dentro como fora da internet">
   <META NAME="KeyWords" CONTENT="sexo anal, grupal, boquete, camisinha, trapaça, sexo virtual, prostituta, malandragem, sexo bizarro, cavalo de tróia, vírus, trojan,  herpes, prostituição">
</HEAD>
<BODY TEXT="#FFFFFF" BGCOLOR="#400040" LINK="#0000EE" VLINK="#551A8B" ALINK="#FF0000">

<CENTER><P>P&aacute;gina Inicial<A HREF="http://www.inf.ufsc.br/barata">http://www.inf.ufsc.br/barata</A>
Email <A HREF="mailto:derneval@bigfoot.com">derneval@bigfoot.com</A> &Iacute;ndice
<A HREF="http://www.inf.ufsc.br/barata/barata26.html">barata26.html </A></P></CENTER>

<CENTER><P>
<HR></P></CENTER>

<CENTER><P><B>Parece, mas n&atilde;o &eacute;: Sexo Virtual e outros perigos</B></P></CENTER>

<P>Derneval R.R.&nbsp;Cunha</P>

<P>H&aacute; alguns anos atr&aacute;s, quando o mundo era dividido em dois
blocos e a AIDS era coisa de jornal, havia uma coisa chamada <I>&quot;ir
na zona&quot;</I>. Onde ficam as prostitutas, os marginais, as boates.
E a malandragem. Podiam acontecer hist&oacute;rias fant&aacute;sticas.
Como a do sujeito que ouviu falar que tinha um bordel onde por uma quantia
X se fazia tudo. Ou a do sujeito que foi roubado por que fez besteira.
A melhor hist&oacute;ria que ouvi era do carinha que ouviu falar de blow-job
por R$ 10,00. Essa pode estar acontecendo ainda hoje. </P>

<P>O sujeito vai no local, tipo centro da cidade, na chamada <I>&quot;Boca
do Lixo&quot; </I>(bairro de S&atilde;o Paulo) e sai procurando. De repente
descobre uma super-oferta de sexo. Blow-job, sexo anal, sexo oral, banho
de l&iacute;ngua, at&eacute; mesmo beijo na boca. E barato. O sujeito nem
consegue acreditar, fica at&eacute; nervoso. A&iacute; escolhe uma vagabunda
linda. Conversa um monte com ela. Chegam na porta do muquifo, mudou a cara
da menina, &eacute; pagamento adiantado. Em vez de falar tchau, o cara
paga. Sobe at&eacute; o quarto, deita na cama enquanto a menina fica conversando
com um cara. Demora. Quando finalmente v&ecirc;m para o quarto, o sujeito
j&aacute; est&aacute; meio com raiva. A&iacute; &eacute; a hora em que
a mulher pede mais um pouco de grana, por que est&aacute; precisando. Se
n&atilde;o, n&atilde;o tira toda a roupa. O sujeito resolve tirar a m&atilde;o
da carteira e d&aacute; mais uns trocados. A vagabunda chama ele de p&atilde;o-duro
e fala que vai tirar no m&aacute;ximo a calcinha, fica de camiseta. E nada
de fazer algo &nbsp;&quot;interessante&quot;. Depois de insistir muito,
ela tira a camiseta. E o cara se arrepende. O rosto &eacute; bonito, mas
a mulher t&aacute; cheia de feridas com pus saindo. L&aacute; embaixo nem
&eacute; bom olhar, que pega herpes. Puto, o cara quer o dinheiro de volta.
Ela chama o cara de brocha e amea&ccedil;a chamar o seguran&ccedil;a. O
que o cara pode fazer? Ele est&aacute; pelado. Ela, quase vestida. Como
&eacute; que se chamar a pol&iacute;cia desse jeito? O documento dele est&aacute;
na portaria. Se ela quiser, pode sair correndo com as cal&ccedil;as dele,
com os documentos, cart&atilde;o de cr&eacute;dito, do banco, etc.. Pois
&eacute;, o que um cara desses pode fazer? </P>

<P>Isso &eacute; o chamado &nbsp;<I>&quot;golpe&quot;</I>. S&atilde;o v&aacute;rios
os perigos dessa vida.. o que a pessoa aprende, numa experi&ecirc;ncia
dessas? A primeira &eacute; que <I>&quot;Papai Noel n&atilde;o existe&quot;</I>.
&Oacute;bvio. A segunda &eacute; que nunca pague adiantado por um produto
que voc&ecirc; n&atilde;o conhece. Mulher tamb&eacute;m tem essa de ter
embalagem bonita escondendo um produto podre. E n&atilde;o &eacute; s&oacute;
as mais vagabundas que fazem isso. <I>&quot;Vais sair na balada?&quot;</I>
Saia com xerox autenticada, deixe o tal&atilde;o de cheques, o rel&oacute;gio
e os badulaques em casa. E nada de contar onde voc&ecirc; mora, estuda,
trabalha. Quer algu&eacute;m indo atrapalhar sua vida, faz isso. A maior
de todas as li&ccedil;&otilde;es &eacute; que nunca se entrega seus documentos
ou informa&ccedil;&atilde;o sobre voc&ecirc; para qualquer um. Se est&atilde;o
roubando os dados dos contribuintes do imposto, coisa supostamente inviol&aacute;vel,
e vendendo nas lojas de CD-pirata pelo Brasil afora, que dir&aacute; do
resto. Inclui-se nisso os question&aacute;rios que andam distribuindo no
PROV&Atilde;O e nos ENEM da vida. Talvez voc&ecirc; n&atilde;o conhe&ccedil;a
essa hist&oacute;ria. Est&atilde;o distribuindo question&aacute;rios nas
duas provas. Para conseguir ver fui no PROV&Atilde;O e me inscrevi no ENEM.
Um por obriga&ccedil;&atilde;o profissional, receber o diploma. O outro
&eacute; por que tinha um sonho de fazer outra faculdade. Impressionante.
A mo&ccedil;ada protesta contra o prov&atilde;o, mas ningu&eacute;m fala
nada dos question&aacute;rios s&oacute;cio-econ&ocirc;micos. (Que podem
ser entregues em branco, eu fiz isso e me mandaram o resultado do prov&atilde;o
do mesmo jeito). Est&atilde;o perguntando nesses question&aacute;rios(*)
coisas &iacute;ntimas do tipo:</P>

<P>- Voc&ecirc; consome drogas? </P>

<P>- Voc&ecirc; sabe de algu&eacute;m que consome drogas?</P>

<P>- Voc&ecirc; sabe de algu&eacute;m que vende drogas?</P>

<P>O perigo de se responder a qualquer uma dessas perguntas com um <I>&quot;sim&quot;</I>
&eacute; que a pessoa j&aacute; se incrimina, s&oacute; de ajudar o governo
&agrave; responder uma pesquisa (incrimina por que o question&aacute;rio
vem com o nome da pessoa). Vamos supor que o sujeito conhece algu&eacute;m
que trafica drogas no col&eacute;gio dele, mas n&atilde;o denuncia (o que
pode ser uma boa forma de se chegar vivo at&eacute; o final do curso).
Respondendo sim no question&aacute;rio, j&aacute; se tornou c&uacute;mplice.
A legisla&ccedil;&atilde;o diz que &eacute; c&uacute;mplice quem n&atilde;o
denuncia um crime. Por lei, todo cidad&atilde;o tem por obriga&ccedil;&atilde;o
denunciar. Mas vamos supor que voc&ecirc; seja honesto e s&oacute; fez
o que todo mundo faz. Ou que voc&ecirc; responda com dados do tipo <I>&quot;n&atilde;o
sei o que &eacute; t&oacute;chico, s&oacute; vi na televis&atilde;o&quot;</I>.
Question&aacute;rios s&atilde;o feitos com perguntas para testar a veracidade
de outras perguntas. Ent&atilde;o fica claro que a pessoa est&aacute; mentindo.
Por exemplo: D&aacute; para acreditar que algu&eacute;m ganhando sal&aacute;rio
m&iacute;nimo consiga responder <I>&quot;sim&quot;</I> no quesito <I>&quot;voc&ecirc;
&eacute; feliz&quot;</I>?. (&Eacute; s&oacute; um exemplo, tem tanto desempregado
hoje em dia que isso as vezes at&eacute; acontece).</P>

<P>Mas o que pode pegar no seu p&eacute; &eacute; que essa informa&ccedil;&atilde;o
vai para o computador e talvez seja vendida para algu&eacute;m, num CD
pirata em algum lugar, como aconteceu com a Telef&ocirc;nica e a Receita
Federal (vide <A HREF="http://www.estado.estadao.com.br/editorias/2000/06/03/cid720.html">http://www.estado.estadao.com.br/editorias/2000/06/03/cid720.html</A>
e <A HREF="http://www.jt.com.br/editorias/2000/06/02/ger601.html">http://www.jt.com.br/editorias/2000/06/02/ger601.html</A>
. H&aacute; outras quest&otilde;es tamb&eacute;m chocantes (No question&aacute;rio
tinha perguntas assim <I>&quot;Voc&ecirc; acredita em conselhos de Pai-de-Santo?&quot;</I>
imagina o cara responder <I>&quot;sim&quot;</I>, se formar em Economia
e o empregador souber disso antes da contrata&ccedil;&atilde;o, anos depois..
ser&aacute; que o Economista continua sendo considerado bom apesar de se
consultar em jogo de b&uacute;zios?), mas voltando ao assunto anterior..</P>

<P>&Eacute; aquela velha hist&oacute;ria, a coisa parece, mas n&atilde;o
&eacute;. Nem tudo o que reluz &eacute; ouro. Vide p&aacute;ginas de sexo
virtual. H&aacute; v&aacute;rios tipos de p&aacute;ginas de sexo virtual,
da mesma forma que mulheres num bordel. Tem aqueles que gostam de sexo
anal, bizarro, gay, boquete, colegiais, tiazinha, playboy, l&eacute;sbica,
com velhos, com adolescentes, com virgens, com freiras, filmes, com a feiticeira,
etc, etc.. mas o problema &eacute; quando a pessoa chega numa p&aacute;gina
dessas, v&ecirc; essa ou aquela foto e resolve que quer mais al&eacute;m
do que realmente est&aacute; dispon&iacute;vel como amostra gr&aacute;tis.
Coitado.</P>

<P>H&aacute; v&aacute;rios formas de se cobrar por conte&uacute;do er&oacute;tico,
na internet. Uma delas &eacute; via cart&atilde;o de cr&eacute;dito. A
p&aacute;gina diz que usa esse crit&eacute;rio para se certificar que a
pessoa tem idade para ter acesso &agrave;quele conte&uacute;do (art&iacute;stico
ou pervertido). Pena que algumas p&aacute;ginas mentem (mundo cruel) e
cobram ou usam esse n&uacute;mero de cart&atilde;o de cr&eacute;dito para
outras finalidades (quem sabe viajar em outras p&aacute;ginas porn&ocirc;).
Outra forma &eacute; pagar por uma ID-check, que &eacute; um c&oacute;digo
que d&aacute; acesso a p&aacute;ginas conveniadas pela empresa. Algumas
p&aacute;ginas tem um processo de cadastramento que d&atilde;o um login
de acesso (v&atilde;o dizer que a minha pesquisa foi boa, mas bobagem).</P>

<P>Em algumas p&aacute;ginas &eacute; necess&aacute;rio fazer o download
de um programa que acelera a conex&atilde;o. J&aacute; aconteceu com voc&ecirc;?
Pois &eacute;. S&oacute; que o programa tem uma esp&eacute;cie de contrato,
que deve ser lido antes de voc&ecirc; ter acesso aos &nbsp;<I>&quot;filmes
porn&ocirc; gratuitos&quot;, </I>ele pede que a conex&atilde;o seja feita
de um provedor espec&iacute;fico. Para ser mais exato, numa conex&atilde;o
fora do pa&iacute;s onde voc&ecirc; se encontra. J&aacute; ouviu falar
da Moldova? E das Ilhas Caim&atilde;ns? Madagascar. Pois &eacute;. Mas
a culpa ser&aacute; s&oacute; sua, por que voc&ecirc; n&atilde;o leu o
contrato. No contrato fala-se claramente que esse acesso &eacute; via um
provedor l&aacute; longe de voc&ecirc; e que haver&aacute; uma taxa cobrada
na sua conta telef&ocirc;nica. Coisa de US$ 250,00 por cerca de meia hora.
Mas quem &eacute; que passa meia hora navegando na internet em site porn&ocirc;?
Toma cuidado com esses sites. Se voc&ecirc; n&atilde;o tem paci&ecirc;ncia
para ler os contratos daquilo que est&aacute; fazendo download, melhor
n&atilde;o fazer. Por que esses programas s&atilde;o piores do que Trojans.
Se um cavalo-de-tr&oacute;ia formatar seu HD, voc&ecirc; ter&aacute; que
pagar um t&eacute;cnico. Mas se o programa ligar para as Ilhas Caim&atilde;ns,
voc&ecirc; ter&aacute; que pagar a empresa telef&ocirc;nica ou perder a
linha. Na figura abaixo, temos um exemplo de chamada para Vanuatu, pagando
US$5.09 por minuto. </P>

<P><IMG SRC="otario1.jpg" HEIGHT=406 WIDTH=616></P>

<P>O contrato especifica claramente: <I>&quot;Uma vez conectado, voc&ecirc;
ir&aacute; estabelecer uma conec&ccedil;&atilde;o com um servidor remoto
fora de seu pa&iacute;s. Seu modem ir&aacute; se desconectar do seu provedor
de acesso internet e chamar um N&Uacute;MERO DE TELEFONE INTERNACIONAL
para Vanuatu atrav&eacute;s do n&uacute;mero de acesso 1010288 da AT&amp;T.
Uma CHAMADA INTERNACIONAL DE LONGA DIST&Acirc;NCIA para Vanuatu, pagando
a taxa de $5.09 por minuto ir&aacute; aparecer na sua conta telef&ocirc;nica&quot;</I>.
&Eacute; um contrato v&aacute;lido. Apertou Enter, concordou com isso.
Inoc&ecirc;ncia n&atilde;o &eacute; desculpa.</P>

<P>N&atilde;o &eacute; s&oacute; site porn&ocirc; que tem esses tipos de
armadilha. Existe outros tipos de sites comuns, com armadinhas que, embora
n&atilde;o prejudiquem tanto, tamb&eacute;m atrapalham muito. Como os CDs
de provedores que instalam um servi&ccedil;o internet gratuito no seu micro
e <I>&quot;engessam&quot; </I>o sistema, obrigando a reinstalar o Windows
se quiser tirar aquela propaganda velha. Falando em propaganda, quem ficou
famoso com isso foi o site GoHip. Est&aacute; l&aacute;, preto no branco.
A pessoa concorda em ter algumas altera&ccedil;&otilde;es feitas no seu
micro em troca da possibilidade de ver material gratuito (nada de porn&ocirc;).
Isso deu uma gritaria incr&iacute;vel na internet. Por qu&ecirc; o que
o programa (sim, nesse caso tamb&eacute;m havia um programa que melhora
o acesso o qual o usu&aacute;rio tinha que fazer o download para poder
ter acesso ao material visual gratuito). Esse programa alterava a signature
do email da pessoa para acrescentar propaganda do site. Ent&atilde;o seria
algo assim, no final do email:</P>

<CENTER><P><I>------------------------------------------- <BR>
Click here for Free Video!<BR>
! http://www.gohip.com/freevideo/</I></P></CENTER>

<P>Mais gente clicava, a&iacute; mais gente acabava mandando para os amigos
propaganda do site. Claro, agora eles colocaram um texto explicando como
deixar tudo de volta ao normal, &eacute; s&oacute; fazer outro download
de program! (vide <A HREF="http://www.gohip.com/remove_browser_enhancement.html">http://www.gohip.com/remove_browser_enhancement.html</A>).
O chato &eacute; que tudo isso estava no contrato com o qual a pessoa concorda
quando usa. </P>

<P>Os leil&otilde;es virtuais podem ser uma &oacute;tima maneira de vender
seus badulaques ou comprar algo de segunda m&atilde;o por um pre&ccedil;o
rid&iacute;culo. Mas apesar das revistas, jornais e a TV (que ganham uma
fortuna fazendo comerciais desses leil&otilde;es), o mal existe. A pessoa
pode receber seu dinheiro e n&atilde;o mandar o produto. Ou mandar um produto
errado. Ou te amea&ccedil;ar jogar um advogado em cima se voc&ecirc; reclamar
da troca que recebeu. H&aacute; quem confie. Em todo o caso, d&ecirc; uma
olhada na p&aacute;gina <A HREF="http://www.estadao.com.br/economia/financas/noticias/2001/set/24/77.htm">http://www.estadao.com.br/economia/financas/noticias/2001/set/24/77.htm</A>
</P>

<P>Existem v&aacute;rios outros tipos de malandragem via internet, como
aqueles emails onde a pessoa pede <I>&quot;ajuda&quot;</I> para transferir
o dinheiro de um pa&iacute;s para outro. Coisa semelhante acontece fora
da internet: algu&eacute;m, as vezes uma mulher muito bonita e gostosa,
fala que quer transferir um dinheiro para sua conta (ou te d&aacute; um
cheque para depositar) e pede para que voc&ecirc; retire o dinheiro da
sua conta para ela, que perdeu o cart&atilde;o ou outro problema qualquer.
Entendeu? N&atilde;o. A pessoa pode n&atilde;o ser a dona do cheque que
est&aacute; sendo depositado na sua conta ou pode ser algu&eacute;m que
est&aacute; <I>&quot;lavando dinheiro&quot;</I> de um assalto ou desfalque.</P>

<P>Cuidado. A pr&oacute;xima v&iacute;tma pode ser voc&ecirc;.</P>

<P>Compra via internet pode dar problemas, j&aacute; que a loja virtual
nem sempre troca o produto, vide <A HREF="http://www.estado.estadao.com.br/suplementos/info/2001/12/24/info024.html">http://www.estado.estadao.com.br/suplementos/info/2001/12/24/info024.html</A>
. </P>

<P>Artigo no New York Times sobre o <I>&quot;Escambo&quot;</I> de Modem</P>

<P><A HREF="http://www.nytimes.com/library/cyber/week/021197scam.html">http://www.nytimes.com/library/cyber/week/021197scam.html</A></P>

<P>Outro artigo</P>

<P><A HREF="http://www.accessatlanta.com/partners/wsbtv/consumer/modem_hijacking.html">http://www.accessatlanta.com/partners/wsbtv/consumer/modem_hijacking.html</A>
</P>

<P>Wired</P>

<P><A HREF="http://www.wired.com/news/politics/0,1283,2147,00.html">http://www.wired.com/news/politics/0,1283,2147,00.html</A>
</P>

<P>(*) Para ser mais exato (custei um pouco a encontrar o question&aacute;rio
do ENEM&nbsp;de 2001), algumas das perguntas que me chamaram a aten&ccedil;&atilde;o
s&atilde;o essas:</P>

<P><B>---------------</B></P>

<P><B>48. Na sua escola, voc&ecirc; viu alguma vez:____ J&aacute; vi ______Nunca
vi<BR>
48.1 algum aluno usando drogas ___________(a)________(b)<BR>
48.2 brigas de &nbsp;&quot;gangs&nbsp;&quot; ou grupos_________(a)________(b)<BR>
48.3 algu&eacute;m vendendo drogas (maconha, crack, etc) (a) (b)<BR>
48.4 alunos violentos, alunos armados ______(a)________(b)<BR>
49. Se voc&ecirc; descobrisse que algum(a) amigo(a) seu(ua) usa drogas
freq&uuml;entemente, que atitude voc&ecirc; tomaria? (aten&ccedil;&atilde;o,
escolha apenas uma op&ccedil;&atilde;o)</B></P>

<P><B>(a) Eu n&atilde;o faria nada, pois cada um sabe o que faz.<BR>
(b) Eu tentaria convenc&ecirc;-lo(a) a parar.<BR>
(c) Eu procuraria encaminh&aacute;-lo(a) para uma cl&iacute;nica de drogados.<BR>
(d) Eu avisaria &agrave; fam&iacute;lia e deixaria que ela cuidasse do
caso.<BR>
(e) N&atilde;o sei.<BR>
<BR>
--------------<BR>
<BR>
53. Dos itens abaixo, qual voc&ecirc; acha que faz mais falta em sua forma&ccedil;&atilde;o
pessoal para enfrentar a vida? (aten&ccedil;&atilde;o, escolha apenas uma
op&ccedil;&atilde;o)</B></P>

<P><B>a) autoconfian&ccedil;&atilde; b) Clareza de objetivos c) Capacidade
de resolu&ccedil;&atilde;o de problemas d) Lideran&ccedil;a e) Saber me
relacionar com as pessoas, trabalhar em grupo f) N&atilde;o me falta nada</B></P>

<P><B>-------------</B></P>

<P><B>56. Voc&ecirc; j&aacute; recorreu alguma vez a qualquer dos recursos
abaixo para resolver seus problemas pessoais? (a)Sim (b)N&atilde;o<BR>
56.1 - Procurou pela fam&iacute;lia (a)(b)<BR>
56.2- Foi a cartomante (a)(b)<BR>
56.3- Consultou o jogo de b&uacute;zios (a)(b)<BR>
56.4- Foi &agrave; Igreja/procurou padre/pastor (a)(b)<BR>
56.5- Buscou ajuda profissional(psic&oacute;logo, m&eacute;dico, etc) (a)(b)<BR>
56.6- Consultou hor&oacute;scopo (a)(b)<BR>
56.7- Procurou amigos (a)(b)<BR>
56.8- Buscou orienta&ccedil;&atilde;o em livros e revistas (a)(b)</B></P>

<P><B>Fonte: Manual do Inscrito - Question&aacute;rio S&oacute;cioecon&ocirc;mico
- Exame Nacional do Ensino M&eacute;dio</B></P>

<P><B>---------------</B></P>

</BODY>
</HTML>
