<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<TITLE></TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice/5.1 (Win32)">
	<META NAME="AUTHOR" CONTENT="Miguel Angel Nieto Salazar">
	<META NAME="CREATED" CONTENT="20000325;11581900">
	<META NAME="CHANGEDBY" CONTENT="Miguel Angel Nieto Salazar">
	<META NAME="CHANGED" CONTENT="20000326;19403120">
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
	<STYLE>
	<!--
		@page { size: 21.01cm 29.69cm }
	-->
	</STYLE>
</HEAD>
<BODY BGCOLOR="#000000">
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><IMG SRC="atime.jpg" NAME="Imagen1" ALIGN=BOTTOM WIDTH=350 HEIGHT=75 BORDER=0></P>
<P><FONT COLOR="#ffffff"><BR>&nbsp; </FONT>
</P>
<P><FONT COLOR="#ffffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Seguramente
muchos de vosotros/as contact&aacute;is de vez en cuando con personas
que se encuentran a muchos kil&oacute;metros de distancia de
vosotros... haber si me explico, que no son de tu mismo pa&iacute;s
:) En este tipo de amistades a distancia siempre existe el mismo
problema, el cambio de hora. Cada vez que quieras quedar en un chat o
en el ICQ para echarte una charlita, hay que calcular la hora, y lo mas incre&iacute;ble es que siempre estos c&aacute;lculos
son err&oacute;neos, lo digo por experiencia :) A partir de ahora
este problema ya no existe, gracias a la marca Swatch, y la reci&eacute;n
nacida &quot;Hora internet&quot; (I-time) </FONT></FONT></FONT>
</P>
<P><FONT COLOR="#ffffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>A
partir de ahora, el d&iacute;a ya no se divide en 24 horas, cada hora
en 60 minutos, etc... Desde el 1 de enero del 1999 el d&iacute;a se
divide en 1000 beats, palabra que viene de la expresi&oacute;n &quot;be
at the time&quot;, que en espa&ntilde;ol viene a decir... &quot;estar
a la misma hora&quot; o algo as&iacute; :) cada y beat equivale a 1
minuto y 26,4 segundos. A partir de ahora cuando quieras quedar par
charlar con esa amiguita de Argentina que te echastes el otro d&iacute;a
ya no tendr&aacute;s que ponerte a calcular el cambio horario.
Qued&aacute;is a las @450, y sin ning&uacute;n problema. Tu amiga y
tu estar&eacute;is a las @455 (siempre te retrasas :) en el chat &quot;mas
que amiguitos&quot;. </FONT></FONT></FONT>
</P>
<P><FONT COLOR="#ffffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Este
nuevo sistema horario fue creado por la marca swatch en el a&ntilde;o
1998, con la intenci&oacute;n de eliminar las zonas horarias,
logrando as&iacute; un sistema horario gracias a el cual todos los
usuarios de internet tuvieran la misma hora en sus relojes.
L&oacute;gicamente este sistema no se esta imponiendo aun con mucha
fuerza, ya que un cambio de este tipo no resulta nada sencillo. Aun
no se pueden encontrar en la calle muchos relojes de pulsera para
este nuevo tipo de hora, aun as&iacute; si que se pueden encontrar
muchos en internet, para algo es la hora internet :) </FONT></FONT></FONT>
</P>
<P><FONT SIZE=2><FONT FACE="Arial, sans-serif"><FONT COLOR="#ffffff">Podr&eacute;is
encontrar muchos conversores de este tipo. El mas usado es,
l&oacute;gicamente el que se encuentra en la propia web de la marca
swatch (</FONT></FONT></FONT><A HREF="http://www.swatch.com/"><FONT SIZE=2><FONT FACE="Arial, sans-serif"><FONT COLOR="#ffffff">http://www.swatch.com</FONT></FONT></FONT></A><FONT SIZE=2><FONT FACE="Arial, sans-serif"><FONT COLOR="#ffffff">)
donde encontrareis un conversor en linea basado en web, y a la vez os
podr&eacute;is bajar uno a vuestro ordenador. </FONT></FONT></FONT>
</P>
<P><FONT SIZE=2><FONT FACE="Arial, sans-serif"><FONT COLOR="#ffffff">Tambi&eacute;n
podr&eacute;is encontrar otro con mucho mas completo (y a mi gusto
mucho mejor) en </FONT></FONT></FONT><A HREF="http://www.creativengine.com/"><FONT SIZE=2><FONT FACE="Arial, sans-serif"><FONT COLOR="#ffffff">http://www.creativengine.com</FONT></FONT></FONT></A><FONT SIZE=2><FONT FACE="Arial, sans-serif"><FONT COLOR="#ffffff">
Este conversor cuenta con muchas mas caracter&iacute;sticas, entre
las que destacan la posibilidad de configurar alarmas a distintas
horas, cambiar el aspecto del programa por medio de skins, etc. </FONT></FONT></FONT>
</P>
<P><FONT COLOR="#ffffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Seguramente
en internet habr&aacute; much&iacute;simos programas mas, pero yo
expongo los mas importantes, vosotros ver&eacute;is lo que hac&eacute;is
:) </FONT></FONT></FONT>
</P>
<P><FONT COLOR="#ffffff"><FONT SIZE=2><FONT FACE="Arial, sans-serif">Ahora
solo queda esperar a que este nuevo sistema horario comienza a
utilizarse cada vez mas. El sistema es novedoso, y ayuda much&iacute;simo...
pero quiz&aacute;s la pereza de tener que cambiar de sistema horario
pueda mas que nosotros, yo por el momento ya me he pasado a esta
nueva forma de ver volar los minutos, la hora internet.</FONT></FONT>
</FONT>
</P>
<P><A HREF="mailto:punisher@linuxfan.com"><IMG SRC="Punish07.gif" NAME="Imagen4" ALIGN=RIGHT WIDTH=384 HEIGHT=224 BORDER=0></A><BR><BR>
</P>
</BODY>
</HTML>