<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Miguel Angel [ Punisher '00? ]">
   <meta name="GENERATOR" content="Mozilla/4.7 [en] (Win98; I) [Netscape]">
   <title>Box</title>
</head>
<body text="#FFFFFF" bgcolor="#000000" link="#3366FF" vlink="#3366FF" alink="#3366FF">
<font face="Arial,Helvetica"><font size=-1></font></font>&nbsp;
<center><table BORDER CELLSPACING=0 CELLPADDING=0 >
<tr>
<td>
<center><b><font face="Arial,Helvetica"><font size=-1>Un pokillo de phreaking</font></font></b>
<br><font face="Arial,Helvetica"><font size=-1>por</font></font>
<br><b><font face="Arial,Helvetica"><font color="#FF0000">31337</font></font></b>
<br><font face="Arial,Helvetica"><font size=-1><a href="mailto:sux0r@hax0r.com.ar">sux0r@hax0r.com.ar</a></font></font></center>
</td>
</tr>
</table></center>
<font face="Arial,Helvetica"><font size=-1></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Bueno, antes de nada, aclarar
que TODO lo escrito aqu&iexcl; es puramente con FINES EDUCACIONALES y ,
ni yo ni ning&uacute;n miembro de OiOiO'S Band se hace responsable del
mal uso que se le pueda dar, y esas cosas m&aacute;s que se dicen.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Aclarado esto, vamos a por
ello ;)</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Ante nada, decir que lo que
aqu&iacute; se va a comentar es una cosa muy cutre, que debemos agradecer
a los coleguitas de la Timof&oacute;nica.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Voy a explicar como hacer
beige boxing de guays en Espa&ntilde;a, en otros paises no creo que var&iexcl;e
mucho la cosa, pero aqu&iacute; est&aacute; facilillo. Pal que no lo sepa,
el beige boxing consiste en llamar por telefono desde la calle o cualquier
sitio donde encuentres una cajita de Timof&oacute;nica para poder pinchar
tu "m&oacute;vil" ;)</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Lo primero de todo pasa por
pillarte un telefono, preferiblemente peque&ntilde;o, de esos que solo
tienen el mango, pq va a ser nuestro m&oacute;vil (si quieres uno grande,
t&uacute; mismo, pero es m&aacute;s dificil de esconder y m&aacute;s palo
llevarlo ). Bien, aparte de eso necesitaremos, o bien unas pinzas de cocodrilo
de esas, o un "enchufe" que se encuentra dentro de las cajas esas de la
Timo (las grandes, las peque&ntilde;as no se pq no he abierto ninguna,
aun) Bueno, el proceso est&aacute; tirao, y pasa por cortar un cachito
del cable que va a la roseta de la pared del telefono, y acoplarle ah&iacute;,
o bien las pinzas, o bien el mencionado enchufe (en caso de tener cuatro
cables, se ha de enchufar en los que quedaran en medio, que generalmente
son marr&oacute;n y blanco). Tras ello ya tenemos m&oacute;vil, y solo
falta ir a llamar ;)</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Las cajas a las que me refiero
est&aacute;n a una altura del pecho, y llevan el logo de la Timof&oacute;nica,
y algunas llevan una pegata que pone: "manipular solo con el instrumental
adecuado", y tb suelen llevar n&uacute;meros para indicar a los chup&oacute;pteros
de que zona se encarga la caja XDDDDD El proceso para encontrar cajas es
bien sencillo. Busca por:</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>-</font><b><font color="#FFCC00">Barrios
residenciales</font></b><font size=-1>, por dos cosas : todas las casas
son plantas bajas, y en las zonas con edificios las cajas suelen ser de
esas peque&ntilde;itas que se colocan en las fachadas de los edificios,
a la altura del 1er piso, y sobre todo, porque piensa que al llamar la
puta Timof&oacute;nica no pierde nada, ya que llamamos cogiendo la linea
de un pobre incauto, que desconoce lo poco que la Timof&oacute;nica protege
su l&iacute;nea de telefono. As&iacute;, si estamos en una zona de ricos
es l&oacute;gico pensar que va a pagar alg&uacute;n acaudalado ricach&oacute;n,
con lo que no me remuerde en absoluto la conciencia sino que por el contrario,
me anima a hacerlo ;) De todas formas ten en cuenta que en cualquier zona
con casas que sean chalets o plantas bajas habr&aacute; cajas de estas
;)</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>-</font><b><font color="#FFCC00">Carreteras</font></b><font size=-1>,
o tramos en los que hay mucho campo. Para ello basta con fijarse en los
palos por donde van los cables, y seguir los de telefonos (no es muy dificil),
que son f&aacute;ciles de reconocer pq muchas veces acaban en una especie
de gran consolador negro encima del palo o si no, te fijas de las l&iacute;neas
que provienen de casas y van hacia la caja, que son los cables m&aacute;s
finos que hay, y a menudo hay muuuchos cables de estos finos, as&iacute;
que solo hay que seguirlos.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Bueno, ya hemos llegado a
la caja, y ahora ...... &shy;ESTA CERRADA! Tranquilo ;) Has de ir provisto
de una llave de contadores de gas, de esas triangulares, o si no tienes
(como yo), un buen destornillador (ti&ntilde;aor de ahora en adelante )
har&aacute; de llave ;)</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Bien, si tienes la llave
de contadores, te puedes saltar lo siguiente, que explica para paletos
como abrir una caja con un ti&ntilde;aor (la verd&aacute;d es que no tiene
secreto)</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Si eres de los que van con
ti&ntilde;aor en mano, sigue leyendo. Al toparte con la caja, puede darse
la ocasi&oacute;n de que te encuentres con alguna de las m&aacute;s antiguas,
que son de hierro o algo as&iacute;, y suelen estar por el campo, carreteras
y dem&aacute;s, as&iacute; como en lugares donde la timo vaya poco, ya
que parece que ahora todas las ponen de pl&aacute;stico 8)''' ;)</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Bueno, en este caso, pilla
el ti&ntilde;aor, lo metes por donde queda la cerradura, y espero que sea
un buen ti&ntilde;aor, pq ahora hay que hacer palanca O:) XDDDDDD</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Supongo que tras ello ya
tendr&aacute;s la caja, abierta, con sus cables, sus ruedecitas y sus agujeritos,
ahora ya puedes pasar a la siguiente parte&nbsp; ;)</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Si sigues leyendo es pq has
tenido la suerte de entontrarte con un cajet&iacute;n de los de pl&aacute;stico,
pues bien, estos son facil&iacute;simos de abrir. Puedes hacerlo como he
dicho antes, con el ti&ntilde;aor, o si se te ha olvidado en casa, simplemente
pilla por la cerradura con las manos y pega un tir&oacute;n ;) &iquest;F&aacute;cil,
verdad? }:)</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Vale, &iquest;y ahora? Que
co&ntilde;o hago! Bueno, pues ahora pilla el enchufe al que me refer&iacute;a
antes, que est&aacute; en la parte superior de la caja, aguantado con un
hilo de pescar (si no se lo ha llevado alguien), y ver&aacute;s que hay&nbsp;
unas ruedecitas negras con agujeros en las diagonales, y que a algunas
les&nbsp; llegan unos cables del lado. Bien, pues los que tienen los cables
son los que interesan, puesto que son los que tienen l&iacute;nea. Ahora
solo hace falta enchufar el enchufe ese en alguno de esos, poniendolo por
encima de la ruedecita, y de forma que pille los agujeros esos de las diagonales,
y girarlo un poquillo para que enganche bien. Bueno, si eres de los que
has&nbsp; endi&ntilde;ado el enchufe al m&oacute;vil, solo te falta llamar,
si le has puesto las pinzas, simplemente pincha una a cada patilla y a
llamar tocan.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Bueno, pues ahora solo queda
que este, en un buen sitio para poder llamar sin problemas, o lo que sea.
Puedes inventarte 1000 maneras de&nbsp; usarlo, desde pinchar la l&iacute;nea
auxiliar de tu casa a casa del vecino, a pillarte un port&aacute;til e
irte por la noche a festear de gratix, y dem&aacute;s&nbsp; ..... ;)</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<div align=right>
<p><font face="Arial,Helvetica"><font size=-1>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>
Correcciones, sugerencias o lo que quer&aacute;is en <a href="mailto:sux0r@hax0r.com.ar">sux0r@hax0r.com.ar</a></b></font></font></div>

</body>
</html>
