<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<TITLE>DELPHI</TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice/5.1 (Win32)">
	<META NAME="AUTHOR" CONTENT="Oscar Montes D&iacute;az">
	<META NAME="CREATED" CONTENT="20000326;15023131">
	<META NAME="CHANGEDBY" CONTENT="Miguel Angel Nieto Salazar">
	<META NAME="CHANGED" CONTENT="20000326;15043330">
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
	<STYLE>
	<!--
		TD P { color: #ffffff }
		P { color: #ffffff }
		A:visited { color: #000000 }
		A:link { color: #000000 }
	-->
	</STYLE>
</HEAD>
<BODY TEXT="#ffffff" LINK="#000000" VLINK="#000000" BGCOLOR="#000000">
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><IMG SRC="Delphi.JPG" NAME="Imagen1" ALT="DEEEEEEELPHI" ALIGN=BOTTOM WIDTH=290 HEIGHT=68 BORDER=0></P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><BR>
</P>
<P ALIGN=CENTER><FONT FACE="Arial, sans-serif"><FONT SIZE=2>SEGUIMOS
CON EL DELPHI, Y EN CONCRETO CON LOS OBJETOS. <BR></FONT></FONT><BR><BR>
</P>
<P ALIGN=LEFT><FONT FACE="Arial, sans-serif"><FONT SIZE=2>OBJETOS
<BR>Pr&aacute;cticamente todos los elementos del entorno son objetos,
en ocasiones ya predefinidos mientras que en otras se definen a
medida que avanza el dise&ntilde;o de la aplicaci&oacute;n. La ficha
inicialmente vac&iacute;a, los botones de control, etc, todos ellos
son objetos que poseen una serie de caracter&iacute;sticas propias.
Por lo general, s&oacute;lo necesitar&aacute;s alterar algunas de las
propiedades de cada objeto seleccionado para adaptarlo a sus
necesidades. La metodolog&iacute;a de uso de objetos se basa en la
herencia de sus propiedades. Por ejemplo, el objeto ventana (o bot&oacute;n)
hereda todas las cualidades del &quot;patr&oacute;n&quot; ventana (o
bot&oacute;n) predefinidas en el componente original. A partir de
aqu&iacute; podr&aacute;s personalizarlas, mejor dicho, modificarlas
para que se adapten mejor a una tarea particular. Esto permite
simplificar notablemente el dise&ntilde;o de cualquier aplicaci&oacute;n,
ya que no es necesario crear o definir un componente con todos sus
detalles, para poder&nbsp; aplicarlo a cada situaci&oacute;n
particular. </FONT></FONT>
</P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>No se si te ha quedado
claro esto de los objetos, tampoco tiene mucha importancia, con que
sepas que todo lo que vas a utilizar con el Delphi son objetos (
porque casi todo lo que usas lo has cogido de alguna parte y lo has
puesto sobre la ficha, como si ser&iacute;a una cosa) me vale. </FONT></FONT>
</P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Antes de empezar
definitivamente a programar con Delphi (y como siempre creo que la
mejor manera de aprender es la practica) y hacer nuestro primer
programa vamos a por un poco de vocabulario para que sepas que son
unas cuantas cosas que vamos a nombrar en Delphi. </FONT></FONT>
</P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>COMPONENTES <BR>Un
componente es cualquiera de los elementos de programaci&oacute;n que
se insertan en una ficha. No todos los componentes deben ser visibles
para el usuario. A los componentes que disponen de partes visuales se
les denomina &quot;controles&quot;. Delphi dispone de una amplia
&quot;paleta&quot; de componentes propios, creados con su lenguaje
Object Pascal y creados con el propio Delphi, adem&aacute;s de poder
utilizar componentes VBX (que en su momento fueron creados para ser
usados para el Microsoft Visual Basic). Para desarrollar un
componente propio, mediante Delphi, se puede partir tanto de cero
como de la modificaci&oacute;n de un componente ya creado. <BR>Los
componentes son las unidades b&aacute;sicas de la programaci&oacute;n
con Delphi. La creaci&oacute;n de aplicaciones mediante la
reutilizaci&oacute;n de los componentes resulta de gran importancia,
ya que permite generar programas de gran complejidad sin necesidad de
conocer todos los detalles de los diversos elementos utilizados, ni
evidentemente tener que escribirlos. </FONT></FONT>
</P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>FICHAS <BR>La ficha, o
&quot;Form&quot; en ingl&eacute;s, es una ventana al estilo Windows.
La verdad, es que es el contenedor principal donde se coloca la
informaci&oacute;n, se dibuja, se asignan controles y se colocan los
componentes visuales. Es el medio para que el programa se cominique
con el usuario y viceversa. Los programas pueden emplear tanto una
sola ficha como varias, seg&uacute;n convenga. Pero siempre existir&aacute;
una ficha principal que da acceso a las dem&aacute;s, ya sea mediante
men&uacute;s, botones o por opciones que el usuario. <BR>Delphi
permite trabajar tanto con fichas vac&iacute;as, como acudir a
plantillas existentes que contengan ya una larga serie de componentes
definidos. El propio usuario puede crear y definir estas plantillas.
Un m&eacute;todo m&aacute;s para hacer m&aacute;s facil nuestra vida.
<BR>Dise&ntilde;ar una ficha consiste simplemente en seleccionar
entre los componentes disponibles, arrastrarlo a su posici&oacute;n
en la ficha y ajustar las propiedades. Para la mayor parte del
trabajo no es necesario escribir manualmente c&oacute;digo
&iexcl;&iexcl;&iexcl;&iexcl;bieeeeeen!!!! </FONT></FONT>
</P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>M&Eacute;TODOS <BR>Adem&aacute;s
de tener sus propiedades y responder a eventos, los componentes de
Delphi pueden contener m&eacute;todos. Un m&eacute;todo es un
procedimiento o funci&oacute;n que permite realizar una cierta acci&oacute;n
en el componente. Al igual que los eventos y las propiedades el
m&eacute;todo que pertenece a un determinado componente se identifica
de forma un&iacute;voca para que se ejecute de forma precisa y
ordenada s&oacute;lo cuando le corresponde. </FONT></FONT>
</P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>La cualidad de la
t&eacute;cnica de orientaci&oacute;n a objetos, una caracter&iacute;stica
que est&aacute; presente en el propio dise&ntilde;o interno de
Delphi, permite que cada objeto sea el &uacute;nico propietario de
una serie de caracter&iacute;sticas, como propiedades y m&eacute;todos,
junto con variables y c&oacute;digo de ejecuci&oacute;n, que no son
accesibles a ning&uacute;n otro objeto diferente. Esta cualidad se
denomina encapsulaci&oacute;n y permite aislar los diversos elementos
del programa para evitar interferencias mutuas y salvaguardar tanto
la integridad de ejecuci&oacute;n como facilitar la creaci&oacute;n
de programas sin que nos comamos mucho la cabeza. </FONT></FONT>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>PUES
YA EST&Aacute; ESTE ERA EL VOCABULARIO QUE QUIERO QUE HASTA ESTE
MOMENTO CONOZCAS M&Aacute;S ADELANTE APRENDEREMOS OTRAS PALABRITAS.
EN EL PROXIMO N&Uacute;MERO POR FIN CREAREMOS NUESTRO PRIMER
PROGRAMA. </FONT></FONT>
</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><A HREF="YO.htm"><IMG SRC="Smiley.gif" NAME="Imagen2" ALIGN=BOTTOM WIDTH=35 HEIGHT=34 BORDER=0></A></P>
</BODY>
</HTML>