<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<TITLE>DONCABAL</TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice/5.1 (Win32)">
	<META NAME="AUTHOR" CONTENT="Oscar Montes D&iacute;az">
	<META NAME="CREATED" CONTENT="20000326;15064194">
	<META NAME="CHANGEDBY" CONTENT="Miguel Angel Nieto Salazar">
	<META NAME="CHANGED" CONTENT="20000326;15074620">
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
	<STYLE>
	<!--
		TD P { color: #ffffff }
		P { color: #ffffff }
		A:visited { color: #000000 }
		A:link { color: #000000 }
	-->
	</STYLE>
</HEAD>
<BODY TEXT="#ffffff" LINK="#000000" VLINK="#000000" BGCOLOR="#000000">
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT SIZE=5><U>DON
CABALLO</U></FONT></P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><BR>
</P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>HOLA AMIGOS Y AMIGAS
DE LO GORE, LLEGAMOS A LA PARTE FINAL DE DON CABALLO PRIMERA PARTE,
PERO PRIMERO: </FONT></FONT>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2><U>RESUMEN
DE LO PUBLICADO</U> <BR>Don Caballo debe dirigirse a la monta&ntilde;a
&quot;Aqui huele a pedo&quot;, para poder hacer crecer su rabo,
consigue llegar y su deseo se cumple. <BR>Pasan los d&iacute;as y don
Caballo misteriosamente es abducido, cuando se encuentra en el
interior de la nave espacial, los extraterrestres, pum pu&ntilde;etazo...
digo aliens le cuentan que hay un hombre que quiere conquistar el
universo y por supuesto la Tierra tambi&eacute;n, ese hombre se llama
Dark Mierder y necesitan a un hombre como don Caballo para
combatirle, asi que don Caballo acepta y entrena a las tropas de los
extraterrestres para combatir, mueren todos y ahora tan solo queda
don Caballo para medirse a Dark Mierder, este por su parte opta por
atacar a la nave en la que viaja don Caballo, y aqui lo dejamos &iquest;que
ser&aacute; de don Caballo? &iquest;y de Dark Mierder? </FONT></FONT>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;
13</FONT></FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>&nbsp;-Nos
estamos acercando a la nave, mi se&ntilde;or. Dijo Cunnilingus.
<BR>&nbsp;-Bien. Dijo Dark Mierder.- Atacaremos al amanecer. <BR>&nbsp;-Mi
se&ntilde;or acuerdese de que est&aacute; en el esp&aacute;cio.
<BR>&nbsp;-&iexcl;Cojones!, es verdad, Cunnilingus, ni una palabra.
<BR>La nave de Dark Mierder se situ&oacute; enfrente de la nave de
Tarari, menos conocido como I9845. <BR>&nbsp;-&iexcl;Disparen!, y que
los den por culo a todos. Vocifer&oacute; Dark Mierder. <BR>Entonces
salieron muchos soldados de Dark Mierder, bueno yo dir&iacute;a unos
10, con pistolas de agua y se dispusieron a mojar la nave. <BR>Dark
Mierder al ver eso dijo muy cabreado: <BR>&nbsp;-&iexcl;Pero, que
haceis, panda de subnormales, que esto no es un ensayo, volver a la
nave y coger los laser. <BR>Los soldados volvieron a la nave y
protestaron diciendo que con los laser se pod&iacute;an hacer pupa.
<BR>&nbsp;-&iexcl;Me da igual una opini&oacute;n, coger los laser y
atacar a la nave de I..., joder, como se llame, hostias, a pooooorrrr
elllllllllos. Esto, por si no lo sabes lo dijo Dark Mierder. <BR>Los
soldados muy descontentos cogieron los laser y atacaron la nave de
Tarari. <BR>Empezaron a caer trozos de metal encuanto dispararon a la
nave, y al mismo tiempo sal&iacute;an chispas. <BR>&nbsp;-Este tu fin
I99999999933333333388888888444444777333. Dijo Dark Mierder. <BR>&nbsp;-Se
llama I9845, mi se&ntilde;or. Le corrigi&oacute; Cunnilingus. <BR>&nbsp;-Lo
que sea, me d&aacute; igual, en cuesti&oacute;n de minutos estar&aacute;
muerto. </FONT></FONT>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
14</FONT></FONT></P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Don
Caballo corr&iacute;a por el pasillo, escuchando los disparos de los
soldados de Dark Mierder, hasta que lleg&oacute; a una ventana. Desde
ell&iacute; los pod&iacute;a observar a todos. <BR>&nbsp;-Bien,
chupapollas de las narices, este es vuestro fin. Dijo don Caballo.
<BR>Entonces baj&oacute; las escaleras y se situ&oacute; enfrente de
los soldados. <BR>&nbsp;-&iexcl;Gilipollas! Les grit&oacute; don
Caballo. <BR>&nbsp;-Los soldados se quedaron achorrados al ver a ese
tipo, que no ten&iacute;a miedo a sus lasers y que &iexcl;encima les
estba insultando!, los soldados como tontos dejaron de disparar.
<BR>&nbsp;-Grrrrrrrrrr. Erupto de don Caballo. <BR>Autom&aacute;ticamente
los soldados que estaban m&aacute;s cerca de don Caballo, se quedaron
sin conocimiento y se fueron flotando por el espacio.
<BR>&nbsp;-Prrrrrrrrrdddrrdd. Pedo que les tir&oacute; don Caballo.
<BR>Los que quedaron vivios del erupto, aqu&iacute; si que se
asfixiaron. </FONT></FONT>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
15</FONT></FONT></P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>&nbsp;-Pero,
has visto lo que ha hecho el invecil ese. Dijo Dark Mierder a
Cunnilingus. <BR>&nbsp;-Ese quien ser&aacute;. Pregunt&oacute;
Cunnilingus. <BR>&nbsp;-Es el hombre del que me habl&oacute;, Yo
espio mejor que tu padre. Dijo Dark Mierder. <BR>&nbsp;-Y &iquest;ahora
que hacemos? Pregunt&oacute; Cunnilingus. <BR>&nbsp;-No tenemos m&aacute;s
soldados &iquest;verdad? Pregunt&oacute; Dark Mierder. <BR>&nbsp;-En
efecto, mi se&ntilde;or. <BR>&nbsp;-Pues sal tu, capullo. <BR>&nbsp;-&iexcl;Est&aacute;
loco! <BR>&nbsp;-Que te jodan. Dijo Dark Mierder. <BR>Dark Mierder
abri&oacute; la escotilla y Cunnilingus sali&oacute; a por don
Caballo. </FONT></FONT>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
16</FONT></FONT></P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Don
Caballo observaba a los t&iacute;os alejarse flotando. <BR>&nbsp;-Joder,
que bueno ha sido esto, bueno y ahora a por el tipo este de Dark
Mierder. <BR>Entonces se abri&oacute; una especie de puerta que ten&iacute;a
la nabe y sali&oacute; un tipo m&aacute;s bien rid&iacute;culo.
<BR>&nbsp;-&iquest;De donde has salido tu, que pareces que vienes de
Star Treck? Dijo don Caballo. <BR>&nbsp;-&iexcl;El que te va ha aguar
la fiesta, pedazo de burro! Dijo el escuchimizao. <BR>&nbsp;-Eso lo
quiero ver yo, vamos ataca y yo con una mano detr&aacute;s de la
espalda. Dijo don Caballo. <BR>Entonces el tipo atac&oacute; o
intent&oacute; atacar, porque ya don Caballo le hab&iacute;a
arrancado la cabeza, antes de que se moviera el tipo, pero ya se sabe
que con la inercia, el cuerpo del tipo se estrell&oacute; contra don
Caballo. </FONT></FONT>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
17</FONT></FONT></P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>&nbsp;-Joder,
que show. Dijo Dark Mierder.- Y ahora que hago yo, mejor escapar. <BR>La
nave empez&oacute; a moverse, pero que pasaba la nave ya no se mov&iacute;a
m&aacute;s. Dark Mierder vi&oacute; que don Caballo aguantaba la nave
con la polla. </FONT></FONT>
</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
18</FONT></FONT></P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Don
Caballo se dio cuenta de que la nave de Dark Mierder intentaba
escapar. <BR>&nbsp;-Cojones, tu no te vas. <BR>Entonces don Caballo
se sac&oacute; el rabo y se puso a sujetar la nave. <BR>&nbsp;-&iexcl;Sal,
Dark de mierda! Grit&oacute; don Caballo y Dark Mierder sali&oacute;.
</FONT></FONT>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
19</FONT></FONT></P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>&nbsp;-Bueno,
bueno, bueno. Dijo Dark Mierder.- La que has montado aqu&iacute;, no
te gustar&iacute;a formar parte de mi invencible ejercito.
<BR>&nbsp;-Invencible, &iquest;invencible?, &iexcl;invencible!, joder
que bueno. Dijo mofandose don Caballo..- pero si con un pedo y un
erupto los eh matado a todos. <BR>&nbsp;-Bueno, &iquest;y que m&aacute;s
da?, te voy a matar hijo de puta. Dijo Dark Mierder. <BR>&nbsp;-Mira,
para que veas que soy bueno, te voy a decir como te voy a matar. Dijo
don caballo. <BR>&nbsp;-A &iquest;si?, y &iquest;c&oacute;mo?. Dijo
Dark Mierder. <BR>&nbsp;-Te voy a coger los huevos, te los voy a
arrancar, los voy a mascar y te los voy a hacer tragar, a ti y a tu
padre. Concluy&oacute; don Caballo. <BR>&nbsp;-Mira guapo, cuando yo
vea eso, yo sere... demasiado tarde, don Caballo le hab&iacute;a
cogido de los huevos. <BR>&nbsp;-Oh, mierda, &iexcl;no! Dijo Dark
Mierder. <BR>Don Caballo se los arranc&oacute; y se los meti&oacute;
en la boca, empez&oacute; a masticar y se los escupi&oacute; en la
mano, abri&oacute; la boca de Dark Mierder y se los hizo tragar.
<BR>Dark Mierder notaba que no pod&iacute;a respirar, que se ahogaba,
&iexcl;que se mor&iacute;a! <BR>&nbsp;-&iquest;Qu&eacute; pasa, no
puedes respirar?, muerete cabr&oacute;n. Dijo don Caballo y cogi&oacute;
a Dark Mierder y le empez&oacute; a dar vueltas, cada vez m&aacute;s
r&aacute;pido, m&aacute;s r&aacute;pido. <BR>Dark Mierder se dio
cuenta de que se mor&iacute;a, todo estaba borroso, lo &uacute;ltimo
que pens&oacute; fue, &#147;me ha vencido un humano, hay digo,
hombre&#148;. <BR>&nbsp;-Volve....pudo decir Dark Mierder, justo
antes de explotar sus pulmones por la falta de oxigeno, bueno eso
creo yo. </FONT></FONT>
</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
20</FONT></FONT></P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>&nbsp;-Bueno,
trabajo terminado. Dijo don Caballo.- Voy a ver si el invecil de
Tarar&iacute;, tiene algo de comida. <BR>Entr&oacute; en la nave, vi&oacute;
un cuerpo en el suelo, se acerc&oacute; y comprob&oacute; que era
Tarar&iacute;, le puso la mano donde se supon&iacute;a que era su
coraz&oacute;n y descubri&oacute; que estaba muerto. <BR>&nbsp;-Me
cago en la hostia. Dijo don Caballo.-&iquest;Qui&eacute;n le ha
matado? <BR>&nbsp;-Eh sido yo. Dijo uno saliendo de una columna.
<BR>&nbsp;-&iexcl;Cojones!, el mam&oacute;n que cant&oacute; la
pu&ntilde;etera canci&oacute;n de &#147;Tu me camelas&#148;. Dijo don
Caballo.-Por cierto, tu no eras esp&iacute;a de Dark Mierder.
<BR>&nbsp;-Exacto, pero ahora voy a ser cantor de Liebana.
<BR>&nbsp;-&iexcl;Hostias!, vas a ser un t&iacute;o con el ojete
gigantesco. <BR>Don Caballo se baj&oacute; la bragueta y se dio
cuenta que como estaba Tarar&iacute; muerto y &eacute;l no sab&iacute;a
pilotar la nave, estaba perdido... pero se le ocurri&oacute; una
idea. <BR>&nbsp;-Oye tu. Dijo .- &iquest;Tu sabes pilotar esta nave?
<BR>&nbsp;-Pues claro, que te crees mam&oacute;n. Dijo Yo esp&iacute;o
mejor que tu padre. <BR>&nbsp;-Pues venga . Dijo don Caballo.
<BR>&nbsp;-&iquest;C&oacute;mo? Dijo yo esp&iacute;o mejor que tu
padre. <BR>&nbsp;-Que venga, me pilotas la nave y me llevas para la
Tierra o sino te arranco la nariz y le abofeteo con ella. Dijo don
Caballo. <BR>&nbsp;-Venga. Dijo Yo esp&iacute;o mejor que tu padre,
desafiandole.- Venga, no hay cojones... Yo esp&iacute;o mejor que tu
padre no ten&iacute;a nariz y ademas le estaban abofeteado con ella.
<BR>&nbsp;-&iquest;La vas a pilotar? <BR>&nbsp;-Pues claro. Dijo con
voz nasal. <BR>Y don Caballo por fin se dirigi&oacute; de vuelta a la
Tierra. <BR>No tardaron mucho, porque ya se sabe con estas naves, y a
los dos d&iacute;as llegaron. <BR>&nbsp;-&iexcl;Por fin, estoy aqu&iacute;
de nuevo! Grit&oacute; don Caballo al tisar la tierra otra vez. <BR>&nbsp;-&iquest;Y
yo que hago? Dijo Yo esp&iacute;o mejor que tu padre. <BR>&nbsp;-Tu
te vas a tomar po culo, hijo de la grand&iacute;sima puta. Dijo don
Caballo. <BR>Y empez&oacute; a caminar mientras la nave despegaba y
se perd&iacute;a en el firmamento, con tan solo el esp&iacute;a, un
manco y el chef. </FONT></FONT>
</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;
INTERLUDIO FINAL</FONT></FONT></P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><BR>
</P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Don Caballo segu&iacute;a
caminando, porque ya no ten&iacute;a el caballo, no sab&iacute;a
donde le hab&iacute;a dejado, pero cre&iacute;a que era en aquella
casa que hab&iacute;a tantos subnormales viendo la tele. <BR>Ya
hab&iacute;an pasado varios d&iacute;as desde que hab&iacute;a dejado
la nave aquella de los cojones y apenas hab&iacute;a comido, follado,
cagado y bebido, cuando lleg&oacute; a la entrada de un pueblo, pero
m&aacute;s bien parec&iacute;a una ciudad, m&aacute;s que un pueblo.
<BR>&nbsp;-&iexcl;Joder!, todav&iacute;a me pilla un coche. Dijo don
Caballo. <BR>&nbsp;-&iexcl;Hijo de la grand&iacute;sima puta! Dijo
uno que iba en un cuatro latas, to jodio. <BR>&nbsp;-&iexcl;Chupamela!,
le dijo don Caballo. <BR>Entonces mir&oacute; el cartel,
&#147;Torrelavega&#148; dec&iacute;a el cartel. <BR>&nbsp;-&iexcl;Pero
que nombre es ese, hostias! Dijo. <BR>Sigui&oacute; por la carretera
cuando casi le atropella un coche blanco. <BR>&nbsp;-&iexcl;Mam&oacute;n!
Dijo don Caballo. <BR>Entonces el coche fren&oacute; y se baj&oacute;
un extra&ntilde;o hombre, con un jersey verde, peinado de lado y con
cuerpo de orangut&aacute;n. <BR>&nbsp;-Ustezzzz. Le dijo se&ntilde;al&aacute;ndole
con un dedo. &#150; Ustezzzz es un inculto y adem&aacute;s feo.
<BR>&nbsp;-&iexcl;Cojones! Dijo don Caballo. <BR>&nbsp;-Todav&iacute;a
te enculo, &iexcl;hay!, digo te doy una patada en el culo. Le dijo el
hombrecillo. <BR>Entonces cuando don Caballo se dispon&iacute;a a
matar a ese hombre redondo, lleg&oacute; otro tan feo como el y dijo:
<BR>&nbsp;-Que, Antonio, vamos a tomar una copichuela. <BR>&nbsp;-Ahora
voy. Dijo el tal Antonio. <BR>&nbsp;-&iexcl;Que os jodan, yo os doy
por culo! Dijo don Caballo. </FONT></FONT>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>&nbsp;-&iexcl;Hay
que hacer un asiento con esto! Dijo el de la copichuelas que se
parec&iacute;a a Bean. <BR>&nbsp;-Pues yo creo que hay que hacer un
descuento o negociaci&oacute;n. Dijo un calvo que andaba por all&iacute;.
<BR>&nbsp;-Este tiene forma de vector, con la misma direcci&oacute;n
y sentido. Dijo otra que la verdad es que no tiene descripci&oacute;n.
Le &uacute;nico que puedo decir es que llevaba un chambergo como el
de pescanova. <BR>&nbsp;-&iexcl;&iexcl;&iexcl;&iexcl;&iexcl;&iexcl;Que
os calleis!!!!!! Dijo una gorda que llegaba tambi&eacute;n. <BR>&nbsp;-Yo
lo que voy a hacer es encularos. Dijo don Caballo. <BR>&nbsp;-&iexcl;&iexcl;&iexcl;&iexcl;&iexcl;&iexcl;Es
no me ois!!!!! Volvi&oacute; a gritar la gorda. <BR>&nbsp;-Esto es
como cuando los indios vinieron de la china. Dijo Antonio. <BR>&nbsp;-&iexcl;&iexcl;&iexcl;&iexcl;Es
que lo tengo que decir de otra manera o que!!!!! Segu&iacute;a
diciendo la gorda. <BR>Mientras tanto don Caballo estaba achorrado
viendo esta pandilla de burros. <BR>&nbsp;-&iexcl;&iexcl;&iexcl;&iexcl;&iexcl;&iexcl;Fuera!!!!!
Grit&oacute; la gorda. <BR>&nbsp;-Yo a ti te reviento la boca. Dijo
don Caballo. <BR>Y as&iacute; lo hizo. La gorda se fue llorando.
<BR>Mientras tanto llegaban chavales que hab&iacute;a cerca. <BR>&nbsp;-&iexcl;A
por ellos Montones! Dec&iacute;a uno. <BR>&nbsp;-&iexcl;A mi no me
toques los cojones, me cago en Dios! Dijo el chaval aludido, mientras
daba collejas a uno con una cazadora amarilla. <BR>Ahora ya no se
entend&iacute;a nada, lo &uacute;nico que se entend&iacute;a era:
<BR>&nbsp;-&iexcl;A por enculos a los deudores indios con una fuerza
mayor que no me entendeis so inculto cojones pasos a liguidar...!
<BR>&nbsp;-Siiiiiileeeeeenciiioooo. Grit&oacute; al final don
Caballo. <BR>Todos se callaron y se quedaron mirando a don caballo.
<BR>&nbsp;-De donde ha salido este, que parece Kuntakinte. Dijo un
chaval. <BR>&nbsp;-Sois demasiados para mi. Dijo don Caballo. &#150;Sois
demasiado raros, no me atrevo a encularos, mejor me voy. <BR>&nbsp;-Saca
la cadena Montones. Dijo uno. <BR>El chico aludido le mir&oacute; con
cara de que le iba a meter un par de hostias. <BR>&nbsp;-Adios, me
piro de esta ciudad tan rara!. Dijo don Caballo. <BR>Empez&oacute; a
alejarse del grupo. <BR>&nbsp;-Mira que este tipo me suena. Dijo uno
que estaba all&iacute;. &#150;No se si he leido algo de &eacute;l, no
se en un peri&oacute; dico o revista. <BR>&nbsp;-Venga, todos para
clase a estudiar que en dos minutos voy a preguntar. Dijo la de
pescanoba. <BR>Cuando todos estaban iendo hacia el portal, sali&oacute;
una de &eacute;l y dijo: <BR>&nbsp;-No se puede entrar, la puerta se
ha atascado. <BR>&nbsp;-&iexcl;&iexcl;&iexcl;&iexcl;&iexcl;Bien!!!!!
Gritaron todos. <BR>Mientras tanto don Caballo ya casi hab&iacute;a
salido de esa ciudad, y se dispon&iacute;a a seguir su viaje a
ninguna parte, la verdad. </FONT></FONT>
</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
2</FONT></FONT></P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><BR>
</P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Hab&iacute;a pasado
casi un a&ntilde;o de todo lo de la nave y toda esa historia, don
Caballo hab&iacute;a conseguido otro caballo (escoba), y segu&iacute;a
cabalgando. <BR>En ese periodo de tiempo hab&iacute;a saqueado
pueblos, enculado y matado gente, lo de siempre en la vida de don
Caballo. <BR>Despues de varias horas cabalgando, estaba muy cansado y
no lo comprend&iacute;a, porque la verdad, el no caminaba, porque
estaba montado en un caballo. <BR>Estaba sentado en una piedra
bebiendo agua de su cantimplora, cuando un destello apareci&oacute;
delante de &eacute;l. <BR>&nbsp;-No, otra nave espacial, no, por
favor. Dijo don Caballo. <BR>Pero se equivocaba, el destello no sal&iacute;a
del cielo, sino de enfrente suyo. Desapareci&oacute; el destello y
apareci&oacute; como un tunel en el que en su interior hab&iacute;a
un remolino, y algo se acercaba del fondo del remolino. <BR>&nbsp;-&iquest;Qu&eacute;
es esto? Se pregunt&oacute; don Caballo. &#150;No lo comprendo,
&iexcl;dios, no puede ser, esto es increible! Grit&oacute;, momentos
antes de descubrir lo que pasaba. <BR>TO BE CONTINUED <BR>O eso
creo...&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Torrelavega. Noviembre 1997. 21 de abril de 1998. <BR>&nbsp; </FONT></FONT>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Y
HASTA AQUI ES LA PRIMERA PARTE DE DON CABALLO, EN EL SIGUIENTE N&Uacute;MERO
DE LA BINARY ZONE EMPEZAREMOS CON... </FONT></FONT>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>DON
CABALLO 2</FONT></FONT></P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>El
regreso del mito</FONT></FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>OSCAR
MONTES D&Iacute;AZ <BR>&nbsp; </FONT></FONT>
</P>
</BODY>
</HTML>