<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Generator" content="Microsoft Word 97">
   <meta name="Template" content="C:\WINDOWS\OFFICE\OFFICE\html.dot">
   <meta name="GENERATOR" content="Mozilla/4.7 [en] (Win98; I) [Netscape]">
   <meta name="Author" content="Miguel Angel [ Punisher '00? ]">
   <title>El FXY2K</title>
<!-- saved from url=(0022)http://internet.e-mail -->
</head>
<body text="#FFFFFF" bgcolor="#000000" link="#3366FF" vlink="#3366FF" alink="#3366FF">

<center><b><u><font face="Arial,Helvetica"><font color="#FF0000"><font size=+4>El
FXY2K</font></font></font></u></b><font face="Arial,Helvetica"><font size=-1></font></font>
<p><i><font face="Arial,Helvetica"><font color="#66CCFF"><font size=-1>(lo
cualo, traducido del idioma moderno, al idioma del conocido escritor Paquito
Gilipuertas, significa Er Efesto 2000)</font></font></font></i></center>
<font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Cuando un evento importante
ocurre, aprovecha el tir&oacute;n cual sanguijuela hambrienta. Con esa
m&aacute;xima por delante, nuestra querida y simp&aacute;tica clase politico-oligarquica,
encabezada bien a la cabeza por <font color="#33FF33">Josemari</font>,
el amigo de los ni&ntilde;os, los fachas, o como el mismo denomina, los
"centristas", nos han <font color="#FF0000">bombardeado</font> en los proleg&oacute;menos
del aclamado a&ntilde;o 2000 (a&ntilde;o que para la pe&ntilde;a de poco
seso, los fan&aacute;ticos del f&uacute;tbol, idiotas, y bastardos vendedores
comerciales, es el comienzo del nuevo milenio, para celebrarlo dos veces,
el a&ntilde;o que viene y sacar mas cacho) con multitud de propaganda de
un marcado corte <font color="#FF9900">apocal&iacute;ptico</font>.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Con dichos pedacitos de (des)informaci&oacute;n,
comprimida en 20 segundos de im&aacute;genes, se ve&iacute;a una oficina
arrasada, no por una bomba nuclear, ni un arma qu&iacute;mica estadounidense
de las que se almacenan en los zulos top-secret que los yankis tienen aqu&iacute;...
Se supone que ha sido el <font color="#00FF00">efecto 2000</font>, que
en un alarde de mala hostia, se ha enfadado con el resto de los humanos,
y ha decidido exterminarlos, al estilo de una pel&iacute;cula yanki, tambi&eacute;n.
As&iacute; que resulta, que en el a&ntilde;o 2000 no deb&iacute;an funcionar
ni los ordenadores, ni los equipos de m&uacute;sica, ni el aire acondicionado,
ni los ascensores, ni los relojitos de pulsera, los orinales, ni los discos
del Fary.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Ante tama&ntilde;a selecci&oacute;n
de im&aacute;genes, al pobre individuo que contemplaba estas, se quedaba
tan <font color="#CC9933">cagado</font>, que casi se ji&ntilde;aba encima.
Todo <font color="#FF0033">caos</font>, <font color="#FF9900">destrucci&oacute;n</font>,
<font color="#FFCC00">anarkia</font>...
Y lo pero de todo... &iexcl;&iexcl;Sin el partido del Real Villabellotas
contra el Atl&eacute;tico Zaragozano!! Dios!!! Nada puede ser peor que
esto.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>As&iacute; que, mientras
muchos emigran con su familia al desierto, o se van a una casa de las monta&ntilde;as
de <font color="#009900">Nebraska</font>, cuyo cacharro el&eacute;ctrico
mas cercano esta a <font color="#CCFF00">200 millas</font>, otros incautos
personajillos salen a las tiendas de inform&aacute;tica, donde los vendedores
mas "aguilillas" (usease, mas listos, o con mas ojo pa sacar cuartos) siguen
el rollo gubernamental para vender todo lo vendible, ante tama&ntilde;o
hecho de buena suerte. Todo el mundo debe deshacerse de sus viejos Pentiums,
por que si no se compran el ultimo Pentium III, corren peligro de que el
malvado efecto 2000 borre <b><i>toda</i></b> su colecci&oacute;n de cds
de<font color="#FF99FF"> fotos porno</font>, las cintas de episodios de
los <font color="#CC33FF">tel</font><font color="#00FF00">etu</font><font color="#FFFF00">bbi</font><font color="#FF0000">es</font>,
juegue al <font color="#CCCCFF">hockey</font> con sus CDs de m&uacute;sica
y tan solo quede la discograf&iacute;a del <font color="#CCFF00">Fary</font>.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>&iexcl;&iexcl;Que miedo,
que miedo, uuuuuuuuh!!</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>As&iacute; que gracias al
gobierno, la gente realmente ha actualizado sus sistemas inform&aacute;ticos,
"adapt&aacute;ndolos a las exigencias del nuevo milenio, la Europa de Maastrich,
la OTAN y el cambio a euros". Que har&iacute;amos sin todo eso... Uff,
de la que nos hemos salvado... probablemente de la <font color="#FF3333">extinci&oacute;n</font><font color="#FFFFFF">
de la raza humana</font></font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Pero... Si mi ordenador funciona
bien... &iquest;qu&eacute; co&ntilde;o de efecto 2000? Como puede <font color="#66FFCC">afectar
una fecha</font> a un ascensor o al aire acondicionado? &iquest;Es que
ahora los ascensores subir&aacute;n para abajo y bajaran para arriba? As&iacute;
que empezamos a creer que el susodicho efecto no existe...</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1><font color="#FF0033">Grave
error</font>.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Eso es lo que el efecto quiere,
que todos dejemos de creer en el, para <font color="#FFFF00">matarnos</font>
despues. El efecto 2000 esta ah&iacute;, latente, agazapado en un rinc&oacute;n
para saltar sobre nosotros y devorarnos el cerebro, absorbiendo nuestra
personalidad y meti&eacute;ndose en nuestro cuerpo. Y su pr&oacute;ximo
atake mortal ser&aacute; este mes, en febrero. Seg&uacute;n lo que la gente
de Resaka hemos visto por ah&iacute;, en febrero sale el <font color="#3399FF">Guindows
2000</font>... Este si que es un efecto peligroso.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Ya veremos si es tan malo
como cuentan, aunque siendo<font color="#6666FF"> Micro$oft</font>, mucho
nos tenemos que si, probablemente har&aacute; aumentar los requisitos de
sistema a<font color="#FFFFFF"> <i>Pentium 4, 950 mhz, y 250 Mbs de RAM</i></font>,
tan solo para funcionar.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>De todas formas, por ah&iacute;
se ha o&iacute;do que los<font color="#FF9900"> fallos de sistema</font>
son tantos como en sus parientes 95 y 98, aunque eso solo es un rumor.
Pero los rumores suelen ser ciertos.</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>As&iacute; que si quer&eacute;is
ver algo triste y lamentable, una demostraci&oacute;n de bajeza moral,
solo ten&eacute;is que pasaros por un <font color="#66CCFF">gran almac&eacute;n
de capital franc&eacute;s</font> o una tienda de inform&aacute;tica cutrilla,
para ver como al t&iacute;pico novato le encasquetan la versi&oacute;n
<font color="#FF3333">try-out</font>
del nuevo guindous con su ordenador al m&oacute;dico precio de 15.000 pelas.
No os ri&aacute;is o le tir&eacute;is cosas ni al vendedor ni al comprador,
que no son los monos del circo. <font color="#FFFFFF">Uno hace su trabajo
y el otro hace el idiota</font>, como todos. Por que a todos nos debieron
enga&ntilde;ar cuando &eacute;ramos mas novatos...</font></font><font face="Arial,Helvetica"><font size=-1></font></font>
<p><font face="Arial,Helvetica"><font size=-1>&iquest;Qu&eacute; estragos,
tragedias y muertes traer&aacute; la nueva versi&oacute;n? Como dec&iacute;an
los <font color="#66CCFF">G.I</font><font color="#3333FF">.</font><font color="#FF0033">JOE</font>,
Pr&oacute;ximo episodio en tu casa...</font></font>
<div align=right>
<p><a href="mailto:bauer2@jazzfree.com"><img SRC="BauerN_2.GIF" ALT="pulsa para enviar un mailito a Bauer" BORDER=0 height=106 width=235></a>
<p><font face="Arial,Helvetica"><font size=-1><a href="http://www.dreamers.com/resaka">http://www.dreamers.com/resaka</a></font></font></div>

</body>
</html>
