<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
    <TITLE>IMPULSE</TITLE>
    <META NAME="GENERATOR" CONTENT="StarOffice/5.1 (Win32)">
    <META NAME="AUTHOR" CONTENT="Miguel Angel Nieto Salazar">
    <META NAME="CREATED" CONTENT="20000326;15200973">
    <META NAME="CHANGEDBY" CONTENT="Miguel Angel Nieto Salazar">
    <META NAME="CHANGED" CONTENT="20000326;15212794">
    <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
    <STYLE>
    <!--
        TD P { color: #ffffff }
        P { color: #ffffff }
        A:visited { color: #000000 }
        A:link { color: #000000 }
    -->
    </STYLE>
</HEAD>
<BODY TEXT="#ffffff" LINK="#000000" VLINK="#000000" BGCOLOR="#000000">
<P STYLE="margin-bottom: 0cm">&nbsp; 
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><IMG SRC="Impul.jpg" NAME="Imagen1" ALT="CURSO DE IMPULSE TRACKER" ALIGN=BOTTOM WIDTH=350 HEIGHT=152 BORDER=0></P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm; font-weight: medium"><BR>
</P>
<P STYLE="font-weight: medium"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>&iexcl;HOLA
AMIGOS DE BINARY ZONE!, ESPERO QUE OS EST&Eacute; SIRVIENDO ESTE
CURSO DEL IMPULSE TRACKER Y APAREZCAN M&Aacute;S TRACKERS EN ESPA&Ntilde;A,
VAMOS A SEGUIR CON LOS PATRONES DEL IMPULSE. <BR>Ya te expliqu&eacute;
en el art&iacute;culo anterior para que serv&iacute;a esto de los
patrones, ya sabes que all&iacute; van ha ir las notas, que las
introduciremos con el teclado como si ser&iacute;a un piano, tambi&eacute;n
te cont&eacute; que un Canal (channel) est&aacute; compuesto por una
serie de campos, el primero tiene tres rayas o l&iacute;neas que son
la primera para poner la nota &quot;C&quot; por ejemplo, la segunda
linea simplemente es un separador &quot;-&quot; y la tercera va la
octava (del 0 al 9), el segundo campo estaba compuesto por dos l&iacute;neas
y es el n&uacute;mero del Sample o Instrumento que est&aacute;s
utilizando, (acuerdate que los samples se cargan en F3 y los
instrumentos en F4), el siguiente campo era el volumen del sample o
instrumento que va de 00 a 64 y el &uacute;ltimo campo est&aacute;
compuesto por tres partes, si no hay nada puesto te debe aparecer un
punto &quot;.&quot; y dos ceros &quot;00&quot; en este campo podr&aacute;s
hacer efectos en la canci&oacute;n que en un momento vamos a estudiar
y acabando este repaso te voy a poner un ejemplo: </FONT></FONT>
</P>
<P STYLE="font-weight: medium"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>C-6
02 32 P0F </FONT></FONT>
</P>
<P STYLE="font-weight: medium"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Si
pones esto en el patr&oacute;n querr&aacute; decir que es el sample o
instrumento n&uacute;mero dos, que tiene la nota &quot;C&quot;, la
tecla &quot;i&quot; en el teclado, est&aacute; en la octava &quot;6&quot;,
est&aacute; a la mitad de su volumen &quot;32&quot; y sonar&aacute;
por el altavoz derecho &quot;P0F&quot;. </FONT></FONT>
</P>
<P STYLE="font-weight: medium"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Bueno
y&nbsp; ahora vamos a por el motivo de este tercer art&iacute;culo,
el &uacute;ltimo campo, el de los efectos, creo que de todos es el
m&aacute;s complicado, pero tambi&eacute;n es uno de los m&aacute;s
importantes. </FONT></FONT>
</P>
<P STYLE="font-weight: medium"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Ya
sabes que este campo est&aacute; divido en tres partes, bueno pues en
la primera vamos a poner letras del alfabeto, y en los siguientes
ponemos n&uacute;meros en hexadecimal, que &iquest;Que cojones es eso
de hexadecimal?, bueno es una manera numeraci&oacute;n, existe la
&quot;decimal&quot;, que es la que todos usamos normalmente y son los
n&uacute;meros del 0 al 9, tambi&eacute;n existe la &quot;binaria&quot;
que es con la que trabaja el ordenador y tan solo est&aacute;
compuesta de dos n&uacute;mero el 0 y el&nbsp; 1, tambi&eacute;n
tenemos la numeraci&oacute;n &quot;octal&quot; que est&aacute;
compuesta de los n&uacute;meros del 0 al 7 y despues aparece la
&quot;hexadecimal&quot; que es un tanto especial, porque aparte de
utilizar los n&uacute;meros del 0 al 9 usa letras, que son la A, B,
C, D, E, F, que ser&iacute;an los numeros 10, 11, 12,13,14,15, quiero
decir con esto que A=10, B=11... <BR>Pues bien eso es lo que vamos ha
poner en estas dos filas n&uacute;meros(del 0 al 9) y letras (A,
B...F). </FONT></FONT>
</P>
<P STYLE="font-weight: medium"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Poniendo
esto el sample har&aacute; el efecto que le corresponda a la letra
primera y lo ejecutar&aacute; de la forma que est&eacute;n en los
n&uacute;meros hexadecimales, contra mayor sea el n&uacute;mero hexa.
mayor ser&aacute; el efecto. </FONT></FONT>
</P>
<P STYLE="font-weight: medium"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>&iquest;Y
que efectos son estos?, pues aqui tienes la lista de todos los
efectos que puedes hacer en el Impulse con su correspondiente letra: </FONT></FONT>
</P>
<P STYLE="font-weight: medium"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>*Las
&quot;X&quot; quieren decir donde deben ir los n&uacute;meros en
hexadecimal* </FONT></FONT>
</P>
<P STYLE="font-weight: medium"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-AXX:
Con esto controlas la velocidad de la canci&oacute;n. <BR>-BXX: Hay
un salto en la canci&oacute;n, &iquest;hasta donde?, pues hasta donde
tu pongas en XX (en hexadecimal) <BR>-CXX: Con esto har&aacute;s que
el patr&oacute;n se acabe hay, es algo muy util si una melodia u otra
cosa que tengas en el patr&oacute;n ocupe menos que las 64 l&iacute;neas
de este, yo normalmente tan solo pongo la &quot;C&quot; y no escribo
ning&uacute;n n&uacute;mero en hexadecimal, creo que es lo mejor.
<BR>-D0X: Con esto haces que el volumen de la nota se reduzca en X
cada frame. <BR>-DFX: Bajas el volumen un valor X al comienzo de la
fila. <BR>-DXF: Lo contrario, sube el volumen un valor X al comienzo
de la fila. <BR>-EXX: Te baja la nota del sample. <BR>-FXX: Te sube
la nota. <BR>-HXX: Con esto har&aacute;s que en esa nota el sample
baje o suba un tono, o dos, o tres... pero volver&aacute; a su sonido
normal en la siguiente nota, simpre que no haya nada en el cuarto
campo, claro. <BR>-IXY: Este es bastante raro, hace que el volumen
del sample/instrumento sea normal durante X l&iacute;neas, entonces
pone el volumen a = durante Y lineas. <BR>-MXX: Determina el volumen
del canal. <BR>-OXX: Este es uno de los m&aacute;s utiles, sirve para
hacer un desplazamiento en el sample, me explico, tu tienes un sample
que dice &quot;Tillo est&aacute; tilloso&quot; y quieres que tan solo
se escuche &quot;tilloso&quot;, pues este es tu efecto, poniendo &quot;O&quot;
y los n&uacute;meros en hexadecimal, este efecto aparecer&aacute;,
por cierto, tu por los n&uacute;meros a bulto y mira haber que pasa y
despues buscas los n&uacute;meros exactamente, yo normalmente si me
encuentro con un sample largo pongo &quot;5O&quot; y voy subiendo de
aqui o bajando, dependiendo de como queda. <BR>-S91: Pones el sonido
en &iexcl;surround! <BR>-TXX: Con esto dominas el tempo de la
canci&oacute;n. <BR>-VXX: Con esto controlar&aacute;s el volumen
global de la canci&oacute;n, es ideal cuando vas a acabar una canci&oacute;n
y quieres que todo empiece a bajar de volumen hasta que no se oiga
nada, lo tipico. <BR>Bueno, estos son unos cuantos de los efectos,
por lo menos, para mi est&aacute;n los m&aacute;s importantes, pero
no est&aacute;n todos, siempre puedes acudir al manual del Impulse
Tracker en ingles o si tienes suerte en la PC MANIA de vez en cuando
le incluyen en su CD-ROM en espa&ntilde;ol. </FONT></FONT>
</P>
<P STYLE="margin-bottom: 0cm; font-weight: medium"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>BUENO,
Y HASTA AQUI EL ART&Iacute;CULO DE HOY, EN EL PROXIMO NO VAMOS HA
DEJAR EL PATR&Oacute;N, PORQUE OS VOY A CONTAR UNOS CUANTOS TRUQUITOS
QUE HE APRENDIDO CON LA EXPERIENCIA. </FONT></FONT>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm">&nbsp;<A HREF="YO.htm"><IMG SRC="Smiley.gif" NAME="Imagen2" ALIGN=BOTTOM WIDTH=35 HEIGHT=34 BORDER=0></A></P>
<P STYLE="margin-bottom: 0cm">&nbsp; 
</P>
</BODY>
</HTML>