<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<TITLE></TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice/5.1 (Win32)">
	<META NAME="AUTHOR" CONTENT="Miguel Angel Nieto Salazar">
	<META NAME="CREATED" CONTENT="20000326;12422107">
	<META NAME="CHANGEDBY" CONTENT="Miguel Angel Nieto Salazar">
	<META NAME="CHANGED" CONTENT="20000331;21371672">
</HEAD>
<BODY BGCOLOR="#000000">
<P ALIGN=CENTER><IMG SRC="internet.jpg" NAME="Imagen8" ALIGN=MIDDLE WIDTH=350 HEIGHT=75 BORDER=0><BR><BR><BR>
</P>
<P ALIGN=CENTER><FONT COLOR="#ffffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Este
numero viene con una buena selecci&oacute;n de paginas web, espero
que os gusten.</FONT></FONT></FONT></P>
<P ALIGN=CENTER><BR><BR>
</P>
<P ALIGN=LEFT><IMG SRC="inter4.jpg" NAME="Imagen1" ALIGN=LEFT HSPACE=4 VSPACE=4 WIDTH=300 HEIGHT=218 BORDER=0><FONT COLOR="#ffffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>La
asociaci&oacute;n de internautas a encontrado otra nueva forma de
luchar contra las abusivas tarifas que tenemos que pagar a timofonica
por entrar a internet. Ahora nos toca atacar nosotros a su bolsillo,
donde mas les duele, en la publicidad de sus portales. Gracias a este
programa que solamente ocupa 25 Kb llamado comebanners, no tendremos
que tragarnos toda la publicidad que podemos encontrar en los
portales de operadoras como jazztel, uni2, telef&oacute;nica... En un
principio estas operadoras se re&iacute;an, diciendo que no
llegar&iacute;amos a ning&uacute;n lado, y pocas semanas despu&eacute;s
ya hubo alguna pidiendo parar la distribuci&oacute;n del programa,
jajajaja. Desde esta web podr&eacute;is bajaros el programita, y por
una vez podremos reirnos nosotros :)</FONT></FONT></FONT></P>
<P ALIGN=CENTER><A HREF="http://www.internautas.org/comebanners/index.html"><FONT SIZE=2><FONT FACE="Arial, sans-serif"><FONT COLOR="#ffffff">http://www.internautas.org/comebanners/index.html</FONT></FONT></FONT></A></P>
<P ALIGN=CENTER><BR><BR>
</P>
<P ALIGN=CENTER><BR><BR>
</P>
<P ALIGN=RIGHT><IMG SRC="inter2.jpg" NAME="Imagen2" ALIGN=RIGHT HSPACE=4 VSPACE=4 WIDTH=300 HEIGHT=218 BORDER=0><FONT COLOR="#ffffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Hace
poco tiempo Opera presento la ultima versi&oacute;n estable de su
navegador Opera, la 3.62 para windows. De momento &uacute;nicamente
se encuentra en ingles, pero recemos para que la versi&oacute;n en
espa&ntilde;ol no se retrase mucho. Desde su web podr&eacute;is
bajaros las ultimas versiones, acceder a diferentes versiones para
linux, Beos, MacOs, Os2, etc. Una web bien estructurada y sencilla,
con toda la informaci&oacute;n necesaria. Si buscas un buen navegador
o simplemente quieres probar otro navegador diferente, aqu&iacute;
tienes tu mejor oportunidad.</FONT></FONT></FONT></P>
<P ALIGN=CENTER><A HREF="http://www.opera.com/"><FONT SIZE=2><FONT FACE="Arial, sans-serif"><FONT COLOR="#ffffff">Http://www.opera.com</FONT></FONT></FONT></A></P>
<P ALIGN=CENTER><BR><BR>
</P>
<P ALIGN=CENTER><BR><BR>
</P>
<P ALIGN=LEFT><BR><BR>
</P>
<P ALIGN=LEFT><IMG SRC="inter3.jpg" NAME="Imagen3" ALIGN=LEFT HSPACE=4 VSPACE=4 WIDTH=300 HEIGHT=218 BORDER=0><FONT COLOR="#ffffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Por
fin pudimos saber en que consist&iacute;a ese trabajo que tan en
secreto manten&iacute;a el creador de linux, Linus Torvalds. La
empresa transmeta con una conferencia a trav&eacute;s de internet
desvelo el secreto. Una nueva gama de procesadores para sistemas
movibles llamado crusoe. El consejero delegado explico que estos
nuevos procesadores usar&iacute;an software para crear potentes
capacidades y permitir un dise&ntilde;o mas simple. De esta forma el
procesador seria actualizable v&iacute;a software, consumir&iacute;a
much&iacute;simo menos, etc. En pocas palabras, se trata de un
procesador revolucionario para sistemas movibles como PDAs, WebTV,
port&aacute;tiles, etc. Un ultimo dato, intel redujo un 52% el precio
de sus procesadores para port&aacute;tiles d&iacute;as despu&eacute;s
de la presentaci&oacute;n de Crusoe :)</FONT></FONT></FONT></P>
<P ALIGN=CENTER><A HREF="http://www.crusoe.com/"><FONT SIZE=2><FONT FACE="Arial, sans-serif"><FONT COLOR="#ffffff">http://www.crusoe.com</FONT></FONT></FONT></A><FONT SIZE=2><FONT FACE="Arial, sans-serif"><FONT COLOR="#ffffff">
</FONT></FONT></FONT>
</P>
<P ALIGN=CENTER><BR><BR>
</P>
<P ALIGN=CENTER><BR><BR>
</P>
<P ALIGN=RIGHT><IMG SRC="inter5.jpg" NAME="Imagen4" ALIGN=RIGHT HSPACE=4 VSPACE=4 WIDTH=300 HEIGHT=218 BORDER=0><FONT COLOR="#ffffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>En
esta web encontrar&eacute;is una amplia lista con los mejores links a
webs desde las que te podr&aacute;s bajar completos todos los
programas que siempre quisistes tener, pero la mala suerte de haber
no haber nacido en una familia con dinero no te lo permite :)
Encontraras links desde los que te podr&aacute;s bajar el office
2000, windows2000 y miles de cosas de mocosoft con el 2000 al final.
Encontraras los &uacute;ltimos juegos que han visto la luz, como
Quake3, tomb raider 4, etc. La verdad es que como no vivas en un pa&iacute;s
civilizado donde el precio de internet y su velocidad no sea una
traba, te va a salir mas caro bajartelo que comprarlo original, pero
vosotros ver&eacute;is. Si alguno disfruta de tarifa plana, que se
baje algunos programitas, y que me los env&iacute;e por correo postal
:) </FONT></FONT></FONT>
</P>
<P ALIGN=CENTER><A HREF="http://www.wareznetwork.com/index.html"><FONT SIZE=2><FONT FACE="Arial, sans-serif"><FONT COLOR="#ffffff">http://www.wareznetwork.com/index.html</FONT></FONT></FONT></A></P>
<P ALIGN=CENTER><BR><BR>
</P>
<P ALIGN=CENTER><BR><BR>
</P>
<P ALIGN=LEFT><IMG SRC="inter1.jpg" NAME="Imagen5" ALIGN=LEFT HSPACE=4 VSPACE=4 WIDTH=300 HEIGHT=218 BORDER=0><FONT COLOR="#ffffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>&iquest;Deseas
mejorar tu web? En &#147;Maestros de la web&#148; (valla nombrecito)
podr&eacute;is encontrar cursos de programaci&oacute;n, links a otras
webs del mismo estilo, un poco de asp, programas, foros, listas de
noticias, etc. Como ves una web de lo mas completa, gracias al cual
se puede acceder r&aacute;pidamente a todo lo que buscamos sin perder
tiempo. Aqu&iacute; tienes tu mejor oportunidad para mejorar tu web,
y de paso aprender algo de HTML, javascript, java, ASP, y todas esas
cosas que has o&iacute;do, pero te ha dado miedo echarle un vistazo
:)</FONT></FONT></FONT></P>
<P ALIGN=CENTER><A HREF="http://www.maestrosdelweb.org/"><FONT SIZE=2><FONT FACE="Arial, sans-serif"><FONT COLOR="#ffffff">http://www.maestrosdelweb.org/</FONT></FONT></FONT></A></P>
<P ALIGN=CENTER><BR><BR>
</P>
<P ALIGN=CENTER><BR><BR>
</P>
<P ALIGN=CENTER><BR><BR>
</P>
<P ALIGN=RIGHT><IMG SRC="sole.jpg" NAME="Imagen6" ALIGN=RIGHT HSPACE=4 VSPACE=4 WIDTH=300 HEIGHT=218 BORDER=0><FONT COLOR="#ffffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>&iquest;Buscas
una web con muy buen dise&ntilde;o, divertida y muy completa?
Entonces debes visitar esta pagina, la web de Sole! Encontrareis de
todo, m&uacute;sica, inform&aacute;tica, chistes, fotos, etc. Y todo
en una web con un incre&iacute;ble dise&ntilde;o. Nada mejor para
describir la web, que utilizando las palabras de su propia autora:
&#148;incre&iacute;ble, asombrosa, revolucionaria, &iexcl;&iexcl;O
SEA!!, no has visto otra como &eacute;sta ;)&#148; No dej&eacute;is
de visitar esta web, y a&ntilde;adirla a la lista de favoritos (junto
a la m&iacute;a :), porque os aseguro que no os arrepentir&eacute;is.</FONT></FONT></FONT></P>
<P ALIGN=CENTER><A HREF="http://www.geocities.com/SunsetStrip/Underground/9690/"><FONT SIZE=2><FONT FACE="Arial, sans-serif"><FONT COLOR="#ffffff">http://www.geocities.com/SunsetStrip/Underground/9690/</FONT></FONT></FONT></A></P>
<P ALIGN=CENTER><BR><BR>
</P>
<P ALIGN=CENTER><BR><BR>
</P>
<P ALIGN=CENTER><BR><BR>
</P>
<P ALIGN=LEFT><IMG SRC="soleh.jpg" NAME="Imagen7" ALIGN=LEFT HSPACE=4 VSPACE=4 WIDTH=300 HEIGHT=218 BORDER=0><FONT COLOR="#ffffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Despues
de visitar la web de sole, &iquest;que mejor que darse un paseo por
la de su hermana? :) El la web de Radhge podr&eacute;is leer lo que
le cabrea, frases celebres, su historia con el numero 34 XDDD, y
alguna cosa en valenciano que no entiendo nada. En resumen, si
visit&aacute;is esta web estar&eacute;is un buen mont&oacute;n de
tiempo leyendo toda la web, porque grande ya es!!! As&iacute;
presenta la web: &#147; Mi web sigue siendo anti-racistas,
anti-machistas, anti-feministas, anti-hip&oacute;critas,
anti-falsedad, etc.&#148; El &uacute;nico punto negro que se puede
encontrar es su dise&ntilde;o, un poco pobre, un fallo que pasa a
segundo plano, porque lo verdaderamente interesante de esta web es su
contenido.</FONT></FONT></FONT></P>
<P ALIGN=CENTER><FONT SIZE=3><FONT FACE="Times New Roman, serif"><FONT COLOR="#000000"><A HREF="http://www.geocities.com/SunsetStrip/Amphitheatre/2889/"><FONT SIZE=2><FONT FACE="Arial, sans-serif"><FONT COLOR="#ffffff">http://www.geocities.com/SunsetStrip/Amphitheatre/2889/</FONT></FONT></FONT></A><FONT SIZE=2><FONT FACE="Arial, sans-serif"><FONT COLOR="#ffffff">
</FONT></FONT></FONT></FONT></FONT></FONT>
</P>
<P ALIGN=LEFT><BR><BR>
</P>
<P ALIGN=LEFT><BR><BR>
</P>
<P ALIGN=RIGHT><IMG SRC="inter6.jpg" NAME="Imagen9" ALIGN=RIGHT HSPACE=4 VSPACE=4 WIDTH=300 HEIGHT=225 BORDER=0><FONT COLOR="#ffffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Si
te gusta la astronom&iacute;a no te puedes perder esta pagina web.
Una pagina personal de un aficionando a la astronom&iacute;a, que
incluye una grand&iacute;sima cantidad de fotos, documentos, etc.
Podr&aacute;s informarte de todo lo que quisisteis saber sobre todo
lo que rodea a este fascinante mundo con solo un par de clics, desde
el sistema solar al completo, hasta los cometas, asteroides,
nebulosas, etc. Es de visita obligada, darse un paseo por las
estrellas no viene nada mal, incluso a los que nos pasamos el d&iacute;a
en la luna :)</FONT></FONT></FONT></P>
<P ALIGN=CENTER><FONT COLOR="#ffffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2><a href="http://jupiter.spaceports.com/~123a/Astro.htm"><FONT COLOR="#ffffff">http://jupiter.spaceports.com/~123a/Astro.htm</a>
</FONT></FONT></FONT></FONT>
</P>
<P ALIGN=LEFT><BR><BR>
</P>
<P ALIGN=LEFT><BR><BR>
</P>
<P ALIGN=LEFT><BR><BR>
</P>
<P ALIGN=LEFT><BR><BR>
</P>
<P><A HREF="mailto:punisher@linuxfan.com"><IMG SRC="Punish07.gif" NAME="Imagen4" ALIGN=RIGHT WIDTH=384 HEIGHT=224 BORDER=0></A><BR><BR>
</P>
</BODY>
</HTML>