<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
    <TITLE>JAVA</TITLE>
    <META NAME="GENERATOR" CONTENT="StarOffice/5.1 (Win32)">
    <META NAME="AUTHOR" CONTENT="Oscar Montes D&iacute;az">
    <META NAME="CREATED" CONTENT="20000326;15044308">
    <META NAME="CHANGEDBY" CONTENT="Miguel Angel Nieto Salazar">
    <META NAME="CHANGED" CONTENT="20000326;15062689">
    <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
    <STYLE>
    <!--
        TD P { color: #ffffff }
        P { color: #ffffff }
        A:visited { color: #000000 }
        A:link { color: #000000 }
    -->
    </STYLE>
</HEAD>
<BODY TEXT="#ffffff" LINK="#000000" VLINK="#000000" BGCOLOR="#000000">
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><IMG SRC="java.jpg" NAME="Imagen1" ALT="PROGRAMANDO CON JAVA" ALIGN=BOTTOM WIDTH=322 HEIGHT=68 BORDER=0></A></P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><BR>
</P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>&iexcl;HOLA
JAVAMAN&Iacute;ACOS! SEGUIMOS CON EL CURSO DE JAVA YA EN SU TERCERA
ENTREGA, HEMOS HABLADO DE LOS APPLETS DE JAVA Y COMO METERLOS EN UNA
P&Aacute;GINA WEB, PERO &iquest;COMO SE PROGRAMA EN JAVA? YA ES HORA
DE QUE EMPECEMOS CON EL LENGUAJE DE PROGRAMACI&Oacute;N EN SI. </FONT></FONT>
</P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>ELEMENTOS B&Aacute;SICOS
DEL LENGUAJE <BR>Como en cualquier otro lenguaje de programaci&oacute;n,
un programa Java es un fichero de texto que contiene una serie de
elementos l&eacute;xicos propios del lenguaje dispuestos de acuerdo
con una sintaxis determinada. <BR>Las relgas que determinan la
validez de los elementos l&eacute;xicos, junto con las que definen
qu&eacute; combinaciones de esos elementos tienen una sintaxis
correcta, constituyen la definici&oacute;n gramatical del lenguaje. </FONT></FONT>
</P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Los elementos l&eacute;xicos
de un lenguaje tienen un nombre muy raro y sin sentido alguno, se
llaman &iexcl;tokens!, a quien se le ocurrir&iacute;a llamarlos as&iacute;,
&iexcl;vaya un lumbreras! Bueno, pues en Java, los &quot;tokens&quot;
se dividen en en identificadores, palabras clave, expresiones
literales, operadores y separadores. </FONT></FONT>
</P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Indentificadores <BR>La
teor&iacute;a dice que un identificador hace referencia a una entidad
determinada del programa, como puede ser una clase, un objeto, un
m&eacute;todo o una varialbe. <BR>El primer car&aacute;cter de un
identificador en Java ha de ser necesariamente una letra may&uacute;scula
o min&uacute;scula, un subrayado (&quot;_&quot;) o el s&iacute;mbolo
del dolar (&quot;$&quot;). <BR>Los caracteres que siguen al inicial
pueden ser tanto los anteriores como d&iacute;gitos decimales. Dado
que Java emplea el juego de caracteres Unicode (est&aacute;ndar que
incluye muchos caracteres de idiomas distintos del ingles) es posible
emplear caracteres como la &quot;&ntilde;&quot;. De hecho, se puede
emplear cualquier car&aacute;cter con un c&oacute;digo Unicode mayor&nbsp;
que 00C0 (esto es hexadecimal), con una pocas excepciones. </FONT></FONT>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Palabras
clave <BR>Las palabras clave o &quot;keywords&quot; son un conjunto
de s&iacute;mbolos reservados por el lenguaje que no pueden ser
empleados para otros prop&oacute;sitos que los definidos en el mismo.
Si has programado en alg&uacute;n otro lenguaje de programaci&oacute;n
ya conoceras que significa esto de las palabras claves, ahora vamos a
ver cuales son las de Java. </FONT></FONT>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT COLOR="#ff6666"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>PALABRAS
CLAVES DE JAVA</FONT></FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><FONT COLOR="#ff6666">abstract,
boolean, break, byte, byvalue, case, catch, char, class, const,
continue, default, do, double, else, extends, false, final, finally,
float, for, goto, if, implements, import, instanceof, int, interface,

long, native, new, null, package, private, protected, public, return,
short, static, super, switch, syncronized, this, threadsafe, throw,
transient, true, try, void, while.</FONT> </FONT></FONT>
</P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Expresiones
literales</FONT> <BR><FONT COLOR="#ffffff">Las expresiones literales
son conjuntos de caracteres situados en el c&oacute;digo fuente que
representan valores particulares de datos de los tipos predefinidos,
y que suelen emplear en comparaciones y para inicializar variables,
En Java se pueden emplear expresiones literales para datos de tipo
car&aacute;cter, strings, enteros, punto flotante y valores
booleanos.</FONT> </FONT></FONT>
</P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Ahora
vamos a ver todos estos tipos... buff.</FONT> </FONT></FONT>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">&nbsp;&nbsp;&nbsp;
Expresiones literales de tipo car&aacute;cter.</FONT> <BR><FONT COLOR="#ffffff">Las
de tipo caracter se pueden usar junto con el tipo predefinido &quot;char&quot;,
y representan un &uacute;nico car&aacute;ter Unicode. La
representaci&oacute;n interna de los caracteres es un n&uacute;mero
de 16 bits. El modo normal de definir un car&aacute;cter accesible
desde teclado es escribirlo rodeado por comillas simples, si se va a
usar como car&aacute;cter aislado.</FONT> <BR><FONT COLOR="#ffffff">Cuando
el car&aacute;cter no es accesible de este modo, se puede emplear un
c&oacute;digo Unicode, octal o hexadecimal, emple&aacute;ndose para
ello el car&aacute;cter &quot;\&quot;. El formato de los c&oacute;digos
de escape es \uddd (ya se que no tiene sentido eso del uddd, pero es
que asi son los lumbreras de los programadores) para caracteres
definidos en Unicode, \ddd para caracteres definidos en octal y \xdd
para caracteres definidos en hexadecimal.</FONT> <BR><FONT COLOR="#ffffff">Tanto
para una expresi&oacute;n literal de tipo car&aacute;cter como para
definir una expresi&oacute;n literal de tipo &quot;string&quot;,
puede ser necesario introducir caracteres no imprimibles o caracteres
que se usan adem&aacute;s como delimitadores. Para poder usarlos, se
definen las siguientes secuencias de escape:</FONT> </FONT></FONT>
</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT COLOR="#ff6666"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>SECUENCIAS
DE ESCAPE</FONT></FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><FONT COLOR="#ff6666">CARACTER&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
SECUENCIA</FONT>
<BR><FONT COLOR="#ff6666">\&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
\\</FONT> <BR><FONT COLOR="#ff6666">'&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
\'</FONT> <BR><FONT COLOR="#ff6666">&quot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
\&quot;</FONT> <BR><FONT COLOR="#ff6666">Retorno del carro
(CR)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
\r</FONT> <BR><FONT COLOR="#ff6666">Line Feed
(LF)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
\n</FONT> <BR><FONT COLOR="#ff6666">Form Feed
(FF)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
\f</FONT> <BR><FONT COLOR="#ff6666">Backspace
(BS)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
\b</FONT> <BR><FONT COLOR="#ff6666">Tabulador
(HT)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
\t</FONT> </FONT></FONT>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">&nbsp;&nbsp;&nbsp;
Expresiones literales para cadenas de caracteres</FONT> <BR><FONT COLOR="#ffffff">Las
cadenas de caracteres se representan en las expresiones literales
correspondientes como una secuencia de cero o m&aacute;s caracteres
flanqueados por comillas, supongo que se has programado alguna vez
sabras esto de las cadenas de caracteres en Metodolog&iacute;a de la
Programaci&oacute;n me ense&ntilde;aron a escribir cadenas de
caracteres asi:</FONT> </FONT></FONT>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Escribir
&quot;Tu abuela fuma&quot;</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">La
cadena de caracteres es &quot;Tu abuela fuma&quot; lo de escribir lo
tienes que poner como te indique el lenguaje con el que est&eacute;s
programando.</FONT> </FONT></FONT>
</P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">&nbsp;&nbsp;&nbsp;
Expresiones literales para valores l&oacute;gicos (booleanos)</FONT>
<BR><FONT COLOR="#ffffff">Existen dos valores booleanos, </FONT><FONT COLOR="#33ff33">true
</FONT><FONT COLOR="#ffffff">y </FONT><FONT COLOR="#33ff33">false</FONT><FONT COLOR="#ffffff">.
Estos valores no son strings y no pueden ser convertidos a literales
del tipo String. Siempre se emplean en relaci&oacute;n con objetos de
tipo boolean.</FONT> <BR><FONT COLOR="#ffffff">Cualquiera que haya
dado un curso de inform&aacute;tica en condiciones, (no estos que te
dicen, &quot;esto es un rat&oacute;n, esto un teclado, y esto tus
huevos&quot;, sino uno que te ense&ntilde;e desde las matem&aacute;ticas
diriginas a la inform&aacute;tica, hasta la programaci&oacute;n.)
sabr&aacute; que es esto de boolean y acabar&aacute; hasta los
cojones de ello.</FONT> </FONT></FONT>
</P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">&nbsp;&nbsp;&nbsp;
Expresiones literales para valores enteros</FONT> <BR><FONT COLOR="#ffffff">Despues
del cabreo que me he llevado con el buleaaaaaan de los huevos, vamos
a ver que es esto.</FONT> <BR><FONT COLOR="#ffffff">Java permite
representar un valor entero mediante una expresi&oacute;n literal en
tres bases distintas: Octal</FONT> <BR><FONT COLOR="#ffffff">(base
8), decimal (base 10) y hexadecimal (base 16).</FONT> </FONT></FONT>
</P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Un
entero representado en octal comienza siempre por un cero, al que le
siguen uno o m&aacute;s d&iacute;gitos de 0 a 7. Un ejemplo 0666 &quot;Is
the number of the beast&quot;</FONT> </FONT></FONT>
</P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">La
representaci&oacute;n de un entero en base 10 es la de toda la vida,
la &uacute;nica precauci&oacute;n&nbsp; que hay que tener es no poner
ning&uacute;n cero a la izquierda si el resto de los d&iacute;gitos
del n&uacute;mero est&aacute;n comprendidos entre 0 y 7, con el fin
de que el compilador pueda distinguirlo de un numero octal. Un
ejemplo 1999.</FONT> </FONT></FONT>
</P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Para
representar un n&uacute;mero hexadecimal se empieza con 0x su
secuencia de d&iacute;gitos. Se emplea la notaci&oacute;n habitual,
con las letras A a F (da igual si son mayusculas o minusculas) para
representar los n&uacute;meros del 10 al 15, o sea la &quot;a&quot;
es el 10, la &quot;b&quot; es el 11 y as&iacute; hasta la &quot;f&quot;.
Un ejemplo puede ser 0xFFA.</FONT> </FONT></FONT>
</P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">El
compilador emplea uno u otro de los tipos predefinidos para las
expresiones literales enteras en funci&oacute;n del n&uacute;mero
m&iacute;nimo de bits que se necesitan para representar el n&uacute;mero
en binario. As&iacute;, los n&uacute;meros que requieren hasta 8 bits
se consideral del tipo &quot;byte&quot;, los que requieren hasta 16
del tipo &quot;short&quot;, los que necesitan hasta 32 bits se
asocian al tipo &quot;int&quot; y los de hasta 64 bits al tipo
&quot;long&quot;.</FONT> </FONT></FONT>
</P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">&nbsp;&nbsp;&nbsp;
Expresiones literales para valores de punto flotante</FONT> <BR><FONT COLOR="#ffffff">En
Java, las expresiones literales que representan un n&uacute;mero en
punto flotante constan de las siguientes partes:</FONT> </FONT></FONT>
</P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Parte
entera, secuencia de d&iacute;gitos decimales</FONT> <BR><FONT COLOR="#ffffff">Punto
decimal</FONT> <BR><FONT COLOR="#ffffff">Parte fraccionaria,
secuencia de d&iacute;gitos decimales</FONT> <BR><FONT COLOR="#ffffff">Exponente,
una E may&uacute;scula o min&uacute;scula seguida por un entero con
signo en base 10</FONT> <BR><FONT COLOR="#ffffff">Un expecificador de
precisi&oacute;n</FONT> </FONT></FONT>
</P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Algunas
de estas partes son opcionales, un n&uacute;mero en punto flotante ha
de tener, al menos, una parte entera y un punto decimal o un
exponente.</FONT> </FONT></FONT>
</P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">El
especificaodr de precisi&oacute;n es opcional y determina la
precisi&oacute;n empleada para la representaci&oacute;n interna del
n&uacute;mero. Cuando el especificador es F o f, o cuando no est&aacute;
presente, el n&uacute;mero se considera como de precisi&oacute;n
simple. Si el especificaodr es D o d, el n&uacute;mero se considera
como de doble precisi&oacute;n. En el primer caso, el tipo de datos
Java correspondiente es &quot;float&quot;, y en el segundo caso
&quot;double&quot;.</FONT> </FONT></FONT>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="Arial, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">BUENO
Y YA EST&Aacute; ESTO ES TODO POR AHORA, EN EL PROXIMO N&Uacute;MERO
VAMOS A POR LOS DATOS PREDEFINIDOS, ESTOS DE TIPOS ENTEROS, PUNTO
FLOTANTE Y YO QUE SE M&Aacute;S COSAS (PIDO PERD&Oacute;N POR LOS
TACOS QUE HAY EN ESTE ART&Iacute;CULO, PERO ES QUE ESTOY CABREADO POR
QUE ES S&Aacute;BADO Y HACE MAL&Iacute;SIMO &iexcl;CON LO BUENO QUE
HIZO AYER!).</FONT> </FONT></FONT>
</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><A HREF="YO.htm"><IMG SRC="Smiley.gif" NAME="Imagen2" ALIGN=BOTTOM WIDTH=35 HEIGHT=34 BORDER=0></A></P>
<P STYLE="margin-bottom: 0cm">&nbsp; 
</P>
</BODY>
</HTML>