<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<TITLE></TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice/5.1 (Linux)">
	<META NAME="CREATED" CONTENT="20000311;14155200">
	<META NAME="CHANGEDBY" CONTENT="Miguel Angel Nieto Salazar">
	<META NAME="CHANGED" CONTENT="20000325;13555400">
</HEAD>
<BODY BGCOLOR="#000000">
<P ALIGN=CENTER><IMG SRC="jueg.jpg" NAME="Imagen3" ALIGN=MIDDLE WIDTH=350 HEIGHT=75 BORDER=0><BR><BR><BR>
</P>
<P><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">Todo
el que lleve ya un tiempo en la inform&aacute;tica, y mas
concretamente viciandose diariamente a todos los juegos que pasan por
sus manos, se habr&aacute; dado cuenta de lo que esta ocurriendo. En
principio todo parece ser una conspiraci&oacute;n, y no estamos muy
alejado de esa afirmaci&oacute;n, porque... &iquest;que esta
ocurriendo con los juegos actuales? Uno podr&iacute;a decir, &quot;Que
son caros&quot;... NO!, otro quiz&aacute;s dir&iacute;a, &quot;Que
son entrenidos&quot;... NO!, y ya el ultimo dir&iacute;a, &quot;Pos
dilo de una puta vez, ostias&quot;... BIEN!!!! El problema de los
juegos actuales es que... son una puta basura! As&iacute; de f&aacute;cil,
y como no tengo nada mejor que hacer, y seguramente vosotros tampoco,
porque... &iquest;que hac&eacute;is leyendo esto?. Pos eso, que voy a
dar mis razones ahora, he intentare argumentarlas con ejemplos, algo
que no ser&aacute; muy dif&iacute;cil.</FONT></FONT></FONT> 
</P>
<P><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">Si
recordamos aquellos juegos de hace a&ntilde;os, los juegos esos de
nuestro amado Amstrad, Spectrum, Comodore, etc. eran malillos
gr&aacute;ficamente, pero eran un vicio de cagarse!!! Todav&iacute;a
recuerdo las partidas a las 3 de la ma&ntilde;ana con esa primera
parte del Arkanoid, y no digamos nada del Tetris!!! Bien, ahora coger
un juego cualquiera y compararlo... seguramente que de 100 juegos que
escoj&aacute;is al azar, solamente uno es capaz de enganchar al jugon
compulsivo... &iquest;y porque? Porque no hay nuevas ideas, todo ya
esta visto, o eso creen los programadores o los que est&eacute;n
encargados de buscar nuevas ideas. El 99% de nosotros estamos hasta
los mism&iacute;simos del juegos 3D. Bien, con el doom y el
wolfestein era un vicio, pero ahora... quake 1 (cutrillo), quake 2
(cutrada), quake3 (dios m&iacute;o, que puta mierda!), mortyr
(jajajaja... mejor me callo), unreal (valla, otra basura).</FONT></FONT></FONT>
</P>
<P><IMG SRC="q3.jpg" NAME="Imagen1" ALT="Instalacion de Q3 desde Linux" ALIGN=LEFT HSPACE=10 VSPACE=10 WIDTH=350 HEIGHT=192 BORDER=0><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">Aunque
no lo parezca hay algunas excepciones, como pueden ser el Half-Life,
Unreal Tournament, etc. Pero no vamos a negarlo, en estos momentos el
mercado esta plagado de copias, de las copias, que antes eran copias
de otras copias... Pero como no de arcade 3D vive &uacute;nicamente
el hombre (y la mujer), &iquest;que tal una partidita a un juego de
estrategia? NO!, ya que nos topamos con el mismo problema... y como
siempre, salvando algunas excepciones (starcraft, warcraft...), todo
lo dem&aacute;s es otra copia.</FONT></FONT></FONT> 
</P>
<P><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">-
Ejemplo, por favor.</FONT></FONT></FONT> 
</P>
<P><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">Bien,
que me dec&iacute;s del Tiberian Sun, Red Alert... y todos esos. Ya
se que son de la misma empresa y to eso, pero co&ntilde;o... si en
vez de juegos parecen meras ampliaciones del original e inimitable
C&amp;C. Pero el premio gordo se lo lleva microsoft. A todos nos
sorprendi&oacute; ese maravilloso juego de estrategia, el Age of
empires. Todos alucinados, no nos pod&iacute;amos creer que algo as&iacute;
llevara la firma del diablo (mocosoft). Despu&eacute;s de ver el
dinero que llegaron a ganar, pensaron... &quot;y si hacemos una
continuaci&oacute;n&quot;. Y la hicieron, pero el problema es que &iexcl;ES
IGUAL QUE LA PRIMERA PARTE! Mismos sonidos, mismos gr&aacute;ficos...
&iquest;no saben renovar un juego, o es que la primera parte les
sali&oacute; de suerte?</FONT></FONT></FONT> <BR>&nbsp; 
</P>
<P><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">Muy
bien, muchos de vosotros estar&eacute;is pensando que soy el t&iacute;pico
tipo raro que le encantar&iacute;a volver al mundo de los juegos
antiguos, con sus ordenadores antiguos, y to eso. Otros quiz&aacute;s
est&eacute;is pensando en diferentes formas de acabar con mi vida
(haber quakeros... tranquilizaos. Vosotros con matar a los Bots
&iquest;inteligentes? del quake 3 ya ten&eacute;is bastante). Pero,
&iquest;quien me puede negar que lo que aqu&iacute; estoy contando no
es cierto? Mas y mas juegos, con mas y mas gr&aacute;ficos, mas y mas
requisitos... y en el fondo, es lo mismo de siempre.</FONT></FONT></FONT>
</P>
<P><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">He
o&iacute;do a mucha gente plantearse la siguiente cuesti&oacute;n, y
si lo piensas, no es tan extra&ntilde;o &iquest;Acaso Carmack tiene
un acuerdo con intel o 3DFX? No me extra&ntilde;ar&iacute;a nada, ya
que su ultimo juego el Quake 3, es la basura mas grande que se ha
visto nunca. Vale... el motor esta muy bien, pero... &iquest;la
jugabilidad, la inteligencia de los bots...? En pocas palabras, los
gr&aacute;ficos avanzan, pero la jubalididad y todo lo dem&aacute;s
desciende a toda leche.</FONT></FONT></FONT> 
</P>
<P><IMG SRC="unreal.gif" NAME="Imagen2" ALT="Esto si es un juego!" ALIGN=RIGHT WIDTH=204 HEIGHT=206 BORDER=0><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">&iexcl;Y
luego se pregunta la gente porque hay pirater&iacute;a! &iquest;Quien
puede estar dispuesto, y tener suficiente dinero, para comprase cada
uno de los &quot;nuevos juegos que salen a la calle? Yo
personalmente, cuando encuentro un juego que me encanta, me lo pillo
original... y si es un juego de esos que he mencionado anteriormente,
se lo pido a un colega y me echo unas partiditas. Y aunque parezca de
locos... &iexcl;Quiero seguir comprando juegos originales! Pero cada
vez es mas dif&iacute;cil encontrar un juego que merezca la pena.</FONT></FONT></FONT>
</P>
<P><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">Para
uno que puede ser medianamente interesante... detienen su venta
(carmagedon) en varios pa&iacute;ses... no sea que alguien se ponga a
atropellar... con estas decisiones te das cuenta de la panda de
subnormales que tenemos encima, pero esto es otro tema. Y aunque el
carma sea muy divertido, lleva el mismo camino que el resto de los
juegos, ya que se nos avecina el carmaggedon 2000, con mas peatones
para llevarnos por delante... mas de los mismo.</FONT></FONT></FONT>
<BR>&nbsp; 
</P>
<P><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">Bien,
creo que esta casi todo dicho. Ahora mismo, despu&eacute;s de
escribir esto me echare un partidita al Unreal Tournament, al Doom o
quiz&aacute;s al Warcraft... &iexcl;eso si son juegos! Ojal&aacute;
vuelvan buenos tiempos para el sector de los videojuegos, ya que en
estos momentos esta esta mal, muy mal... y eso es una pena, una puta
pena!</FONT></FONT></FONT> 
</P>
<P><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">Como
nota&nbsp; final, el &uacute;nico juego interesante que he encontrado
en los &uacute;ltimos meses a sido el Lego Racers... para que ve&aacute;is
como esta el panorama.</FONT></FONT></FONT> 
</P>
<A HREF="mailto:punisher@linuxfan.com"><IMG SRC="Punish07.gif" ALIGN=RIGHT WIDTH=384 HEIGHT=224 BORDER=0>
</BODY>
</HTML>