<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<TITLE></TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice/5.1 (Linux)">
	<META NAME="CREATED" CONTENT="20000311;13565700">
	<META NAME="CHANGEDBY" CONTENT="Miguel Angel Nieto Salazar">
	<META NAME="CHANGED" CONTENT="20000325;13083400">
</HEAD>
<BODY BGCOLOR="#000000">
<P ALIGN=CENTER><IMG SRC="kern.jpg" NAME="Imagen3" ALIGN=CENTER WIDTH=350 HEIGHT=75 BORDER=0><BR CLEAR=LEFT><BR><BR>
</P>
<P><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">En
este peque&ntilde;o articulo os explicare una de las cosas que mas
vamos ha hacer en nuestro Sistema Operativo favorito, el Linux. &iquest;Y
que es el Kernel? Es f&aacute;cil, seguramente muchos de vosotros si
hab&eacute;is estado alg&uacute;n tiempo en Windows, habr&eacute;is
recibido alg&uacute;n mensaje de &quot;error en kernel&quot;, &quot;el
kernel esta jodio&quot; o algo similar. Nuestro windows, cuando habla
del Kernel, esta hablando el &quot;coraz&oacute;n&quot; de nuestro
sistema operativo. Es el encargado de hacer funcionar nuestra
maquina, conectar los diferentes componentes de nuestro hardwares,
etc. En resuman, sin kernel no hay sistema operativo.</FONT></FONT></FONT>
</P>
<P><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">El
kernel del linux suele acutalizarse cada poco tiempo, introduciendo
nuevas caracter&iacute;sticas, corrigiendo fallos, etc. En el momento
en el que escribo estas lineas, ya va por la versi&oacute;n 2.2.15.
Como veis, el kernel pertenece a la familia 2.2, y es la 15&ordf;
actualizaci&oacute;n. La forma de numeraci&oacute;n es sencilla. Los
kernels se diferencian entre los estables, y los que no los son
tanto... Si el segundo numero de la version del kernel es par,
entonces nos encontramos ante una versi&oacute;n estable. Si por el
contrario es impar, es una versi&oacute;n inestable, que aunque el
nombre asuste... no se te va a estar colgando cada poco tiempo, si no
que incluye muchas cosas que aun se encuentran en prueba, y puede que
no funcionen bien, o puedan producir errores. As&iacute;, una versi&oacute;n
2.3.x estar&iacute;a todav&iacute;a en desarrollo, y no se recomienda
su instalaci&oacute;n. Por el contrario, un kernel del tipo 2.2.x
esta libre de problemas y es estable, aunque tenga menos
caracter&iacute;sticas que la 2.3.x.</FONT></FONT></FONT> 
</P>
<P><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">En
estos momentos se esta desarrollando en nuevo kernel estable, que
seg&uacute;n se rumorea ser&aacute; un gran salto para el mundo de
linux. No voy ha hablar de lo que traer&aacute; en nuevo kernel
2.4.x, porque no tengo ni idea, pero os podr&eacute;is documentar
f&aacute;cilmente en linux.org o linux.com.</FONT></FONT></FONT> 
</P>
<P><IMG SRC="kernel1.jpg" NAME="Imagen2" ALT="Configuracion del Kernel desde el Menuconfig" ALIGN=RIGHT HSPACE=10 VSPACE=10 WIDTH=400 HEIGHT=236 BORDER=0><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">Bien,
despu&eacute;s de esta mini-presentaci&oacute;n, vamos a comenzar a
instalar y actualizar nuestro nuevo Kernel. Tenemos el archivo
comprimido con las fuentes del kernel, que generalmente suele ser en
formato *.tar.gz o *.bz2. Si se trata de un archivo &quot;tar.gz&quot;
se descomprime escribiendo en la linea de comandos &quot;tar -xzf
nombredearchivo.tar.gz&quot;, si por el contrario se trara de un
*.bz2... en estos momentos no tengo ni idea de como se descomprimen
:) La descompresi&oacute;n se puede realizar en cualquier directorio
de nuestro disco duro, aunque se recomienda hacerlo en
/usr/src/linux, para que no tengamos problemas de compatibilidad con
algunos programas que son necesarios para compilar en kernel, ya que
estos generalmente buscaran los archivos en el directorio que he
mencionado anteriormente, y si lo instalamos en otros, solo vamos a
dificultar mas las cosas.</FONT></FONT></FONT> 
</P>
<P><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">Bien,
despues de haber descomprimido nuestro kernel, solo queda
configurarlo y compilarlo. Como ya sabr&eacute;is el kernel no viene
compilado, ya que se distribuye en diferentes archivos fuente. Pero
antes de pasar a la compilaci&oacute;n, habr&aacute; que configurarlo
con las opciones que deseemos, porque... &iquest;para que vamos a
instalar la opci&oacute;n para utilizar tarjetas SCSI si no disponemos
de ellas, por ejemplo? Lo &uacute;nico que lograr&iacute;amos seria
perder tiempo y memoria.</FONT></FONT></FONT> 
</P>
<P><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">Antes
la configuraci&oacute;n del kernel se hacia desde la linea de
comandos, respondiendo a cada una de las preguntas que se te iban
formulando, pero ahora con esa man&iacute;a de hacer todo mas f&aacute;cil,
tambi&eacute;n se puede hacer desde men&uacute;s sencillos, o mejor
aun, &iexcl;desde nuestro gestor de ventanas favorito! Cada uno debe
seleccionar la opci&oacute;n que mas le guste. Si eres novato en
esto, ser&aacute; mejor utilizar la opci&oacute;n de configuraci&oacute;n
desde el gestor de ventanas. Si estas harto de ventanitas, puedes
hacerlo desde un men&uacute; desde la linea de comandos, o mejor aun,
utilizando la primera opci&oacute;n de la que os he hablado.</FONT></FONT></FONT>
</P>
<P><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">Si
deseamos hacerlo mediante la linea de comandos, respondiendo a cada
una de las preguntas que nos realice, deberemos escribir en la
consola del sistema, make config (esto escribirlo dentro del
directorio /usr/src/linux). A partir de ahora solo queda comenzar a
responder a cada una de las preguntas, y cuando acabemos compilarlo,
pero ya hablaremos de esto mas adelante.</FONT></FONT></FONT> 
</P>
<P><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">Si
queremos hacerlo desde un sencillo men&uacute; desde la consola del
sistema, &uacute;nicamente debemos escribir en la linea de comandos
lo siguiente: make menuconfig. Configuramos todo el kernel a nuestro
gusto, grabamos los cambios, salimos y compilamos.</FONT></FONT></FONT>
</P>
<P><IMG SRC="kernel.jpg" NAME="Imagen1" ALT="Configuracion del Kernel desde el KDE" ALIGN=LEFT HSPACE=2 VSPACE=2 WIDTH=376 HEIGHT=150 BORDER=0><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">Y
por ultimo, si deseas hacerlo todo sin salir de tus preciadas
ventanitas, con escribir (no te va a pasar nada por soltar el rat&oacute;n)
make xconfig, veras un precioso men&uacute; para seleccionar todas
las opciones que creas oportunas a golpe de rat&oacute;n.</FONT></FONT></FONT>
</P>
<P><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">Y
seguramente muchos os preguntareis que opciones son esas... f&aacute;cil.
Como ya he dicho antes el kernel es el encargado de hacer que todo el
hardware se entienda y funcione perfectamente, as&iacute; que
nosotros tendremos que configurarlo teniendo el cuenta el ordenador
que tenemos entre manos. Instalaremos soporte para SCSI si disponemos
de el, soporte para tarjetas de sonido, para puertos, para modems
RDSI, soporte para USB, Plug and Play, etc. En pocas palabras,
tendr&aacute;s que decirle al kernel que co&ntilde;o es lo que tienes
en ese ordenador.</FONT></FONT></FONT> 
</P>
<P><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">Despu&eacute;s
de configurar todo, solo nos queda compilarlo, para que funcione como
Dios manda. Este proceso suele ser bastante largo, pero tranquilo,
que tu solo tendr&aacute;s que escribir cuatro cosas, el proceso en
realidad es largo para el ordenador.</FONT></FONT></FONT>
</P>
<P><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">Estos
son los comandos que debes introducir:</FONT></FONT></FONT> 
</P>
<UL>
	<LI><P><FONT COLOR="#ffcc00"><FONT FACE="Arial, Helvetica"><FONT SIZE=2><B>make
	dep</B></FONT></FONT></FONT></P>
	<LI><P><B><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffcc00">make
	clean</FONT></FONT></FONT></B> 
	</P>
	<LI><P><FONT COLOR="#ffcc00"><FONT FACE="Arial, Helvetica"><FONT SIZE=2><B>make
	zImage</B></FONT></FONT></FONT></P>
</UL>
<P><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">Tambi&eacute;n
se pueden introducir todos los comandos en unas sola linea (make dep
clean zImage), para que se ejecuten uno detr&aacute;s de otros y nos
podamos ir a tomar un caf&eacute; o cualquier otra cosa, pero esta
forma es menos segura. Ya que si en alg&uacute;n punto de la
compilaci&oacute;n surge alg&uacute;n error, no podremos verlo para
despu&eacute;s solucionarlo.&nbsp; Despu&eacute;s de la compilaci&oacute;n
el kernel comprimido se encuentra en el directorio
/usr/src/linux/arch/i386/boot. La imagen del kernel, esto es, el
fichero que contiene el kernel se llama zImage. Si no lo encontramos,
quiere decir que no se a podido concluir la compilaci&oacute;n. Esto
suele deberse a que el kernel es demasiado grande para ser compilado,
as&iacute; que deberemos usar compilar de nuevo con make bzImage,
para indicarle que el kernel va a ser mu grande, y que luego no se
asuste.</FONT></FONT></FONT> 
</P>
<P><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">Si
algunas de las funciones del kernel funcionan como m&oacute;dulos, es
recomendable instalarlas tambi&eacute;n, con la opci&oacute;n make
modules. Ahora solo queda completar la instalaci&oacute;n,
configurando lilo para que utilice el nuevo kernel, escribiendo el la
linea de comandos make zlilo lo har&aacute; autom&aacute;ticamente.</FONT></FONT></FONT>
</P>
<P><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">Y
aqu&iacute; se acaba todo, como ves, tener linux a la ultima no es
tan dif&iacute;cil, con recordar cada uno de los paso ya es
suficiente, ni siquiera tienes que saber que es lo que hace cada uno,
para eso ya habr&aacute; tiempo. Tambi&eacute;n quiero recordar que
lo he explicado muy por encima, para no meterme en demasiados rollos
que no llevar&iacute;an a nada, &iexcl;&iexcl;&iexcl;pero que mejor
que experimentar uno mismo!!!</FONT></FONT></FONT> 
</P>
<P><FONT SIZE=2><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">Nada
mas, espero que os haya interesado el articulo. Nos vemos en la
pr&oacute;xima BZ, y viva el software Libre!!!!</FONT></FONT></FONT>
<BR>&nbsp; 
</P>
<P><FONT SIZE=1><FONT FACE="Arial, Helvetica"><FONT COLOR="#ffffff">(Una ultima cosa. Cuando nos referimos al linux en realidad nos referimos al Kernel, pero bueno... para no meter mas lio no lo he explicado)</FONT></FONT></FONT>
<BR>&nbsp;
</P>
<a href="mailto:punisher@linuxfan.com"><IMG SRC="Punish07.gif" NAME="Imagen4" ALIGN=RIGHT WIDTH=384 HEIGHT=224 BORDER=0></a>

</BODY>
</HTML>