<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.7 [en] (Win98; I) [Netscape]">
   <title>PCs vs. Consolas (segunda parte)</title>
</head>
<body text="#FFFFFF" bgcolor="#000000">

<center><img SRC="pcon.gif" height=100 width=350><font face="Tahoma"><font size=-2>
(segunda parte)</font></font></center>

<p><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>Por
decirlo de alguna manera, esto es una continuacion de mi anterior articulo
PCs vs. Consolas, escrito en la Binary Zone 4. Despues de esta breve introduccion
empieza el articulo.</font></font></font>
<p><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>No
s&eacute; por donde empezar, bueno a s&iacute;... empecemos por el punto
m&aacute;s decisivo y que m&aacute;s fuerte pega en la balanza que hace
decidir cu&aacute;l de los dos aparatos comprar; <b><u>el precio.</u></b></font></font></font>
<p><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>Imag&iacute;nate
que eres un gran forofo de los juegos de carreras de coches, y te han dicho
que para un PC o una consola hay uno chul&iacute;simo. Vas a una tienda,
compras el juego y un sistema para usarlo, porque descubres que tu minicadena
no acepta ese tipo de CDs (una l&aacute;stima).</font></font></font>
<ul>
<h4>
<font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>Opci&oacute;n
1: el PC</font></font></font></h4>
<font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>Ordenador
PIII a 450Mhz o superior con monitor de 15/17’’, 64 Mb RAM, Windows 98,
rat&oacute;n, teclado, CD,disco duro y caja torre: <b>250000ptas</b>(aproximadamente)</font></font></font>
<p><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>Juego:
<b>10000ptas</b></font></font></font>
<p><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>Volante:
<b>12000ptas</b></font></font></font>
<p><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>Tarjeta
3Dfx Voodo2: <b>50000ptas</b></font></font></font>
<p><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1><b>TOTAL</b>
para un jueguecito: <b>322000ptas</b></font></font></font></ul>
<b><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>&iexcl;Dios
m&iacute;o, no me puedo permitir eso!</font></font></font></b>
<ul>
<h4>
<font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>Opci&oacute;n
2: Consola</font></font></font></h4>
<font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>N64, Playstation,
DreamCast, la que quieras: <b>15000 ptas/20000 ptas/40000 ptas</b></font></font></font>
<p><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>Volante:
<b>12000ptas</b></font></font></font>
<p><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1><b>TOTAL</b>:
<b>27000
ptas/32000 ptas/52000 ptas</b></font></font></font></ul>
<font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>Por supuesto,
si eres una persona a la que no le sobra el dinero, elegir&aacute;s la
segunda opci&oacute;n sea la consola que sea.</font></font></font>
<h4>
<b><u><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>La
calidad</font></font></font></u></b></h4>
<font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>Muy bi&eacute;n,
imaginemos que has elegido la consola, como supongo que has hecho. Has
estado ahorrando unos meses sin ir al sal&oacute;n recreativo, quedando
mal con tus amigos porque nunca invitabas t&uacute;, viendo pel&iacute;culas
con anuncios porque el canal de pago es mucho para ti, etc. . . Por fin,
tienes el dinero para una consola(N64,Plx, DC) invitas a tus amigos a tu
casa, y despu&eacute;s del shock que hayan tenido moment&aacute;neamente
al ver que has invitado t&uacute; porque eres muy feliz, entr&aacute;is
en tu cuarto y enciendes la consola. Sale el t&iacute;tulo del juego, eliges
play y.. El 90% de los presentes se queda alucinando. &lt;&lt;&iexcl;Qu&eacute;
fluidez!>> &lt;&lt;&iexcl;Qu&eacute; suerte tienes, chaval!>> &lt;&lt;&iexcl;Y
yo que a&uacute;n aguantaba con la Master!>>. Pero el 10% restante, un
colega rico de los chalets de las afueras, dice; &lt;&lt;Pues yo, con el
ordenador de mi padre, tengo este mismo juego, pero va mucho m&aacute;s
r&aacute;pido, los gr&aacute;ficos son mejores y es much&iacute;&iacute;&iacute;&iacute;&iacute;&iacute;&iacute;&iacute;&iacute;&iacute;&iacute;simo
mejor que esta porquer&iacute;a>>. Cambias salvajemente la expresi&oacute;n
de tu cara, te giras para quemarle los ojos a &eacute;se enterado con la
mirada, pero est&aacute;s s&oacute;lo. En lugar de ellos, aquellos que
considerabas tus amigos, hay una nota; &lt;&lt;Hemos ido a jugar a &eacute;sa
delicia de juego que no tiene comparaci&oacute;n con lo tuyo>>. Est&aacute;s
ofendido. Has hecho el rid&iacute;culo. Y todo por no gastarte "s&oacute;lo"
unas 300000ptas m&aacute;s.</font></font></font>
<p><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>Vas
a casa de aqu&eacute;l cre&iacute;do y le preguntas c&oacute;mo consigue
eso. Te dice que tiene lo &uacute;ltimo en tarjetas aceleradoras, un Pentium
III a 600Mhz con 128 Mb de RAM y un lector a 50x o DVD, y que (con toda
la raz&oacute;n del mundo), un monitor tiene m&aacute;s calidad de imagen
que un televisor. Aunque te hubieras gastado las 322000, hubieras hecho
el rid&iacute;culo igual. S&oacute;lo los ricos pueden estar al d&iacute;a
en esto.</font></font></font>
<h4>
<b><u><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>La
durabilidad</font></font></font></u></b></h4>
<font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>Supongo
que despu&eacute;s de gastarte 30 de los grandes (para ti enormes), esperas
que te dure un per&iacute;odo de dos a&ntilde;os para amortizar el gasto.
Pues no, chaval&iacute;n. Resulta que esto es m&aacute;s complicado de
lo que crees.</font></font></font>
<p><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>Compras
el ordenador de la opci&oacute;n uno (excepto la tarjeta aceleradora),
y te vas al centro comercial a comprar (sin ning&uacute;n tipo de favoritismo)
el Final Fantasy VIII. &Eacute;ste juego requiere un Pentium a 133 con
tarjeta aceleradora y un Pentium a 166 sin ella. Dices; &lt;&lt;Je, je,
si las &uacute;ltimas novedades requieren esto, mi ordenador va a durar
siglos. Hasta mis nietos lo usar&aacute;n felices>>. Lo compras con una
sonrisa que te d&aacute; la vuelta a la nuca y, despu&eacute;s de tropezar
con un par de escalones de la emoci&oacute;n, lo pruebas. Pero; &iexcl;horror!
&iexcl;El juego se para cont&iacute;nuamente! &iexcl;Los personajes son
tartamudos y pasean por la pa-pa-pa-pantalla! Resulta que el ordenador
que requiere no es ni un Pentium a 166 ni a 233 ni a 700 ni a 3500 sin
tarjeta aceleradora; &iexcl;requiere un ordenador de esos de Silicon Graphics!
Vas a comprar lo &uacute;ltimo en tarjetas aceleradoras y "disfrutas" el
juego de lo "barato" que te ha salido.</font></font></font>
<p><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>Medio
a&ntilde;o despu&eacute;s, tras superar el trauma, compras The Mask of
the Eternity (King’s Quest VIII), vas a usarlo, y no va. &iexcl;Otra tarjeta
aceleradora! &iexcl;No! &iexcl;He dicho nooooooooooooo!</font></font></font>
<p><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>Como
v&eacute;is, 40000 pesetas ahora es arena en pocos meses, ya que habr&aacute;
salido la 3D2000fx Voodo<sup>893798237</sup> y la tuya es historia tan
lejana
como la era medieval. Ch&iacute;nchate.</font></font></font>
<h4>
<b><u><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>La
sencillez de uso</font></font></font></u></b></h4>
<font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>Veamos.
&iquest;Qu&eacute; necesitas saber para hacer las conexiones de una consola?
Suficiente serr&iacute;n en el cerebro como para reconocer "qu&eacute;
encaja con qu&eacute;" y saber encender la tele. Umh...... demasiado trabajo.</font></font></font>
<p><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>&iquest;Qu&eacute;
necesitas saber para hacer las conexiones del ordenador? Unas largas vacaciones,
mucha mano fr&iacute;a, y un manual de instrucciones de 3000 p&aacute;ginas.
A&uacute;n m&aacute;s trabajo. Toquemos madera de la buena.</font></font></font>
<p><b><i><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>Se
estropea.</font></font></font></i></b>
<p><i><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>-
Pap&aacute;, se me ha estropeado la consola y necesito 20000 pesetas para
arreglarlo. :-)</font></font></font></i>
<br><i><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>-
No te lo crees ni t&uacute;, encanto. : - (</font></font></font></i>
<p><b><i><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>En
cambio...</font></font></font></i></b>
<p><i><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>-
Pap&aacute;, el ordenador se ha estropeado y necesito 20000 pesetas para
arreglarlo. : - )</font></font></font></i>
<br><i><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>-
&iquest;Otra vez? : - (</font></font></font></i>
<p><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>El
ordenador se estropea muy f&aacute;cilmente, debido a todos sus componentes,
y a veces, cuando cargas un programa, como un juego, a Windows le parece
que jugar es sinonimo de salir.</font></font></font>
<h4>
<b><u><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>Entonces,
&iquest;tiene algo bueno el ordenador?</font></font></font></u></b></h4>
<font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>Por supuesto
que no. &iexcl;Es broma!. Lo que pasa es que en los grandes pesos de la
balanza (precio, calidad, durabilidad, sencillez, y "estropeamiento"),
s&oacute;lo gana en calidad. Pero los que no vean por encima, ver&aacute;n
un nuevo peso, que s&oacute;lo &eacute;l puede con todos, pero es el m&aacute;s
escondido y dif&iacute;cil de ver. Si hasta ahora no te hab&iacute;as dado
cuenta lo tuyo es la consola. Puedes irte. Adi&oacute;s, adi&oacute;s.</font></font></font>
<p><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>Si
te hab&iacute;as dado cuenta, es que o te compras un PC o no vives; puedes
no s&oacute;lo jugar (adem&aacute;s de que aqu&iacute; la calidad suele
ser mayor si cumples la dif&iacute;cil tarea de estar al d&iacute;a), sino
conectar a Internet, escribir con muchas m&aacute;s posibilidades que las
m&aacute;quinas de tinta, almacenar datos sin papel, coleccionar fotograf&iacute;as,
leer Binary Zone, etc. . .</font></font></font>
<p><font face="Arial,Helvetica"><font color="#FFFFFF"><font size=-1>Por
otro lado, creo que el que hayas le&iacute;do esto ha sido algo absurdo,
pues si lo has hecho es porque &iexcl;tienes un PC! (o por lo menos un
Mac)...</font></font></font>
<div align=right><a href="midirec.htm"><img SRC="Rubén.gif" border="0" height=100 width=200></a></div>

</body>
</html>
