<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<TITLE>Las divertidas aventuras de PEPO</TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice/5.1 (Win32)">
	<META NAME="AUTHOR" CONTENT="Miguel Angel Nieto Salazar">
	<META NAME="CREATED" CONTENT="20000326;15303626">
	<META NAME="CHANGEDBY" CONTENT="Miguel Angel Nieto Salazar">
	<META NAME="CHANGED" CONTENT="20000326;15314300">
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
	<STYLE>
	<!--
		TD P { color: #ffffff }
		P { color: #ffffff }
		A:visited { color: #8080ff }
		A:link { color: #8080ff }
	-->
	</STYLE>
</HEAD>
<BODY TEXT="#ffffff" LINK="#8080ff" VLINK="#8080ff" BGCOLOR="#000000">
<P ALIGN=CENTER><FONT COLOR="#ff0000"><FONT FACE="Arial Black, Arial, Helvetica"><FONT SIZE=7><B>Las
divertidas aventuras de PEPO</B></FONT></FONT></FONT></P>
<P ALIGN=CENTER><FONT COLOR="#a8b7ff"><FONT FACE="Comic Sans MS, Comic Sans, Times New Roman"><FONT SIZE=7><B>PARTE
2</B></FONT></FONT></FONT></P>
<P><A NAME="c21"></A><FONT COLOR="#febf01"><FONT FACE="Comic Sans MS, Comic Sans, Times New Roman"><FONT SIZE=3><B>CAP&Iacute;TULO
I</B></FONT></FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Entonces todos fueron
felices. Las Mariposillas volaban por todas partes, los pajaritos
contaban incesantemente composiciones de los grandes m&uacute;sicos y
los elefantes bailaban al son de la balalaika que tocaban los sapos.
Hab&iacute;an ArcoIris por todas partes y del suelo brotaban
gominolas. Los Tinos, con sus cabezas deshinchadas, paseaban por las
calles como uno m&aacute;s, los pollos fritos se encargaban de
reconstruir los edificios y los Pepos, como dec&iacute;a la vieja
leyenda, devolvieron sus plaquitas identificativas al SuperPepo para
convertirse todos juntos, como hermanos, en fieles s&uacute;bditos
del Dios SuperPepo.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Todos los monumentos
del Gran Cabeza en el planeta fueron ab&oacute;lidos, las calles
fueron reasfaltadas esta vez con la cara de Superpepo, y el sonriente
Gran Cabeza que adornaba el papel higi&eacute;nico fue reemplazado
por las palabras &quot;Superpepo, nuestro Dios y nuestro padre&quot;.
A partir de entonces todos los Pepos se llamar&iacute;an entre s&iacute;
&quot;Fiel s&uacute;bdito n&uacute;mero 1&quot;, &quot;Fiel s&uacute;bdito
n&uacute;mero 2...&quot; o, si no, Pepo1, Pepo2... Todas las fuerzas
hostiles del planeta Pepo y que tantas guerras hab&iacute;an
provocado en el pasado dejaron sus anteriores asentamientos y se
fueron a vivir al imperio del Salchich&oacute;n. Por fin el planeta,
tras casi 10.000 a&ntilde;os de continuas luchas comprend&iacute;a
qu&eacute; era aquello que siempre hab&iacute;an estado buscando
mediante la guerra lo que ahora tenian... La paz...</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>El Gran Pollo Frito
Cabez&oacute;n, que hab&iacute;a mostrado su claro apoyo a los Tinos
se rindi&oacute; pero, al no manifestar su amor por el Salchich&oacute;n,
fue desterrado a la Tierra.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Todos los Tinos,
Pollos Fritos o incluso Pepos que no se encontraron de acuerdo con el
mandato de SuperPepo, a pesar de no ser muchos en n&uacute;mero,
fueron lanzados en el Ca&ntilde;on de lanzamiento de basura espacial
hacia la Tierra.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Pepo, o SuperPepo, se
pasaba casi todo el tiempo de su reinado sentado en su trono comiendo
cacahuetes cuando no estaba pelando judias. Sus alitas y su cara
angelical, as&iacute; como su resplandor celestial hab&iacute;an ido
desapareciendo poco a poco, solo duraban las primeras semanas del
reinado y despu&eacute;s ir&iacute;a transform&aacute;ndose
lentamente en un ser muy parecido a un Pepo com&uacute;n, pero con
ligeras diferencias.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>All&iacute;, sentado
en su trono, tuvo mucho tiempo para pensar y reflexionar. Pens&oacute;
en su padre, que hab&iacute;a muerto luchando contra lo que ahora
eran aliados y pens&oacute; en su madre. La &uacute;ltima vez que la
vi&oacute; estaba sentado encima de ella y se vi&oacute; obligado a
meterle una buena tanda de patadas para que el guard&iacute;a no le
tomara por loco.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>&iquest;Donde estar&iacute;a
ahora?... La busc&oacute; por todas partes, desenterr&oacute; a todos
los muertos de las batallas, rebusc&oacute; en los vertederos, y al
final, preguntando a los m&aacute;s viejos del lugar se enter&oacute;
de que hab&iacute;a muerto de pena al ver que a su hijo se lo
llevaban a la c&aacute;rcel.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Se hab&iacute;a
quedado completamente solo: No ten&iacute;a padre ni madre. Solo le
quedaban las toneladas y toneladas de salchich&oacute;n y chorizo que
el reino hab&iacute;a ido extrayendo de las minas, as&iacute; que
decidi&oacute; construirse unos padres a base de chorizo y
salchich&oacute;n, y lo hizo. No obstante el invento no funcion&oacute;:
los padres de salchich&oacute;n y chorizo no daban mucha conversaci&oacute;n
y casi nunca respond&iacute;an a las preguntas. Adem&aacute;s,
acostumbraban a desmoronarse cada cierto tiempo y al cabo de los d&iacute;as
un olor a podrido y a basura imped&iacute;a a Pepo acercarse para
darles los buenos d&iacute;as.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Entonces fue cuando
naci&oacute; en Pepo la extra&ntilde;a obsesi&oacute;n por hacer
figuritas con salchich&oacute;n. Dej&oacute; de comer cacahuetes y
pelar judias y gast&oacute; todo su tiempo en hacer a todas horas
figuritas de salchich&oacute;n con las m&aacute;s diversas formas.
Algunas ni siquiera el mismo sab&iacute;a lo que significaban, pero
se imaginaba que eran presagios de un pr&oacute;ximo futuro...</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Mientras tanto, en la
Tierra, el planeta Tinolizado, El Gran Cabeza, El Gran Pollo Frito,
los Tinos que no hab&iacute;an viajado al planeta Pepo, los
desterrados del planeta Pepo y una peque&ntilde;a resistencia humana
segu&iacute;an malviviendo. El planeta era demasiado peque&ntilde;o
para el enorme tama&ntilde;o que las cabezas de los Tinos hab&iacute;an
adquirido. Era impresionante. Las largas investigaciones de tantos
a&ntilde;os por fin hab&iacute;an obtenido su fruto. Algunos
renegados Pepos que fueron desterrados al planeta donaron su cuerpo a
la ciencia, incluso alg&uacute;n que otro CabezaRoja y CabezaVerde, y
al fin los Tinos pudieron concretar cual era el intrigante secreto de
la divertida iluminaci&oacute;n intermitente de sus cabezas.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Avanzaron
cient&iacute;ficamente una barbaridad. Crearon Tinotantes h&iacute;bridos
de m&aacute;quina y Tinos con la cabeza infinitamente superior,
incluso, a la del Gran Cabeza. La gran ventaja de los h&iacute;bridos
era esa: al tener la mitad cibern&eacute;tica pod&iacute;an
sobrepasar ese est&uacute;pido l&iacute;mite en cuanto a tama&ntilde;o
de cabeza que ven&iacute;a atormentando al Gran Cabeza desde hac&iacute;a
tiempo y, mediante una simple fusi&oacute;n entre Tinos, pod&iacute;an
sumar m&aacute;s y m&aacute;s volumen, con la &uacute;nica
restricci&oacute;n de no alterar las trayectorias de los planetas.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Se hab&iacute;an
armado hasta los dientes. El antiguo modo de ataque &quot;A cabezazo
limpio&quot; fue qued&aacute;ndose anticuado y nuevos implantes de
bazokas en los brazos, misiles en las orejas y rayos l&aacute;ser en
el culo convert&iacute;an a cualquier Tino en un arma letal. Los m&aacute;s
avanzados tiraban misiles nucleares por los ojos, ten&iacute;an
ruedas de tanque y alas de F-14. Dedicaron todo su tiempo a seguir
mejorando sus armas para hacerlas m&aacute;s abundantes y
destructivas; las naranjas fueron sustituidas por modernos y muy
sofisticados aguacates explosivos que solo causar&iacute;an da&ntilde;os
a los Pepos, los melones lanza-pipas se reemplazaron por boniatos
inteligentes capaz de buscar, perseguir y aniquilar el objetivo
durante kil&oacute;metros con un margen de error del 2% y las
remolachas &aacute;cidas continuaron siendo utilizadas, si bien en
menor medida y con una mutaci&oacute;n gen&eacute;tica que las hac&iacute;a
ser m&aacute;s grandes y m&aacute;s &aacute;cidas.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Al cabo de tres duros
a&ntilde;os de investigaciones y actualizaciones en los ej&eacute;rcitos,
las hordas de Tinos estaba preparada de nuevo para la lucha, para la
4&ordf; y definitiva gran batalla contra los Pepos.</FONT></FONT></P>
<P><A NAME="c22"></A><FONT COLOR="#febf01"><FONT FACE="Comic Sans MS, Comic Sans, Times New Roman"><FONT SIZE=3><B>CAP&Iacute;TULO
II</B></FONT></FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Mientras tanto el
imperio continu&oacute; creciendo y creciendo m&aacute;s y m&aacute;s...
Nuevos pobladores se unieron a los ya existentes. Las &uacute;ltimas
incorporaciones al gran reinado fueron los misteriosos Patos-Gatos
que tra&iacute;an consigo algunos guerreros Pepo que lograron
rescatar en la 3&ordm; gran batalla contra los Tinos antes de que las
hordas de Tinos los masacraran junto con el resto del poblado.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Mientras tanto, Pepo
continu&oacute; con su extra&ntilde;a man&iacute;a de hacer figuritas
de salchich&oacute;n. Para estar m&aacute;s tranquilo decidi&oacute;
meterse en el alcantarillado de la ciudad; para no ser molestado
mayormente y porque le gustaba el tufillo que all&iacute; se
respiraba en menor medida... All&iacute; pasaba su tiempo haciendo
m&aacute;s y m&aacute;s figuritas de salchich&oacute;n... El solo se
concentraba en el salchich&oacute;n y sus manos comenzaban a
moldearlo, al principio empez&oacute; haciendo esferas... Esferas
cada vez m&aacute;s y m&aacute;s grandes... se preguntaba si... tal
vez... solo tal vez... esto pudiera tener alg&uacute;n tipo de
significado...</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Pepo comenz&oacute; a
obsesionarse con aquello. Se pasaba los d&iacute;as y las noches
moldeando y moldeando... No paraba de moldear estramb&oacute;ticas
figuras a las cuales no pod&iacute;a dar significado pero que le
causaban miedo por alguna extra&ntilde;a circunstancia que no llegaba
a comprender...</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Mientras tanto en la
superficie los habitantes se encontraban inquietos. Todos se
preguntaban en donde estaba su se&ntilde;or Pepo... algunos rumores
en torno a la salud mental de Pepo comenzaron a circular por toda la
ciudad... la gente se agolpaba en el palacio del Salchich&oacute;n
preguntando en donde estaba Pepo...</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Pese a que Pepo orden&oacute;
esplicitamente que nadie le molestara mientras moldeaba algunos
s&uacute;bditos suyos fueron a advertirle de lo que suced&iacute;a en
el exterior, pero Pepo parec&iacute;a no entender lo que le dec&iacute;an...
les miraba de arriba a abajo e instantes despu&eacute;s continuaba
moldeando...</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>La gente cada vez
estaba m&aacute;s inquieta, algunos se hab&iacute;an ya dado cuenta
de que su estado a&uacute;n no ten&iacute;a nombre y eso les pon&iacute;a
muy nerviosos... la gente no sab&iacute;a que poner en los remites y
la histeria se apoder&oacute; de los habitantes...</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Las mariposillas que
hasta entonces volaban por todas partes alegrando el paisaje
decidieron dejar de volar y se convirtieron en reptiles de un tono
grisaceo.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Los pajaritos dejaron
de cantar y por tanto los elefantes de bailar.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Los sapos continuaron
tocando la balalaika anteponi&eacute;ndose a la situaci&oacute;n pero
debido a la confusi&oacute;n reinante alguno que otro fue apaleado
por equivocaci&oacute;n y en respuesta estos decidieron traer de
nuevo las ratas que en su d&iacute;a se llev&oacute; el flautista de
Hamelin a modo de venganza.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Los ArcoIris que
llevaban sin cobrar varios meses decidieron irse a otros planetas e
incluso alguno que otro se qued&oacute; volando por el espacio sin
rumbo fijo.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Del suelo comenzaron a
brotar salchichas carnivoras que mord&iacute;an a los Pepos, estos,
se quejaban de que las salchichas carn&iacute;voras solo les mord&iacute;an
a ellos as&iacute; que cerraron las minas de ch&oacute;ped,
salchich&oacute;n y chorizo y comenzaron a lanzar c&oacute;cteles
Pepotov contra los Pollos Fritos y los Tinos que hasta ese momento se
hab&iacute;an mantenido al margen.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Los Pollos Fritos se
volvieron de nuevo dorados pese a que se les hab&iacute;a prohibido
esplicitamente por ser considerado contraproducente para el
desarrollo visual del resto de los habitantes de lo que fue llamado a
partir de entonces... El Mundo Sin Nombre... Casi de manera paralela
los Tinos volvieron a hinchar sus cabezas con mantequilla y
comenzaron a derribar todo aquello que hab&iacute;an restaurado en
los meses anteriores...</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Un nuevo aviso del
caos reinante fue dado a Pepo una vez m&aacute;s, pero esta vez Pepo
ni siquiera torn&oacute; la cabeza para reconocer el mensajero... &eacute;l
simplemente continu&oacute; moldeando y moldeando... el aspecto
f&iacute;sico de Pepo hab&iacute;a vuelto a cambiar una vez m&aacute;s
y ahora se asemejaba bastante al que ten&iacute;a cuando a&uacute;n
se encontraba sentado encima de su madre... su pepez intelectual
hab&iacute;a vuelto a descender y de nuevo se convirti&oacute; en uno
de La Mierda...</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>El reino se disperso
r&aacute;pidamente. Todos los Pepos volvieron a coger sus plaquitas
identificativas creando multiples conflictos porque alg&uacute;n que
otro La Mierda se hab&iacute;a cogido una plaquita de Bur&oacute;crata
y se hab&iacute;a ido del pa&iacute;s corriendo para no ser
alcanzado. Los mismos Pepo se atacaban los unos a los otros. Los
Tinos atacaban a los Pollos Fritos y en consecuencia los Sapos y las
Mariposillas Asesinas (as&iacute; se nombraron despu&eacute;s de su
mutaci&oacute;n en reptiles) se aliaron para atacar a los Calcetines
y a las Salchichas Carn&iacute;voras. Los Calcetines se hab&iacute;an
mantenido hasta entonces al margen de todo pero aprovechando la
confusi&oacute;n hab&iacute;an pensado en apoderarse de las ahora
abandonadas minas de salchich&oacute;n y chorizo para poder
reconstruir sus colonias y desodorantes que hab&iacute;an sido
seriamente da&ntilde;adas despu&eacute;s de las inundaciones de caldo
de tomate que supuso la primera y segunda gran batalla contra los
Tinos. Las Salchichas Carn&iacute;voras realmente no hac&iacute;an
da&ntilde;o a nadie ya que no hab&iacute;a ning&uacute;n Pepo al que
morder pero en respuesta a los ataques de las Mariposillas Asesinas y
de los Sapos decidieron atacar. Para ello llamaron a los Panes
Redondos con los cuales ya se hab&iacute;an aliado anteriormente para
que les ayudaran. El sistema de ataque de estos era muy simple. Un
par de salchichas se introduc&iacute;an en los Panes Redondos y
entonces estos se lanzaban pendiente abajo rodando y rodando mientras
que las Salchichas permanec&iacute;an muy atentas para dispararse en
cualquier momento contra sus enemigos. El problema es que el enemigo
deb&iacute;a estar siempre al finalizar una pendiente ya que sino los
Panes Redondos no podr&iacute;an llegar y tendr&iacute;an que llamar
a los Dioses Lakitu para que les transportaran con una peque&ntilde;a
ca&ntilde;a de pescar al lugar deseado pero los Dioses estaban muy
ocupados en esos momentos haciendo ganchillo y ser&iacute;a mejor no
depender mucho de ellos.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Mientras tanto Pepo
segu&iacute;a en su alcantarilla moldeando m&aacute;s y m&aacute;s
figuritas de salchich&oacute;n. Deb&iacute;a tener cientos, quiz&aacute;
miles, pero ninguna ten&iacute;a ning&uacute;n significado concreto
para &eacute;l. O&iacute;a encima de &eacute;l a las multitudes
correr y gritar, pero &eacute;l segu&iacute;a enzarzado en su
continua lucha por fabricar m&aacute;s y m&aacute;s figuritas de
salchich&oacute;n. Cierto d&iacute;a tuvo un presentimiento muy
fuerte y se levant&oacute; hist&eacute;rico del cubo en el que dorm&iacute;a
y fue corriendo hasta su almac&eacute;n de figuritas, las cogi&oacute;
y las fue encajando entre ellas y... &iexcl;&iexcl;Encajaban
perfectamente!!. Comenz&oacute; a juntarlas y cuando las hubo
encajado todas las contempl&oacute;, se puso de rodillas y comenz&oacute;
a llorar...</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Entre tanto, las naves
transportadoras de Tinos se acercaban al planeta. Era la primera vez
que ten&iacute;an que utilizar este m&eacute;todo. En la antig&uuml;edad
siempre hab&iacute;an tenido alguna colonia en el planeta y no hab&iacute;an
necesitado transportar tropas, y cuando realmente lo necesitaban
usaban el ca&ntilde;&oacute;n de lanzamiento de basura espacial para
enviarlos hasta all&iacute;. Las penalidades que sufr&iacute;an las
tropas viajando por el espacio as&iacute; como el duro impacto que
recib&iacute;an al aterrizar y que casi siempre los dejaba
inservibles hiz&oacute; que en esta ocasi&oacute;n se optar&aacute;
por usar las nuevas naves transportadoras.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Se dirig&iacute;a
hacia el planeta 30 naves transportadoras, 20 de ellas llenas de
Tinotantes hibr&iacute;dos de m&aacute;quina y Tino con la cabeza
gigante y armas implantadas por todo el cuerpo y 10 de ellas llenas
de Tinotanques, m&aacute;s lentos pero m&aacute;s destructivos.
Ven&iacute;an volando y protegiendo a las naves los Tinos alados y
cinco naves m&aacute;s de aprovisionamiento llenas de aguacates
explosivos, boniatos inteligentes y remolachas &aacute;cidas para que
fueran utilizadas en tierra por los Tinotantes.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Todav&iacute;a les
quedaba bastante tiempo para llegar, unos meses, dos o tres. El viaje
era largo y, adem&aacute;s, los Tinos alados ten&iacute;an que
repostar cada muy pocos kil&oacute;metros y como no hab&iacute;a en
el espacio ning&uacute;n sitio donde hacerlo se ve&iacute;an
obligados a volver al planeta de nuevo para hacerlo. Por si acaso un
contingente de apoyo de otras 10 naves transportadoras llenas de
Tinotanques sal&iacute;an cada d&iacute;a para ir llegando m&aacute;s
tarde que las otras cuando ya hubiera empezado la batalla.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Pepo a&uacute;n estaba
llorando. Todas esas figuritas que hab&iacute;a estado creando
incesantemente no eran otra cosa m&aacute;s que partes de &eacute;l
mismo: se hab&iacute;a construido de salchich&oacute;n, pero lo que
realmente le aterraba era que en la estatua de salchich&oacute;n
ten&iacute;a la cabeza de un Tino, y sobre todo, la plaquita
conmemorativa de debajo en la que se pod&iacute;a leer: &quot;&Uacute;nete
a tu gran padre, El Gran Cabeza&quot;. &iquest;C&oacute;mo pod&iacute;a
ser su padre aquel ser tan despreciable? No se sab&iacute;a nada de
&eacute;l, y, sobre todo, era un Tino. &iquest;Ser&iacute;a cierto?.
Todas estas dudas pasaron por su mente, y en aquel momento se vi&oacute;
reflejado en una gran butifarra con su nuevo aspecto de La Mierda y
se dijo a s&iacute; mismo:</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>- Vamos, tengo un
reino que proteger.</FONT></FONT></P>
<P><A NAME="c23"></A><FONT COLOR="#febf01"><FONT FACE="Comic Sans MS, Comic Sans, Times New Roman"><B>CAP&Iacute;TULO
III</B></FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Pepo arranc&oacute;
como pudo (Pues ya no ten&iacute;a esas garras de antes) las
morcillas que hab&iacute;a puesto atrancando la puerta, si bien
despu&eacute;s se dio cuenta de que las alcantarillas no tienen
puertas, as&iacute; que probablemente estuvo durante horas tratando
de quitar las morcillas que atrancaban a una rata. Tras este
incidente se dirigi&oacute; a la tapa de la alcantarilla y
desatornill&oacute; las zanahorias con las que los subditos hab&iacute;an
sellado la alcantarilla bajo las ordenes de Pepo. Sali&oacute; a la
superficie al fin. Tras largos meses de creaciones de figuritas de
salchich&oacute;n Pepo volv&iacute;a a ver lucir en lo alto la
estrella Zetoplasma. Hac&iacute;a un d&iacute;a precioso, Zetoplasma
brillaba en lo alto como nunca lo hab&iacute;a hecho antes, el viento
tocaba melodiosas musicas al soplar por las calles, las estrellas del
cielo bailaban y de la tierra sal&iacute;an fuegos artificiales que
iluminaban la atm&oacute;sfera. Recuerdos de su juventud le pasaron
por la cabeza: Record&oacute; cuando estaba en su peque&ntilde;a
aldea dentro de la civilizaci&oacute;n PEP...</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Hac&iacute;a poco
tiempo que su padre lo hab&iacute;a recogido en la cestita del r&iacute;o,
llevaba poco tiempo siendo un Pepo y por las expresiones y gestos que
Pepo hac&iacute;a creyeron sus padres al principio que era
ciertamente est&uacute;pido o, si no, por lo menos, un paral&iacute;tico
cerebral y le hicieron a Pepo pasar por diferentes pruebas para
averiguar cu&aacute;l era su problema.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>A &eacute;l le
contaban que la aldea necesitaba de su ayuda... Que sin &eacute;l
nada ser&iacute;a posible... Etc... Y Pepo acced&iacute;a a hacer
unos &quot;Trabajillos&quot; mientras sus padres tomaban notas sobre
su conducta y despu&eacute;s se los daban al sabio para que los
interpretar&aacute;. Una hoja de apuntes era algo parecido a:</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><!-- $MVD$:spaceretainer() -->&nbsp;</FONT></FONT></P>
<TABLE WIDTH=100% BORDER=0 CELLPADDING=2 CELLSPACING=0>
	<COL WIDTH=67*>
	<COL WIDTH=189*>
	<TR VALIGN=TOP>
		<TD WIDTH=26%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><B>Mision:</B></FONT></FONT></P>
		</TD>
		<TD WIDTH=74%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Contar estrellas
			segun colores.</FONT></FONT></P>
		</TD>
	</TR>
	<TR VALIGN=TOP>
		<TD WIDTH=26%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><B>Participa:</B></FONT></FONT></P>
		</TD>
		<TD WIDTH=74%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Pepo.</FONT></FONT></P>
		</TD>
	</TR>
	<TR VALIGN=TOP>
		<TD WIDTH=26%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><B>Observa:</B></FONT></FONT></P>
		</TD>
		<TD WIDTH=74%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Papotronico, su
			padre.</FONT></FONT></P>
		</TD>
	</TR>
	<TR VALIGN=TOP>
		<TD WIDTH=26%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><B>Comentarios:</B></FONT></FONT></P>
		</TD>
		<TD WIDTH=74%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>No solo no sabe
			contar mas alla del 2, sino que estuvo incesantemente confundiendo
			el rojo con el verde, el verde con el azul y el azul con el rojo.
			En cierto momento le oi decir que queria coger las estrellas para
			ponerlas en montones y contarlas mas tarde y empezo a estirarse
			tratando de cogerlas. Luego se comio a nuestro gato por
			equivocacion cuando iba a coger su bocadillo y para lavarse la
			boca la puso sobre la hierba y empezo a andar en circulos. Luego
			hablo el solo durante un momento discutiendo sobre el color de una
			estrella y despues se enzarzo en una pelea consigo mismo. Temo por
			su vida, cada dia que pasa tiene la cabeza mas dura por los
			pu&ntilde;etazos que se mete.</FONT></FONT></P>
		</TD>
	</TR>
	<TR VALIGN=TOP>
		<TD WIDTH=26%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><B>Conclusion del
			sabio:</B></FONT></FONT></P>
		</TD>
		<TD WIDTH=74%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Ese ni&ntilde;o es
			completamente estupido, no se de donde lo habran sacado, pero
			seria casi mejor que lo devolvieran, es un peligro para todos,
			incluso para el mismo.</FONT></FONT></P>
		</TD>
	</TR>
	<TR VALIGN=TOP>
		<TD WIDTH=26%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><B>Calificacion:</B></FONT></FONT></P>
		</TD>
		<TD WIDTH=74%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Tonto</FONT></FONT></P>
		</TD>
	</TR>
	<TR VALIGN=TOP>
		<TD WIDTH=26%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><B>Observaciones:</B></FONT></FONT></P>
		</TD>
		<TD WIDTH=74%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Sus posibilidades
			de ascension en la escala social se veran muy limitadas, por no
			decir imposibles.</FONT></FONT></P>
		</TD>
	</TR>
</TABLE>
<P><BR><BR>
</P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Confiando en la
capacidad de su reci&eacute;n adquirido hijo, la familia Papotr&oacute;nico
lo trat&oacute; como uno m&aacute;s desde el principio. Le aliment&oacute;
con las sobras de lo que ellos com&iacute;an, le escupi&oacute; en la
cara cuando ten&iacute;a sed, le pegaron palizas cuando se levantaban
de mal humor, le obligaban a ir a Misa todos los domingos y en caso
de que alguien en el poblado necesitar&aacute; un &oacute;rgano
ofrecer&iacute;an a Pepo como donante voluntario. Como al resto de la
familia, Papotr&oacute;nico, siempre le dec&iacute;a que no importaba
lo tonto que fuera, que lo &uacute;nico importante era que cuando
viera un Tino, lo matara. Si su padre se enterara de que en verdad
era hijo de un Tino probablemente no lo hubiera acogido, a lo mejor
incluso, lo hubiera matado. &Eacute;l odiaba a los Tinos. Mataron a
su abuelo a&uacute;n antes de la 1&ordf; Gran Guerra contra los Tinos
cuando &eacute;stos ten&iacute;an tan solo colonias en el planeta que
hab&iacute;an sido cedidas por los Pepos por un acuerdo por escrito
en el que los Tinos se compromet&iacute;an a no molestar para nada a
los Pepos y a alimentarse a partir de las miguitas de pan que los
Pepos tiraran en la plaza, pero en la pr&aacute;ctica nada de esto
val&iacute;a de nada y hab&iacute;a continuos altercados entre las
dos razas. Su abuelo muri&oacute; en una pelea en una taberna. &Eacute;l
aseguraba que el pollo m&aacute;s grande que nunca hab&iacute;a
comido era realmente el m&aacute;s grande del universo y un Tino que
estaba borracho de lentejas aseguraba que en su pa&iacute;s hab&iacute;a
pollos mucho m&aacute;s grandes, y que &eacute;l se los hab&iacute;a
comido a todos. R&aacute;pidamente empez&oacute; una pelea. El abuelo
era m&aacute;s d&eacute;bil, pero el Tino estaba completamente
borracho y sus movimientos eran muy lentos y torpes, pero de todas
maneras, bastante efectivos. Unos cuantos pu&ntilde;etazos...
Patadas... Y al final en un forcejeo el abuelo le desinfl&oacute; la
cabeza y salieron los dos volando por la ventana. Nunca m&aacute;s se
supo de ellos, cuando subieron a los 5.000 pies de altitud se les
perdi&oacute; el rastro.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Pero a lo que Pepo le
recordaba aquel d&iacute;a tan brillante era al d&iacute;a en el que
sus padres le encomendaron ir a vaciar el mar. Llevaba ya hechos
varios trabajos por aquella zona, pero ninguno de tanto calibre ni
tanta responsabilidad como ese. En verdad llevaban ya un tiempo
aprovech&aacute;ndose del pobre Pepo y todo trabajo que requiriese un
esfuerzo f&iacute;sico (Que no mental) en el &aacute;rea JF2 era
realizado por &eacute;l. Al levantarse el Sol por el horizonte Pepo
sali&oacute; a comenzar la operaci&oacute;n de vaciado mientras que
su padre se limitaba a observar y apuntar. El informe presentado para
el gran sabio fu&eacute; el siguiente:</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><!-- $MVD$:spaceretainer() -->&nbsp;</FONT></FONT></P>
<TABLE WIDTH=100% BORDER=0 CELLPADDING=2 CELLSPACING=0>
	<COL WIDTH=67*>
	<COL WIDTH=189*>
	<TR VALIGN=TOP>
		<TD WIDTH=26%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><B>Mision:</B></FONT></FONT></P>
		</TD>
		<TD WIDTH=74%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Vaciar el mar.</FONT></FONT></P>
		</TD>
	</TR>
	<TR VALIGN=TOP>
		<TD WIDTH=26%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><B>Participa:</B></FONT></FONT></P>
		</TD>
		<TD WIDTH=74%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Pepo.</FONT></FONT></P>
		</TD>
	</TR>
	<TR VALIGN=TOP>
		<TD WIDTH=26%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><B>Observa:</B></FONT></FONT></P>
		</TD>
		<TD WIDTH=74%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Papotronico, su
			padre.</FONT></FONT></P>
		</TD>
	</TR>
	<TR VALIGN=TOP>
		<TD WIDTH=26%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><B>Comentarios:</B></FONT></FONT></P>
		</TD>
		<TD WIDTH=74%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Despues de 7 dias
			por fin Pepo se decidio por el instrumento a utilizar para el
			vaciado. Despues de desechar la bomba de agua de 50 mega-tinos de
			potencia, el cubo gigante automatico y los 250 millones de
			instrumentos que su padre le habia comprado esplicitamente para el
			vaciado del mar decidio elegir un tenedor y un cuchillo. Puesto
			que la decision no podia ser de nadie que no fuera el se prosiguio
			con la operacion.<BR>Pepo intento durante varios dias cortar el
			agua una y otra vez para instantes despues intentar pincharla. De
			vez en cuando Pepo se ponia el tenedor y el cuchillo en la espalda
			y comenzaba a silvar hacia el cielo haciendose el despistado para
			instantes despues intentar cortar muy rapidamente el agua con
			resultados negativos.<BR>Muchas otras veces Pepo comenzaba a
			gritar y a apalear el agua de manera violenta.<BR>Despues de 5
			meses Pepo se dio cuenta de que nada le serviria cortarla asi que
			comenzo a echarla con el tenedor hacia el cielo con resultados,
			una vez mas, negativos.</FONT></FONT></P>
		</TD>
	</TR>
	<TR VALIGN=TOP>
		<TD WIDTH=26%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><B>Conclusion del
			sabio:</B></FONT></FONT></P>
		</TD>
		<TD WIDTH=74%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Es tonto, pero
			tonto, tonto, tonto.</FONT></FONT></P>
		</TD>
	</TR>
	<TR VALIGN=TOP>
		<TD WIDTH=26%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><B>Calificacion:</B></FONT></FONT></P>
		</TD>
		<TD WIDTH=74%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Tonto tonto</FONT></FONT></P>
		</TD>
	</TR>
	<TR VALIGN=TOP>
		<TD WIDTH=26%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2><B>Observaciones:</B></FONT></FONT></P>
		</TD>
		<TD WIDTH=74%>
			<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Tonto, tonto,
			tonto.</FONT></FONT></P>
		</TD>
	</TR>
</TABLE>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Muchas otras misiones
fueron encomendadas a Pepo pero ninguna con &eacute;xito. Al ver que
fallaba se decidi&oacute; comenzar desde el principio.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Se le encomend&oacute;
meter la cabeza en un cubo durante un periodo de tiempo pero Pepo no
lo logr&oacute;, met&iacute;a la cabeza pero luego se asustaba por no
ver nada y se lo quitaba rapidamente para asegurarse de que a&uacute;n
ve&iacute;a.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Otras veces olvidaba
donde estaba su cabeza e intentaba meter los pies.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Alguna que otra vez,
se supone que por la frustraci&oacute;n que todo aquello le
proporcionaba se puso una cortina rode&aacute;ndose el cuello y
comenz&oacute; a correr por la habitaci&oacute;n asegurando ser una
croqueta.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Los resultados estaban
m&aacute;s que claros y cada d&iacute;a la evidencia de que Pepo era
tonto del culo parec&iacute;a m&aacute;s cercana...</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Cierto d&iacute;a Pepo
fu&eacute; a la cocina a coger una bolsa de patatas qued&aacute;ndose
encerrado en el mueble por error (Crey&oacute; que era una bolsa de
patatas y se encerr&oacute; para mantenerse fresco y crujiente) y
all&iacute; se qued&oacute; durante largo tiempo. Intentando ver las
diferencias que hab&iacute;a entre el y las bolsas de patatas que le
rodeaban, pero despu&eacute;s de horas de ardua b&uacute;squeda no
encontr&oacute; ninguna as&iacute; que se qued&oacute; acurrucado
durante d&iacute;as deseando que alguien que quisiera patatas le
eligiera a &eacute;l antes que a las otras bolsas de al lado suyo sin
embargo esto jam&aacute;s ocurri&oacute;... la gente pasaba y cog&iacute;a
a las otras bolsas de patatas dejando al pobre Pepo ah&iacute;
sentado...</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Pero, ya estaba bien
de desaprovechar el tiempo con recuerdos del pasado... Hac&iacute;a
un d&iacute;a demasiado bueno como para desaprovecharlo de aquella
manera, la iluminaci&oacute;n de Zetoplasma, la temperatura c&aacute;lida
del ambiente... Pod&iacute;a decirse que era un d&iacute;a perfecto
all&iacute; en el planeta Pepo, de los que no pasan todos los d&iacute;as.
Sin embargo estaba siendo desaprovechado por todos sus habitantes que
corr&iacute;an y se persegu&iacute;an entre ellos sin raz&oacute;n
aparente. Pepo corri&oacute; por las calles esquivando los c&oacute;cteles
Pepotov que iban de un lado a otro de las calles tratando de llegar a
la plaza para desde all&iacute; lanzar un discurso a la naci&oacute;n,
pero una sandia le impact&oacute; en la cabeza y cay&oacute; al suelo
inconsciente... Sin reconocerle, los Pepos y Tinos segu&iacute;an
persigui&eacute;ndose y pisoteando de vez en cuando la cabeza del
pobre Pepo...</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Mientras tanto las
hordas de Tinos continuaban acerc&aacute;ndose al planeta. Las naves
se hab&iacute;an multiplicado por cien, a&ntilde;adi&eacute;ndose
naves de ataque, infinidad de transportadores con tropas tan
sofisticadas que ni siquiera ellos sab&iacute;an controlar y tambi&eacute;n
naves de repostaje de combustible, con lo que los pron&oacute;sticos
de llegada al planeta Pepo se quedaron en pocas semanas.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Pepo despert&oacute;
al cabo de un rato. Estaba en un lugar extra&ntilde;o... Hab&iacute;a
Chupa-Chups colgando del techo, dos &aacute;rboles de gominola en la
puerta y un intenso olor a fabada y chistorra perfumaban la sala.
Pepo sinti&oacute; una paz interior que no sent&iacute;a desde su
conversi&oacute;n a Superpepo.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Se le acerc&oacute; un
calvo:</FONT></FONT></P>
<P><FONT COLOR="#00ffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
Hola helmano.</FONT></FONT></FONT></P>
<P><FONT COLOR="#ff0000"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
Ehh... &iquest;Qui&eacute;n eres? &iquest;Qu&eacute; quieres? &iquest;Qu&eacute;
hago aqu&iacute;? &iquest;Por qu&eacute; soy tan est&uacute;pido?
&iquest;C&oacute;mo puedo lavar las manchas de pintura en la ropa
delicada? &iquest;Como...?.</FONT></FONT></FONT></P>
<P><FONT COLOR="#00ffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
No te pleocupes pol nada. Soy un monje Tinotano, aqu&iacute;
encontlalas la paz espilitual de tu alma y cuelpo. S&iacute;gueme.</FONT></FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Pepo se levant&oacute;
sin dudarlo dos veces de la cama espiritual en la que los monjes
Tinotanos le hab&iacute;an tumbado y sigui&oacute; al misterioso
calvo por los largos pasillos del monasterio. Seg&uacute;n iba
avanzando el olor a fabada y chistorra fue dejando paso a un
agradable olor a chorizo y salchich&oacute;n. Cuando el olor se hizo
tan intenso que casi pod&iacute;an verse las rodajas de salchich&oacute;n
volando en el aire le dijo el calvo:</FONT></FONT></P>
<P><FONT COLOR="#00ffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
Helmano, esta es tu habitaci&oacute;n espilitual. Entla y acom&oacute;date.</FONT></FONT></FONT></P>
<P><FONT COLOR="#ff0000"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
Pero... ese olor... &iexcl;&iexcl;&iexcl;SALCHICH&Oacute;N!!!, &iexcl;&iexcl;QU&Eacute;
DETALLE!!, &iexcl;&iexcl;HAB&Eacute;IS TAPIZADO MI HABITACI&Oacute;N
CON SALCHICH&Oacute;N!!, &iexcl;&iexcl;INCLUSO LOS MUEBLES!!, &iexcl;&iexcl;QUE
GOZADA!!, &iexcl;MUCHAS GRACIAS!.</FONT></FONT></FONT></P>
<P><FONT COLOR="#00ffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
No tienes pol que d&aacute;lnoslas. Solo deseamos lo mejol pala
nuestlos visitantes espilituales. Espela divilt&iacute;endote como
puedas hasta la hola del t&eacute; espilitual. Tienes toda la
tlilog&iacute;a de pel&iacute;culas de los Powel Langels debajo de la
almohada. Adi&oacute;s helmano.</FONT></FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Aquello le parec&iacute;a
un sue&ntilde;o a Pepo. Por fin ten&iacute;a una habitaci&oacute;n
tapizada con salchich&oacute;n como siempre hab&iacute;a querido, que
tantas veces pidi&oacute; a sus padres y que nunca pudo crear en las
alcantarillas cuando creaba las figuritas porque ensimismado en la
creaci&oacute;n sin l&iacute;mite no ten&iacute;a tiempo para tapizar
nada. A&uacute;n as&iacute; ni siquiera en sus sue&ntilde;os habr&iacute;a
sido capaz nunca de imaginarse una habitaci&oacute;n tan maravillosa,
porque no solo ten&iacute;a las paredes de salchich&oacute;n, sino
que los muebles eran de una aleaci&oacute;n de chorizo y salchich&oacute;n
muy resistente y hab&iacute;a una gran pila de salchich&oacute;n
sobre la mesa sin duda disponible para que Pepo pudiera continuar con
su creaci&oacute;n de figuritas. Se sent&oacute; en la c&oacute;moda
(y pringosa) silla de chorizo y pas&oacute; el rato creando figuritas
de salchich&oacute;n que despu&eacute;s derribaba de un manotazo, se
com&iacute;a el salchich&oacute;n, lo escup&iacute;a, y de nuevo
vuelta a empezar.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Ya no ten&iacute;a la
misma magia que antes creando figuritas de salchich&oacute;n, le
faltaba algo. Quiz&aacute; lo &uacute;nico que podr&iacute;a ayudarle
a continuar con su proyecto de creaci&oacute;n de figuritas ser&iacute;a
descifrar el enigma que hab&iacute;a creado en las alcantarillas
juntando todas las figuritas que hab&iacute;a creado, es decir, la
imagen de &eacute;l mismo con la cabeza de un Tino y la inscripci&oacute;n:
&quot;&Uacute;nete a tu gran padre, el GRAN CABEZA&quot;.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Comprendiendo esto
dej&oacute; de crear figuritas y se tumb&oacute; en su c&oacute;moda
cama de salchich&oacute;n a recapacitar, pero cuando se dispon&iacute;a
a activar su cerebro, que llevaba toda su vida sin ser activado,
entr&oacute; el calvo en la habitaci&oacute;n y le invit&oacute; a
tomar el t&eacute; espiritual:</FONT></FONT></P>
<P><FONT COLOR="#00ffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
Hola helmano. Veo que ya has complendido tu futulo, pelo a&uacute;n
no has asimilado tu pasado. S&iacute;gueme hasta la habitaci&oacute;n
espilitual pala tomal el t&eacute; y te explical&eacute; todo m&aacute;s
detenidamente.</FONT></FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Y le sigui&oacute;
fuera de la habitaci&oacute;n, bajando unas escaleras de caracol de
varios centenares de escalones, a trav&eacute;s de intrigantes
puertas con cerrojos y claves secretas y por fin llegaron hasta la
puerta en la que un cartel advert&iacute;a &quot;SALA DE T&Eacute;
ESPILITUAL, SE PLOHIBE LA ENTLADA A MENOLES DE 4 CABEZAS DE VACA&quot;.
Al ver esto Pepo tuvo que decir:</FONT></FONT></P>
<P><FONT COLOR="#ff0000"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
&iexcl;Me dej&eacute; las cabezas de vaca en la alcantarilla! &iexcl;&iexcl;Tengo
que volver por ellas!!.</FONT></FONT></FONT></P>
<P><FONT COLOR="#00ffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
No te pleocupes helmano, aqu&iacute; todos conocemos tu histolia
pasada, plesente y futula. No nos hacen falta tus cabezas de vaca
pala sabel que existen. Pasa pol favol.</FONT></FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Y entraron en la sala.
Aqu&iacute; el olor a chorizo y salchich&oacute;n no se apreciaba ya,
solo el t&eacute; era lo &uacute;nico que se pod&iacute;a oler, ver,
tocar, oir y comer en esa sala. Las paredes y muebles estaban hechas
de t&eacute;, ol&iacute;a a t&eacute; y tamb&iacute;en sonaba a t&eacute;
la habitaci&oacute;n. Le pareci&oacute; muy extra&ntilde;o a Pepo
todo esto.</FONT></FONT></P>
<P><FONT COLOR="#00ffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
No te pleocupes pol nada. El t&eacute; no puede hacelte da&ntilde;o,
al menos no mientlas no le insultes. Pelo ahola si&eacute;ntate en tu
silla de t&eacute; espilitual que tengo algo que contalte.</FONT></FONT></FONT></P>
<P><FONT COLOR="#ff0000"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
&iquest;Algo sobre qu&eacute;?.</FONT></FONT></FONT></P>
<P><FONT COLOR="#00ffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
Algo soble t&iacute;. Algo soble tu familia, tu pueblo, tu histolia.
&iquest;Quieles que te lo cuente o vas a hacel como aquel flacasado
que vino aqu&iacute; hace tiempo?</FONT></FONT></FONT></P>
<P><FONT COLOR="#ff0000"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
&iquest;Qu&eacute; fracasado?.</FONT></FONT></FONT></P>
<P><FONT COLOR="#00ffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
Un tal Constantino Lamos Bl&aacute;s. Vino hasta aqu&iacute; desde
lejanas tielas con un peine m&aacute;gico, una calabaza gigante y una
plaquita en la que pon&iacute;a &quot;YO SOY EL M&Aacute;S EST&Uacute;PIDO&quot;
y pletend&iacute;a que le dielamos pol el mismo plecio paz espilitual
y chocolate con chulos.</FONT></FONT></FONT></P>
<P><FONT COLOR="#ff0000"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
&iquest;Y que pas&oacute;?.</FONT></FONT></FONT></P>
<P><FONT COLOR="#00ffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
Al final accedimos y nos quedamos con su peine m&aacute;gico a cambio
de que le contalamos su futulo, pelo cuando lo hicimos no nos quiso
cleer y se lalg&oacute; lejos de aqu&iacute;, al otlo monastelio
Tinotano de al otlo lado de las monta&ntilde;as. Esos no palan de
quitalnos los clientes. &iexcl;&iexcl;Si tuviela unas tenazas le
cogelia de las p...!!.</FONT></FONT></FONT></P>
<P><FONT COLOR="#ff0000"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
&iquest;Tan terrible era su futuro? &iquest;Qu&eacute; dec&iacute;a?.</FONT></FONT></FONT></P>
<P><FONT COLOR="#00ffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
No te lo puedo decil todav&iacute;a. Alg&uacute;n d&iacute;a lo
adivinalas tu solito, ya que vuestlas vidas est&aacute;n
espilitualmente unidas pol lazos entle las estlellas...</FONT></FONT></FONT></P>
<P><FONT COLOR="#ff0000"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
&iquest;Qu&eacute;?.</FONT></FONT></FONT></P>
<P><FONT COLOR="#00ffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
Quielo decil que te vayas al otlo monastelio a pleguntal, yo no me
acueldo ni de lo que he hecho esta ma&ntilde;ana...</FONT></FONT></FONT></P>
<P><FONT COLOR="#ff0000"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
&iquest;No me iba a contar la historia de mi vida?.</FONT></FONT></FONT></P>
<P><FONT COLOR="#00ffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
Ah, si, pelo debel&iacute;as tlael contigo a Constantino pala que
entiendas mejol lo que te voy a contal, pala que &eacute;l complenda
que lo que le dije ela cielto y, soble todo, pala ganal el doble de
pasta. Toma, ll&eacute;vate su peine m&aacute;gico, aqu&iacute; ya no
quedan ancianitas a las que electlocutal, as&iacute; sabl&aacute; que
vas en selio. Adem&aacute;s, el peine a m&iacute; no me selvil&iacute;a
de mucho...</FONT></FONT></FONT></P>
<P><FONT COLOR="#ff0000"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
Muchas gracias, se&ntilde;or...</FONT></FONT></FONT></P>
<P><FONT COLOR="#00ffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
Rodolfo Ratorriv&aacute;ceo</FONT></FONT></FONT></P>
<P><FONT COLOR="#ff0000"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
Un momento... &iexcl;&iexcl;Has dicho tres erres!!!</FONT></FONT></FONT></P>
<P><FONT COLOR="#00ffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
Eeeh... ehhh... peque&ntilde;o saltamontes... cleo que tienes que
ilte l&aacute;pido.</FONT></FONT></FONT></P>
<P><FONT COLOR="#ff0000"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
Pero...</FONT></FONT></FONT></P>
<P><FONT COLOR="#00ffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
Vete.</FONT></FONT></FONT></P>
<P><FONT COLOR="#ff0000"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
Pero...</FONT></FONT></FONT></P>
<P><FONT COLOR="#00ffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>-
&iexcl;&iexcl;CO&Ntilde;O!!, &iexcl;&iexcl;&iexcl;QUE TE VAYAS!!!,
&iexcl;&iexcl;&iexcl;&iquest;ES QUE HAY QUE DEC&Iacute;RTELO TODO
CUATRO VECES O QU&Eacute;?!!!.</FONT></FONT></FONT></P>
<P ALIGN=LEFT><FONT COLOR="#febf01"><FONT FACE="Arial, sans-serif"><FONT SIZE=2><B>Pepo
sali&oacute; corriendo de la sala del t&eacute; espiritual, no sin
antes haberse bebido una mesa entera, y sali&oacute; del monasterio
Tinotano a la calle principal. Ten&iacute;a que encontrar a
Constantino...</B></FONT></FONT></FONT></P>
<P>&nbsp;</P>
<P ALIGN=RIGHT STYLE="margin-bottom: 0cm"><FONT FACE="Arial"><FONT SIZE=2>CONTINUARA....</FONT></FONT></P>
<P ALIGN=RIGHT STYLE="margin-bottom: 0cm"><BR>
</P>
<P ALIGN=RIGHT STYLE="margin-bottom: 0cm"><!-- StartFragment --><FONT SIZE=2><FONT FACE="Arial, sans-serif">Ivan
Ramirez - </FONT></FONT><A HREF="mailto:ivanr@arrakis.es"><FONT SIZE=2><FONT FACE="Arial, sans-serif">ivanr@arrakis.es</FONT></FONT></A></P>
<P ALIGN=RIGHT STYLE="margin-bottom: 0cm"><FONT SIZE=2><FONT FACE="Arial, sans-serif">Ivan
Salmeron - </FONT><A HREF="mailto:davivan@mad.servicom.es"><FONT FACE="Arial, sans-serif">davivan@mad.servicom.es</FONT></A></FONT></P>
<P ALIGN=RIGHT STYLE="margin-bottom: 0cm"><FONT SIZE=2><FONT FACE="Arial, sans-serif">WWW
- </FONT><A HREF="http://members.dencity.com/ivansoft"><FONT FACE="Arial, sans-serif">http://members.dencity.com/ivansoft</FONT></A></FONT></P>
<P><BR><BR>
</P>
<P><!-- EndFragment --><!-- EndFragment --></P>
</BODY>
</HTML>