<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<TITLE></TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice/5.1 (Win32)">
	<META NAME="AUTHOR" CONTENT="Miguel Angel Nieto Salazar">
	<META NAME="CREATED" CONTENT="20000326;16431037">
	<META NAME="CHANGEDBY" CONTENT="Miguel Angel Nieto Salazar">
	<META NAME="CHANGED" CONTENT="20000326;16534894">
</HEAD>
<BODY BGCOLOR="#000000">
<center><P><IMG SRC="caly.jpg" NAME="Imagen1"><BR CLEAR=RIGHT><BR><BR></center>
</P>
<P><FONT COLOR="#ffffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>El
servicio mas utilizado por los internautas, es sin ning&uacute;n
lugar a dudas el correo electr&oacute;nico. Miles y miles de mensajes
dando vueltas de aqu&iacute; para alla, buscando su destinatario.
Para todos estos mensajes es necesario un programa que se encargue de
recogerlos, analizarlos, agruparlos y archivarlos, aqu&iacute; es
donde entran los gestores de correo electr&oacute;nico. Todos estamos
acostumbrados a usar el Outlook Express, Netscape Messenger, Eudora,
Pegasus Mail, etc. los dos primeros porque pertenecen a dos
navegadores de internet y que por comodidad se suelen utilizar con
asiduidad, y los dos &uacute;ltimos por su ya probada calidad. Pero
esto tiene un problema, y es que siempre nos olvidamos de otros, que
por ser menos populares y no disponer del dinero suficiente para
publicitarse tienen que ser relegados a un segundo plano. Dentro de
este ultimo tipo de gestores, aunque no lo parezca, se encuentran los
mejores de todos. En este caso, el gestor de correo es el Calypso, de
Micro Computing Systems, en su versi&oacute;n 3.1 para windows va a
ser analizado en esta secci&oacute;n, &#147;Lo mejor de shareware&#148;.</FONT></FONT></FONT></P>
<P><BR><BR>
</P>
<P><IMG SRC="calyp.gif" NAME="Imagen2" ALIGN=LEFT HSPACE=4 VSPACE=4 WIDTH=350 HEIGHT=263 BORDER=0><FONT SIZE=2><FONT FACE="Arial, sans-serif"><FONT COLOR="#ffffff">Este
gestor, que se puede bajar desde la web </FONT></FONT></FONT><A HREF="http://www.mcsdallas.com/"><FONT SIZE=2><FONT FACE="Arial, sans-serif"><FONT COLOR="#ffffff">http://www.mcsdallas.com/</FONT></FONT></FONT></A><FONT SIZE=2><FONT FACE="Arial, sans-serif"><FONT COLOR="#ffffff">
lo encontr&eacute; por casualidad. En un principio desde su
instalaci&oacute;n, el aspecto general del programa es un poco tosco,
y puede dar miedo a los usuario noveles, pero pasado este primer
impacto, su uso es sencillo. Desde una interface sin ning&uacute;n
tipo de adornos, se puede encontrar los botones mas utilizados,
responder, redactar mensaje, guardar mensaje, imprimir, eliminar,
etc. </FONT></FONT></FONT>
</P>
<P><FONT COLOR="#ffffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>El
programa se divide en tres ventanas. En la primera de ellas
(arriba-izquierda) tenemos acceso con un solo clic a todas nuestras
cuentas de correo, la papelera, la libreta de direcciones, los
contestadores autom&aacute;ticos, etc. De esta forma nos podemos
ahorrar un buen mont&oacute;n de clics, y as&iacute; poder acceder a
lo mas esencial de una forma r&aacute;pida y sin complicaciones. La
segunda ventana que se puede observar (arriba-derecha) tenemos una
lista con todos los mensajes, y cada uno con toda la informaci&oacute;n
necesaria comprimida en el m&iacute;nimo espacio posible. Con un solo
vistazo sabremos cuando nos ha sido enviado el e-mail, quien lo
env&iacute;o, a quien va dirigido, a que cuenta de correo pertenece
(si disponemos de varias), asunto, tama&ntilde;o, etc. Por ultimo, en
la ultima ventana podremos leer los mensajes que seleccionemos en la
ventana anterior.</FONT></FONT></FONT></P>
<P><FONT COLOR="#ffffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Como
se puede ver, aunque su aspecto exterior no sea muy agradable a
primera vista, esta muy bien estructurado, donde prima la sencillez
de uso y la posibilidad de acceder a todo lo que queramos sin tener
que andar buscando entre men&uacute;s y dem&aacute;s chorradas.</FONT></FONT></FONT></P>
<P><FONT COLOR="#ffffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Dejando
a un lado su aspecto exterior, despu&eacute;s de unos minutos de uso,
podemos darnos cuenta de la gran cantidad de opciones que posee.
Podemos gestionar infinitas cuentas de correo electr&oacute;nico,
como si de una sola se tratase. De esta forma ya no ser&aacute;
necesario y bajandose el correo de cuenta en cuenta. Pero cada cuenta
se configura de forma independiente. As&iacute; podemos tener una
firma diferente para cada cuenta, crear contestadores autom&aacute;ticos
para cada cuenta, filtrado de mensajes, etc. Estas dos ultimas son
las mas importantes. Como todos sabemos, el Spam es pan nuestro de
cada d&iacute;a, y Calypso nos ofrece una forma muy sencilla de
acabar con el. Pero tambi&eacute;n se puede usar para otras cosas,
como abrir un determinado programa, mover el mensaje a una carpeta, o
cualquier cosa que nosotros queramos, si en el mensaje aparece tal
palabra, en la cabecera una frase determinada, si el tama&ntilde;o es
de xx Kbs, etc. El otro punto importante es la posibilidad de crear
contestadores autom&aacute;ticos para cada cuenta, de forma que cada
vez que nos llegue un mensaje a esa cuenta, calypso env&iacute;e un
mensaje inmediatamente al remitente, un mensaje que nosotros
definiremos, como no.</FONT></FONT></FONT></P>
<P><BR><BR>
</P>
<P ALIGN=LEFT><IMG SRC="libreta.jpg" NAME="Imagen3" ALIGN=RIGHT HSPACE=4 VSPACE=4 WIDTH=300 HEIGHT=270 BORDER=0><FONT COLOR="#ffffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Otro
punto importante en cualquier gestor de correo, y que no se debe
descuidar, es la libreta de direcciones, ese apartado que en otros
programas dan tantos problemas. En este caso, la gesti&oacute;n de
todas las direcciones de los amigos/as, es muy sencillo. Los
contactos se pueden distribuir en diferentes grupos, pudiendo as&iacute;
separar, por ejemplo, los amigos de tu poblaci&oacute;n, de los
amigos del pueblo de al lado :) Los contactos se pueden eliminar y
crear de una manera muy r&aacute;pida, y si lo que deseas es importar
la libreta de direcciones, no tendr&aacute;s ning&uacute;n problema,
ya que calypso permite importar todas las direcciones de otros
gestores. Tambi&eacute;n puede configurar la libreta, de forma que
todos los remitentes de los mensajes que te leguen a tu ordenador
ser&aacute;n incluidos autom&aacute;ticamente en la libreta,
ahorrandote as&iacute; mucho tiempo. Tambi&eacute;n puedes hacer lo
mismo con los mensajes qu&eacute; env&iacute;es, pudiendo a&ntilde;adir
directamente a la libreta a todas las personas a las que env&iacute;es
un e-mail.</FONT></FONT></FONT></P>
<P ALIGN=LEFT><FONT COLOR="#ffffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Dejando
a un lado la libreta de direcciones nos centraremos en la composici&oacute;n
de los mensajes. Un punto muy a tener en cuenta es la compatibilidad
de calypso con PGP, de forma que todos nuestros mensajes sean 99%
seguros. Gracias a esta compatibilidad, se pueden firmar y cifrar
mensajes con PGP de forma totalmente autom&aacute;tica, y
desencriptarlos de forma autom&aacute;tica cuando estos entren en
nuestro ordenador.</FONT></FONT></FONT></P>
<P ALIGN=LEFT><FONT COLOR="#ffffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Con
respecto a la composici&oacute;n de mensajes, como ya os imaginareis,
se puede hacer en HTML o TXT puro. Aqu&iacute; se pueden encontrar
las opciones de siempre, adjuntar archivos, incluir firma, etc. Como
en todos los gestores de correo decentes, incluye un corrector
ortogr&aacute;fico, para todos a los que la ortograf&iacute;a les
suponga un grave problema (yo soy un ejemplo). En la versi&oacute;n
que nos bajamos directamente de internet solo se incluye un
diccionario de ingles, por lo que es necesario bajarse el del espa&ntilde;ol
desde otra web que se indica en el archivo de ayuda del programa.</FONT></FONT></FONT></P>
<P ALIGN=LEFT><FONT COLOR="#ffffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Otro
aspecto importante que no se suele tener mucho en cuenta en estos
programas, es la seguridad de nuestro mensajes. En este caso, calypso
es multiusuario, me explico. Si tu y tu hermano antes usabais el
outlook, por ejemplo, el pod&iacute;a leer tus mensajes, recogerlos,
eliminarlos, y tu lo mismo con los suyos (que menos). Ahora esto ya
no ser&aacute; posible. Cada persona que tenga acceso al programa
dispondr&aacute; de una clave, de forma que cada usuario al entrar al
programa con su clave lo tendr&aacute; todo perfectamente
configurado, con sus mensajes en su sitio y todo muy bonito. De esta
forma cada usuario puede configurar el programa a su gusto, sin
molestar a los dem&aacute;s y siendo totalmente imposible acceder a
la configuraci&oacute;n y a los mensajes de su hermanito mayor :)</FONT></FONT></FONT></P>
<P ALIGN=LEFT><FONT COLOR="#ffffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Continuando
con la seguridad, al calypso no le gusta que por un fallo tonto del
windows, el usuario pierda todos sus mensajes, y para eso que mejor
que copias de seguridad. El programa puede, a gusto del usuario,
hacer copias de seguridad de todos los mensajes, libretas, etc. cada
x d&iacute;as, o cada x veces que el usuario a arrancado el programa,
de forma que nuestros datos estar&aacute;n siempre seguros y no
tendremos la oportunidad de darnos ning&uacute;n susto al ver que
todos los mensajes han desaparecido por arte de magia.</FONT></FONT></FONT></P>
<P ALIGN=LEFT><FONT COLOR="#ffffff"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Y
este es a grandes rasgo el Calypso, un gestor de correo shareware,
que esta muy por encima de otros que gozan de mas fama. Todo lo
explicado aqu&iacute; es solo la punta del iceberg, un an&aacute;lisis
mas a fondo os lo dejo a vosotros, lectores de binary zone :), ya que
sino este articulo seria demasiado extenso. Espero que con este
an&aacute;lisis os hay&aacute;is dado cuenta que existen muchos
programas que pueden quitar el puesto f&aacute;cilmente a otros de
gran renombre por la marca que las respalda, solo hay que saber
buscar o tener suerte.. y encontraras joyas como esta.</FONT></FONT></FONT></P>
<P ALIGN=LEFT><BR><BR>
</P>
<P ALIGN=LEFT STYLE="margin-bottom: 0cm"><BR>
</P>
<CENTER>
	<TABLE WIDTH=476 BORDER=1 BORDERCOLOR="#000000" CELLPADDING=2 CELLSPACING=0>
		<COL WIDTH=299>
		<COL WIDTH=167>
		<TR>
			<TD WIDTH=299 BGCOLOR="#000080">
				<P ALIGN=CENTER><FONT COLOR="#ffffff"><FONT FACE="Arial"><U><B>Caracter&iacute;sticas
				del programa analizado</B></U></FONT></FONT></P>
			</TD>
			<TD WIDTH=167 VALIGN=TOP></TD>
		</TR>
		<TR>
			<TD WIDTH=299 BGCOLOR="#8080ff">
				<P><FONT COLOR="#000000"><FONT FACE="Arial"><FONT SIZE=2><B>Nombre
				del programa</B></FONT></FONT></FONT></P>
			</TD>
			<TD WIDTH=167 BGCOLOR="#8080ff">
				<P ALIGN=CENTER><FONT COLOR="#ffffff"><FONT FACE="Arial"><FONT SIZE=2><B>Calypso</B></FONT></FONT></FONT></P>
			</TD>
		</TR>
		<TR>
			<TD WIDTH=299 BGCOLOR="#8080ff">
				<P><FONT COLOR="#ffffff"><FONT FACE="Arial"><FONT SIZE=2><B>Versi&oacute;n</B></FONT></FONT></FONT></P>
			</TD>
			<TD WIDTH=167 BGCOLOR="#8080ff" SDVAL="3,1" SDNUM="3082;">
				<P ALIGN=CENTER><FONT COLOR="#000000"><FONT FACE="Arial"><FONT SIZE=2><B>3,1</B></FONT></FONT></FONT></P>
			</TD>
		</TR>
		<TR>
			<TD WIDTH=299 BGCOLOR="#8080ff">
				<P><FONT COLOR="#000000"><FONT FACE="Arial"><FONT SIZE=2><B>Idioma</B></FONT></FONT></FONT></P>
			</TD>
			<TD WIDTH=167 BGCOLOR="#8080ff">
				<P ALIGN=CENTER><FONT FACE="Arial"><FONT SIZE=2><B>Ingles</B></FONT></FONT></P>
			</TD>
		</TR>
		<TR>
			<TD WIDTH=299 BGCOLOR="#8080ff">
				<P><FONT COLOR="#ffffff"><FONT FACE="Arial"><FONT SIZE=2><B>Tama&ntilde;o
				del ejecutable</B></FONT></FONT></FONT></P>
			</TD>
			<TD WIDTH=167 BGCOLOR="#8080ff">
				<P ALIGN=CENTER><FONT COLOR="#000000"><FONT FACE="Arial"><FONT SIZE=2><B>4,31
				Mb</B></FONT></FONT></FONT></P>
			</TD>
		</TR>
		<TR>
			<TD WIDTH=299 BGCOLOR="#8080ff">
				<P><FONT COLOR="#000000"><FONT FACE="Arial"><FONT SIZE=2><B>Modalidad</B></FONT></FONT></FONT></P>
			</TD>
			<TD WIDTH=167 BGCOLOR="#8080ff">
				<P ALIGN=CENTER><FONT FACE="Arial"><FONT SIZE=2><B>Shareware</B></FONT></FONT></P>
			</TD>
		</TR>
		<TR>
			<TD WIDTH=299 BGCOLOR="#8080ff">
				<P><FONT COLOR="#ffffff"><FONT FACE="Arial"><FONT SIZE=2><B>Web
				peich</B></FONT></FONT></FONT></P>
			</TD>
			<TD WIDTH=167 BGCOLOR="#8080ff">
				<P ALIGN=CENTER><A HREF="http://www.mcsdallas.com/"><FONT SIZE=2><FONT FACE="Arial, sans-serif"><FONT COLOR="#ffffff">http://www.mcsdallas.com/</FONT></FONT></FONT></A><FONT SIZE=2><FONT FACE="Arial, sans-serif"><FONT COLOR="#ffffff">
				</FONT></FONT></FONT>
				</P>
			</TD>
		</TR>
	</TABLE>
</CENTER>
</P>
<P ALIGN=RIGHT><A HREF="mailto:punisher@linuxfan.com"><IMG SRC="Punish07.gif" NAME="Imagen4" ALIGN=RIGHT WIDTH=384 HEIGHT=224 BORDER=0><BR CLEAR=RIGHT></A><BR><BR>
</BODY>
</HTML>