<HTML>
<HEAD>
<TITLE>.pt zine 02 - WWWBoard hacking</TITLE>
</HEAD>
<BODY BGCOLOR="Black" TEXT="#000000" LINK="Green" VLINK="Red">
<IMG SRC="pt_small.gif" WIDTH=452 HEIGHT=81 BORDER=0>
<BR>
<FONT SIZE="3" FACE="Arial" COLOR="#FFC639">
<B>WWWBoard hackin</B>g<BR>
------------------------------
<BR>
by: KrazyBoy of the World.

<P>


Este exploit vai directamente para aqueles que se auto intitulam hackers, mas que na realidade, pouco conseguiram ainda fazer para que isso se lhes pudesse chamar.
<BR>
Finalmente v&atilde;o conseguir fazer algo para falar aos vossos amigos. Neste sec&ccedil;&atilde;o, vou tentar fazer uma breve descri&ccedil;&atilde;o de como hackar um site com WWWBOARD. <BR>
Para quem n&atilde;o sabe, uma Internet Board, &eacute; basicamente como um newsgroup (se nem sequer sabem o que &eacute; um newsgroup, ent&atilde;o, acho que n&atilde;o deviam andar por estas bandas!!!!). <BR>
Existe um tema e tudo gira &agrave; volta dum ciclo de perguntas e respostas. O interessante neste tipo de "servi&ccedil;o", &eacute; que raramente os Administradores que gerem a Board, se preocupam muito com a seguran&ccedil;a. Ent&atilde;o, &eacute; muitas vezes f&aacute;cil conseguir "furar" o sistema, e mudar tudo completamente. Desde apagar mensagens ou mudar o tema, at&eacute; colocar um link que redirecciona quem l&aacute; vai para outro site. Claro, que n&atilde;o estou a dizer para fazerem isto mal consigam hackar uma. &Eacute; que a protec&ccedil;&atilde;o e a seguran&ccedil;a s&atilde;o coisas muito relativas, e nunca se sabe o rastro que podemos ter ou n&atilde;o deixado ficar para tr&aacute;s.
<BR>
Ali&aacute;s, nunca aconselho a fazer tal coisa, excepto se se impuser uma quest&atilde;o moral. Se estiverem em completo desacordo com o tema que o Administrador gere na Board, por exemplo. Muitas vezes, &eacute; uma boa raz&atilde;o. &Eacute; que ir para a cadeia meramente porque se estava &agrave; procura de uma realiza&ccedil;&atilde;o pessoal… n&atilde;o tem l&aacute; muita piada. Mas, vamos l&aacute; saber como se consegue obter o controlo da WWWBOARD. <BR>
Como &eacute; obvio, para o conseguir &eacute; necess&aacute;rio uma qualquer tipo de ficheiro de passwords. O ficheiro que procuramos chama-se passwd.txt e sofre de uma particularidade muito interessante. O algoritmo de encriptamento &eacute; o mesmo que o UNIX utiliza para codificar as password dos utilizadores do sistema. Mas, ao contr&aacute;rio deste, o ficheiro passwd.txt costuma apenas conter uma entrada, que &eacute; a do Administrador da Board. Mas, antes de tudo, p&otilde;em-se a quest&atilde;o de como se vai fazer para obter o tal ficheiro. Onde encontr&aacute;-lo??? Geralmente, e por op&ccedil;&atilde;o default, encontra-se no direct&oacute;rio "root" da
pr&oacute;pria WWWBOARD. <BR>
Vamos exemplificar com o URL: http://www.krazyboy.com/programas/boards/music/wwwboard/ (nem se cansem porque na realidade este site n&atilde;o existe J). Por vezes, entrando um endere&ccedil;o na mesma forma que este, ou seja,
http://www.&lt;domain&gt;/directory/directory/…/wwwboard/, far&aacute; com o browser
apresente todos os ficheiros existentes no direct&oacute;rio. Logo, seria f&aacute;cil clicar com o rato sobre o ficheiro passwd.txt para obter o login e a password do administrador. Mas nem sempre isso acontece. A maior parte das vezes, o que se obtem &eacute; um redirecionamente para uma p&aacute;gina default, tipo index.html. Mas n&atilde;o h&aacute; motivo para alarmes, porque isso nem de perto nem de longe vai dificultar o processo de Hackar a Board. Basta apenas "pedir" ao browser que nos apresente especificamente o cont&eacute;udo do ficheiro passwd.txt de uma forma muito simples, tipo
http://www.&lt;domain&gt;/directory/directory/…/wwwboard/passwd.txt. O resultado ser&aacute; algo como:
<P>
WebAdmin:aepTOqxOi4i8U
<P>
Como &eacute; obvio, o primeiro campo &eacute; o username do administrador, WebAdmin, e o segundo &eacute; a sua password devidamente codificada. Logo, neste momento torna-se evidente a necessidade de um programa que a v&aacute; crackar.
Os que recomendo s&atilde;o sem d&uacute;vida o CrackerJack ou o John the Ripper por serem de longe os mais r&aacute;pidos que por a&iacute; andam. Mas, antes de os poder utilizar tem que se colocar a informa&ccedil;&atilde;o a crackar de uma forma "especial", tal como WebAdmin:aepTOqxOi4i8U:0:0:KrazyBoy:/:/bin/csh, para a&iacute; sim, o programa reconhecer a password como pertencente a um campo do ficheiros das passwords do UNIX……………………………….
<BR>
Depois de alguns minutos, horas ou dias de espera, ap&oacute;s terem finalmente conseguido obter a password do administrador, h&aacute; que descobrir onde a utilizar. Os ficheiros m&aacute;gicos a procurar no direct&oacute;rio da WWWBOARD s&atilde;o os ficheiros WWWADMIN.CGI ou WWWADMIN.PL ou WWWBOARD.CGI ou at&eacute; WWWBOARD.PL. Para aqueles que conseguem obter a listagem do conte&uacute;do do direct&oacute;rio da WWWBOARD, n&atilde;o se deixem enganar se n&atilde;o encontrarem nenhum destes ficheiros.
Eles podem na verdade n&atilde;o existir, sendo ent&atilde;o substitu&iacute;dos por outros com a mesma funcionalidade, mas, geralmente eles est&atilde;o apenas escondidos, n&atilde;o sendo ent&atilde;o poss&iacute;vel clicar neles para os executar. Simplesmente fa&ccedil;am o mesmo que fizeram no caso do ficheiro passwd.txt. Ou seja, deste vez fa&ccedil;am http://www.&lt;domain&gt;/directory/directory/…/wwwboard/&lt;um dos quatro ficheiros referidos&gt;. Tudo muito f&aacute;cil, muito linear para se obter um resultado satisfat&oacute;rio.
<P>
 O resto explica-se por si mesmo… O programa apresenta ao utilizador uma lista de op&ccedil;&otilde;es que este pode mandar executar mediante o login e a password que obteram pelo processo acima. Uma dica: n&atilde;o se ponham a apagar ficheiros porque por vezes existe muita gente dependente da WWWBOARD… Fa&ccedil;am coisas mais divertidas, como por exemplo, leiam as mensagens escondidas. Costumam ter, geralmente, muita informa&ccedil;&atilde;o interessante…
<P> 
	Uma dica… Se n&atilde;o souberem de nenhuma WWWBOARD, v&atilde;o at&eacute; ao altavista, ou outro qualquer motor de busca, e procurem por…. WWWBOARD… Nada mais f&aacute;cil!


</FONT>
</BODY>
</HTML>
