<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Author" CONTENT="The Electron">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.05 [en] (Win95; I) [Netscape]">
   <TITLE>Be Paranoid</TITLE>
</HEAD>
<BODY TEXT="#33FF33" BGCOLOR="#FFFFFF" LINK="#33FF33" VLINK="#00CC00" ALINK="#FF0000" BACKGROUND="olive_wisps.jpg">
<B><FONT COLOR="#009900"><FONT SIZE=+3>Be Paranoid</FONT></FONT></B>
<BR><B><FONT COLOR="#009900">&nbsp;</FONT></B>
<BR><B><FONT COLOR="#33FF33">Dieser Artikel ist f&uuml;r diejenigen unter
Euch gedacht, die sich um Ihre t&auml;gliche Sicherheit</FONT></B>
<BR><B><FONT COLOR="#33FF33">zu wenig Gedanken machen bzw. noch gar keinen
Kopf gemacht haben.</FONT></B>
<BR><B><FONT COLOR="#33FF33">&nbsp; Zun&auml;chst einmal solltest Du Dir
&uuml;ber eines klar sein: man kann garnicht paranoid genug</FONT></B>
<BR><B><FONT COLOR="#33FF33">sein, auch wenn es Dir noch so l&auml;cherlich
vorkommt. Das f&auml;ngt schon damit an, das es genug Leute [angehende
Hacker/Cracker/Carder/Phreaker...usw., kurz sogenannte Kriminelle] gibt,
die stolz in ihrem Freundes/Bekanntenkreis rumerz&auml;hlen, was sie so
tolles im Web [oder auch zuhause auf ihrem PC] anstellen. Als Regel: erz&auml;hl
niemandem</FONT></B>
<BR><B><FONT COLOR="#33FF33">etwas, auch wenn Du meinst, das es ein nochsoguter
Freund von Dir ist, dem Du absolut</FONT></B>
<BR><B><FONT COLOR="#33FF33">vertrauen kannst [absolut vertrauen kannst
Du eigentlich immer nur Dir selber]. Ob es</FONT></B>
<BR><B><FONT COLOR="#33FF33">ein guter Freund ist, stellt sich n&auml;mlich
erst dann heraus, wenn die Cops bei ihm zuhause</FONT></B>
<BR><B><FONT COLOR="#33FF33">einmarschieren [seine Mutter besorgt ausieht]
und ihn evtl. als Zeuge vor Gericht zerren</FONT></B>
<BR><B><FONT COLOR="#33FF33">und er Dich dann immer noch deckt. Das Problem
ist folgendes: Du kannst Dich mit</FONT></B>
<BR><B><FONT COLOR="#33FF33">Leuten nochsogut verstehen, wenn sie vor&nbsp;
Gericht ausagen m&uuml;ssen, h&ouml;rt bei leider</FONT></B>
<BR><B><FONT COLOR="#33FF33">viel zu vielen Leuten die Freundschaft auf
[ja, auch bei Leuten f&uuml;r die Du jetzt noch Deine Hand ins Feuer legen
w&uuml;rdest]. Das kommt daher, das wenn sie vor einem Richter stehen,
geschw&ouml;rt haben, die verdammte Wahrheit zu sagen [tun sie das nicht
und es kommt heraus, k&ouml;nnen sie daf&uuml;r &uuml;belst bestraft werden],
viele kalte F&uuml;sse bekommen</FONT></B>
<BR><B><FONT COLOR="#33FF33">und sich sagen: "wenn der Kerl [Du] mist gebaut
hat, halte ich doch nicht meinen Kopf</FONT></B>
<BR><B><FONT COLOR="#33FF33">daf&uuml;r hin, dann soll er selber sehn,
wie er da wieder rauskommt". Jaja, der Mensch ist</FONT></B>
<BR><B><FONT COLOR="#33FF33">sehr egoistisch und geht gerne den Weg des
geringsten Widerstands, um sich keine</FONT></B>
<BR><B><FONT COLOR="#33FF33">Unanehmlichkeiten zumuten zu m&uuml;ssen und
genau das kann Dein grosses Problem werden. Also las es nicht soweit kommen
und erz&auml;hl nicht rum was f&uuml;r ein toller Hecht Du</FONT></B>
<BR><B><FONT COLOR="#33FF33">bist und welchen Server Du gestern wieder
gehackt, welches Prog gecracked hast usw.,</FONT></B>
<BR><B><FONT COLOR="#33FF33">denn wenn das die Leute nicht wissen, k&ouml;nnen
sie dem Richter auch nichts erz&auml;hlen.</FONT></B>
<BR><B><FONT COLOR="#33FF33">So solltest Du anfangen zu denken, auch wenn
es Dir schwerf&auml;llt.</FONT></B>

<P><B><FONT COLOR="#33FF33">Wenn es Dir alles zu l&auml;cherlich vorkommt,
dann versuch Dir doch mal vorzustellen, was</FONT></B>
<BR><B><FONT COLOR="#33FF33">passieren kann, wenn Du nicht paranoid bist.
Stell Dir vor, wie die Cops zuhause reinkommen und Dich vor den Augen Deiner
Mutter oder deiner Freundin in Handschellen abf&uuml;hrn, das ist nicht
alles so easy wie im Fernsehn. Deine Mutter wird</FONT></B>
<BR><B><FONT COLOR="#33FF33">weinen, die Nachbarn werden extrem strange
gucken [6 Freunde von mir wurden nach</FONT></B>
<BR><B><FONT COLOR="#33FF33">einer Razzia in den Sachen abgef&uuml;hrt,
in denen sie geschlafen hatten und mussten</FONT></B>
<BR><B><FONT COLOR="#33FF33">Sonntag Morgen &uuml;ber 50 Meter von der
Haust&uuml;r bis zum Wagen der Cops &uuml;ber die</FONT></B>
<BR><B><FONT COLOR="#33FF33">Strasse gehn, Du kannst Dir vorstellen, was
das f&uuml;r ne Show das war f&uuml;r die ganze Nachbarschaft, Deine Mutter
w&uuml;rde es wahrscheinlich vorziehen wegzuziehn, anstatt</FONT></B>
<BR><B><FONT COLOR="#33FF33">mit den Nachbarn wochenlang &uuml;ber Deine
Festnahme zu diskutieren]. Du wirst keinen</FONT></B>
<BR><B><FONT COLOR="#33FF33">Job mehr annehmen k&ouml;nnen, der irgendwie
mit Computern zu tun hat, was das bedeuten kann, brauch ich Dir wohl nicht
zu erkl&auml;ren. Deine Freundin wird es wahrscheinlich auch nicht besonders
toll finden, Dich von nun an nur noch hinter Gittern zu besuchen, vieleicht</FONT></B>
<BR><B><FONT COLOR="#33FF33">wird sie es vorziehn Schluss zu machen. Der
Knast ist auch nicht das Sch&ouml;nste auf der</FONT></B>
<BR><B><FONT COLOR="#33FF33">Welt, t&auml;glich verpr&uuml;gelt und vergewaltigt
zu werden, das ist nicht nur in Filmen so, wenn</FONT></B>
<BR><B><FONT COLOR="#33FF33">Du das nicht glaubst, unterhalte Dich doch
mal mit Ex-Knackis, die werden Dir vom</FONT></B>
<BR><B><FONT COLOR="#33FF33">Knast abraten.</FONT></B>

<P><B><FONT COLOR="#33FF33">Also ich denke es ist klargeworden, warum es
sich lohnt paranoid zu sein.</FONT></B>

<P><B><FONT COLOR="#33FF33">Das n&auml;chste ist, das noch immer viel zu
wenig Leute PGP benutzen. Dir sollte klar sein,</FONT></B>
<BR><B><FONT COLOR="#33FF33">das jede Mail eingesehen werden kann, bzw.
auf gewisse Schl&uuml;sselw&ouml;rter wie "Crack"</FONT></B>
<BR><B><FONT COLOR="#33FF33">usw. gescannt und ausgewertet wird.</FONT></B>
<BR><B><FONT COLOR="#33FF33">Encryption ist nat&uuml;rlich nicht nur f&uuml;r
Mails wichtig, sondern auch f&uuml;r gewisse Dateien.</FONT></B>
<BR><B><FONT COLOR="#33FF33">Ich habe zb. "heikle" Dateien, von denen ich
nicht unbedingt m&ouml;chte, das sie Cops und</FONT></B>
<BR><B><FONT COLOR="#33FF33">anderes Ungeziefer in die Finger bekommen,
mehrfach gecrypted auf einer CD bzw.</FONT></B>
<BR><B><FONT COLOR="#33FF33">Diskette. Diese CD hebe ich dann bei einem
Freund auf, der keinen Computer und</FONT></B>
<BR><B><FONT COLOR="#33FF33">keine Ahnung von Computern hat [die CD f&auml;llt
in seinem Audio-CD Regal in einer</FONT></B>
<BR><B>Audio-CD-H&uuml;lle zwischen 1000 anderen CDs auch nicht weiter
auf].</B>
<BR><B>&nbsp;</B>
<BR><B>Ausserdem fasse ich alles, was ich weiterverkaufe, also zB. CDs
die gecrackte Software</B>
<BR><B>und so enthalten, Chipkarten-Rohlinge auf die Einheiten geschrieben
wurden [also quasi</B>
<BR><B>selbstgemachte Telefonkarten] usw. nur mit AIDS-Handschuhen an [!!!!!].
Das h&ouml;rt sich</B>
<BR><B>jetzt f&ouml;llig &uuml;bertrieben an, ist aber sinnvoll, da sich
so zumindest keine Fingerabdr&uuml;cke von</B>
<BR><B>mir an den Sachen befinden.</B>

<P><B>Und so gibt es tausend Sachen, die man beachten sollte, wie das man,
wenn man Hacking- related Sites auch nur besucht, nicht einen auf seinen
Namen registrierten Account verwenden sollte, oder selbstverst&auml;ndliche
Dinge, wie das man seinen Hotmail-Account mit einem Fake-Address-Generator
registriert und, und, und...</B>

<P><B>Am besten &uuml;berlegst Du Dir den ganzen Tag, wie Du noch vorsichter
werden kannst, auch</B>
<BR><B>wenn Dir das ganze noch so l&auml;cherlich vorkommt und Dich Leute
daf&uuml;r auslachen, denn</B>
<BR><B>glaub mir, es lohnt sich auf lange Sicht. Also, Be Paranoid!</B>

<P><B>T R O N</B>
<BR><B><FONT SIZE=-1>&nbsp;</FONT></B>
<BR><I><FONT SIZE=-1>Written July the 20th, 1998</FONT></I>
<BR>&nbsp;
<BR>&nbsp;
<CENTER><B><FONT SIZE=+1><A HREF="!index!.htm#contents">Back To Index</A></FONT></B></CENTER>

<CENTER><B><FONT SIZE=+1>&nbsp;</FONT></B></CENTER>

<CENTER><B><FONT SIZE=+1>&nbsp;</FONT></B></CENTER>

<CENTER><B><FONT SIZE=+1>&nbsp;</FONT></B></CENTER>

</BODY>
</HTML>
