<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<TITLE>Curso de Delphi</TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice/5.1 (Linux)">
	<META NAME="AUTHOR" CONTENT="Oscar Montes D&iacute;az">
	<META NAME="CREATED" CONTENT="20000618;16482500">
	<META NAME="CHANGEDBY" CONTENT="Miguel Angel Nieto Salazar">
	<META NAME="CHANGED" CONTENT="20000618;16483600">
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
	<STYLE>
	<!--
		TD P { color: #ffffff }
		P { color: #ffffff }
		A:visited { color: #ffcc00 }
		A:link { color: #ffcc00 }
	-->
	</STYLE>
</HEAD>
<BODY TEXT="#ffffff" LINK="#ffcc00" VLINK="#ffcc00" BGCOLOR="#000000" BACKGROUND="backmain.gif">
<P ALIGN=CENTER><FONT FACE="helvetica, sans-serif"><FONT SIZE=7><I><B>CURSO
DE DELPHI</B></I></FONT></FONT></P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&iexcl;HEY,
QUE PASA!, DESPUES DE TRES N&Uacute;MEROS HABLANDO DEL DELPHI, TANTO
DE SU ENTORNO COMO DE LAS PALABREJAS QUE VAMOS A UTILIZAR, CREO QUE
YA ES HORA DE EMPEZAR A PROGRAMAR, HOY VAMOS A HACER UN PROGRAMA
SENCILLITO, PERO QUE TE ENSE&Ntilde;AR&Aacute; MUCHAS COSAS DE COMO
SE PROGRAMA BAJO DELPHI.</FONT> <BR><FONT SIZE=2>VAMOS A SACO:</FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Arranca el Delphi
y sit&uacute;ate en el Inspector de objetos, busca la propiedad
&quot;Caption&quot; y cambia el valor que viene por defecto (Form1)
por &quot;El primer programa con Delphi&quot;. Te has dado cuenta que
en la parte de arriba de la ficha tambi&eacute;n a cambiado, pues
todos contentos.</FONT> <BR><FONT SIZE=2>Busca la propiedad Name
(Inspector de objetos) y escribe Ficha1, en lugar del que viene
(Form1), ahora lo que ha cambiado es la referencia del componente
(arriba del Inspector de objetos), ahora se llama &quot;Ficha1:Tficha1&quot;</FONT>
<BR><FONT SIZE=2>Ahora acudimos a la paleta de componentes y
seleccionamos la p&aacute;gina &quot;Standard&quot;, (que si no hemos
tocado nada ya estar&aacute; seleccionada porque es la primera), de
la p&aacute;gina Standard selecciona el componente Button (es el
sexto por la izquierda, un peque&ntilde;o bot&oacute;n con la
palabraq OK en su interior, si no sabes bien cual es, tu pon el
cursor encima que te saldr&aacute; un mensaje con el nombre del
objeto). Pulsa sobre este icono y lleva el cursor a alguna parte de
la ficha, mejor que sea en la zona inferior; pulsa el bot&oacute;n
izquierdo del rat&oacute;n y manteniendolo pulsado, arr&aacute;stralo
para definir el tama&ntilde;o del bot&oacute;n, al final suelta
cuando tenga el tama&ntilde;o que quieres.</FONT> <BR><FONT SIZE=2>Ahora
vete al Inspector de objetos (procura que el bot&oacute;n que has
creado este seleccionado),&nbsp; y cambia&nbsp; las propiedades Name,
escribiendo &quot;BotonSalida1&quot; (sin comillas, claro), &iquest;ves
que el valor de Caption cambia al mismo nombre asignado?, pero no me
gusta como se llama el bot&oacute;n, asi que cambia el valor de
Caption escribiendo &amp;Salida (el signo &amp;, es para indicar que
pulsando la tecla &quot;s&quot;, el bot&oacute;n funcionar&aacute;,
fijate ahora en el bot&oacute;n y mira como ha cambiado y la &quot;s&quot;
est&aacute; subrayada).</FONT> </FONT>
</P>
<P ALIGN=CENTER><FONT FACE="helvetica, sans-serif"><IMG SRC="Delphi.jpg" NAME="Imagen1" ALT="MIRA EL BOT&Oacute;N COMO VA QUEDANDO." ALIGN=BOTTOM WIDTH=427 HEIGHT=314 BORDER=0></FONT></P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Activa la solapa
&quot;Event&quot; (abajo en el Inspector de objetos) y haz doble
click sobre el evento On Click (hazlo sobre la parte blanca), con lo
que haces que salga una ventana del editor de c&oacute;digo (ahora
vamos ha escribir una l&iacute;nea de c&oacute;digo, para que cuando
pulses el b&oacute;ton, por eso lo del evento &quot;On Click&quot;,
salgamos del programa), bueno escribe despues del begin (supongo que
el cursor del editor ya se habr&aacute; puesto solo debajo del begin,
es lo normal):</FONT> </FONT>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><B>Application.terminate;</B></FONT></FONT></P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Y ya est&aacute;,
has creado un bot&oacute;n de salida, para probarle tan solo tienes
que pulsar sobre el triangulito verde de arriva,&nbsp;<IMG SRC="Delphi2.jpg" NAME="Imagen2" ALIGN=BOTTOM WIDTH=27 HEIGHT=22 BORDER=0>
que es el Run, si en el c&oacute;digo hay alg&uacute;n error, ya te
lo dir&aacute;, tu tranquilo y adem&aacute;s, te dir&aacute;
exactamente donde est&aacute;.</FONT> <BR><FONT SIZE=2>Para terminar
por ahora vamos a poner un label, el label es el tercer bot&oacute;n
empezando por la izquierda, el que tiene dibujado una letra &quot;A&quot;,
coloca, de la misma manera que colocaste el bot&oacute;n, el label en
la parte de arriba hacia el centro, y vete a Caption y escribe, por
ejemplo &quot;Acabo de entrar en el programa&quot;, en label tan solo
sirve para eso, para poner mensajes en el programa.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Antes de compilar
el programa, estar&iacute;a bien que guard&aacute;ramos el c&oacute;digo
fuente, asi que vete a &quot;Save project as...&quot; te aparecer&aacute;
por defecto unit1.pas (la extensi&oacute;n .PAS significa que es un
fichero fuente de pascal), cambialo y escribe &quot;project1.dpr&quot;
y aceptas.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Ahora tienes que
compilarlo para crear el EXE, asi que pulsando al mismo tiempo Ctrl +
F9, lo compilar&aacute;s, el codigo fuente y el exe lo m&aacute;s
seguro que est&eacute;n en la carpeta bin del delphi, sino buscalos
por el Delphi y si no por el discoduro.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>La verdad es que
te ha creado unos cuantos archivos, tu guardalos todos que sino no
funciona el programa.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Por &uacute;ltimo
decirte que en el zip &quot;Delphi&quot; encontrar&aacute; el EXE y
los archivos necesarios para que te funcione el programa, metelos en
la carpeta del delphi y selecciona &quot;Open project&quot; y elije
&quot;project1.dpr&quot; y veras como va la cosa.</FONT> </FONT>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif">EN
EL PROXIMO N&Uacute;MERO SEGUIREMOS AGRANDANDO UN POCO M&Aacute;S
ESTE PROGRAMILLA. <BR>&nbsp; </FONT>
</P>
<P ALIGN=RIGHT STYLE="margin-bottom: 0cm"><A HREF="mailto:omontes@wanadoo.es"><B><U><FONT SIZE=7><FONT FACE="helvetica, sans-serif"><FONT COLOR="#ffcc00">OSCAR
MONTES</FONT></FONT></FONT></U></B></A></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><BR>&nbsp;
</FONT>
</P>
<P ALIGN=RIGHT STYLE="margin-bottom: 0cm"><A HREF="http://www.geocities.com/doncaballo"><FONT SIZE=2><FONT FACE="helvetica, sans-serif">http://www.geocities.com/doncaballo</FONT></FONT></A><FONT FACE="helvetica, sans-serif">
<BR></FONT><A HREF="http://artists.traxinspace.com/oscarmontes"><FONT SIZE=2><FONT FACE="helvetica, sans-serif">Bajate
mis canciones en Traxinspace</FONT></FONT></A></P>
</BODY>
</HTML>