<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<TITLE>Don Caballo 2 por Oscar Montes</TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice/5.1 (Linux)">
	<META NAME="AUTHOR" CONTENT="Oscar Montes D&iacute;az">
	<META NAME="CREATED" CONTENT="20000618;16484600">
	<META NAME="CHANGEDBY" CONTENT="Miguel Angel Nieto Salazar">
	<META NAME="CHANGED" CONTENT="20000618;16485400">
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
	<STYLE>
	<!--
		TD P { color: #ffffff }
		P { color: #ffffff }
		A:visited { color: #ffcc00 }
		A:link { color: #ffcc00 }
	-->
	</STYLE>
</HEAD>
<BODY TEXT="#ffffff" LINK="#ffcc00" VLINK="#ffcc00" BGCOLOR="#000000" BACKGROUND="backmain.gif">
<P ALIGN=CENTER><FONT FACE="helvetica, sans-serif"><FONT SIZE=7><I><B>DON
CABALLO</B></I></FONT></FONT></P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Hola, a todos,
pues aqui teneis la segunda parte de don Caballo, en concreto son las
10 primeras p&aacute;ginas. Creo que esta segunda parte es mucho
mejor que la primera, la verdad es que tiene m&aacute;s historia que
dureza, aunque va ha seguir siendo muuuy dura, va ha haber muchas
muertes y muy originales. Se nota que ya me puse ha escribir en
serio, la primera parte la hice medio en bromas, pero esta no, esta
m&aacute;s o menos me lo curr&eacute;.</FONT> </FONT>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Pos
nada m&aacute;s, ya te dejo, haber que te parece esta paranoiada mia.</FONT>
</FONT>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT COLOR="#ff0000"><FONT FACE="helvetica, sans-serif"><B>INTRODUCCI&Oacute;N</B></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Han
pasado los a&ntilde;os, bueno mejor dicho, han pasado siglos, nos
encontramos en el siglo XXIV y esto ha cambiado un poco la verdad.
Para empezar la media de vida subi&oacute; de 75 a&ntilde;os a 175,
el cd desapareci&oacute; hace ya siglos, bueno, si lo buscar bien,
creo que encontrar&aacute;s alguno en alguna tienda antig&uuml;edades,
creo que v&iacute; uno una vez en una tienda, por lo menos era como
me lo describi&oacute; mi abuelo, el hab&iacute;a conseguido tener
alguno, gracias a que en varias generaciones atr&aacute;s se hab&iacute;an
guardado y no tirado como hab&iacute;a ocurrido en otras familias
cuando apareci&oacute; la m&uacute;sica hologr&aacute;fica, para que
lo entiendas, tu lo pones y gracias a un c&oacute;digo que
implantaban en tu cerebro, tu la oyes, como si te la trasmitieran
mentalmente, es la hostia.</FONT> <BR><FONT SIZE=2>Tambi&eacute;n mi
abuelo me cont&oacute; que en el siglo XX, joder no se como pod&iacute;an
vivir si su consola de 3000000 de Megagigas de velocidad, ten&iacute;an
ordenadores de 32 megabytes de memoria ram, joder esto es la hostia.</FONT>
<BR><FONT SIZE=2>Los siglos XX, XXI y XXII, tuvieron algo que
nosotros no tenemos, paz. Durante esos siglo los extraterrestres solo
nos observaban, nos estudiaban directamente de vez en cuando
abduciendo a persona y aunque hab&iacute;a m&aacute;s que suficientes
pruebas para demostrar su existencia, hab&iacute;a excepticos que lo
negaban. A todos los excepticos esos yo los maldigo, por culpa de
ellos ahora estamos como estamos, y eso que yo soy de los m&aacute;s
afortunados, ya que aparte de que me han dejado con vida, tampoco
vivo tan mal, aunque sin capa de ozono, sin &aacute;rboles, aunque yo
una vez vi uno en una foto muy vieja, fijate si ser&iacute;a vieja
que era en color yt en dos dimensiones. A lo que iva, los
extraterrestres no observaron durante tres siglos y cuando ya
conoc&iacute;an lo suficiente sobre nuestro pensamiento, nuestras
devilidades, nuestras almas, nuestras creencias, en resumen todo,
pues nos invadieron y no les result&oacute;, ya que, despu&eacute;s
de que ya no hab&iacute;a guerras, ni violencia en las calles, ni
todas esas cosas, pues nuestra sociedad era pac&iacute;fica y no
sabiamos ni dar una hostia, asi que nos atacaron, homs muerto casi
todos, monis los m&aacute;s valiosos, por ser cient&iacute;ficos,
fuertes o los que los extraterrestres creyeron que &eacute;ramos
importantes.</FONT> <BR><FONT SIZE=2>Hace algun tiempo, nos reunimos
unos cuantos humanos en una gigantesca reuni&oacute;n, por supuesto
clandestina, para devatir, que soluciones dar a este problema, se
dijeron que aprendi&eacute;ramos a utilizar armas, (creo que se
llaman asi) una vez lei en algun libre de historia, que en la &eacute;poca
contempor&aacute;nia se utilizaban bastante, bueno pues esa id&eacute;a
se desecho, como la de aprerder artes maricales, ya que no hay
maestros de dichas artes ya, y ademas nosotros somos unos in&uacute;tiles
en esas cosas de la vilencia, pero hubo una propuesta que a mi me
gust&oacute;, un cient&iacute;fico historiador inventor dijo:</FONT>
<BR><FONT SIZE=2>&nbsp;-Hacer muchos siglos, hubo un hombre, un
luchador, un asesino sin piedad y adem&aacute;s psic&oacute;pata, ese
hombre se llamaba don Caballo, si ese hombre estar&iacute;a aqu&iacute;,
os apuesto todo el dinero que hay en J&uacute;piter, que destruir&iacute;a
todas las naves alien&iacute;genas que nos est&aacute;n amargando la
vida.</FONT> <BR><FONT SIZE=2>Era bonito saber esa historia sobre
aquel hombre, nos daba esperanaza para nuestra lucha, saber que hubo
un hombre asi, pero no nos serv&iacute;a de nada.</FONT> <BR><FONT SIZE=2>El
cient&iacute;fico sigui&oacute; diciendonos:</FONT> <BR><FONT SIZE=2>&nbsp;-La
soluci&oacute;n est&aacute; en ese hombre, debemos ir a buscarlo y
traerlo a este tiempo, para que nos ayude.</FONT> <BR><FONT SIZE=2>&nbsp;-Est&aacute;
usted hablando como si ir&iacute;a a viajar en el tiempo a buscarlo,
es una idea absurda. Dijo un cient&iacute;fico que estaba entre
nosotros.</FONT> <BR><FONT SIZE=2>&nbsp;-Una vez existi&oacute; una
m&aacute;quina. Continu&oacute; el cient&iacute;fico. &#150; Que
pod&iacute;a hacer posibles los viajes en el tiempo. Bueno eso se
cree, porque tan solo un hombre lo intent&oacute; y nunca m&aacute;s
volvi&oacute;. El problema est&aacute; en encontrar a la m&aacute;quina,
puede que los extraterrestres la hallan destruido como todo lo dem&aacute;s,
pero puede que no y esa es la esperanza que debemos tener ahora,
debemos encontrar la m&aacute;quina.</FONT> <BR><FONT SIZE=2>Ah&iacute;
est&aacute; la esperanza de la humanidad, mi esperanza es don
Caballo.</FONT> </FONT>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#ff0000">PRIMER
INTERLUDIO</FONT></B> <BR><B><FONT COLOR="#ff0000">1</FONT></B></FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;-Y,
&iquest;por donde buscamos esa puta m&aacute;quina? Dijo uno.</FONT>
<BR><FONT SIZE=2>&nbsp;-La vertdad es que no tengo ni idea, pero,
puede estar en alguna cueva, o por all&iacute;. Dijo el historiador.-
Hay que pensar de que esa m&aacute;quina no la han desucbierto los
aliens, asi que &iquest;donde mejor que esconderla en una cueva?</FONT>
<BR><FONT SIZE=2>&nbsp;-&iquest;Si?, en cual. Dijo otro cient&iacute;fico.</FONT>
<BR><FONT SIZE=2>&nbsp;-Pues hombre. Dijo el historiador sacando un
mapa.-Yo pienso que por esta zona. Dijo se&ntilde;al&aacute;ndola con
el dedo.</FONT> <BR><FONT SIZE=2>&nbsp;-Y &iquest;por qu&eacute; esa
zona? Dijo otro.</FONT> <BR><FONT SIZE=2>&nbsp;-Pues, porque por aqu&iacute;
es por donde se vi&oacute; la m&aacute;quina por &uacute;ltima vez
antes que desapareciera el hombre que intent&oacute; el viaje en el
tiempo.</FONT> <BR><FONT SIZE=2>&nbsp;-&iexcl;Por que no nos dejamos
de chorradas y somo racionales! Dijo uno.- Os estais oyendo, viajes
en el tiempo, viajes en el tiempo, hay que vivr en el presente,
nosotros debemos luchar por nuestras vidas.</FONT> <BR><FONT SIZE=2>&nbsp;-Pero,
estas loco, no tenemos los medios para enfrentarnos a los
extraterrestres, morir&iacute;amos como moscas.</FONT> <BR><FONT SIZE=2>&nbsp;-La
lucha es m&aacute;s practica que buscar una puta m&aacute;quina que
puede que nunca halla existido.</FONT> <BR><FONT SIZE=2>&nbsp;-Tu lo
que quieres es morir, &iquest;no?, pues muere, pero nosotros queremos
que la humanidad sobreviva, y ya que quedamso pocos, por lo menos
vamos a intentar lo de la m&aacute;quina.</FONT> <BR><FONT SIZE=2>&nbsp;-&iquest;Estamos
todos deacuerdo? Dijo el historiador.</FONT> <BR><FONT SIZE=2>&nbsp;-&iexcl;Si!
Contestaron la mayor&iacute;a, no muy contentos, pero la verdad no
ten&iacute;an otra cosa.</FONT> <BR><FONT SIZE=2>Asi que empezaron a
buscar la m&aacute;quina, en el lugar indicado.</FONT> <BR><FONT SIZE=2>&nbsp;-Bueno,
ya hemos llegado aqu&iacute;. Dijo uno de los cient&iacute;ficos. &#150;
&iquest;Y ahora por donde buscamos?</FONT> <BR><FONT SIZE=2>&nbsp;-Por
las cuevas. Dijo el historiador. &#150; Como ya he dicho, es el mejor
lugar para guardar una cosa asi y ademas los extraterrestres,
practicamente no han tenido acceso a esas cuevas.</FONT> <BR><FONT SIZE=2>Hicieron
grupos de tres y empezaron a registrar las cuevas, con instrumentos
adecuados, como linternas, cuerdas, todo eso.</FONT> <BR><FONT SIZE=2>&nbsp;-&iquest;Qu&eacute;
te hace pensar, que si nosotros hemos entrado aqu&iacute;, los
extraterrestres no lo han hecho con antelaci&oacute;n? Dijo uno.</FONT>
<BR><FONT SIZE=2>&nbsp;-Antes que nada llamame JR.</FONT> <BR><FONT SIZE=2>&nbsp;-Muy
bien JR, &iquest;Qu&eacute; te lo hace pensar?</FONT> <BR><FONT SIZE=2>&nbsp;-No
se, una corazonada o algo as&iacute;, creo que mejor es esperanza,
m&aacute;s que otra cosa.</FONT> <BR><FONT SIZE=2>Se introdujeron en
lo m&aacute;s profundo de esas cuevas y en la cueva de la monta&ntilde;a
&#147;Ni Dios llega tan alto&#148;, encontraron algo.</FONT> <BR><FONT SIZE=2>&nbsp;-&iquest;Qu&eacute;
es? Pregunt&oacute; uno.</FONT> <BR><FONT SIZE=2>&nbsp;-Parece ser un
diario o algo asi. Dijo JR mirando el libro por todas partes.</FONT>
<BR><FONT SIZE=2>&nbsp;-Abrele, para ver su contenido.</FONT> <BR><FONT SIZE=2>JR
abri&oacute; el diario y la primera p&aacute;gina les dej&oacute;
helados.</FONT> <BR><FONT SIZE=2>&#147;Mi aventura temporal&#148;
pon&iacute;a en la primera p&aacute;gida .&#148;Por DM&#148;</FONT>
<BR><FONT SIZE=2>&nbsp;-Dios, lo hemos encontrado. Dijo el
historiador.</FONT> <BR><FONT SIZE=2>&nbsp;-Tan solo es un di&aacute;rio.
Dijo uno de los cient&iacute;ficos.</FONT> <BR><FONT SIZE=2>&nbsp;-A
parte de ser una prueba de que la m&aacute;quina existe, espero que
ademas contenga unos planos o algo, por lo menos para encontrar la
m&aacute;quina o para construirla.</FONT> <BR><FONT SIZE=2>&nbsp;-Debemos
coger este diario, llevarlo a nuestro escondite y estudiarle
deten&iacute;damente. Dijo JR.</FONT> <BR><FONT SIZE=2>&nbsp;-Exacto.
Concluy&oacute; el historiador.</FONT> <BR><FONT SIZE=2>Asi que
cogieron el di&aacute;rio y el primer paso para poder hacer los
viajes en el tiempo, estaba hecho</FONT> </FONT>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT COLOR="#ff0000"><FONT FACE="helvetica, sans-serif"><B>2</B></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;-El
di&aacute;rio comienza contando sus impresiones. Dijo el historiador.</FONT>
<BR><FONT SIZE=2>&nbsp;-No nos sirve. Dijo el que dudaba antes.</FONT>
<BR><FONT SIZE=2>El historiador empez&oacute; a ojear, se par&oacute;
en una p&aacute;gina, ley&oacute; un poco y digo:</FONT> <BR><FONT SIZE=2>&nbsp;-Eh,
escuchar esto amigos.</FONT> <BR><FONT SIZE=2>&#147;Hoy, por la
noche, me dispongo a provar mi invento, tengo esperanzas de que mi
misi&oacute;n concluya posit&iacute;vamente, si lo consigo, podr&eacute;
adelantarme a los extraterrestres y hacerme due&ntilde;o de ellos, ya
que conozco todo perfectamente de ellos y s&eacute; como van a
atarcar, si lo consigo, no tendr&eacute; que volver, ya que mi vida
ser&aacute; mucho mejor&#148;.</FONT> <BR><FONT SIZE=2>El historiador
pas&oacute; algunas p&aacute;ginas y ley&oacute;:</FONT> <BR><FONT SIZE=2>&#147;Ya
es hora, me dispongo a viajar unos cuantos siglos, para poder acceder
a sus naves, antes de que ellos ataquen, aunque quedan muchos a&ntilde;os
para eso, cuando ellos lleguen a la Tierra, y empiecen a estudiarnos
me apoderar&eacute; de ellos, aqu&iacute; dejo como legado el esquema
estructural de la m&aacute;quina del tiempo y mi diario, para que la
humanidad sepa mi aza&ntilde;a, me despido, espero que para siempre
de este siglo, adios&#148;</FONT> <BR><FONT SIZE=2>&nbsp;-Que cabr&oacute;n.
Dijo uno.</FONT> <BR><FONT SIZE=2>&nbsp;-Si y muy listo. Dijo el
historiador.</FONT> <BR><FONT SIZE=2>&nbsp;-&iquest;Pone como se
llama? Dijo JR.</FONT> <BR><FONT SIZE=2>&nbsp;-Bueno, viene firmado,
creo que pone Dark Mierder, pero no estoy seguro.</FONT> <BR><FONT SIZE=2>&nbsp;-Bueno,
&iquest;y vienen los mapas o los esquemas o lo que sea de la m&aacute;quina
o no?</FONT> <BR><FONT SIZE=2>El historiador empez&oacute; a rebuscar
entre las p&aacute;ginas y encontr&oacute; un dibujo:</FONT> <BR><FONT SIZE=2>&nbsp;-&iexcl;Este
debe ser! Dijo entusiasmado.</FONT> <BR><FONT SIZE=2>El dibujo
mostraba una especie de submarino en miniatura, perfectamente
explicado paso a paso su construcci&oacute;n.</FONT> <BR><FONT SIZE=2>Al
final de una flecha que se&ntilde;alaba una especie de televisor
dec&iacute;a:</FONT> <BR><FONT SIZE=2>&#147;Pantalla en la que puedes
ver, im&aacute;genes de cualquier parte, momento o acci&oacute;n que
halla ocurrido en el mundo, se sepa o no se sepa&#148;</FONT> <BR><FONT SIZE=2>&nbsp;-Es
importante esto, &iquest;no creeis?. Dijo JR. &#150; Si queremos
localizar a don Caballo esta televisi&oacute;n nos puede ayudar.</FONT>
<BR><FONT SIZE=2>&nbsp;-Cierto. Dijo el historiador.</FONT> <BR><FONT SIZE=2>&nbsp;-Aqu&iacute;
pone todo lo que necesitamos. Dijo JR. Es hora de ir de compras.</FONT>
</FONT>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT COLOR="#ff0000"><FONT FACE="helvetica, sans-serif"><B>3</B></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Empezaron
a construir la nave, cada uno la rama que conoc&iacute;a, y asi todos
contribuyeron a la construcci&oacute;n de la m&aacute;quina.</FONT>
<BR><FONT SIZE=2>Dias despues, que ademas por suerte fueron de calma,
pudieron montar algo parecido al esquema.</FONT> <BR><FONT SIZE=2>&nbsp;-&iquest;Funcionar&aacute;?</FONT>
<BR><FONT SIZE=2>&nbsp;-Lo mejor ser&aacute; probarla. Dijo JR.</FONT>
<BR><FONT SIZE=2>&nbsp;-Bueno, pues halla vamos. Dijo el historiador.</FONT>
<BR><FONT SIZE=2>Accion&oacute; la palanca y apareci&oacute; un ruido
como de turvinas o algo as&iacute;.</FONT> <BR><FONT SIZE=2>El
aparato se ilumin&oacute;, er&aacute; guap&iacute;simo todo llenos de
lucecitas de colores, la verdad sea dicha, era practicamente calcado
al del dibujo, por unos pocos detalles, era muy parecido.</FONT>
<BR><FONT SIZE=2>&nbsp;-Bueno, amigo don Caballo. Dijo el
historiador. &#150; Haber donde estabas el 17 de abril de 1998.</FONT>
<BR><FONT SIZE=2>Debajo de la televisi&oacute;n hab&iacute;a un panel
con letras y n&uacute;meros, en &eacute;l escribi&oacute; Caballo y
la fecha.</FONT> <BR><FONT SIZE=2>&nbsp;-No se ve nada.</FONT> <BR><FONT SIZE=2>&nbsp;-Es
verdad, &iquest;en que habermos fallado? Dijo el historiador.</FONT>
<BR><FONT SIZE=2>&nbsp;-En que no hemos encendido la televisi&oacute;n,
payaso. Dijo JR.</FONT> <BR><FONT SIZE=2>&nbsp;-&iexcl;Cojones!, es
verdad. Dijo el historiador.</FONT> <BR><FONT SIZE=2>Puls&oacute; el
bot&oacute;n de encendido y en la pantalla apareci&oacute; poco a
poco la imagen inconfundible de un caballo. El caballo estaba
montando a una yegua y la yegua relinchaba de gusto.</FONT> <BR><FONT SIZE=2>&nbsp;-&iexcl;Pero
que cojones es esto! Grit&oacute; el historiador.</FONT> <BR><FONT SIZE=2>&nbsp;-Haber
dejame mirar. Dijo JR. Y al ver la escena, no pudo otra cosa que
reir. &#150; Pero como se te ocurre poner caballo y no don Caballo,
mam&oacute;n! Decia mientras se enjuagaba los ojos, de los cuales
saltaban las l&aacute;grimas de la risa.</FONT> <BR><FONT SIZE=2>&nbsp;-Hombre,
pensaba que el don no era m&aacute;s que una&nbsp; formalidad,
hostias, ahora lo cambio. Dijo el historiador.</FONT> <BR><FONT SIZE=2>Y
lo cambi&oacute;, borr&oacute; caballo y escribi&oacute; don Caballo
y en la pantalla, empez&oacute; a aparecer un&nbsp; hombre corpulento
comiendo tortilla y pl&aacute;tanos y al mismo tiempo hablando con
una esp&eacute;cie de monstruo o algo parecido.</FONT> <BR><FONT SIZE=2>&nbsp;-Puedes
subir el volumen, para escuchar lo que est&aacute;n hablando. Dijo
JR.</FONT> <BR><FONT SIZE=2>&nbsp;-Pues claro. Dijo el historiador y
subi&oacute; el volumen.</FONT> <BR><FONT SIZE=2>Por los altavoces
del televisor, se empez&oacute; a escuchar.</FONT> <BR><FONT SIZE=2>&nbsp;-&#147;Creemos
que es un esp&iacute;a de Dark Mierder&#148;. Dijo el monstruo.</FONT>
<BR><FONT SIZE=2>&nbsp;-Habeis oido. Dijo el historiador. &#150; Ha
dicho Dark Mierder, al parecer, el el muy cabr&oacute;n lo consigui&oacute;.</FONT>
<BR><FONT SIZE=2>&nbsp;-&#147;Que cosa m&aacute;s curiosa&#148;. Dijo
el hombre que estaba comiendo. &#150;&#147;Tu crees que sabe mucho.</FONT>
<BR><FONT SIZE=2>&nbsp;-&#147;No mucho, solo de tu existencia...&#148;</FONT>
<BR><FONT SIZE=2>&nbsp;-Debemos actuar ahora. Dijo el historiador. &#150;
Creo que el comil&oacute;n ese es don Caballo, debemos viajar a
buscarle, ese mismo d&iacute;a incluso, que parece que est&aacute;
contento.</FONT> <BR><FONT SIZE=2>&nbsp;-Muy bien, &iquest;y quien
ir&aacute;?</FONT> <BR><FONT SIZE=2>&nbsp;-Yo ir&eacute;. Dijo el
historiador.</FONT> <BR><FONT SIZE=2>&nbsp;-No, usted no. Dijo JR. &#150;
Usted es valioso aqu&iacute;, ir&eacute; yo.</FONT> <BR><FONT SIZE=2>&nbsp;-No
se vayan a pelear.</FONT> <BR><FONT SIZE=2>&nbsp;-Muy bien. Dijo el
historiador. &#150; Ir&aacute; usted, vamos a escuchar, haber donde
podemos contactar con don Caballo a solas.</FONT> <BR><FONT SIZE=2>Miraron
al televisor y empezaron a escuchar.</FONT> <BR><FONT SIZE=2>&nbsp;-&#147;Cojonudo,
que le den mucho por culo, me voy a mi habitaci&oacute;n&#148;. Dijo
el corpulento.</FONT> <BR><FONT SIZE=2>&nbsp;-Perfecto. Dijo el
historiador. &#150; Hay le podemos encontrar solo, est&aacute;
preparado JR.</FONT> <BR><FONT SIZE=2>&nbsp;-Espere un momento. Dijo.
Se puso la ropa especial, el reloj para medir la fuerza del campo
temporal, lo comprob&oacute; todo y dijo. &#150; Listo.</FONT>
<BR><FONT SIZE=2>&nbsp;-Perfecto, ser&aacute; el segundo hombre en
viajar por el tiempo. Dijo el historiador.</FONT> <BR><FONT SIZE=2>&nbsp;-&iquest;Me
doler&aacute;? Pregunt&oacute; JR.</FONT> <BR><FONT SIZE=2>&nbsp;-Seg&uacute;n
el diario de Dark Mierder. Dijo el historiador. &#150; El cree que
aparecera asi, casi de inmediato, sin ning&uacute;n dolor.</FONT>
<BR><FONT SIZE=2>&nbsp;-Estupendo, espero que tuviera raz&oacute;n.</FONT>
<BR><FONT SIZE=2>&nbsp;-Ya ves que &eacute;l consigui&oacute; viajar,
asi que no creo que sea mucho.</FONT> <BR><FONT SIZE=2>JR se
introdujo en la maquina y puso el d&iacute;a, la hora exacta en que
don Caballo iba a ir a su habitaci&oacute;n, previamente claculada y
claro est&aacute; el nombre de don Caballo y puls&oacute; el bot&oacute;n
&#147;hasta otro a&ntilde;o&#148;, que ero lo que pon&iacute;a en el
y JR desapareci&oacute; delante de los otro cient&iacute;ficos.</FONT>
</FONT>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#ff0000">SEGUNDO
INTERLUDIO</FONT></B> <BR><B><FONT COLOR="#ff0000">1</FONT></B></FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Don
Caballo iba por el pasillo caminando hacia su habitaci&oacute;n
pensando en que embolao se hab&iacute;a metido, para tan solo matar a
gente, con lo facil, entretenido y divertido que era en la Tierra.
Iba pensando en todo eso cuando de la nada apareci&oacute; un hombre
delante, don Caballo se sorprendi&oacute; al ver que era un ser
humano, pero con una ropa muy rid&iacute;cula.</FONT> <BR><FONT SIZE=2>&nbsp;-Es
usted don Caballo. Dijo el hombre.</FONT> <BR><FONT SIZE=2>&nbsp;-Pues
si, que te pasa desgraciao.</FONT> <BR><FONT SIZE=2>&nbsp;-Increible,
lo hemos conseguido, esto es la hostia. Dijo el tipo contentisimo. &#150;
No tengo mucho tiempo, pero tienes que venir conmigo.</FONT> <BR><FONT SIZE=2>&nbsp;-&iquest;a
d&oacute;nde? Pregunt&oacute; don Caballo.</FONT> <BR><FONT SIZE=2>&nbsp;-Al
a&ntilde;o 2346 d. C, te necesitamos. Dijo el t&iacute;o.</FONT>
<BR><FONT SIZE=2>&nbsp;-Ultimamente la gente me necesita mucho. Dijo
don Caballo.</FONT> <BR><FONT SIZE=2>&nbsp;-No tengo tiempo, la
humanidad est&aacute; en peligro y eh conseguido venir para buscarte.</FONT>
<BR><FONT SIZE=2>&nbsp;-&iexcl;Joder, que guapo!</FONT> </FONT>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT COLOR="#ff0000"><FONT FACE="helvetica, sans-serif"><B>2</B></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>JR
vi&oacute; que sus compa&ntilde;eros desaparec&iacute;an y todo se
volvi&oacute; de un tono como violeta, con rayas blancas que parec&iacute;an
nubes. La verdad no sabr&iacute;a precisar cuando dur&oacute; el
viaje, pero derrepente apareci&oacute; enfrente de el un largo
pasillo y el hombre al que el creia que era don Caballo, el hombre se
asust&oacute; a verle.</FONT> <BR><FONT SIZE=2>Por favor que sea don
Caballo, por favor. Pensaba JR, mientras le hac&iacute;a la pregunta
de rigor.</FONT> <BR><FONT SIZE=2>&nbsp;-&iquest;Es usted don
Caballo?</FONT> <BR><FONT SIZE=2>El hombre contest&oacute; que si.</FONT>
<BR><FONT SIZE=2>&iexcl;Por fin! Pens&oacute; JR, le hemos
encontrado, pensaba mientras hablaba con don Caballo. Tengo que
convencerle a toda costa, segui pensando JR.</FONT> <BR><FONT SIZE=2>Mientras
hablaba con don Caballo, JR escuch&oacute; por el auricular que ten&iacute;a
en la oreja el pitido de que le quedaban pocos segundos para volver
al presente, algo hab&iacute;a fallado en la m&aacute;quina. Joder
que desesperado estoy. Pens&oacute; don Caballo, tengo que hacer que
este hombre me coja, sino estamos perdidos.</FONT> <BR><FONT SIZE=2>&nbsp;-Mierda,
veo que no puedo resistir m&aacute;s, corra, cojame, por favor,
&iexcl;cojame!</FONT> <BR><FONT SIZE=2>&nbsp;-Cojete del rabo,
payaso. Dijo don Caballo apart&aacute;ndose de JR.</FONT> <BR><FONT SIZE=2>El
pitido se hizo ensordecedor, JR descubri&oacute; que iba a volver y
sin don Caballo.</FONT> <BR><FONT SIZE=2>&nbsp;-Oh no, &iexcl;oh no!.
Dijo JR justo antes de volver a ver el color violeta y las nuves
blancas otra vez.</FONT> </FONT>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT COLOR="#ff0000"><FONT FACE="helvetica, sans-serif"><B>3</B></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;-Bueno,
JR ya se ha evaporado. Dijo el historiador.</FONT> <BR><FONT SIZE=2>&nbsp;-Si
todo va bien, en pocos segundo volver&aacute; con don Caballo. Dijo
otro de lso supuestamente cintificos.</FONT> <BR><FONT SIZE=2>Y
entonces JR apareci&oacute; otra vez con la nave, si&nbsp; se puede
llamar asi.</FONT> <BR><FONT SIZE=2>&nbsp;-Oh noooo. Grit&oacute;.</FONT>
<BR><FONT SIZE=2>Todos corrieron alarmados.</FONT> <BR><FONT SIZE=2>&nbsp;-&iquest;D&oacute;nde
est&aacute;, donde est&aacute;? Decian todos.</FONT> <BR><FONT SIZE=2>JR
se tambaleaba, como si estuviera borracho, y se tuvo que agarrar a
uno de los hierros de la m&aacute;quina del tiempo.</FONT> <BR><FONT SIZE=2>&nbsp;-&iquest;Estas
bien? Pregunt&oacute; el historiador.</FONT> <BR><FONT SIZE=2>&nbsp;-Si,
solo estoy un poco mareado. Dijo JR.</FONT> <BR><FONT SIZE=2>&nbsp;-&iquest;D&oacute;nde
est&aacute; don Caballo?</FONT> <BR><FONT SIZE=2>&nbsp;-No he podido
traerle, todo ha sucedido muy r&aacute;pido y no me ha dado casi
tiempo a explicarle nuestro plan.</FONT> <BR><FONT SIZE=2>&nbsp;-No
puede ser. Dijo uno de los cient&iacute;ficos. &#150; La m&aacute;quina
est&aacute; hecha para que puedas utilizarla a tu antojo y vuelvas
cuando tu quieras.</FONT> <BR><FONT SIZE=2>&nbsp;-Si, pues la alarma
de regreso a sonado sola, yo no he tocado nada, que conste.</FONT>
<BR><FONT SIZE=2>&nbsp;-Habr&aacute; que revisar la m&aacute;quina,
para ver donde est&aacute; el fallo. Dijo el historiador. &#150;
Puede que no la hayamos construido tan parecido como creiamos al
original o igual con algo de menos potencia, no se.</FONT> <BR><FONT SIZE=2>&nbsp;-Si,
mientras hablamos, los aliens pueden estar planeando otra vez atacar,
y todos muramos como moscas, hijo de puta. Dijo uno que mejor ni
decir su nombre, aparte porque no tengo ni puta idea.</FONT> <BR><FONT SIZE=2>&nbsp;-Hay
que pensar en positivo. Dijo JR. &#150; Yo he conseguido hablar con
don Caballo, he estado muy poco tiempo, pero conseguido viajar en el
tiempo, algo que hace tan solo unas semanas estabamos discutiendo, si
podr&iacute;amos o no hacerlo, gilipollas.</FONT> <BR><FONT SIZE=2>&nbsp;-Exacto,
hay que pensar en positivo. Dijo el historiador. &#150; JR lo ha
conseguido, por poco tiempo, pero lo ha conseguido, ahora lo que hay
que hacer es buscar el fallo de la m&aacute;quina y arreglarlo, no
debemos olvidar que Dark Mierder lo consigui&oacute;, y como vemos
todos, logr&oacute; quedarse indefinidamente, asi que debemos
contrastar la m&aacute;quina con el plano y los dibujos y volver a
intentarlo.</FONT> <BR><FONT SIZE=2>&nbsp;-Muy bien, lo intentaremos.</FONT>
<BR><FONT SIZE=2>Y todos se pusieron de nuevo a trabajar, para
encontrar el fallo de la m&aacute;quina.</FONT> </FONT>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT COLOR="#ff0000"><FONT FACE="helvetica, sans-serif"><FONT SIZE=4><B>4</B></FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Empezaron
a buscar por toda la m&aacute;quina, mirando los planos, leyendo el
di&aacute;rio, pero no encontraban nada.</FONT> <BR><FONT SIZE=2>Pasaron
varias semanas, practicamente, recontruyeron la m&aacute;quina.</FONT>
<BR><FONT SIZE=2>&nbsp;-Eureka, lo encontr&eacute;. Dijo uno de los
eminene cient&iacute;ficos que estaban en la historia.</FONT> <BR><FONT SIZE=2>&nbsp;-&iquest;De
que se trata? Dijo el historiador.</FONT> <BR><FONT SIZE=2>&nbsp;.El
reloj.</FONT> <BR><FONT SIZE=2>&nbsp;-&iquest;C&oacute;mo?</FONT>
<BR><FONT SIZE=2>&nbsp;-El reloj est&aacute; incompleto, si os fijais
bien en el esquema de la m&aacute;quina, hay dos relojes. Todos se
acercaron a los esquemas y despues se fijaron en la m&aacute;quina. &#150;
Uno es para la fecha de ida. Continu&oacute; el cient&iacute;fico. &#150;
Y otro para el de vuelta, pr eso le devolvi&oacute; tan pronto, lo
poco que pudo aguantar la m&aacute;quina.</FONT> <BR><FONT SIZE=2>Todos
se miraron sonriendo, ahora si hab&iacute;a un palo donde sujetarse.</FONT>
<BR><FONT SIZE=2>Se pusieron manos a la obra, les cost&oacute; un
poco encontrar otro reloj, pero le encontraron y le colocaron
correctamente, por fin todo estaba listo para ir a buscar a don
Caballo.</FONT> </FONT>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT COLOR="#ff0000"><FONT FACE="helvetica, sans-serif"><B>5</B></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;-Muy
bien JR. Dijo el historiador. - &iquest;Estas otra vez preparado para
el gran viaje?</FONT> <BR><FONT SIZE=2>&nbsp;-Si contest&oacute;. &#150;
Tan solo un detalle, &iquest;cu&aacute;nto tiempo podr&eacute;
residir en el pasado?</FONT> <BR><FONT SIZE=2>&nbsp;-Pues te vamos a
dar vario a&ntilde;os, supongo que necesitar&aacute;s varios minutos
para convencerle, pero m&aacute;s vale que sobre y no que falte.</FONT>
<BR><FONT SIZE=2>Se introdujo en la m&aacute;quina y encendi&oacute;
el televisor, escribi&oacute; don Caballo y por seguridad puso un a&ntilde;o
despues del encuentro.</FONT> <BR><FONT SIZE=2>&nbsp;-Acuerdate de
poner un minuto despues de el de ahora, a la hora de volver.</FONT>
<BR><FONT SIZE=2>&nbsp;-Deacuerdo.</FONT> <BR><FONT SIZE=2>&nbsp;-Y
poner, &#147;Desesperados, buscando a don Caballo&#148;</FONT> <BR><FONT SIZE=2>&nbsp;-Muy
bien.</FONT> <BR><FONT SIZE=2>Entonces encendi&oacute; la m&aacute;quina,
observo que todo estaba en orden, vi&oacute; que don Caballo estaba
sentado en una piedra bebiendo agua.</FONT> <BR><FONT SIZE=2>&nbsp;-Ahora
puede que sea el viaje un poco m&aacute;s fuerte, te cuidado JR. Dijo
el historiador.</FONT> <BR><FONT SIZE=2>&nbsp;-Lo tendr&eacute;. Dijo
justo antes de desaparecer delante de ellos.</FONT> <BR><FONT SIZE=2>&nbsp;-Eso
espero.</FONT> <BR><FONT SIZE=2>Y se quedaron mirando la tierra
quemada que hab&iacute;a dejado la nave despues de desaparecer.</FONT>
</FONT>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#ff0000">TERCER
INTERLUDIO</FONT></B> <BR><B><FONT COLOR="#ff0000">1</FONT></B></FONT></P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Don Caballo se
encontraba agotado y con mucha sed, se sent&oacute; en una piedra
para poder descansar (aunque no sab&iacute;a porque estaba cansado,
porque lo &uacute;nico que hab&iacute;a hecho era cabalgar encima de
su caballo) y beber un poco de agua.</FONT> <BR><FONT SIZE=2>Entonces
una luz cegadora apareci&oacute; delante de el.</FONT> <BR><FONT SIZE=2>&nbsp;-No,
otra nave espacial, no. Dijo don Caballo.</FONT> <BR><FONT SIZE=2>Pero
no pod&iacute;a serlo, porque la luz no aparec&iacute;a de el cielo,
sino de enfrente de el.</FONT> <BR><FONT SIZE=2>&nbsp;-&iquest;Qu&eacute;
es esto? Se pregunt&oacute; don Caballo. &#150; No lo comprendo.
&iexcl;Dios, no puede ser!, esto es increible. Grit&oacute; don
Caballo al ver que dentro de la espiral aparec&iacute;a un hombre,
por ahora era tan solo la forma.</FONT> <BR><FONT SIZE=2>&nbsp;-Me
cago en la hostia puta, el cabr&oacute;n que salga de ah&iacute; le
parto la cara, lo juro por Dios. Dijo don Caballo besandose el dedo
indice.</FONT> </FONT>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Entonces
la luz ces&oacute; y apareci&oacute; un hombre que a don Caballo le
sonaba, a los dos segundos el hombre ten&iacute;a una hostia en toda
la cara.</FONT> <BR><FONT SIZE=2>&nbsp;-A tomar por culo. Dijo don
Caballo. &#150; Y ahora identif&iacute;cate o te parto la cara tres
veces m&aacute;s y te dejo por que al hombre elefante.</FONT> <BR><FONT SIZE=2>El
hombre sac&oacute; un pa&ntilde;uelo del bolsillo y se quit&oacute;
la sangre que emanaba de su boca.</FONT> <BR><FONT SIZE=2>&nbsp;-Me
llamo JR y vengo a buscarte.</FONT> <BR><FONT SIZE=2>&nbsp;-Tu lo que
buscas es quedarte ciego, cabr&oacute;n. Dijo don Caballo.</FONT>
<BR><FONT SIZE=2>&nbsp;-Deja que te lo explique, yo vengo... erupto
en toda la cara que le ech&oacute; don Caballo.</FONT> <BR><FONT SIZE=2>&nbsp;-joder,
que mal huele. Dijo JR.</FONT> <BR><FONT SIZE=2>&nbsp;-Huele que
alimenta. Dijo don Caballo.</FONT> <BR><FONT SIZE=2>&nbsp;-Muy bien,
ahora me va a escuchar, vale, no se mueva ni nada tu escucha tan
solo.</FONT> <BR><FONT SIZE=2>&nbsp;-Muy bien cag&oacute;n, te
escucho.</FONT> <BR><FONT SIZE=2>Y don Caballo empez&oacute; a
escuchar la historia de JR.</FONT> </FONT>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT COLOR="#ff0000"><FONT FACE="helvetica, sans-serif"><B>2</B></FONT></FONT></P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Don Caballo
escuch&oacute; la historia de JR, lo de que ven&iacute;a del futuro,
que el era el &uacute;nico que pod&iacute;a hacer frente a los
aliens, etc.</FONT> <BR><FONT SIZE=2>&nbsp;-Haber, que me cosque yo.
Dijo don Caballo. &#150; Tu vienes del futuro.</FONT> <BR><FONT SIZE=2>&nbsp;-Asi
es.</FONT> <BR><FONT SIZE=2>&nbsp;-En el futuro la Tierra est&aacute;
invadida por extraterrestres.</FONT> <BR><FONT SIZE=2>&nbsp;-Correcto.</FONT>
<BR><FONT SIZE=2>&nbsp;-Y quieres que yo viaje al futuro contifo para
convatirlos.</FONT> <BR><FONT SIZE=2>&nbsp;-Muy bien, lo has
entendido.</FONT> <BR><FONT SIZE=2>&nbsp;-Chupame esto. Dijo don
Caballo mientras se sacaba el miembro.</FONT> <BR><FONT SIZE=2>&nbsp;-Joder,
pero que grande es.</FONT> <BR><FONT SIZE=2>&nbsp;-Y esta es tan solo
la punta. Dijo don Caballo mientras cog&iacute;a sus cosas, y se
montaba en el caballo.</FONT> <BR><FONT SIZE=2>&nbsp;-Pero, &iquest;a
d&oacute;nde vas? Pregunt&oacute; JR.</FONT> <BR><FONT SIZE=2>&nbsp;-A
tomar por culo. Contest&oacute; don Caballo con tono de chuler&iacute;a.</FONT>
<BR><FONT SIZE=2>&nbsp;-Pero, no me vas a ayudar, por favor te
necesitamos.</FONT> <BR><FONT SIZE=2>&nbsp;-Hasta luego que me piro.</FONT>
<BR><FONT SIZE=2>Don Caballo empez&oacute; a cabalgar, mientras JR
corr&iacute;a detr&aacute;s de el.</FONT> <BR><FONT SIZE=2>&nbsp;-Por
favor no te vayas, &iexcl;ayudanos!</FONT> <BR><FONT SIZE=2>&nbsp;-Mira,
en el rato que he estado contigo, pod&iacute;a haber matado a m&aacute;s
de 20 personas, asi que no me toques la pelotas o te rompo la parte
de la cara que te queda sana.</FONT> </FONT>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>JR
observaba como se alejaba don Caballo de all&iacute;, estaba
desolado, no esperaba que ese tipo ser&iacute;a asi.</FONT> <BR><FONT SIZE=2>Muy
triste se dirig&iacute;a a su m&aacute;quina, cuando se le ocurri&oacute;
una idea. &#147;Tengo m&aacute;quina del tiempo&#148;, pens&oacute;
mir&aacute;ndola, &#147;puedo viajar a donde quiera&#148;, JR
empezaba a sonreir, &#147;vamos a hacer una visita don Caballo cuando
era peque&ntilde;o&#148;.</FONT> <BR><FONT SIZE=2>JR se mont&oacute;
en la nave, puso don Caballo en el sitio correcto, puso treinta a&ntilde;os
atr&aacute;s en el tiempo y encendi&oacute; la televisi&oacute;n.</FONT>
<BR><FONT SIZE=2>En la televisi&oacute;n apareci&oacute; un don
Caballo muy peque&ntilde;o, como de cinco a&ntilde;os.</FONT>
<BR><FONT SIZE=2>&nbsp;-Perfecto. Dijo JR. &#150; Contra m&aacute;s
joven, mejor le podr&eacute; manipular.</FONT> <BR><FONT SIZE=2>Observ&oacute;
por la televisi&oacute;n que don Caballo se acercaba por detr&aacute;s
de una ni&ntilde;a y la cogi&oacute;.</FONT> <BR><FONT SIZE=2>&nbsp;-Ser&aacute;
mejor pasarse ahora por all&iacute;.</FONT> <BR><FONT SIZE=2>Activ&oacute;
la m&aacute;quina y desapareci&oacute;, don Caballo que estaba a unos
50 metros mir&oacute; atr&aacute;s, sonri&oacute; y dijo:</FONT>
<BR><FONT SIZE=2>&nbsp;-&iexcl;Mam&oacute;n!, con paridas a mi me vas
a venir.</FONT> </FONT>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT COLOR="#ff0000"><FONT FACE="helvetica, sans-serif"><B>3</B></FONT></FONT></P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Don Caballo
entraba en el ba&ntilde;o de la ni&ntilde;as, con la ni&ntilde;a en
brazos, que se tambaleaba, pero don Caballo era muy fuerte para su
edad y se le escapaba.</FONT> <BR><FONT SIZE=2>&nbsp;-Haber zorra,
&iquest;tienes sed? Dijo don Caballo.</FONT> <BR><FONT SIZE=2>&nbsp;-Caballo,
dejate de bromas y dejame volver, me estas asustando.</FONT> <BR><FONT SIZE=2>&nbsp;-Al
parecer tienes sed. Dijo como si no la hubiera escuchado. &#150; Pues
yo soy muy caballeroso con la damas y siempre las doy lo que quieren.</FONT>
<BR><FONT SIZE=2>La cogi&oacute; por las piernas y la puso bocabajo,
la meti&oacute; la cabeza en la taza y la dej&oacute; alli.</FONT>
<BR><FONT SIZE=2>&nbsp;-Traga guarra, traga. Dec&iacute;a don Caballo
o mejor dicho Caballo.</FONT> <BR><FONT SIZE=2>&nbsp;-Glglglgl. Dec&iacute;a
la ni&ntilde;a.</FONT> <BR><FONT SIZE=2>&nbsp;-O no te has
despeinada. La dec&iacute;a Caballo mientras la sacaba. &#150; Tengo
la soluci&oacute;n.</FONT> <BR><FONT SIZE=2>Mientras don Caballo la
afeitaba la cabeza una luz apareci&oacute; en el ba&ntilde;o y un
hombre se puso alado de Caballo, mientras terminaba de afeitarla.</FONT>
<BR><FONT SIZE=2>&nbsp;-Chico. Dijo JR, mientras le pon&iacute;a la
mano en el hombre.</FONT> <BR><FONT SIZE=2>Don Caballo se dio la
vuelta y le ech&oacute; un gargajo en toda la camisa.</FONT> <BR><FONT SIZE=2>&nbsp;-Pero
que garro. Dijo JR y se dirigi&oacute; a la toalla para quitarselo.</FONT>
<BR><FONT SIZE=2>&nbsp;-Que quieres mamarracho, te dejo diez
segundos, que tengo que ir a atormentar a la de gimnasia, a esa tia
la voy a matar de un susto. Diez, nueve, ocho...</FONT> <BR><FONT SIZE=2>JR
se apresur&oacute; a sacar un aparato y se lo puso en los ojos
mientras don Caballo contaba.</FONT> <BR><FONT SIZE=2>&nbsp;-Dentro
de treinta a&ntilde;os un hombre te pedir&aacute; ayuda, te lo pedir&aacute;
en tres momentos diferentes, en el tercero aceptar&aacute;s,
entendido.</FONT> <BR><FONT SIZE=2>Caballo que se hab&iacute;a
quedado helado mirando el aparato, dijo si con la cabeza.</FONT>
<BR><FONT SIZE=2>&nbsp;-Muy bien. Dijo JR. Y le apart&oacute; el
aparato de la cara.</FONT> <BR><FONT SIZE=2>&nbsp;-Uno y cero. Se te
a acabadof el tiempo. Dijo Caballo, pesta&ntilde;eando mucho y
despues arrascandose los ojos.</FONT> <BR><FONT SIZE=2>Entonces
Caballo le meti&oacute; por la bragueta a JR el pelo de la ni&ntilde;a
y le vomit&oacute; en la camisa y se fue corriendo.</FONT> <BR><FONT SIZE=2>&nbsp;-&iexcl;Me
cago en la hostia! Dijo JR.</FONT> <BR><FONT SIZE=2>&nbsp;-Y eso que
hoy tiene un buen dia. Dijo la ni&ntilde;a con la cabeza afeitada.</FONT>
<BR><FONT SIZE=2>&nbsp;-Menos mal. Dijo JR y se dirigi&oacute;
apresudaramente hacia su nave, para pedirle a don Caballo por tercea
vez que le ayudara.</FONT> <BR><FONT SIZE=2>Puso la fecha justo un
minuto despues de que se fuera y puso en funcionamiento la m&aacute;quina.</FONT>
<BR><FONT SIZE=2>El ba&ntilde;o desapareci&oacute; aparecieron la
nubes blancas y derrepente apareci&oacute; en el desierto.</FONT> </FONT>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>La
ni&ntilde;a vi&oacute; como la nave esa tan rara desaparec&iacute;a y
se acord&oacute; de que ten&iacute;a clase y salio corriendo, pero
misteriosamente una mano la dio en toda la cara y la rompi&oacute; la
nariz.</FONT> <BR><FONT SIZE=2>Vi&oacute; que sangraba y mir&oacute;
a su lado derecho y comprob&oacute; que hab&iacute;a sido Caballo.</FONT>
<BR><FONT SIZE=2>&nbsp;-Jodete, puta. La dijo Caballo riendose de
ella.</FONT> </FONT>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT COLOR="#ff0000"><FONT FACE="helvetica, sans-serif"><B>4</B></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>JR
lleg&oacute; al presente de don Caballo y observ&oacute; en todos los
lados y lo &uacute;nico que observ&oacute; fue a una mujer, se
desmont&oacute; de la m&aacute;quina y corri&oacute; hac&iacute;a
ella.</FONT> <BR><FONT SIZE=2>&nbsp;-Perdone se&ntilde;orita, no
habr&aacute; visto un hombre muy raro, montado en una escoba.</FONT>
<BR><FONT SIZE=2>&nbsp;-Jove, pero que bueno esta, me presento, soy
do&ntilde;a Yegua.</FONT> <BR><FONT SIZE=2>A JR le pareci&oacute; muy
raro el nombre y se fij&oacute; mejor en la t&iacute;a y comprobo
&iexcl;que era don Caballo!</FONT> <BR><FONT SIZE=2>&nbsp;-&iexcl;Don
Caballo! Grit&oacute; JR.</FONT> <BR><FONT SIZE=2>Entonces don
Caballo, &iexcl;hay &iexcl;digo do&ntilde;a Yegua le cogi&oacute; de
los huevos.</FONT> <BR><FONT SIZE=2>&nbsp;-Hijo de la grand&iacute;sima
puta, como me has reconocido.</FONT> <BR><FONT SIZE=2>&nbsp;-No de
nada, &iquest;me puedes soltar?</FONT> <BR><FONT SIZE=2>Do&ntilde;a
Yegua le solt&oacute;.</FONT> <BR><FONT SIZE=2>&nbsp;-Buenas tardes
se&ntilde;orita. Dijo JR y se alej&oacute; de all&iacute;
practicamente corriendo.</FONT> <BR><FONT SIZE=2>Cuando se alej&oacute;
lo suficiente, par&oacute; de correr y empez&oacute; a pensar.</FONT>
<BR><FONT SIZE=2>&#147;Que le dije a don Caballo, algo le tuve que
decir para que halla ocurrido esto&#148;, sigui&oacute; pensando y se
dio cuenta del fallo de su conversaci&oacute;n con don Caballo cuando
era un ni&ntilde;o.</FONT> <BR><FONT SIZE=2>&nbsp;-Le dije que dentro
de treinta a&ntilde;os un hombre le pedir&iacute;a ayuda tres veces,
claro, pero no le dije que clase de ayuda, alg&uacute;n cabr&oacute;n
le pedir&iacute;a ayuda tres veces y asi ha quedado don caballo,
madre del amor hermoso, haber como arreglo esto.</FONT> <BR><FONT SIZE=2>Sigui&oacute;
pensando y se le ocurri&oacute; volver all&iacute; un minuto despues
de su visita y volverle a hipnotizar en condiciones, contandole todo.</FONT>
<BR><FONT SIZE=2>Puso la misma fecha pero con un minuto m&aacute;s y
encendi&oacute; la televisi&oacute;n.</FONT> <BR><FONT SIZE=2>Se vi&oacute;
a el mismo desapareciendo delante de la ni&ntilde;a.</FONT> <BR><FONT SIZE=2>&nbsp;-Bueno
alli voy. Y activo la m&aacute;quina otra vez.</FONT> </FONT>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT COLOR="#ff0000"><FONT FACE="helvetica, sans-serif"><B>5</B></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Un
momento despues apareci&oacute; en el ba&ntilde;o, lo primero que
escucho fue.</FONT> <BR><FONT SIZE=2>&nbsp;-Jodete, puta. Era la
inconfundible voz de don Caballo.</FONT> <BR><FONT SIZE=2>&#147;Algo
le habra vuelto ha hacer a esa pobre ni&ntilde;a&#148;, pens&oacute;
JR, corri&oacute; hacia la puerta la abri&oacute; y vi&oacute; a la
ni&ntilde;a con un pa&ntilde;uelo en la nariz y don Caballo dandola
patadas en la espalda.</FONT> <BR><FONT SIZE=2>&nbsp;-Chico. Grit&oacute;
JR.</FONT> <BR><FONT SIZE=2>Caballo se dio la vuelta, cosa que
aprovech&oacute; la ni&ntilde;a para huir de el, Caballo se dio
cuenta y la dijo.</FONT> <BR><FONT SIZE=2>&nbsp;-Te volver&eacute; a
coger, lesbiana, no podr&aacute;s huir de mi. Entonces se volvi&oacute;
hacia JR con cara de mala hostia y se acerc&oacute; a el.</FONT>
<BR><FONT SIZE=2>&nbsp;-Has hecho que se me escape la presa, cabr&oacute;n,
espero que sea algo importante.</FONT> <BR><FONT SIZE=2>JR se
apresur&oacute; a ponerle el aparato en los ojos a Caballo, en ese
mismo instante Caballo se qued&oacute; con cara de invecil mirando el
aparato y cayendosele la baba.</FONT> <BR><FONT SIZE=2>&nbsp;-Dentro
de treinta a&ntilde;os. Empez&oacute; a decir JR muy despacio. &#150;
Un viajero en el tiempo llamado JR, un a&ntilde;o despues de derrotar
a Dark Mierder, te pedir&aacute; ayuda tres veces, la primera estaras
en guerra con Dark Mierder y las otras dos un a&ntilde;o despues,
escuchame bien, cuando te pida ayuda por tercera vez, tu le ayudar&aacute;s,
entendido, le ayudar&aacute;s.</FONT> <BR><FONT SIZE=2>JR le apart&oacute;
el aparato de la cara a Caballo, que en ese mismo instante se le
quit&oacute; la cara de invecil.</FONT> <BR><FONT SIZE=2>&nbsp;-Caramono,
preparate para morir.</FONT> <BR><FONT SIZE=2>&nbsp;-Sera otro dia,
que ahora tengo prisa. Dijo JR casi corriendo hacia su m&aacute;quina.</FONT>
<BR><FONT SIZE=2>&nbsp;-Que te jodan, yo te parto los morros. Caballo
corri&oacute; a por JR, pero no lo apa&ntilde;&oacute;, porque
misteriosamente el tipo desapareci&oacute; dejando tras de si una luz
cegadora.</FONT> <BR><FONT SIZE=2>&nbsp;-Donde cojones se ha metido,
y encima se ma ha escapado la guarra esta, hija del tal Quinter&iacute;a,
&iquest;puta!. Grit&oacute; Caballo saliendo por la puerta del ba&ntilde;o
corriendo y buscando a la que ser&iacute;a su futura novia y que
asesinar&iacute;a mucho m&aacute;s adelante dandola por culo.</FONT> </FONT>
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT COLOR="#ff0000"><FONT FACE="helvetica, sans-serif"><B>6</B></FONT></FONT></P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Don Caballo hab&iacute;a
empezado a cabalgar, estaba pensando lo de el tipo ese que dec&iacute;a
que ven&iacute;a del futuro.</FONT> <BR><FONT SIZE=2>&nbsp;-Pero que
trisca era... Una luz apareci&oacute; a su espalda, don Caballo se
dio la vuelta y comprob&oacute; con espanto que era otra vez el tipo
ese.</FONT> <BR><FONT SIZE=2>El tipo o mejor dicho JR corri&oacute; a
por don Caballo lo m&aacute;s deprisa que pudo.</FONT> <BR><FONT SIZE=2>&nbsp;-Oh,
eres otra vez tu. Dijo JR muy contento. &#150; Tengo que pedirte...
gapo en toda la cara que recibi&oacute; por gentileza de don Caballo.</FONT>
<BR><FONT SIZE=2>&nbsp;-Mira caramono, me estas tocando mucho los
cojones, hostias. Dijo don Caballo. &#150; O desapareces tu, la nave
y tu asquerosa cara o te juro que de las hostias que te meto, no te
encuentran ni la polic&iacute;a, ni el F.B.I, ni la C.I.A, asi que
pista so orangutan.</FONT> <BR><FONT SIZE=2>JR, mientras escuchaba
esas cari&ntilde;osas palabras de don Caballo se estaba quitando el
gargajo con moco de la cara, algo que le estaba costando horrores,
porque se hab&iacute;an pegado como un pegamento, cuando se consigui&oacute;
limpiar completamente la cara dijo.</FONT> <BR><FONT SIZE=2>&nbsp;-Escuchame,
te necesito, tienes que acompa&ntilde;arme al futuro, necesito tu
ayuda. En cuanto JR pronunci&oacute; estas palabras don Caballo
irgui&oacute; la cabeza y empez&oacute; a mirar a la nada.</FONT>
<BR><FONT SIZE=2>&nbsp;-Cuando me pidan ayuda por tercer vez. Dojo
don Caballo con voz de aut&oacute;mata. &#150; Tendr&eacute; que
ofrecerle ayuda, ayuda, ayuda...</FONT> <BR><FONT SIZE=2>JR comprob&oacute;
que hab&iacute;a resultado su plan y abofete&oacute; a don Caballo.</FONT>
<BR><FONT SIZE=2>&nbsp;-Preparate para morir, comadreja inmunda. Dijo
don Caballo alargando sus brazos en direcci&oacute;n al cuello en
direcci&oacute;n al cuello de JR.</FONT> <BR><FONT SIZE=2>&nbsp;-&iquest;Me
ayudaras? Dijo JR.</FONT> <BR><FONT SIZE=2>&nbsp;-Por supuesto. Dijo
don Caballo muy alegre. &#150; Me gustar&iacute;a a&ntilde;adir que
hace un d&iacute;a maravilloso, la primavera se acerca, estoy
enamoradoooo.</FONT> <BR><FONT SIZE=2>Don Caballo hecho a correr,
bueno m&aacute;s que correr bailaba como en el ballet.</FONT> <BR><FONT SIZE=2>&nbsp;-Tu
eres, tu mi principe azul que yo so&ntilde;e, tra la tra la. Don
Caballo cantaba y bailaba.</FONT> <BR><FONT SIZE=2>Don Caballo cogi&oacute;
a JR de la cintura.</FONT> <BR><FONT SIZE=2>&nbsp;-Le gustar&iacute;a
ser mi pareja de baile. Dijo don Caballo.</FONT> <BR><FONT SIZE=2>JR
y don Caballo empezaron a bailar.</FONT> <BR><FONT SIZE=2>&nbsp;-No,
no, por favor ayudenos, ayude a la humanidad. Dijo JR.</FONT> <BR><FONT SIZE=2>Don
Caballo se par&oacute; en seco y dijo:</FONT> <BR><FONT SIZE=2>&nbsp;-Vamos
a matar a esos grand&iacute;simos hijos de puta, cabrones y maricones
de extraterrestres.</FONT> <BR><FONT SIZE=2>&nbsp;-Asi me gusta, con
optimismo. Dijo JR.</FONT> <BR><FONT SIZE=2>Don Caballo y JR se
dirigieron a la nave.</FONT> <BR><FONT SIZE=2>&nbsp;-Tu crees que
entraremos aqu&iacute; los dos, tengo miendo, &iquest;d&oacute;nde
est&aacute; mi osito?, o no he perdido mi osito. Dijo don Caballo.</FONT>
<BR><FONT SIZE=2>JR sospech&oacute; que algo le hab&iacute;a pasado a
don Caballo, ya no era el mismo.</FONT> <BR><FONT SIZE=2>&nbsp;-No te
preocupes. Dijo JR. &#150; Viajaremos los dos en el mismo asiento,
uno encima del otro, ser&aacute; incomodo, pero el viaje solo duirar&aacute;
varios segundos, milesimas, cent&eacute;simas, muy poco... &iexcl;aaaahhhh,
que poco va ha durar el viaje, mami!</FONT> <BR><FONT SIZE=2>JR se
hab&iacute;a puesto nervioso y empezaba a temblar, entonces don
Caballo le dio una bofetada, bueno, m&aacute;s que una bofetada fue
un pu&ntilde;etazo que JR no encaj&oacute; muy bien y qued&oacute;
K.O.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Cuando JR
despert&oacute;, don Caballo le estaba meando las piernas.</FONT>
<BR><FONT SIZE=2>&nbsp;-&iexcl;Joder!, que asco, mierda mis
pantalones nuevos, seras cabr&oacute;n. Dijo JR.</FONT> <BR><FONT SIZE=2>&nbsp;-A
tomar por culo, ten&iacute;a ganas de mear y me&eacute;, asi que te
cayas, basura.</FONT> <BR><FONT SIZE=2>&nbsp;-Bueno, da igual,
vamonos ya, que nos esperan.</FONT> <BR><FONT SIZE=2>&nbsp;-No
dejaremos aqu&iacute; a mi caballo, no lo consentir&eacute;. Dijo don
Caballo abrazando a su escoba.</FONT> <BR><FONT SIZE=2>&nbsp;-No se
si podemos llevarla, mmm, llevarlo, avos a ir muy estrujaos.</FONT>
<BR><FONT SIZE=2>&nbsp;-De eso nada, el caballo se viene conmigo,
como la piel del perro, las pollas que colecciono, incluyendo la del
viejo hijo puta, que la necesito de aspiradora.</FONT> <BR><FONT SIZE=2>&nbsp;-Bueno,
vale, deacuerdo. Dijo JR, sin ganas de discutir m&aacute;s.</FONT>
<BR><FONT SIZE=2>Don Caballo meti&oacute; todas sus cosas como pudo y
entraron muy ajustados.</FONT> <BR><FONT SIZE=2>JR puso el a&ntilde;o
y la fecha en la que parti&oacute;, pero con un minuto adelantado
respecto a la hora en la que parti&oacute; y encendi&oacute; su tele,
se acord&oacute; de poner lo que ten&iacute;a que poner y casi al
mismo tiempo la televisi&oacute;n mostr&oacute; la imagen de sus
amigos cient&iacute;ficos, todos haciendose una paja y puls&oacute;
el bot&oacute;n, para activar la m&aacute;quina.</FONT> <BR><FONT SIZE=2>&nbsp;-Vamonos.
Dijo JR.</FONT> <BR><FONT SIZE=2>&nbsp;-Tengo miedo. Dijo don
Caballo.</FONT> <BR><FONT SIZE=2>&nbsp;-No te asustes cari&ntilde;o,
yo estoy contigo.</FONT> <BR><FONT SIZE=2>Y entonces la m&aacute;quina
desapareci&oacute; haciendo un ruido sordo.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Un desgraciao que
hab&iacute;a por alli observ&oacute; la escena y se lo fue a contar a
los de su pueblo, por eso le mataron dos dias depues, pero eso es
otra historia.</FONT> </FONT>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Continuar&aacute;...</FONT>
<BR>&nbsp; </FONT>
</P>
<P ALIGN=RIGHT STYLE="margin-bottom: 0cm"><A HREF="mailto:omontes@wanadoo.es"><B><U><FONT SIZE=7><FONT FACE="helvetica, sans-serif"><FONT COLOR="#ffcc00">OSCAR
MONTES</FONT></FONT></FONT></U></B></A></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><BR>&nbsp;
</FONT>
</P>
<P ALIGN=RIGHT STYLE="margin-bottom: 0cm"><A HREF="http://www.geocities.com/doncaballo"><FONT SIZE=2><FONT FACE="helvetica, sans-serif">http://www.geocities.com/doncaballo</FONT></FONT></A><FONT FACE="helvetica, sans-serif">
<BR></FONT><A HREF="http://artists.traxinspace.com/oscarmontes"><FONT SIZE=2><FONT FACE="helvetica, sans-serif">Bajate
mis canciones en Traxinspace</FONT></FONT></A></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><BR>&nbsp;
</FONT>
</P>
</BODY>
</HTML>