<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<TITLE>Iloveyou</TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice/5.1 (Linux)">
	<META NAME="AUTHOR" CONTENT="Miguel Angel Nieto">
	<META NAME="CREATED" CONTENT="20000618;16311900">
	<META NAME="CHANGEDBY" CONTENT="Miguel Angel Nieto Salazar">
	<META NAME="CHANGED" CONTENT="20000618;16501400">
	<STYLE>
	<!--
		TD P { color: #ffffff }
		P { color: #ffffff }
		A:visited { color: #ffcc00 }
		A:link { color: #ffcc00 }
	-->
	</STYLE>
</HEAD>
<BODY TEXT="#ffffff" LINK="#ffcc00" VLINK="#ffcc00" BGCOLOR="#ffffff" BACKGROUND="backmain.gif">
<P ALIGN=CENTER><FONT FACE="helvetica, sans-serif"><FONT SIZE=7><I><B>I
LOVE YOU!</B></I></FONT></FONT></P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;
En este corto articulo, intentare explicar como un virus tan sencillo
como el famoso I Love You a llegado a infectar a tantas empresas y
usuarios de un PC (con windows). Como todos sabr&eacute;is, este
famoso virus es un script de VB, que aprovecha los errores de
seguridad del windows y de Outlook, se reenv&iacute;a a todas las
direcciones que tenemos en la libreta de direcciones y para hacerlo
mas interesante, sobreescribe todos nuestros archivos multimedia.
Pues bien, un d&iacute;a como otro cualquiera, todas las cadenas de
televisi&oacute;n alertaron de esta nueva &iquest;amenaza? para todos
nosotros. As&iacute; fue mas o menos como se lo tomaron los medios de
comunicaci&oacute;n:</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>La 1: Ehhh...
esto, pos, un virus. Aun no sabemos que es esto, pero estamos
investigando para mantenerles informados, como es nuestra labor, y...
pos eso, un virus. Creemos que el virus ataca a algo llamado
ordenador, tambi&eacute;n estamos buscando el significado a esta
palabra, ya tenemos 17 periodistas buscando en diccionarios la
palabreja, esperamos que dentro de 7 meses tengamos resuelto el...
esto, pos eso.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>La 2: Un virus
inform&aacute;tico potentisimo pone en peligro a todos los
ordenadores del mundo (mientras suena m&uacute;sica apocal&iacute;ptica
de fondo). Por favor, no cogais los e-mails, y si por equivocaci&oacute;n
recib&iacute;s alguno, sea de quien sea, eliminarlo! Por ultimo solo
nos queda decir que... pos que el virus es... y eso, que no encend&aacute;is
el ordenador hasta dentro de 4 a&ntilde;os.... el tiempo que tarda en
desaparecer el virus de los ordenadores.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Antena 3: Dios
m&iacute;o!! Un virus esta infectando a los ordenadores de medio
planeta, y cada minuto avanza mas! He aqu&iacute; una prueba mas de
que los ordenadores son un arma del demonio, y que internet es el
peor invento de la humanidad. Que bien est&aacute;bamos antes, con
nuestros bolis bic y una libreta.... que tiempos aquellos. Por
cierto, una ni&ntilde;a que viv&iacute;a con sus padres en Madrid, a
matado a una ara&ntilde;a aplastandola con un pie. Todo indica que es
esta acci&oacute;n violenta esta causada por el un juego de ordenador
de nombre &quot;Tetris&quot; y los demoniacos juegos de ROL (aun no
sabemos que es esto).</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Tele 5: Si, un
virus a infectado miles de ordenadores... incluso a nosotros, con lo
listos que somos!!! Todo esto es culpa de los hackers, esos chavales
cuya &uacute;nica motivaci&oacute;n para vivir es hacer sufrir al
resto de usuarios de ordenadores. Desde hoy, y hasta dentro de un
mes, echaremos la culpa a los hackers de todo lo que ocurra en este
planeta... somos muy vagos para buscar el verdadero significado de la
palabra hacker, no nos hace falta, somos muy listos.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Canal +: Un nuevo
virus inform&aacute;tico a infectado miles de ordenadores, para saber
mas sobre esta noticia, abonate... no te jode!</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>As&iacute; fue mas
o menos como comenz&oacute; a propagarse la noticia. No he analizado
las cadenas autonom&iacute;cas, en mi caso la ETB, pero os puedo
jurar que son incre&iacute;blemente deprimentes, mejor los dejamos en
paz... :)</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Pero el verdadero
problema no son los informativos televisivos... la verdadera cuesti&oacute;n
es como puede ser que las empresas mas importantes del sector de las
telecomunicaciones e inform&aacute;tica acaben infectados! Todos los
usuarios saben, o deber&iacute;an saber, que el Windows no es un
sistema operativo seguro, y menos aun el outlook. Deber&iacute;an
saber que cualquier persona puede robar sus e-mails, claves,
documentos, etc. Esto para un usuario domestico no deber&iacute;a ser
muy preocupante. El problema es que miles de empresas utilicen estos
programas para gestionar su correo!!!! Dios m&iacute;o, en manos de
quien estamos! Pero ese sigue sin ser el verdadero problema, la
cuesti&oacute;n que nos tenemos que plantear es la siguiente...
&iquest;quien se sienta delante de los ordenadores en esas empresas?
Es dif&iacute;cil imaginarse a un encargado de la seguridad
inform&aacute;tica de una empresa abriendo un archivo adjunto a un
e-mail de nombre &quot;LoveLetterforyou.TXT.vbs&quot;. Como estas
empresas pueden contratar a gente tan subnormal!</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Otra noticia que
me asombro, vino de los estados juntitos. El pent&aacute;gono fue
infectado por el virus! Esto ya tiene webs... en este momento me
vienen un par de preguntas a la cabeza.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>1&ordm; &iquest;Como
el pent&aacute;gono puede usar windows en sus ordenadores? &iquest;Son
imb&eacute;ciles? &iquest;No les importa nada la seguridad? &iquest;Donde
han aprendido inform&aacute;tica? &iquest;En la misma academia que
los Men in Green?</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>2&ordm; &iquest;Como
alguien que trabaja en el pent&aacute;gono pasa su tiempo abriendo
archivos adjuntos de los e-mails? &iquest;De verdad se creen que
alguien va a enviar una carta de amor al pent&aacute;gono? &iquest;Deber&iacute;an
dejar de tomar drogas? &iquest;Leticia Sabater es as&iacute; de
verdad, o en realidad es mas pat&eacute;tica?</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>3&ordm; &iquest;Como
puedo escribir tantas chorradas en tan poco tiempo?</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Pero tambi&eacute;n
los usuarios &quot;no profesionales&quot; de un ordenador se han
visto afectados (aunque en menor medida). Todos estos usuarios usan
windows (cada es menos, todo hay que decirlo), por su sencillez de
uso, sus cuelgues repentinos, sus pantallazos azules, etc. Tambi&eacute;n
es verdad que gracias a la estrategia de microsoft de incluir
internet explorer de serie en windows 98 ha ocasionado que el outlook
sea el gestor mas utilizado. Si a eso le sumamos la ya famosa puerta
trasera que trae de fabrica el Windows para que el gobi de Usa
investigue en nuestro ordenador, podemos decir sin ning&uacute;n
miedo a equivocarnos que windows mas&nbsp; un arma de espionaje que
un sistema operativo. porque imaginemos por un momento... un
programa, que esta instalado en miles y miles de ordenadores &iquest;quien
no tendr&iacute;a la tentaci&oacute;n de entrar en todos estos
ordenadores?</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Como sabr&eacute;is,
el virus ILoveYou podr&iacute;a haber sido mil veces mas peligroso de
lo que fue en realidad... ya que ni roba claves, ni destruye
ejecutables ni na de eso. Ahora microsoft a sacado un parche para al
fant&aacute;stico outlook, pero quiz&aacute;s ya sea demasiado tarde.
A comenzado la carrera para encontrar ese virus perfecto... que
aproveche cada uno de los miles de fallos que windows nos brinda, y
seguro que dentro de muy poco tendremos la noticia de otro nuevo
virus, que se aprovecha de no_se_que fallo para infectar maquinas con
virus, y estaremos con el mismo problema. El FBI ya tiene los cojones
de corbata... como se puedo apreciar en la falsa alarma que hubo
sobre un posible virus que convert&iacute;a los ordenadores en
&quot;zombis&quot; a merced de los pitaras inform&aacute;ticos.&nbsp;&iquest;La
soluci&oacute;n? Bajarte 2500 parches de mircrosoft.com cada d&iacute;a,
o a un SO de c&oacute;digo fuente abierto... donde no habr&aacute;
lugar a ninguna puerta trasera, ni ning&uacute;n bug tan grande como
el de outlook.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Ahora viene lo
bueno, lo siento por todos los usuarios de windows... pero que
ostias! que comience la fiesta!!!!!</FONT> </FONT>
</P>
<P ALIGN=RIGHT STYLE="margin-bottom: 0cm"><A HREF="mailto:punisher@linuxfan.com"><B><FONT SIZE=7><FONT FACE="helvetica, sans-serif">THE&nbsp;PUNISHER</FONT></FONT></B></A></P>
</BODY>
</HTML>