<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<TITLE>Internet en 3 palabras</TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice/5.1 (Linux)">
	<META NAME="CREATED" CONTENT="20000618;16511000">
	<META NAME="CHANGEDBY" CONTENT="Miguel Angel Nieto Salazar">
	<META NAME="CHANGED" CONTENT="20000618;16511700">
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
	<STYLE>
	<!--
		H3 { color: #ffffff }
		H2 { color: #ffffff }
		TD P { color: #ffffff }
		H1 { color: #ffffff }
		P { color: #ffffff }
		A:visited { color: #ffcc00 }
		A:link { color: #ffcc00 }
	-->
	</STYLE>
</HEAD>
<BODY TEXT="#ffffff" LINK="#ffcc00" VLINK="#ffcc00" BGCOLOR="#000000" BACKGROUND="backmain.gif">
<H3 ALIGN=CENTER><FONT FACE="helvetica, sans-serif"><FONT SIZE=7><I><B>INTERNET
EN 3 PALABRAS</B></I></FONT></FONT></H3>
<H1><FONT COLOR="#ffcc00"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&iquest;Qu&eacute;
es internet?</FONT></FONT></FONT></H1>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Es una
Interconexi&oacute;n de redes inform&aacute;ticas que permite a las
computadoras conectadas comunicarse directamente. Consiguiendo as&iacute;
una variada gama de informaci&oacute;n de todo tipo, esto es
accesible a todo p&uacute;blico que tengan un cierto tipo de
programas y elementos. Pero para saber como funciona se necesita
saber como naci&oacute;.</FONT> </FONT>
</P>
<H2><FONT COLOR="#ffcc00"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Historia
de Internet :</FONT></FONT></FONT></H2>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Internet se deriv&oacute;
inicialmente de la <B>Arpanet</B>, en inform&aacute;tica, una red
formada por unos 60.000 ordenadores en la d&eacute;cada de los 60,
desarrollada por la <B>AdvancedResearchProjects</B> <B>Agency</B>
(ARPA) del Departamento de Defensa de Estados Unidos. Su origen est&aacute;
en la guerra fr&iacute;a. Se tem&iacute;a que, en caso de ataque, se
destruyeran las centrales telef&oacute;nicas, por lo que se intent&oacute;
crear un sistema de conmutaci&oacute;n de datos totalmente
descentralizado. Los protocolos de comunicaci&oacute;n que se
desarrollaron dieron origen a la actual Internet. En 1990, ARPANET
fue sustituida por la Red de la Fundaci&oacute;n Nacional para la
Ciencia (<B>NSFNET</B>, acr&oacute;nimo en ingl&eacute;s) para
conectar sus supercomputadoras con las redes regionales. En la
actualidad, la <B>NSFNET</B> funciona como el n&uacute;cleo de alta
velocidad de Internet y como resultado esto que esta leyendo es el
resultado de a&ntilde;os de investigaci&oacute;n tecnol&oacute;gica
la cual imaginada hace unos 20 a&ntilde;os parecer&iacute;a algo de
locos!.</FONT> </FONT>
</P>
<H2><FONT COLOR="#ffcc00"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Como
funciona internet:</FONT></FONT></FONT></H2>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Funciona
inicialmente con algo llamado: Protocolo de Internet (<B>IP</B>) el
cual es el soporte l&oacute;gico b&aacute;sico empleado para
controlar el sistema de redes. Este protocolo especifica c&oacute;mo
las computadoras de origen encaminan la informaci&oacute;n desde el
ordenador emisor hasta el ordenador receptor. Otro protocolo
denominado Protocolo de Control de Transmisi&oacute;n (<B>TCP</B>)
comprueba si la informaci&oacute;n ha llegado al ordenador de destino
y, en caso contrario, hace que se vuelva a enviar.</FONT> <BR><FONT SIZE=2>El
Protocolo de Internet (IP) y el Protocolo de Control de Transmisi&oacute;n
(TCP) fueron desarrollados inicialmente en 1973 por el inform&aacute;tico
estadounidense <B>Vinton</B> <B>Cerf</B> como parte de un proyecto
dirigido por el ingeniero norteamericano <B>RobertKahn</B> y
patrocinado por la Agencia de Programas Avanzados de Investigaci&oacute;n
(ARPA, siglas en ingl&eacute;s) del Departamento Estadounidense de
Defensa. Internet comenz&oacute; siendo una red inform&aacute;tica de
ARPA (llamada ARPAnet) que conectaba redes de ordenadores de varias
universidades y laboratorios de investigaci&oacute;n en Estados
Unidos. <B>World</B> <B>Wide</B> <B>Web </B>se desarroll&oacute; en
1989 por el inform&aacute;tico brit&aacute;nico <B>TimothyBerners</B>-<B>Lee</B>
para el Consejo Europeo de Investigaci&oacute;n Nuclear (<B>CERN</B>,
siglas en franc&eacute;s).</FONT> </FONT>
</P>
<H2><FONT COLOR="#ffcc00"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Que
se necesita para internet:</FONT></FONT></FONT></H2>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Para navegar
primero se necesita un <B>m&oacute;dem,</B> el cual, es un equipo
utilizado para la comunicaci&oacute;n de computadoras a trav&eacute;s
de l&iacute;neas anal&oacute;gicas de transmisi&oacute;n de datos. El
m&oacute;dem convierte las se&ntilde;ales digitales del emisor en
otras anal&oacute;gicas susceptibles de ser enviadas por tel&eacute;fono.
Cuando la se&ntilde;al llega a su destino, otro m&oacute;dem se
encarga de reconstruir la se&ntilde;al digital primitiva, de cuyo
proceso se encarga la computadora receptora. En el caso de que ambos
m&oacute;dems puedan estar transmitiendo datos simult&aacute;neamente,
se dice que operan en modo <B>full</B>-<B>duplex</B>; si s&oacute;lo
puede transmitir uno de ellos, el odo de operaci&oacute;n se denomina
<B>half</B>-<B>duplex</B>. Para convertir una se&ntilde;al digital en
otra anal&oacute;gica, el m&oacute;dem genera una onda portadora y la
modula en funci&oacute;n de la se&ntilde;al digital.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>El tipo de
ondulaci&oacute;n depende de la aplicaci&oacute;n y de la velocidad
de transmisi&oacute;n del m&oacute;dem. Los m&oacute;dems de alta
velocidad, por ejemplo, utilizan una combinaci&oacute;n de modulaci&oacute;n
en amplitud y de modulaci&oacute;n en fase, en la que la fase de la
portadora se var&iacute;a para codificar la informaci&oacute;n
digital. El proceso de recepci&oacute;n de la se&ntilde;al anal&oacute;gica
y su reconversi&oacute;n en digital se denomina demodulaci&oacute;n.
La palabra m&oacute;dem es una contracci&oacute;n de las dos
funciones b&aacute;sicas: modulaci&oacute;n y demodulaci&oacute;n.
Los primeros m&oacute;dems eran muy aparatosos y s&oacute;lo pod&iacute;an
transmitir datos a unos 100 bits por segundo. Los m&aacute;s
utilizados en la actualidad en los ordenadores personales transmiten
la informaci&oacute;n a m&aacute;s de 33 kilobits por segundo. Pueden
incluir funciones de fax y de contestador autom&aacute;tico de voz.</FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Despues se
necesita un explorer: Este es un programa el cual sirve para
transferir los hipertextos (http), o los texto. Estos a su vez pasan
a traducir im&aacute;genes, java, javascript, etc.</FONT> </FONT>
</P>
<H1><FONT COLOR="#ffcc00"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Algo
distinto. Servicios de Internet:</FONT></FONT></FONT></H1>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Los sistemas de
redes como Internet permiten intercambiar informaci&oacute;n entre
computadoras, y ya se han creado numerosos servicios que aprovechan
esta funci&oacute;n. Entre ellos est&aacute;n:</FONT> <BR><FONT SIZE=2>Conectarse
a un ordenador desde otro lugar (<B>telnet</B>); transferir ficheros
entre una computadora local y una computadora remota (protocolo de
transferencia de ficheros, o <B>FTP</B>) y leer e interpretar
ficheros de ordenadores remotos (<B>gopher</B>). El servicio de
Internet m&aacute;s reciente e importante es el protocolo de
transferencia de <B>hipertexto</B> (http), un descendiente del
servicio de gopher. El http puede leer e interpretar ficheros de una
m&aacute;quina remota: no s&oacute;lo texto sino im&aacute;genes,
sonidos o secuencias de v&iacute;deo. El http es el protocolo de
transferencia de informaci&oacute;n que forma la base de la colecci&oacute;n
de informaci&oacute;n distribuida denominada <B>WorldWide</B> <B>Web</B>.</FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>La diferencia: La
World Wide Web (tambi&eacute;n conocida como Web o WWW) es una
colecci&oacute;n de ficheros, denominados lugares de Web o p&aacute;ginas
de Web, que incluyen informaci&oacute;n en forma de textos, gr&aacute;ficos,
sonidos y v&iacute;deos, adem&aacute;s de v&iacute;nculos con otros
ficheros. Los ficheros son identificados por un localizador universal
de recursos (<B>URL</B>, siglas en ingl&eacute;s) que especifica el
protocolo de transferencia, la direcci&oacute;n de Internet de la
m&aacute;quina y el nombre del fichero. Por ejemplo, un URL podr&iacute;a
ser http://www.ciudafutura.com/ Los programas inform&aacute;ticos
denominados exploradores -como Navigator, de Netscape, o Internet
Explorer, de Microsoft- utilizan el protocolo http para recuperar
esos ficheros. Continuamente se desarrollan nuevos tipos de ficheros
para la WWW, que contienen por ejemplo animaci&oacute;n o realidad
virtual <B>VRML</B>). Hasta hace poco hab&iacute;a que programar
especialmente los lectores para manejar cada nuevo tipo de archivo.
Los nuevos lenguajes de programaci&oacute;n (como Java) permiten que
los exploradores puedan cargar programas de ayuda capaces de
manipular esos nuevos tipos de informaci&oacute;n.</FONT> </FONT>
</P>
<H1><FONT COLOR="#ffcc00"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&quot;Bajarse&quot;
un programa:</FONT></FONT></FONT></H1>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Esto es
principalmente traer a trav&eacute;s de un protocolo un programa de
un ordenador lejano al nuestro, se reconoce principalmente con la
palabra &quot;download&quot; la cual inicia la transferencia de datos
seleccionando primero una carpeta para guardarlo, y al terminar se le
da doble click para que se instale.</FONT> </FONT>
</P>
<H2><FONT COLOR="#0080ff"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Terminolog&iacute;a
basica:</FONT></FONT></FONT></H2>
<UL>
	<LI><P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff9900"><B>Gateway</B>:</FONT>
	conjunto de hardware y software que conecta redes que utilizan
	protocolos de comunicaci&oacute;n diferentes, o que transmite datos
	por una red entre dos aplicaciones no compatibles. El gateway cambia
	el formato de los datos de manera que los pueda entender la
	aplicaci&oacute;n que los recibe. El t&eacute;rmino se suele usar
	para describir cualquier computadora que transmite datos de una red
	a otra, pero esta acepci&oacute;n, t&eacute;cnicamente, no es
	correcta.</FONT> </FONT>
	</P>
	<LI><P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><B><FONT COLOR="#ff9900">TCP/IP:</FONT></B>Es
	el Acr&oacute;nimo de Transmission Control Protocol/Internet
	Protocol, protocolos usados para el control de la transmisi&oacute;n
	en Internet.el cual Permite que diferentes tipos de computadoras se
	comuniquen a trav&eacute;s de redes heterog&eacute;neas. El sistema
	operativo. TCP define distintos par&aacute;metros de transmisi&oacute;n
	de datos. IP define el modo en que los datos se dividen en bloques,
	denominados paquetes, y establece el camino que recorre cada paquete
	hasta su destino. En resumen: es el protocolo de transmisi&oacute;n
	de datos. Si no has entendido: bajarse un programa de la red</FONT>.
	</FONT>
	</P>
</UL>
<P ALIGN=RIGHT STYLE="margin-bottom: 0cm"><A HREF="contactar.htm"><B><U><FONT SIZE=7><FONT FACE="helvetica, sans-serif"><FONT COLOR="#ffcc00">Rub&eacute;n
Alcaraz</FONT></FONT></FONT></U></B></A></P>
</BODY>
</HTML>