<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<TITLE>LINUX</TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice/5.1 (Linux)">
	<META NAME="AUTHOR" CONTENT="Rub&eacute;n Alcaraz">
	<META NAME="CREATED" CONTENT="20000618;16525000">
	<META NAME="CHANGEDBY" CONTENT="Miguel Angel Nieto Salazar">
	<META NAME="CHANGED" CONTENT="20000618;16525800">
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
	<STYLE>
	<!--
		TD P { color: #ffffff }
		H1 { color: #ffffff }
		P { color: #ffffff }
		A:visited { color: #ffcc00 }
		A:link { color: #ffcc00 }
	-->
	</STYLE>
</HEAD>
<BODY TEXT="#ffffff" LINK="#ffcc00" VLINK="#ffcc00" BGCOLOR="#000000" BACKGROUND="backmain.gif">
<P ALIGN=CENTER><FONT FACE="helvetica, sans-serif"><FONT SIZE=7><I><B>LINUX</B></I></FONT></FONT></P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Supongo que ya
tendras una distribuci&oacute;n de Linux(si no la tienes que haces
que no la has conseguido) a si que.... vamos a comenzar con la
instalaci&oacute;n de Linux.... este proceso lo dividir&eacute; en
dos partes, la primera que es independiente de la distribuci&oacute;n
que utilices y la segunda que es dependiente de la distribuci&oacute;n.</FONT>
</FONT>
</P>
<H1><FONT COLOR="#ffcc00"><FONT FACE="helvetica, sans-serif"><FONT SIZE=3>Parte
1:</FONT><FONT SIZE=2> Com&uacute;n a todas las distribuciones.</FONT></FONT></FONT></H1>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Al decir com&uacute;n
a todas las distribuciones me refiero al caso m&aacute;s usual de
compartir Linux con otros SSOO como MS-DOS o W9x, en el caso de
dedicarle el disco duro entero al Linux puedes pasar directamente a
la segunda parte.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Inicialmente lo
m&aacute;s usual es tener el disco duro con todo el espacio asignado
a una partici&oacute;n de DOS o W9x, para el caso de WNT o OS/2 con
NTFS o HPFS respectivamente como sistema de archivos no vale lo dicho
a partir de ahora, con la FAT o FAT32. En este caso lo que tendremos
que hacer son dos cosas, o instalar la Slackware que es la &uacute;nica
que se permite instalar bajo UMSDOS (en un directorio de tu partici&oacute;n
de dos) o reparticionar el disco duro que es el tema de esta parte.</FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Para reparticionar
el disco duro existe un programa llamado FIPS, que se distribuye
gratuitamente junto con los CD&#146;s de Linux en un directorio
llamado UTILS en Debian y DOSUTILS en RedHat, este programa hace la
partici&oacute;n actual m&aacute;s peque&ntilde;a y el espacio que
libera lo marca como una partici&oacute;n primaria de DOS sin
formatear, actualmente se distribuye la versi&oacute;n 15 que no
acepta la FAT32 pero versiones posteriores s&iacute; la aceptan,
estas versiones se encuentran en Internet. Para crearte una partici&oacute;n
por este m&eacute;todo tienes que:</FONT> </FONT>
</P>
<OL>
	<LI><P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Defragmentar
	el disco duro y comprobar que todo est&aacute; bien con Scandisk o
	similar.</FONT> </FONT>
	</P>
	<LI><P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Formatear
	un diskette con format a: /s para darle sistema y copiar en &eacute;l
	los archivos del directorio donde hayas descomprimido FIPS:
	RESTRRB.EXE, FIPS.EXE y ERROR.TXT.</FONT> </FONT>
	</P>
	<LI><P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Arrancar
	el ordenador con el diskette creado en la disquetera y ejecutar
	FIPS.EXE.</FONT> </FONT>
	</P>
	<LI><P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Cuando
	pregunte si guardar el boot y root sector al diskette decir que s&iacute;,
	esto crear&aacute; una copia de seguridad de ambos sectores por si
	la l&iacute;as.</FONT> </FONT>
	</P>
	<LI><P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Elegir
	el disco a reparticionar si tienes m&aacute;s de un disco duro. Este
	disco ser&aacute; en el que instales Linux.</FONT> </FONT>
	</P>
	<LI><P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Elegir
	el cilindro de inicio de la nueva partici&oacute;n con las flechas
	de cursor; esto condicionar&aacute; el tama&ntilde;o de la partici&oacute;n
	que dejes para Linux, su tama&ntilde;o debe ser como m&iacute;nimo
	de unos 40Mb, una cosa normal suele rondar los 300Mb, el cilindro de
	inicio nunca podr&aacute; ser mayor del 1024.</FONT> </FONT>
	</P>
	<LI><P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Al
	elegir el cilindro de inicio preguntar&aacute; si se reedita la
	partici&oacute;n, si pulsas a &#145;c&#146; volver&aacute;s atr&aacute;s
	para elegir el tama&ntilde;o y si pulsas &#145;y&#146; grabar&aacute;
	y saldr&aacute;.</FONT> </FONT>
	</P>
	<LI><P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Cualquier
	paso se puede abortar con CTRL-C.</FONT> </FONT>
	</P>
</OL>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Bien, ya tenemos
la partici&oacute;n preparada para Linux, para otros sistemas como
WNT puede ser necesario reformatear, ahora mismo no s&eacute; si
existen herramientas para reparticionar en estos sistemas. El
siguiente paso es seg&uacute;n la distribuci&oacute;n que tengamos
proceder a su instalaci&oacute;n.</FONT> </FONT>
</P>
<H1><FONT COLOR="#ffcc00"><FONT FACE="helvetica, sans-serif"><FONT SIZE=3>Parte
2:</FONT><FONT SIZE=2> Instalaci&oacute;n dependiente de la
distribuci&oacute;n.</FONT></FONT></FONT></H1>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Ahora seg&uacute;n
nuestra distribuci&oacute;n tendremos que hacer una cosa u otra, al
ser un tema bastante largo y venir bien documentado en las
distribuciones, sobre todo si las has sacado de alguna revista donde
explican como instalarla, lo dejo para que el lector lo mire en su
distribuci&oacute;n.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT SIZE=2><FONT COLOR="#ffcc00">3.
Bien, ya lo tengo instalado, &iquest;ahora qu&eacute; hago?</FONT></FONT></B>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Lo primero que
tienes que hacer si tu distribuci&oacute;n no lo ha hecho es CREARTE
UNA CUENTA DE USUARIO, si entras como usuario root es que quiz&aacute;s
no hayas creado tu cuenta de usuario, y debe ser lo primero que
hagas, sobre todo si eres novato en esto, ya que puedes borrar alg&uacute;n
archivo vital y cargarte tu flamante reci&eacute;n instalado Linux.</FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Para crear la
cuenta de usuario, como root ejecutas:</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>localhost #
adduser &lt;nombre del usuario&gt;</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>El comando adduser
se encargar&aacute; de crear el directorio del usuario, a&ntilde;adirlo
al fichero de claves (/etc/passwd) y al de grupos (/etc/group), darte
una shell (como el command.com o el 4dos.com en DOS) que normalmente
ser&aacute; <I>bash</I>, aunque existen m&aacute;s (tcsh, sh, etc.).
Te pedir&aacute; un password que no debes olvidar, ya que en Linux al
entrar hay que identificarse con login (nombre del usuario) y la
clave, aunque ya lo habr&aacute;s hecho si has entrado como root.
Algunas distribuciones dejan la cuenta de root sin password, lo que
es un grave error de seguridad ya que cualquiera podr&iacute;a entrar
como superusuario, si este es tu caso cuando entres la primera vez
como root, teclea:</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>localhost # passwd
root</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Y teclea la clave
del root, esta clave no la debes olvidar y s&oacute;lo debes entrar
como root para tareas administrativas de configuraci&oacute;n de
dispositivos u otras cosas que un usuario normal no deber&iacute;a
hacer.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Una vez que te has
creado la cuenta y que has entrado en ella (saliendo de la de root
con exit y entrando con tu nombre de usuario y clave) empiezan los
primeros pasos:</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Teclea en el promp
<I>ls</I>[intro] (de ahora en adelante supondremos que tras el
comando se pulsa la tecla INTRO). Probablemente no te saldr&aacute;
nada ya que no tienes nada en tu cuenta, por lo menos visible, ahora
teclea <I>ls &#150;a </I>(ojo a may&uacute;sculas y min&uacute;sculas
que Linux s&iacute; las distingue), ahora s&iacute; te saldr&aacute;
algo parecido a esto:</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>. .bashrc
.bash_profile .bash_history .alias</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>.. .bash_logout</FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Este es el
contenido inicial de tu cuenta, m&aacute;s o menos, los ficheros con
un punto delante son ficheros ocultos, en Linux puedes tener .bashrc
y bashrc en el mismo directorio, la opci&oacute;n &#150;a de ls(<U>l</U>i<U>s</U>t)
significa todos(all) y como puedes ver muestra los ficheros, en Linux
cada directorio tiene como m&iacute;nimo dos &#145;ficheros&#146; que
en realidad son alias al directorio actual y al anterior, estos son .
y .. respectivamente.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Ahora teclea <I>man
ls</I>, te saldr&aacute; una pantalla (en ingl&eacute;s
probablemente, aunque hay grupos que est&aacute;n traduciendo las
p&aacute;ginas del manual) con las instrucciones y opciones de uso de
<I>ls</I>, para salir de ella tendr&aacute;s que pulsar la letra q o
CTRL-C. El comando que acabas de utilizar es de vital importancia
para el uso de Linux, es la ayuda del sistema (man viene de manual),
tecleando <I>man &lt;comando&gt;</I> te mostrar&aacute; la p&aacute;gina
del manual correspondiente a este comando, para buscar alguno en
especial puedes hacer <I>man &#150;k</I> &lt;palabra a buscar&gt; o
apropos &lt;palabra a buscar&gt;. Tambi&eacute;n puedes hacer <I>man
man</I> para ver el uso de este comando.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>NUNCA apagues el
ordenador con el bot&oacute;n de reset o apagando directamente el
ordenador, ya que Linux hace uso intensivo de la cach&eacute; en
memoria para disco y algunos datos y el propio sistema de ficheros
podr&iacute;a corromperse, para apagarlo la mejor forma es en modo
consola (sin el entorno de ventanas X-Window) pulsar CTRL-ALT-DEL y
esperar a que vaya a reinicializar, entonces apagar el ordenador.
Otro m&eacute;todo consiste en hacer lo siguiente su &#150;c
&quot;/sbin/halt&quot;, te pedir&aacute; el password del root y tras
introducirlo correctamente empezar&aacute; a apagar el sistema hasta
que ponga &quot;System halted&quot;, entonces puedes apagar el
ordenador.</FONT> </FONT>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Bueno...
me despido, Ah! antes de marcharme; no me hago responsable de lo que
te pueda suceder OK. Pero de todas formas, no tiene que pasarte nada
si sigues los pasos con detenimiento. ADIOS</FONT> <BR>&nbsp;&nbsp; </FONT>
</P>
<P ALIGN=RIGHT STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><BR></FONT><A HREF="contactar.htm"><B><U><FONT SIZE=7><FONT FACE="helvetica, sans-serif"><FONT COLOR="#ffcc00">Rub&eacute;n
Alcaraz</FONT></FONT></FONT></U></B></A></P>
</BODY>
</HTML>