<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<TITLE>La historia de Pepo</TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice/5.1 (Linux)">
	<META NAME="CREATED" CONTENT="20000618;16532300">
	<META NAME="CHANGEDBY" CONTENT="Miguel Angel Nieto Salazar">
	<META NAME="CHANGED" CONTENT="20000618;16533700">
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
	<STYLE>
	<!--
		TD P { color: #ffffff }
		P { color: #ffffff }
		A:visited { color: #ffcc00 }
		A:link { color: #ffcc00 }
	-->
	</STYLE>
</HEAD>
<BODY TEXT="#ffffff" LINK="#ffcc00" VLINK="#ffcc00" BGCOLOR="#000000" BACKGROUND="backmain.gif">
<P ALIGN=CENTER><FONT FACE="helvetica, sans-serif"><FONT SIZE=7><I><B>LAS
DIVERTIDAS AVENTURAS DE PEPO</B></I></FONT></FONT></P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT SIZE=5><FONT COLOR="#febf01">CAP&Iacute;TULO
IV</FONT></FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>En la calle
continuaban los lanzamientos de c&oacute;cteles tinotov, sand&iacute;as,
bananas, mejillones y remolachas. Pepo decidi&oacute; que lo mejor
que pod&iacute;a hacer era atravesar la calle l&eacute;ntamente y con
los ojos cerrados para que no le vieran los que arrojaban la merluza
de un lado a otro (queda claro que ten&iacute;a a&uacute;n el cerebro
desactivado). Recibi&oacute; un brutal golpe de una sardina en la
cabeza pero continu&oacute; caminando pensando que ten&iacute;a que
hacer lo que fuera por encontrar a Constantino. Entonces recibi&oacute;
otro brutal golpe de trucha en la espalda y cay&oacute; al suelo. Fu&eacute;
entonces cuando Pepo se di&oacute; cuenta que el otro monasterio
Tinotano se encontraba en la direcci&oacute;n contraria por la cual
estaba yendo, as&iacute; que lentamente se levant&oacute; mientras se
daba la vuelta con los ojos cerrados y muy muy despacio recibiendo
otro golpe de un arenque en la pierna, dej&aacute;ndosela inservible.
Haciendo un gran esfuerzo cogi&oacute; el chorizo de cantimpalo verde
que tanto trabajo le hab&iacute;a costado conseguir y lo utiliz&oacute;
como muleta, en ese momento Pepo record&oacute; que deb&iacute;a ir a
recoger sus cabezas de vaca antes de ir a buscar a Constantino, as&iacute;
que una vez m&aacute;s se di&oacute; la vuelta muy despacito y con
los ojos cerrados se dirigi&oacute; hacia la alcantarilla en la cual
las hab&iacute;a dejado hasta que recibi&oacute; el impacto de una
marsopa que parti&oacute; en dos su chorizo y le dej&oacute; la otra
pierna tambi&eacute;n inservible.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Completamente
inm&oacute;vil, sin otra alternativa que esperar la muerte, Pepo,
tumbado en el suelo, se puso a pensar en los caballitos de mar, los
engranajes de 3 dientes y en el papel celo de dos caras. Sab&iacute;a
que de un momento a otro una sand&iacute;a llena de metralla
explotar&iacute;a cerca de &eacute;l, y entonces sac&oacute; el peine
m&aacute;gico que le hab&iacute;a dado el calvo y que hasta ese
momento no hab&iacute;a tenido ocasi&oacute;n de observar.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Era un peine
extra&ntilde;o, ten&iacute;a solo dos p&uacute;as, en una pon&iacute;a
un &quot;+&quot; y en otra un &quot;-&quot; y en el centro hab&iacute;a
un bot&oacute;n en el que estaba dibujada una viejecita con unos
rayos electrocut&aacute;ndose.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Pepo, aunque no
ten&iacute;a pelo, decidi&oacute; peinarse, y as&iacute; lo hizo,
pero a la cuarta o quinta de las in&uacute;tiles pasadas sobre su
calva se le escap&oacute; el dedo y puls&oacute; el bot&oacute;n de
descarga. De pronto del peine comenzaron a salir montones de rayos
que surcaron el cielo de una manera vertiginosa; casi inmediatamente
empezaron a oirse estridentes alaridos de viejas que recordaban a las
peores torturas imaginables dando paso al siguiente instante a un
silencio sepulcral, en ese momento los c&oacute;cteles tinotov, las
sardinas, los tomates y dem&aacute;s objetos que sobrevolaban la
cabeza de Pepo peligrosamente dejaron de ser lanzados. Todos hab&iacute;an
ido corriendo a ver a sus ancianas madres para ver que era lo que
hab&iacute;a ocurrido.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Pepo aprovech&oacute;
y comenz&oacute; a rodar calle abajo como si de una croqueta cubierta
de trucha se tratara en direcci&oacute;n a la alcantarilla en la cual
hab&iacute;a olvidado sus cabezas de vaca. En tan solo un par de
minutos ya hab&iacute;a llegado y con una gran habilidad se introdujo
por la boca de la alcantarilla como si de un gusano se tratara
estamp&aacute;ndose poco despu&eacute;s con el duro y humedo suelo de
la alcantarilla de cabeza.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Una vez all&iacute;
Pepo estuvo reptando por la alcantarilla intentando recordar el lugar
exacto en el que las hab&iacute;a guardado. Busc&oacute; en la
mayor&iacute;a de los cubos de basura y pregunt&oacute; a todas las
ratas que se encontr&oacute;, pero ninguna le supo decir a ciencia
cierta el paradero de estas. Desalentado decidi&oacute; entonces
abandonar la b&uacute;squeda y comenz&oacute; a ir en direcci&oacute;n
al otro monasterio Tinotano.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Lo cierto es que a
Pepo le cost&oacute; un poco salir de la alcantarilla ya que como se
hab&iacute;a dicho antes ten&iacute;a tanto los brazos como las
piernas inutilizadas por los contundentes objetos que en el hab&iacute;an
impactado cuando caminaba por la calle. Bueno, lo cierto es que seg&uacute;n
lo que hay puesto en el texto lo &uacute;nico que ten&iacute;a
inutilizadas eran las piernas pero seg&uacute;n parece alg&uacute;n
gracioso vino despu&eacute;s y le at&oacute; un brazo al otro
imposibilit&aacute;ndole hacer cualquier tarea que requiriera sus
manos o sus brazos. Sin embargo Pepo no se rindi&oacute; y a base de
mucho esfuerzo y de su gran dentadura logr&oacute; salir de all&iacute;.
Dirigi&eacute;ndose unas veces rodando y otras reptando comenz&oacute;
su camino hacia el otro monasterio Tinotano en busca de
Constantino...</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Fu&eacute; en ese
momento y no en otro cuando Pepo record&oacute; que no sab&iacute;a a
ciencia cierta en donde se encontraba ese monasterio del cual Rodolfo
Ratorriv&aacute;ceo le hab&iacute;a hablado... El solo sab&iacute;a
que estaba detr&aacute;s de las monta&ntilde;as, pero ni siquiera
sab&iacute;a de que monta&ntilde;as se trataba, de hecho Pepo ni
siquiera conoc&iacute;a el significado de la palabra monta&ntilde;a y
eso le hac&iacute;a pensar que quiz&aacute;s debiera haberlo
preguntado alguna vez... En ese momento a Pepo se le ocurri&oacute;
intentar activar su cerebro para as&iacute; intentar averiguar lo que
era la palabra monta&ntilde;a a trav&eacute;s de anal&iacute;sis de
diferentes contextos que recordaba y en los cuales aparec&iacute;a la
palabra monta&ntilde;a, pero Pepo continuaba con los brazos y las
piernas inutilizables y no pudo pulsar el bot&oacute;n que hab&iacute;a
en su nuca que ten&iacute;a por misi&oacute;n el activado del
cerebro. Sin embargo Pepo no se rindi&oacute; e intent&oacute; hallar
el significado de la palabra monta&ntilde;a a trav&eacute;s de
distintos contextos que encontr&oacute; en su cerebro. Para facilitar
la tarea Pepo decidi&oacute; ir escribiendo y dibujando todo cuanto
recordaba sobre las monta&ntilde;as con fluidos corporales sobre el
&aacute;rido y seco suelo que bajo su cuerpo yac&iacute;a...</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Despu&eacute;s de
varias horas Pepo lleg&oacute; a la siguientes conclusiones:</FONT>
<BR><FONT SIZE=2>Monta&ntilde;a = Si</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Realmente la
utilidad de esta conclusi&oacute;n era bastante nula, pero este
descubrimiento alegr&oacute; a Pepo y ello le permiti&oacute; seguir
reptando durante un par de horas m&aacute;s...</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>La noche estaba
cerca y Pepo no se encontraba en condiciones de pasarla en medio del
bosque de aquella manera, as&iacute; que rapidamente vari&oacute;
ligeramente su ruta y comenz&oacute; a ir en direcci&oacute;n a su
alcantarilla para descansar.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>En poco tiempo
Pepo lleg&oacute; a la alcantarilla (seg&uacute;n parec&iacute;a Pepo
hab&iacute;a estado dando vueltas una y otra vez alrededor de la
alcantarilla) y volvi&oacute; a meterse por ella con la misma gracia
que podr&iacute;a tener por ejemplo, un ladrillo.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Nada m&aacute;s
entrar a Pepo le pareci&oacute; percibir un olor extra&ntilde;o... Un
olor como a... Tino... Aunque suene extra&ntilde;o el olor de un Tino
es muy perceptible debido a su gran falta de higiene, no ser&iacute;a
la primera vez que se dec&iacute;a que un Tino olvid&oacute;
limpiarse el #### despu&eacute;s de haber hecho una enorme ######.</FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Como alma que
lleva el diablo Pepo comenz&oacute; a reptar por toda la alcantarilla
en busca del supuesto Tino sin reparar en el lamentable estado en el
cual se encontraba... Al llegar a cierta esquina a Pepo le parecieron
oir pasos y cuando la cruz&oacute; vi&oacute; una sombra que se
escond&iacute;a detr&aacute;s de una esquina. Pepo continu&oacute;
reptando mientras gritaba al desconocido que se estuviera quieto una
y otra vez sin que este le respondiera...</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Estaba exhausto,
hab&iacute;a expulsado todos sus fluidos corporales tratando de
averiguar el significado de monta&ntilde;a, y, adem&aacute;s de tener
las piernas inservibles y los brazos atados, ahora una gran necesidad
de agua dejaba a Pepo completamente inm&oacute;vil, tendido en el
suelo, con los ojos blancos y con un aspecto similar al de un cadaver
de varios d&iacute;as.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Se sinti&oacute;
morir... Ve&iacute;a en lo alto de sus paranoias delirantes una gran
luz y al Rey de Bastos en el centro llam&aacute;ndole y suplic&aacute;ndole
que fuera hacia la luz:</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#c1f8ff">-
Peeeepoo... Caaaamiiiina haaaacia laaaa luuuuuuz... Yaaaa haas
sufriiiidoo suficieente en esta viiiiida... Veen hacia la paaaaaaz
espirituaaaal...</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
Hac&iacute;a t&iacute; voy, Rey de Bastos... He echado a perder la
armon&iacute;a de mi civilizaci&oacute;n... ni siquiera encuentro mis
cabezas de vaca y mi chorizo de cantimpalo est&aacute; partido... no
me merezco seguir viviendo... ll&eacute;vame contigo...</FONT></FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#c1f8ff">-
Bieeeen heecho, Peepo... veeeeeen a miiii... veeeeeeeen...</FONT></FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff8000">-
No vayas Pepo, &iexcl;&iexcl;Es una trampa!!, &iexcl;&iexcl;&iexcl;AQU&Iacute;
NO HAY SALCHICH&Oacute;N!!!, &iexcl;&iexcl;&iexcl;NOS TIENEN
TIRANIZADOS EN LAS MINAS DEL OLIMPO!!!, &iexcl;&iexcl;&iexcl;AL&Eacute;JATE
DE LA LUZ!!!.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
&iquest;Papotr&oacute;nico?. &iquest;Eres t&uacute;?, &iquest;Est&aacute;s
bien?.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff8000">-
Yo ya he muerto, &iexcl;&iexcl;eres t&uacute; el que todav&iacute;a
puedes elegir!!. &iexcl;&iexcl;AL&Eacute;JATE DE LA LUZ!!, &iexcl;&iexcl;NOS
PEGA CON EL BASTO SI NO TRABAJAMOS LO SUFICIENTE!!. &iexcl;&iexcl;CORRE!!,
&iexcl;&iexcl;HUYE!!, &iexcl;&iexcl;SAL DE AQU&Iacute;!!</FONT></FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#c1f8ff">-
&iexcl;&iexcl;Maldito Papotr&oacute;nico!!, &iexcl;&iexcl;&iexcl;Vuelve
a tu cantera, desgraciado!!!, &iexcl;&iexcl;&iexcl;Y t&uacute;, Pepo,
ve hacia la luz o lo pasar&aacute;s muy mal!!!.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff8000">-
Pepo, no le hagas caso... Despierta... &iexcl;&iexcl;Despi&eacute;rtate!!,
&iexcl;&iexcl;A&Uacute;N NO HA LLEGADO TU HORA!!. Mientras recuerdes
mis consejos nada podr&aacute; sucederte... &iexcl;&iexcl;VETE!!...
Nos reuniremos contigo m&aacute;s adelante... Quiz&aacute; nunca...
pero ahora vete.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
Pero pap&aacute;, yo no recuerdo tus...</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff8000">-
Vete ahora mism-- &iexcl;&iexcl;&iexcl;AAUH!!!</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">En
ese momento el Rey de Bastos estaba golpeando brutalmente con su
basto a Papotr&oacute;nico y Pepo, que no pudo aguantar la visi&oacute;n
de esa escena y sinti&oacute; que no pod&iacute;a hacer nada para
evitarlo, a&uacute;n, se march&oacute; de aquel lugar, caminando en
sus sue&ntilde;os hacia la oscuridad, corriendo todo lo deprisa que
pudo para alejarse lo m&aacute;s r&aacute;pido posible de la luz en
la que se reencontr&oacute; con su padre.</FONT></FONT> <BR><FONT SIZE=2><FONT COLOR="#ffffff">Momentos
despu&eacute;s Pepo sinti&oacute; que se despertaba... Hab&iacute;a
vuelto al mundo real... Hab&iacute;a vencido una vez m&aacute;s a la
muerte.</FONT></FONT> <BR>&nbsp; </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT SIZE=5><FONT COLOR="#febf01">CAP&Iacute;TULO
V</FONT></FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">No
sab&iacute;a cuanto tiempo hab&iacute;a pasado desde que cay&oacute;
inconsciente y casi sin vida sobre el h&uacute;medo suelo de la
alcantarilla, le pareci&oacute; haber estado all&iacute; tumbado
horas, incluso d&iacute;as enteros debati&eacute;ndose entre la vida
y la muerte.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
Has estado a punto de morir </FONT><FONT COLOR="#c0c0c0">-</FONT><FONT COLOR="#6a6aff">
</FONT><FONT COLOR="#ffffff">le dijo alguien desde la esquina
acerc&aacute;ndose lentamente hacia Pepo </FONT><FONT COLOR="#ffff00">-
Pero ahora est&aacute;s mucho mejor, te recuperar&aacute;s en un par
de segundos... 3... 2... 1... Ya.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
&iquest;Qui&eacute;n demonios eres? &iquest;Que haces aq...?....</FONT></FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Pepo
se qued&oacute; boquiabierto. La persona torci&oacute; la esquina y
la luz de la superficie ilumin&oacute; su cabeza dejando al
descubierto la abstracta forma de Constantino.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
Creo que esto es tuyo &iquest;verdad?</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
&iexcl;&iexcl;Mis cabezas de vaca!!, Gracias.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Las
cogi&oacute; a&uacute;n sin creerse que se hab&iacute;a encontrado
cara a cara con el m&iacute;tico cazador - buscador - analizador -
descriptor - comedor - admirador de palomas Constantino, el
aut&eacute;ntico, el &uacute;nico, el irrepetible, la &uacute;nica
persona capaz de seguir a una paloma por tierra mar y aire y el &uacute;nico
capaz de distinguir a todas las palomas del universo por sus nombres.
Pepo se colg&oacute; su collar de cabezas de vaca al cuello y un
poder m&iacute;stico le envolvi&oacute;...</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
Me parece que t&uacute; tambi&eacute;n tienes algo para m&iacute;...</FONT></FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
&iexcl;Ah, s&iacute;!. &iexcl;Lo olvidaba!. Toma, tu peine m&aacute;gico,
Constantino.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
Pepo, veo que sabes quien soy. Gracias por guardarme mi peine, espero
que no lo hayas utilizado, quer&iacute;a acabar personalmente con las
viejecitas de este planeta...</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
Eeeh... no... &iquest;Yo?... No...</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
Est&aacute; bien. El maestro Rodolfo Ratorriv&aacute;ceo me dijo que
te hab&iacute;as pasado por su monasterio poco antes de que yo fuera
y que hab&iacute;as ido a buscarme al otro monasterio Tinotano del
otro lado de las monta&ntilde;as...</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Constantino
hizo una pausa para prepararse un caf&eacute; en una cafetera
imaginaria que el mismo hab&iacute;a creado mientras esperaba a que
Pepo se despertara...</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
&iquest;Quieres una taza?.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
No gracias, contin&uacute;a por favor.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
...En circunstancias normales habr&iacute;a ido a buscarte al otro
monasterio Tinotano, pero Rodolfo me advirti&oacute; de tu capacidad
intelectual y fui a buscarte a la plaza...</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Hizo
otra inquietante pausa en la conversaci&oacute;n. Esta vez para
rellenar su pipa imaginaria y continu&oacute;.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
Oh, por Dios... &iquest;No le estar&eacute; dando envidia con mi
pipa? Tengo otras en el armario y si quiere...</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
No fumo, gracias de todas formas.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
...Un ruido ensordecedor cuando me dirig&iacute;a hacia la calle
principal me hizo tener que refugiarme en las alcantarillas... Aqu&iacute;,
algunas galer&iacute;as a la derecha, me encontr&eacute; a
Ratorriv&aacute;ceo con tus cabezas de vaca y cantando...</FONT></FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Par&oacute;
de nuevo. A Pepo empezaban a cansarle ya las pausas de Constantino,
sobre todo porque ten&iacute;a asuntos mucho m&aacute;s importantes
que hacer y estaba deseando saber el final de la historia. Esta vez
Constantino aprovech&oacute; la pausa para acercarse a la ventana
imaginaria que tambi&eacute;n hab&iacute;a creado y mirar por entre
las rejillas de la persiana.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
&iexcl;&iexcl;Contin&uacute;a por favor!!.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
...Al parecer te estaba robando tus cabezas de vaca para venderlas,
pero eso no importa ahora... Me dijo que te entregara tu collar de
cabezas de vaca para que supiera que iba en serio y que fuera contigo
de vuelta al monasterio Tinotano para que nos contaran nuestra
historia &quot;plesente, pasada y futula&quot;...</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
&iexcl;&iexcl;Pues venga, v&aacute;monos!! &iquest;A que est&aacute;s
esperando?.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
No tan deprisa...</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Diciendo
esto Constantino dej&oacute; la imaginaria pipa sobre una mesilla
imaginaria y, esta vez tomando dos vasos, empez&oacute; a llenarlos
con la cafetera imaginaria lentamente.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
&iquest;Uno o dos terrones de az&uacute;car?.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
Uno por favor. &iquest;Por qu&eacute; no podemos ir ahora?.</FONT></FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
Pepo, amigo m&iacute;o, el calvo me dijo que necesitariamos de m&aacute;s
de 1.000 pepod&oacute;lares para pagar por sus precisas predicciones.
&iquest;Supongo que no tendr&aacute;s ese dinero verdad?.</FONT></FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
D&eacute;jame que vea... Un pepotavo... dos... un chicle y media pipa
chupada... pues... no.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
Yo tampoco as&iacute; que tendremos que ganar dinero de alguna
manera. Por cierto, la idea del calvo no era tan buena, no me pagaban
ni 6 pepod&oacute;lares por tus cabezas de vaca...</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
&iquest;&iquest;No habr&aacute;s intentado...?? &iexcl;&iexcl;Ser&aacute;s...!!.</FONT></FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
Tranquil&iacute;zate. Vamos a tener que pasar mucho tiempo juntos...
Ahora b&eacute;bete tu caf&eacute;. Te preparar&eacute; unas
tostadas...</FONT></FONT> <BR>&nbsp; </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT SIZE=5><FONT COLOR="#febf01">CAP&Iacute;TULO
VI</FONT></FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Constantino
y Pepo llevaban viviendo juntos m&aacute;s de 9 d&iacute;as y no
ten&iacute;an ni un solo pepotavo m&aacute;s de los que ten&iacute;an
cuando se conocieron. Hab&iacute;an formado una casa en las
alcantarillas con los fuertes cimientos de la imaginaci&oacute;n que
todo lo puede crear sin un duro. En las alcantarillas se alimentaban
siempre a base de ratas y de bebida tomaban el asqueroso l&iacute;quido
pastoso y verde que encontraban en el suelo, pero para su imaginaci&oacute;n
todo esto se convert&iacute;a en deliciosos manjares y eran felices.</FONT></FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">O
bueno, al menos lo fueron, aunque no por mucho tiempo, todo hay que
decirlo...</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Las
ratas (los peque&ntilde;os manjares con patas) se estaban acabando
debido al fuerte impacto que sobre su crecimiento produjo
Constantino; por otra parte las reservas de l&iacute;quido pastoso y
verde (la bebida sagrada y tonificante) que con mimo y cuidado hab&iacute;an
estado almacenando en grandes envases imaginarios comenzaban tambi&eacute;n
a escasear as&iacute; que Pepo y Constantino tuvieron que enfrentarse
a la cruda y dura realidad... deber&iacute;an buscar un trabajo con
el cual mantenerse... rapidamente Constantino comenz&oacute; a
trabajar en m&aacute;s de 125 trabajos que realiz&oacute; de manera
talentosa; con las cantidades ingentes de dinero que logr&oacute;
ganar en tan poco tiempo decidi&oacute; ir al supermercado nuevo que
hab&iacute;an hecho en la esquina de la alcantarilla solo para Pepo y
Constantino y compr&oacute; montones de productos alimentarios que
les vinieron muy bien.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Sin
embargo y por alguna extra&ntilde;a raz&oacute;n que Pepo no acertaba
a comprender los alimentos que Constantino aseguraba comprar en el
supermercado se asemejaban enormemente a ladrillos, sab&iacute;an
igual e estaban igual de duros, sin embargo a Pepo le pareci&oacute;
mucho m&aacute;s sencillo pensar que:</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Constantino
hab&iacute;a logrado 125 trabajos sin salir en ning&uacute;n momento
de la alcantarilla.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Constantino
desempe&ntilde;aba todos estos trabajos de manera talentosa.</FONT></FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Constantino
hab&iacute;a logrado una gran cantidad de dinero.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Hab&iacute;an
abierto un super mercado justo en la esquina de la alcantarilla para
el uso exclusivo de Pepo y Constantino.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Que
por ejemplo pensar que:</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Constantino
no hab&iacute;a logrado ni un solo trabajo lo cual es l&oacute;gico
si tenemos en cuenta que en ning&uacute;n momento sali&oacute; de la
alcantarilla para buscarlos.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Puesto
que no ten&iacute;a ning&uacute;n trabajo no los desempe&ntilde;aba
de manera talentosa ni de manera no-talentosa, simplemente no los
desempe&ntilde;aba.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Constantino
no hab&iacute;a logrado nada de dinero.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Ese
tal supermercado que Pepo hab&iacute;a estado buscando de arduas
maneras sin &eacute;xito en realidad no exist&iacute;a.</FONT></FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Si
no hab&iacute;a ning&uacute;n supermercado no pod&iacute;a ser para
uso exclusivo de Pepo y Constantino ni para uso no-exclusivo de Pepo
y Constantino, simplemente no era.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Lo
cierto es que el muy merluzo estaba cogiendo ladrillos de alg&uacute;n
lado y se los estaba dando a Pepo haci&eacute;ndolos pasar por
alimentos; para ello Constantino, que no era tonto ni mucho menos,
delicadamente escrib&iacute;a en cada uno de los ladrillos el
alimento que supuestamente era consiguiendo as&iacute; burlar durante
varios d&iacute;as la inteligencia de Pepo que se ve&iacute;a
desbordada por todos los acontecimientos que cerca de el se suced&iacute;an
(la salida de Zetoplasma por el d&iacute;a y su ocultamiento por la
tarde, el olor de sus pies, el papel celo de una cara, los engranajes
amarillos, azules y dem&aacute;s).</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Pero
Pepo no era tan tonto ni mucho menos y en poco tiempo logr&oacute;
llegar a la conclusi&oacute;n de que alguien estaba robando ladrillos
de la alcantarilla. Mayormente porque de tantos ladrillos que el
individuo a&uacute;n sin determinar hab&iacute;a quitado la
alcantarilla esta se vino abajo y Pepo y Constantino se encontraron
durante bastante tiempo sumidos en una gran monta&ntilde;a de
escombros y polvo que apenas les permit&iacute;an respirar. A&uacute;n
con eso, Pepo, que hab&iacute;a sido extrenado duramente para
resistir cuantos males le abordaran aguant&oacute; y aguant&oacute;
durante varios d&iacute;as.</FONT></FONT> <BR><FONT SIZE=2><FONT COLOR="#ffffff">Para
no perder la esplendida forma f&iacute;sica que Pepo hab&iacute;a
logrado con el paso del tiempo decidi&oacute; aprovechar el tiempo
libre que ahora ten&iacute;a para hacer ejercicio. Mayormente
ejercit&oacute; duramente las mand&iacute;bulas masticando las
inmensas monta&ntilde;as de escombros que le manten&iacute;an
apresado y las pesta&ntilde;as abriendo y cerrando los ojos
continuamente.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">De
manera simultanea Pepo pens&oacute; que tambi&eacute;n le ser&iacute;a
conveniente entrenar su cerebro; para ello se pas&oacute; durante
montones de horas contando y contando n&uacute;meros, bien cierto era
que Pepo jam&aacute;s hab&iacute;a aprendido a contar pero sin
embargo a&uacute;n recordaba las ense&ntilde;anzas que su maestra la
hab&iacute;a impartido cuando a&uacute;n se encontraba en la Tierra
sobre montones de temas interesantes...</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
A ver Iv&aacute;n, la eme con la o...</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
MOOOO.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
&iquest;Y la t con la o?.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
TOOOO,</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
&iexcl;Muy bien Iv&aacute;n, estamos haciendo grandes progresos
ultimamente!.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
Ahora todo junto.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
AAAAMOOOOTOOOO.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
&iexcl;&iexcl;&iexcl;&iexcl;BIEN!!!!.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Por
aquel entonces Iv&aacute;n deb&iacute;a encontrarse ya casi en 6&ordm;
y sus altos conocimientos en diversos campos le permitieron
rapidamente avanzar hasta la guarder&iacute;a, lugar en el cual
destac&oacute; ampliamente.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff00ff">-
A ver Iv&aacute;n &iquest;de qu&eacute; color era el caballo </FONT><FONT COLOR="#ffffff">BLANCO</FONT><FONT COLOR="#ff00ff">
de Santiago?.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
&iquest;Qui&eacute;n es Santiago?.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff00ff">-
Eso da igual, venga dime, &iquest;de que color era el caballo </FONT><FONT COLOR="#ffffff">BLANCO</FONT><FONT COLOR="#ff00ff">
de Santiago?.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
Azul.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff00ff">-
No... No es azul.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
Verde.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff00ff">-
No... La verdad es que no...</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
Turquesa.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff00ff">-
&iquest;Turquesa? Hombre pues no... Turquesa no...</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
Verde.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff00ff">-
Pero si ya te he dicho antes que no era verde.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
Es verde &iquest;verdad?.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff00ff">-
Pero si te he dicho ya dos veces que no.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
Bueno, vale, pero era verde &iquest;no?.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff00ff">-
No hombre, verde no era.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
&iexcl;&iexcl;MALDITO MENTIROSO!! &iexcl;&iexcl;&iexcl;&iexcl;ERA
VERDE!!!!.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff00ff">-
Que no hombre, que no era verde, de verdad.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
&iexcl;MIENTES! &iexcl;&iexcl;ERA VERDE!! &iexcl;&iexcl;&iexcl;&iexcl;A
MI NO PUEDES ENGA&Ntilde;ARME!!!!.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff00ff">-
NO IV&Aacute;N, &iexcl;&iexcl;NO ME MUERD..!!.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
ARGFX ARDF FADFD AADFHHHJ AERSDFS BLEU BLEU ARLCKJ GRUAFG.</FONT></FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Definitivamente
aquello si que fueron buenos tiempos... no como los de ahora... Pepo,
harto de entrenar su cerebro que parec&iacute;a definitivamente ser
inservible engull&iacute;a sin cesar los ladrillos que le
aprisionaban despu&eacute;s de la avalancha.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Hab&iacute;an
pasado ya 11 d&iacute;as desde que se encontr&oacute; con Constantino
en las alcantarillas cuando Pepo sali&oacute; a dar un paseo por las
grutas secretas (Despu&eacute;s de muchas horas de roer y roer hab&iacute;a
por fin logrado hacer a&ntilde;icos todos los ladrillos que le
rodeaban tanto a &eacute;l como a Constantino) y se encontr&oacute;
con algo sorprendente: una c&aacute;scara de platano casi no-podrida.
No pod&iacute;a creerlo: &iquest;Como pod&iacute;a haber llegado
hasta all&iacute; aquel resquicio de comida?, &iquest;Ser&iacute;a
una c&aacute;scara de platano m&aacute;gica?, &iquest;Quiz&aacute;
una c&aacute;scara de platano de m&aacute;s all&aacute; de las
estrellas?. Su cerebro, sin alcanzar a comprender la respuesta a
ninguna de estas cuestiones y, desconociendo no obstante el
significado de las preguntas, solo fue capaz de mandarle la tajante
&oacute;rden de avalanzarse sobre la c&aacute;scara de pl&aacute;tano
antes de que la c&aacute;scara de platano se avalanzara sobre &eacute;l.</FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Salt&oacute;
atl&eacute;ticamente sobre la c&aacute;scara de pl&aacute;tano y se
la comi&oacute; vor&aacute;zmente; era una sensaci&oacute;n
indescriptible la que le provoc&oacute; aquel trozo de lo que un d&iacute;a
fue comida y corri&oacute; hacia su casa imaginaria para hablar con
Constantino:</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
&iexcl;CONSTANTINO!, &iexcl;&iexcl;CONSTANTINO!!.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
&iquest;Qu&eacute; pasa?.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
&iexcl;&iexcl;ME HAS MENTIDO!!, &iexcl;&iexcl;&iexcl;ESO QUE ME DABAS
NO ERA COMIDA!!!, &iexcl;&iexcl;ESTO ES COMIDA!!, &iexcl;&iexcl;&iexcl;MIRA!!!,
&iexcl;&iexcl;NO EST&Aacute; DURO!!, &iexcl;&iexcl;&iexcl;NO DUELE LA
BOCA AL TRAGAR!!!, ES... &iexcl;&iexcl;COMIDA!!.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
Cre&iacute; que este d&iacute;a no llegar&iacute;a nunca pero... veo
que me equivoqu&eacute;... Si&eacute;ntate, por favor...</FONT></FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
&iquest;Qu&eacute; pasa?.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
Tengo algo muy importante que decirte: Lo primero es que aquello que
has comido durante los &uacute;ltimos once d&iacute;as de tu vida no
han sido otra cosa sino ratas, basura y muchos, muchos ladrillos...</FONT></FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
&iquest;Ratas?, &iquest;Basura?, &iquest;Ladrillos? &iquest;De qu&eacute;
est&aacute;s hablando? &iexcl;&iexcl;ESO ES IMPOSIBLE!!.</FONT></FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
Pero ah&iacute; no acaba la cosa... Tenemos que irnos de nuestro
palacio subterr&aacute;neo pronto, pero no podemos hacerlo por donde
entramos....</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
&iquest;Por qu&eacute; tenemos que irnos?, &iquest;Por qu&eacute; no
podemos irnos por donde venimos?.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
Eso quiz&aacute; no lo sepas nunca...</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
&iquest;Pero por qu&eacute;?.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
Es un gran misterio... Hay una leyenda que dice que...</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
&iquest;Por qu&eacute;?.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
&iexcl;&iexcl;ESTA BIEN!!, &iexcl;Esta bien!... Los ladrillos que te
estuve dando los fui cogiendo de la alcantarilla y... hace unos d&iacute;as
debido a la cantidad de ladrillos que quit&eacute; hubo una avalancha
y esta completamente taponada la salida, as&iacute; que tendremos que
buscar otra salida...</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
&iquest;Y por qu&eacute; tenemos que irnos?.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
Eeeh... Puede que no lo puedas creer... pero en verdad no he estado
empleado en 125 sitios simult&aacute;neos ni he ganado lo que se dice
una fortuna... A decir verdad... estamos igual que como empezamos...</FONT></FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
&iquest;Pero por qu&eacute; no me lo has dicho antes?.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
&iexcl;&iexcl;LO INTENT&Eacute;!!!, &iexcl;&iexcl;&iquest;ME OYES?!!,
&iexcl;&iexcl;&iexcl;YA LO CREO QUE LO INTENT&Eacute;!!. Pero cada
vez que me acercaba a t&iacute; empezabas a contarme lo maravillosos
que eran los engranajes de 3 dientes y... tem&iacute;a que te
volvieras loco y empezaras a hacer lo del...</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
BLUP --- BLUP --- BLEU --- BLU --- BLOP --- BLIP BLOP BLUP --- &iquest;DE
DONDE --- BLUP --- SACAREMOS EL -- BLIP BLOP -- DINERO ??? &iexcl;&iexcl;BLOUP!!.</FONT></FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
&iexcl;PARA POR FAVOR!.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
&iquest;BLOP BLUP BLIP?.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
&iexcl;NO LO SOPORTO!.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ff0000">-
&iquest;BLIP BLEP BLOP BLAP BLOP?.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff00">-
&iexcl;&iexcl;&iexcl;ME VOY!!!, &iexcl;&iexcl;NOS ENCONTRAREMOS EN EL
MONASTERIO TINOTANO!!.</FONT></FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Constantino sali&oacute;
corriendo por las galer&iacute;as como alma que lleva el diablo. El
impulso nervioso-f&iacute;sico-neur&oacute;lgico con crisis de
identidad que le entraban a Pepo ante las adversidades era muy
dificil de soportar por cualquier persona ajena a la civilizaci&oacute;n
PEP.</FONT> </FONT>
</P>
<P ALIGN=RIGHT><FONT FACE="helvetica, sans-serif"><B><FONT SIZE=4>CONTINUARA</FONT></B><FONT SIZE=2>....</FONT>
<BR>&nbsp; <BR>&nbsp; <BR>&nbsp; </FONT>
</P>
<P ALIGN=RIGHT><A HREF="mailto:ivanr@arrakis.es"><B><FONT SIZE=7><FONT FACE="helvetica, sans-serif"><FONT COLOR="#ffcc00">Ivan
Ramirez</FONT></FONT></FONT></B></A><FONT FACE="helvetica, sans-serif">
</FONT>
</P>
<P ALIGN=RIGHT><A HREF="mailto:davivan@mad.servicom.es"><B><FONT SIZE=7><FONT FACE="helvetica, sans-serif"><FONT COLOR="#ffcc00">Ivan
Salmeron</FONT></FONT></FONT></B></A><FONT FACE="helvetica, sans-serif">
</FONT>
</P>
<P ALIGN=RIGHT STYLE="margin-bottom: 0cm"><FONT SIZE=2><FONT FACE="helvetica, sans-serif">WWW
- </FONT><A HREF="http://members.dencity.com/ivansoft"><FONT FACE="helvetica, sans-serif">http://members.dencity.com/ivansoft</FONT></A></FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><BR>&nbsp;
<BR>&nbsp; </FONT>
</P>
</BODY>
</HTML>