<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<TITLE>Profesores</TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice/5.1 (Linux)">
	<META NAME="AUTHOR" CONTENT="Bugnick">
	<META NAME="CREATED" CONTENT="20000618;16541700">
	<META NAME="CHANGEDBY" CONTENT="Miguel Angel Nieto Salazar">
	<META NAME="CHANGED" CONTENT="20000618;16542500">
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
	<STYLE>
	<!--
		TD P { color: #ffffff }
		P { color: #ffffff }
		BLOCKQUOTE { color: #ffffff }
		A:visited { color: #ffcc00 }
		A:link { color: #ffcc00 }
	-->
	</STYLE>
</HEAD>
<BODY TEXT="#ffffff" LINK="#ffcc00" VLINK="#ffcc00" BGCOLOR="#666666" BACKGROUND="backmain.gif">
<P ALIGN=CENTER><FONT FACE="helvetica, sans-serif"><B><I><FONT SIZE=7><FONT COLOR="#ffffff">SI
LOS PROFESORES DOMINASEN EL MUNDO...</FONT></FONT></I></B> </FONT>
</P>
<P ALIGN=CENTER><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&iquest;Qui&eacute;n
no ha tenido alguna vez a uno de esos profesores que se pasaba todo
el curso recrimin&aacute;ndonos no dar nuestra vida por su
asignatura, dici&eacute;ndonos una y otra vez lo importante que ser&iacute;a
en nuestro futuro?. Nos re&iacute;amos mucho cuando en el instituto
la profesora de historia nos dec&iacute;a: -ser&aacute; mejor que os
aprendais la &quot;La Batalla de con todo detalle o nunca llegareis a
ser nada en la vida.</FONT> </FONT>
</P>
<P ALIGN=CENTER><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Y
ten&iacute;a toda la raz&oacute;n. Porque llegar&aacute; el d&iacute;a
en el que los profesores se apoderen de nuestro mundo,</FONT> <BR><FONT SIZE=2>y
ese d&iacute;a muchas cosas cambiar&aacute;n.</FONT> <BR><FONT SIZE=2>Adentr&eacute;monos
en lo que nuestra sociedad ser&aacute; en el momento en el que eso
ocurra:</FONT> <BR>&nbsp; <BR>&nbsp; </FONT>
</P>
<P ALIGN=CENTER><FONT FACE="helvetica, sans-serif"><FONT SIZE=6><FONT COLOR="#000000">una
familia convencional:</FONT></FONT> </FONT>
</P>
<P ALIGN=CENTER><FONT COLOR="#ffccff"><FONT FACE="helvetica, sans-serif"><FONT SIZE=5><B>cocinar,
cocinar cocinar sin para:</B></FONT></FONT></FONT></P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
<FONT SIZE=2>Nos encontramos en casa de la t&iacute;pica familia
espa&ntilde;ola. La familia Gilipuertas. Mam&aacute; Gilipuertas,
como cada d&iacute;a, prepara la comida para su marido y sus dos
hijitos. La preparaci&oacute;n de los alimentos no resulta ya tan
sencilla como est&aacute;bamos acostumbrados. Mam&aacute; Gilipuertas
quiere hacer un delicioso cocido madrile&ntilde;&oacute;, para lo
cual ser&aacute; necesario resolver el siguiente teorema:</FONT> </FONT>
</P>
<BLOCKQUOTE><FONT FACE="helvetica, sans-serif"><I><FONT SIZE=2><FONT COLOR="#ffffff">&nbsp;&nbsp;<B>&nbsp;
a)</B></FONT><B><FONT COLOR="#c0c0c0"> </FONT></B><FONT COLOR="#c0c0c0">Hayar
la fuerza centr&iacute;peta de un cubo de 56 metros cuadrados, con un
coeficiente de reducci&oacute;n de -7&acute;3, teniendo en cuenta que
un peso de 539 Kg. en pendiente descendente le arrastra hacia un pozo
de lodo de espesez 21&acute;453, siendo alfa=carricoche amarillo con
la ruedo delantera izquierda desgastada en un 0&acute;4623, mientras
se emerge en el hurac&aacute;n </FONT><FONT COLOR="#ffffff">Rodriguez</FONT><FONT COLOR="#c0c0c0">
que asol&oacute; Kentucky en 1825. As&iacute; mismo, sumar el
resultado al periodo de tiempo que el primo </FONT><FONT COLOR="#ffffff">Rodolfito</FONT><FONT COLOR="#c0c0c0">
tarda en mascar un chicle de clorofila que llevaba en el bolsillo de
su chaqueta de meopreno desde el 13 de Febrero de 1989. No tener en
cuenta que el primo </FONT><FONT COLOR="#ffffff">Rodolfito</FONT><FONT COLOR="#c0c0c0">
no tiene dientes, pero dividir el n&uacute;mero de mascadas al n&uacute;mero
de veces que la &quot;</FONT><FONT COLOR="#ffffff">Super Abuela</FONT><FONT COLOR="#c0c0c0">&quot;
salv&oacute; el mundo.</FONT></FONT></I> <BR><I><FONT SIZE=2><FONT COLOR="#c0c0c0">&nbsp;&nbsp;&nbsp;</FONT><B><FONT COLOR="#ffffff">
b)</FONT></B><FONT COLOR="#c0c0c0"> Obtener el resultado si el primo
</FONT><FONT COLOR="#ffffff">Rodolfito</FONT><FONT COLOR="#c0c0c0">
se rebautiza y pasara a llamarse </FONT><FONT COLOR="#ffffff">Andres&iacute;n</FONT><FONT COLOR="#c0c0c0">.</FONT></FONT></I>
<BR><I><FONT SIZE=2><FONT COLOR="#c0c0c0">&nbsp;&nbsp;&nbsp;</FONT><B><FONT COLOR="#ffffff">
c)</FONT></B><FONT COLOR="#c0c0c0"> &iquest;Y si adem&aacute;s de
llamarse Andres&iacute;n mascase el chicle con un diente?</FONT></FONT></I>
<BR><I><FONT SIZE=2><FONT COLOR="#c0c0c0">&nbsp;&nbsp;</FONT><B><FONT COLOR="#ffffff">&nbsp;
d)</FONT></B><FONT COLOR="#c0c0c0"> &iquest;Y si el diente fuese de
oro?</FONT></FONT></I> <BR><I><FONT SIZE=2><FONT COLOR="#c0c0c0">&nbsp;</FONT><B><FONT COLOR="#ffffff">&nbsp;&nbsp;
e)</FONT></B><FONT COLOR="#c0c0c0"> &iquest;Y si mientras le quita el
envoltorio al chicle le cae un yunque a la cabeza?</FONT></FONT></I></FONT></BLOCKQUOTE>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
<FONT SIZE=2>Esto significa que Mam&aacute; Gilipuertas tendr&aacute;
que despertarse a las cuatro de la ma&ntilde;ana, pues aunque tiene
un buen nivel de matem&aacute;ticas, dicha operaci&oacute;n tiene
cojones y le llevar&aacute; un m&iacute;nimo de siete horas
realizarla, por lo cual no puede comenzar a preparar la comida hasta
las 11, tiempo suficiente para a las dos tenerla perfectamente
preparada sobre la mesa.</FONT> <BR>&nbsp; <BR>&nbsp; </FONT>
</P>
<P ALIGN=CENTER><FONT COLOR="#ffccff"><FONT FACE="helvetica, sans-serif"><FONT SIZE=5><B>hambre,
hambre, tenemos hambre, hambre:</B></FONT></FONT></FONT></P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
<FONT SIZE=2>Paquito Gilipuertas llega en este momento del colegio.
Por su mente llevan pasando durante horas las im&aacute;genes de los
deliciosos platos de comida que con tanto a&iacute;nco prepara su
Mam&aacute;. Paquito se sienta en la mesa y se dispone a comer. Esto
t&aacute;mpoco resulta tan sencillo. Las cosas han cambiado.</FONT>
<BR><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Para
poder coger correntamente la cuchara, Paquito se ve obligado a
recitar en do mayor las nueve tablas de multiplicar en orden
descendente, para lo cual tan solo tiene veinte segundos.</FONT>
<BR><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Esto
provoca que Paquito, al entonar el 7 por 6 en re menor, cometa el
error que le dejar&aacute; sin comer el delicioso cocido madrile&ntilde;o.
Esto no ser&iacute;a ning&uacute;n problema de no ser porque Paquito
se ha equivocado las &uacute;ltimas 67 veces, y para un ni&ntilde;o
no comer a menudo es bastante jodido. Pero eso le ense&ntilde;ar&aacute;
a estudiar m&aacute;s.</FONT> <BR>&nbsp; <BR>&nbsp; </FONT>
</P>
<P ALIGN=CENTER><FONT COLOR="#ffccff"><FONT FACE="helvetica, sans-serif"><FONT SIZE=5><B>mi
amiguito el se&ntilde;or roca:</B></FONT></FONT></FONT></P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<FONT SIZE=2>
Otro caso a resaltar es el de ir al water a descargar. Alfonsito
Gilipuertas, hermano mayor de Paquito, se dispone a entrar en el
lavabo. Pero antes deber&aacute; hacer ciertas cosas:</FONT> <BR><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
La primera ser&aacute; recitar en menos de diez segundos la tabla
peri&oacute;dica, con todos sus n&uacute;meros y valores. Pero no
s&oacute;lo eso. Recordando las lecciones de nuestro profesor de
gimnasia, que dec&iacute;a que el ejercicio es la base de una buena
estructura corporal, deberemos as&iacute; mismo hacer juegos
malavares con la cuberter&iacute;a china mientras hacemos el pino,
adem&aacute;s, claro, de soltar la anteriormente mencionada tabla,
todo mientras la taza del water le lee un dictado que deber&aacute;
escribir sin cometer una sola falta de ortograf&iacute;a, pues de lo
contrario el acceso al cagadero se le denegar&aacute; y tendr&aacute;
que irse a cagar a unos matorrales.</FONT> <BR>&nbsp; <BR>&nbsp; </FONT>
</P>
<P ALIGN=CENTER><FONT COLOR="#ffccff"><FONT FACE="helvetica, sans-serif"><FONT SIZE=5><B>vamos
a la cama, que hay que descansar:</B></FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Pap&aacute; Gilipuertas, cabeza de familia, llega a las doce de la
noche tras una dura jornada en la obra. Tras fallar como su hijo en
las tablas de multiplicar y no poder catar el cocido de su mujer,
decide honorablemente acostarse para recuperar las fuerzas
suficientes para ir al d&iacute;a siguiente a la obra a ganarse el
pan para sus hijos. E aqu&iacute; un nuevo problema. No vale eso de
tumbarse sobre la cama y arroparse para so&ntilde;ar con los
angelitos. El proceso se divide en tres partes, de distintas materias
para la perfecta comprovaci&oacute;n del intelecto de la persona.</FONT>
<BR>&nbsp; </FONT>
</P>
<TABLE COLS=1 WIDTH=100% BORDER=1 CELLPADDING=0 CELLSPACING=0>
	<TR>
		<TD>
			<BLOCKQUOTE><FONT FACE="helvetica, sans-serif">&nbsp; <BR><B><FONT COLOR="#ffffff">PRUEBA
			N&ordm;1:</FONT></B> </FONT>
			</BLOCKQUOTE>
			<BLOCKQUOTE><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>ELECTR&Oacute;NICA:
			Comprobar la tensi&oacute;n total de la central de electricidad de
			tu comunidad, multiplicada por el n&uacute;mero de electrones
			supra-tect&oacute;nicos asumidos a la velocidad de inyecci&oacute;n
			de tinta de la impresora del vecino del quinto.</FONT> <BR><FONT SIZE=2>Para
			dicha operaci&oacute;n, utilizar obligatoriamente la lengua.</FONT>
			</FONT>
			</BLOCKQUOTE>
			<BLOCKQUOTE><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#ffffff">PRUEBAS
			N&ordm; 2 Y 3:</FONT></B> </FONT>
			</BLOCKQUOTE>
			<BLOCKQUOTE><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Nunca
			han sido escritas, pues nunca han sido puestas en funcionamiento.
			Nadie ha llegado hasta aqu&iacute;, seguramente debido al bajo
			nivel cultural del pueblo.</FONT></FONT></BLOCKQUOTE>
		</TD>
	</TR>
</TABLE>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Pap&aacute; Gilipuertas recuerda este proceso y decide inmediatamente
prepararse 20 litros de caf&eacute;.</FONT> <BR>&nbsp; <BR>&nbsp; </FONT>
</P>
<P ALIGN=CENTER><FONT COLOR="#ffccff"><FONT FACE="helvetica, sans-serif"><FONT SIZE=5><B>el
elocuente frigor&iacute;fico:</B></FONT></FONT></FONT></P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
&iquest;Qu&eacute; quieres coger un yogurt del frigor&iacute;fico?
Pues solo tendr&aacute;s que responder a unas sencillas preguntitas:</FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Pasado irreberente del presente pluscuamperfecto subjuntivo del verbo
transgovertar, en griego, aplicado as&iacute; mismo al coeficiente de
reducci&oacute;n de sistema porcentual a=0.2345% + log (0,3,14).</FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
&iquest;Qu&eacute; no te los sabes? &iexcl;Pues a comer mierda!</FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Aunque les cuesta acoplarse al sistema, la familia Gilipuertas es
feliz porque sabe que todas estas penurias son por su bienestar en la
vida.</FONT> <BR>&nbsp; <BR>&nbsp; </FONT>
</P>
<P ALIGN=CENTER><FONT COLOR="#ffccff"><FONT FACE="helvetica, sans-serif"><FONT SIZE=5><B>algunas
situaciones m&aacute;s:</B></FONT></FONT></FONT></P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
<FONT SIZE=2>Una vez visitada la cotidiana vida de esta entra&ntilde;able
familia veamos algunos otros ejemplos de una sociedad dominada por
nuestros queridos profesores:</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Quiero atravesar la carretera para ir a comprar el pan. &iquest;Qu&eacute;
pulse el botoncito para que se ponga el hombrecillo verde? &iexcl;&iexcl;&iexcl;Y
una mierda!!!</FONT> <BR><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
El art&iacute;culo 763 de los 648 estatutos gubernamentales de los
&#147;Teoremas para atravesar una carretera&#148; me indican que bajo
esa circunstancia deber&eacute; estimar la medida de la carretera,
pasarla a n&uacute;meros binarios, analizar la frecuancia de honda
para as&iacute; poder sincronizarla con la S&eacute;ptima Sinfon&iacute;a
de Bethoveen y finalmente realizar un coeficiente de reducci&oacute;n
algebraico con la multiplicaci&oacute;n del n&uacute;mero de zancadas
necesario para llegar a la panader&iacute;a, dividido entre el n&uacute;mero
de documentales realizados desde 1976 por la National Geografic.</FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
&iquest;Que quieres hechar un polvo? Pues cuando est&eacute;s en
bolas con esa r&uacute;bia de 18 a&ntilde;os que mira t&uacute; por
donde es una modelo internacional, esta te dir&aacute; que le
traduzcas al lat&iacute;n &#147;El Quijote&#148; en dos minutos. Si
no lo haces, la chica se va muy ofendida gritandote &#147;maric&oacute;n
inculto&#148; y dici&eacute;ndo que no quiere volver a verte en su
vida. El rumor correr&aacute; por todo el mundo y adem&aacute;s de
ser un azmerreir internacional tu vida sexual se reducir&aacute; a
&#147;nula&#148; el resto de tu vida, al no ser que te lo quieras
montar con la ovejita de la abuela Mari Juani.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Y para ingresar dinero en el banco. O analizas un texto de Federico
Garc&iacute;a Lorca y pintas un cuadro renacentista o ya puedes ir
guardandote el dinero en los calzones, porque ningun banco te lo
aceptar&aacute; nunca.</FONT> <BR><FONT SIZE=2>To mu facil y ameno.</FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Porque las Matem&aacute;ticas, Historia, Educaci&oacute;n F&iacute;sica
y todas esas asignaturas que damos en los institutos nos ense&ntilde;an
a vivir. Saber el seno y el coseno matem&aacute;ticos es
perfectamente aplicable a la hora de freirse unos huevos fritos. O si
quieres aprender a tocar la guitarra basta con hacerse un par de
ejercicios de l&iacute;mites para convertirte en el guitarrista de
U2.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
&iquest;Veis lo bien que ir&iacute;a el mundo si los profesores lo
dominasen? Porque ellos siempre tienen raz&oacute;n y piensan en
nuestro bien estar. &iquest;O no?</FONT> <BR>&nbsp; <BR>&nbsp; </FONT>
</P>
<P ALIGN=CENTER><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Este
art&iacute;culo est&aacute; dedicado a <B>Marisa</B>, mi profesora de
Historia del Instituto.</FONT></FONT> <BR><FONT SIZE=2><FONT COLOR="#ffffff">Conocer
a una mujer tan engre&iacute;da y tan sumamente puta me ha dado
fuerzas</FONT></FONT> <BR><FONT SIZE=2><FONT COLOR="#ffffff">para
escribir esto y para realmente querer ser alguien importante en la
vida.</FONT></FONT> <BR><FONT SIZE=2><FONT COLOR="#ffffff">Espero de
todo coraz&oacute;n que esto llegue alg&uacute;n d&iacute;a a tus
manos y puedas leerlo.</FONT></FONT> <BR><FONT SIZE=2><FONT COLOR="#ffffff">Gracias.</FONT></FONT></FONT></P>
<P ALIGN=RIGHT><FONT FACE="helvetica, sans-serif"><B><U><FONT SIZE=7><FONT COLOR="#ffcc00">EL
NI&Ntilde;O &Ntilde;UMY</FONT></FONT></U></B> </FONT>
</P>
<P ALIGN=RIGHT STYLE="margin-bottom: 0cm"><A HREF="http://www.dreamers.com/resaka"><FONT SIZE=2><FONT FACE="helvetica, sans-serif"><FONT COLOR="#ffcc00">http://www.dreamers.com/resaka</FONT></FONT></FONT></A></P>
</BODY>
</HTML>