<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<TITLE>Snakemail</TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice/5.1 (Linux)">
	<META NAME="CREATED" CONTENT="20000618;16555000">
	<META NAME="CHANGEDBY" CONTENT="Miguel Angel Nieto Salazar">
	<META NAME="CHANGED" CONTENT="20000618;16555600">
	<META NAME="ProgId" CONTENT="FrontPage.Editor.Document">
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
</HEAD>
<BODY BACKGROUND="backmain.gif">
<H2 ALIGN=CENTER><FONT COLOR="#ffffff"><FONT FACE="helvetica, sans-serif"><FONT SIZE=7><I><B>Snakemail
( o Mailsnake, para los zurdos :-)</B></I></FONT></FONT></FONT></H2>
<P STYLE="margin-bottom: 0cm"><FONT COLOR="#ffffff"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Seguro
que hay m&aacute;s de un esc&eacute;ptico que no sabe que es o que
finalidades puede tener este tipo de mails y a cualquier cosa que les
diga me van a llamar loco (esto me lo llama mucha gente :-) y
paranoico (esto tambi&eacute;n, pero menos). Pues bien, dedicado a
todos ellos, va por ustedes.</FONT></FONT></FONT></P>
<P><FONT COLOR="#ffffff"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Atenci&oacute;n,
este texto es completamente informativo, que nadie se ponga a hacer
el cr&iacute;o para creerse m&aacute;s macho (o m&aacute;s hembra,
para las posibles lectoras :-) usando esto para re&iacute;rse a costa
de los dem&aacute;s. Adem&aacute;s, es aconsejable que lo lea todo el
mundo, aunque no tengas previsto hacer t&uacute; un mailsnake, pero
conoci&eacute;ndolos no contribuir&aacute;s sin querer a su
desarrollo y proliferaci&oacute;n por la red.</FONT></FONT></FONT></P>
<P><FONT FACE="helvetica, sans-serif"><I><FONT SIZE=2><FONT COLOR="#ffffff">&quot;La
diferencia entre un lamer y un hacker es la misma que hay entre el
que se hace el listo y el que lo es&quot;.</FONT></FONT></I> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Seguramente
que m&aacute;s de una vez has recibido un snakemail. Que s&iacute;,
tu hazme caso, fijo que los has recibido, pero a&uacute;n no sabes lo
que es. Un <B>Snakemail</B> es un mail con un texto sugerente que
pide que se reenv&iacute;e a todo el mundo que conozcas.</FONT></FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Es
un medio r&aacute;pido y barato (si no contamos el coste de estar
conectado a Internet unos segundos, sale gratis) de conseguir cientos
de direcciones de mails, y con un poco de suerte tambi&eacute;n los
nombres de los due&ntilde;os de dicha direcci&oacute;n.</FONT></FONT>
</FONT>
</P>
<H3><FONT COLOR="#ffcc00"><FONT FACE="helvetica, sans-serif"><FONT SIZE=3><U>Como
hacerlo</U></FONT></FONT></FONT></H3>
<P><FONT COLOR="#ffffff"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Partimos
del supuesto que quieres conseguir la direcci&oacute;n de correo de
unas personas en particular con algo en com&uacute;n.</FONT></FONT></FONT></P>
<OL>
	<LI><P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Entra
	en la lista de correo o news por donde anden normalmente tus
	v&iacute;ctimas. Si este no es el caso, tienes que localizar a una
	persona que conozca a muchas dentro del c&iacute;rculo en el que se
	mueven tus v&iacute;ctimas. Por ejemplo, si tus v&iacute;ctimas
	entran normalmente en un canal del IRC, m&aacute;ndale el mail a una
	de ellas o a otra persona medianamente popular dentro de ese mismo
	canal. Se supone que ya llevas un tiempo en esa lista y te has
	ganado unos cuantos amiguetes.</FONT></FONT> </FONT>
	</P>
</OL>
<OL START=2>
	<LI><P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Escribes
	un mail que b&aacute;sicamente se pueda resumir en lo siguiente:</FONT></FONT>
	</FONT>
	</P>
</OL>
<P STYLE="margin-left: 1.91cm; margin-bottom: 0cm"><FONT COLOR="#ffffff"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><I>Si
reenv&iacute;as esto, ganaras un dinero por cada destinatario.
Reenv&iacute;alo a todas las personas de tu lista de correo.</I></FONT></FONT></FONT></P>
<P STYLE="margin-left: 1.88cm; text-indent: -0.64cm"><FONT COLOR="#ffffff"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&middot;NOTA:
En vez de &#147;ganar un dinero&#148;, puedes poner &#147;ayudar a
una ni&ntilde;a enferma&#148;, que tambi&eacute;n se ve mucho.</FONT></FONT></FONT></P>
<OL START=3>
	<LI><P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Manda
	tu mail a la lista/news/v&iacute;ctima popular (a partir de ahora,
	&#147;lista&#148; a secas). Por seguridad y eficacia, manda el mail
	a m&aacute;s de una persona.</FONT></FONT> </FONT>
	</P>
</OL>
<OL START=4>
	<LI><P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Alguno
	de los destinatarios del paso 3, ser&aacute; ingenuo y har&aacute;
	lo que esperamos: reenviar. Enviar&aacute; el mail a todos los
	miembros de su libreta de direcciones. A su vez, alguno de estos
	miembros, reenviaran el mail a toda su libreta... Es decir, este
	paso se repetir&aacute; varias veces, cosa que nos conviene.</FONT></FONT>
	</FONT>
	</P>
</OL>
<OL START=5>
	<LI><P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Consulta
	tu buz&oacute;n dentro de unos d&iacute;as y tendr&aacute;s un mail
	con un encabezado enorme, repleto de direcciones de Internet y el
	mismo cuerpo que tu mandaste. Si tienes suerte, alguien habr&aacute;
	a&ntilde;adido alg&uacute;n comentario, pudiendo as&iacute; incluso
	re&iacute;rte de la ingenuidad de los pobres plebeyos.</FONT></FONT>
	</FONT>
	</P>
</OL>
<H3><FONT COLOR="#ffcc00"><FONT FACE="helvetica, sans-serif"><FONT SIZE=3><U>Funcionamiento</U></FONT></FONT></FONT></H3>
<P STYLE="margin-bottom: 0cm"><FONT COLOR="#ffffff"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&iquest;Qu&eacute;
a pasado? &iquest;Qu&eacute; misteriosos procesos se han llevado a
cabo entre el paso 4 y 5? &iquest;Acaso es cosa de magia? Dependiendo
del texto del mensaje, el mensaje original habr&aacute; seguido dos
rutas distintas:</FONT></FONT></FONT></P>
<P STYLE="margin-left: 1.88cm; text-indent: -0.64cm"><FONT COLOR="#ffffff"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&middot;<B>Mensaje
repetitivo</B>: si dise&ntilde;aste un texto que incitara al
destinatario a repetirlo una y otra vez, le este apartado. Por
ejemplo, aqu&iacute; se engloban los mails cuyo cuerpo encierre la
idea &#147;cuanto m&aacute;s env&iacute;es esto, m&aacute;s ganar&aacute;s&#148;.
Al usuario le llegar&aacute; el mail y lo reenviar&aacute;. Si le
vuelve a llegar, pensar&aacute; que va a ganar m&aacute;s y lo
volver&aacute; a enviar. Es lo que se puede llamar una <U>topolog&iacute;a
lineal o de doble sentido.</U></FONT></FONT></FONT></P>
<P STYLE="margin-left: 1.88cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Es
un poco complicado de explicar con palabras, pero voy a intentarlo.
La persona que env&iacute;a el mail original es A. Una de las
personas que lo recibe es B. Un tercer sujeto es C. Ahora veamos como
recorre un mail esta topolog&iacute;a:</FONT></FONT> </FONT>
</P>
<P STYLE="margin-left: 5.38cm; text-indent: -0.64cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">-A
manda mail a B.</FONT></FONT> </FONT>
</P>
<P STYLE="margin-left: 5.38cm; text-indent: -0.64cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">-B
manda mail a C y a A.</FONT></FONT> </FONT>
</P>
<P STYLE="margin-left: 5.38cm; text-indent: -0.64cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">-C
manda mail a otras personas y a B.</FONT></FONT> </FONT>
</P>
<P STYLE="margin-left: 5.38cm; text-indent: -0.64cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">-B
manda mail a C y a A.</FONT></FONT> </FONT>
</P>
<P STYLE="margin-left: 1.88cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Como
podr&aacute;s deducir, el proceso se repite siempre con el mismo
patr&oacute;n. A ha recibido dos mails. Uno con las direcciones a los
que B lo mand&oacute;. Y otro con las direcciones a las que C lo
mand&oacute;. Dicho sea de otro modo. El mail llega hasta el punto B
y vuelve hacia ti. Luego llega hasta C y regresa, luego hasta D y
regresa... As&iacute; vas almacenando informaci&oacute;n sobre los
correos electr&oacute;nicos.</FONT></FONT> </FONT>
</P>
<P STYLE="margin-left: 1.88cm"><FONT FACE="helvetica, sans-serif"><B><U><FONT SIZE=2><FONT COLOR="#ffcc00">Problemas</FONT></FONT></U></B>
</FONT>
</P>
<P STYLE="margin-left: 1.88cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Llegar&aacute;
un momento en que un eslab&oacute;n de la cadena cercano a ti se
canse de reenviar mensajes, con lo que todo el sistema se va a pique.
Tu mail seguir&aacute; avanzando por todo el planeta, pero ya la
informaci&oacute;n no te llegar&aacute;, le llegar&aacute; a otras
personas. Si tienes suerte, al cabo de mucho tiempo, te llegar&aacute;
tu mismo mail, pero no cuentes con ello.</FONT></FONT> </FONT>
</P>
<P STYLE="margin-left: 1.88cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Es
posible que tu est&eacute;s entre las personas a las que C, D, E...
reenv&iacute;en el mail, salt&aacute;ndote as&iacute; los eslabones
intermedios. Esto parece la soluci&oacute;n al problema anterior, y
lo es. Pero por desgracia, conlleva otro problema. Llegar&aacute; un
momento en que el mail llegue H, el cual no tendr&aacute; ni idea de
quien eres t&uacute;. Es decir, cuanto m&aacute;s avance el mail,
menores son las posibilidades de que los destinatarios te conozcan, y
por tanto, menores son las posibilidades de que te vuelva a llegar.</FONT></FONT>
</FONT>
</P>
<P STYLE="margin-left: 1.88cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Este
tipo de topograf&iacute;a es aconsejable usarla solo en el caso de
que no conozcamos una lista en la que est&eacute;n nuestras v&iacute;ctimas.
Usarlo solo como &uacute;ltima alternativa, es bastante posible que
no funcione tan bien como te lo esperas. Recibir&aacute;s informaci&oacute;n
de correos, si, pero no de las personas que esperabas a no ser que
tengas un poco de suerte.</FONT></FONT> </FONT>
</P>
<P STYLE="margin-left: 1.88cm; text-indent: -0.64cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">&middot;<B>Mensaje
&uacute;nico</B>: es un texto en el cual la persona solamente lo
env&iacute;a una vez, y en el caso de que le vuelva a llegar, dir&aacute;
&#147;bah, ya lo he enviado, no lo vuelvo a hacer&#148;. Este mensaje
est&aacute; destinado a un completo fracaso, ya que solamente
funciona en una lista (lista de correo, unas news, o dentro de un
grupo de personas que sepas que se env&iacute;a mail muy
frecuentemente y a todos los miembros del grupo). Es una <U>topolog&iacute;a
anular o de bucle</U>.</FONT></FONT> </FONT>
</P>
<P STYLE="margin-left: 1.88cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Tiene
una estructura ciertamente peculiar. Al mandar el mensaje dentro de
una lista se produce un movimiento interior, en el que el mail pasa
de unos a otros por un tiempo indefinido. En estos sucesivos
movimientos, el mail va engrosando su lista de destinatarios, algunos
de la lista. Pero otros de los destinatarios, son gente de fuera,
externa a la lista. Por ejemplo, cuando B env&iacute;e el mail, lo
har&aacute; a D y a E, que pertenecen a la lista, pero tambi&eacute;n
lo har&aacute; a F y a G, amigos que est&aacute;n fuera de la lista.
As&iacute;, el mail va acumulando informaci&oacute;n de gente de la
lista y de gente de fuera.</FONT></FONT> </FONT>
</P>
<P STYLE="margin-left: 1.88cm"><FONT FACE="helvetica, sans-serif"><B><U><FONT SIZE=2><FONT COLOR="#ffcc00">Problemas</FONT></FONT></U></B>
</FONT>
</P>
<P STYLE="margin-left: 1.88cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">En
todas las listas suele haber gente un poco m&aacute;s despierta y
experimentada que pide que no se env&iacute;en dichos mensajes.
Dependiendo de la lista, su tem&aacute;tica, su tama&ntilde;o y el
n&uacute;mero de componentes, el factor &#147;listo-de-turno&#148;
puede ser mayor o menor. Siempre habr&aacute; alguien que se queje,
pero seguramente habr&aacute; alguien que le den igual las quejas y
siga mandando los mailsnakes.</FONT></FONT> </FONT>
</P>
<P STYLE="margin-left: 1.88cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Aunque
el tiempo de vida en activo (es decir, mientras te da informaci&oacute;n)
de este mailsnake es mayor, dentro de la lista morir&aacute; pronto.
Pero tiene la peculiaridad que en su movimiento formar&aacute; muchas
cadenas con el patr&oacute;n topogr&aacute;fico lineal (las inician
inintencionadamente las personas externas a la lista que reenv&iacute;an
el mail). Eso nos da igual, ya que para nosotros el mail habr&aacute;
muerto porque no nos suministra ninguna informaci&oacute;n.</FONT></FONT>
</FONT>
</P>
<P STYLE="margin-left: 1.88cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Tiene
el problema que cuando en una lista aparecen demasiados snakemails,
los miembros se conciencian del problema y ya no participan en la
cadena. No obstante, si es una lista con un n&uacute;mero elevado de
altas y bajas, este no es un problema mayor.</FONT></FONT> </FONT>
</P>
<P STYLE="margin-left: 1.88cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Otro
peligro es que puedes ser expulsado de la lista si formas parte de
ella. Tambi&eacute;n se puede enviar desde fuera de la lista a un
miembro de &eacute;sta, pero las posibilidades de funcionamiento son
menores.</FONT></FONT> </FONT>
</P>
<H3><FONT COLOR="#ffcc00"><FONT FACE="helvetica, sans-serif"><FONT SIZE=3><U><B>&iquest;Todo
mail en cadena es un mailsnake?</B></U></FONT></FONT></FONT></H3>
<P STYLE="margin-bottom: 0cm"><FONT COLOR="#ffffff"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>No.
Nunca podr&aacute;s saber con total seguridad si un mail forma parte
de una cadena o no. Pero usando el sentido com&uacute;n, tendr&aacute;s
cierta seguridad a la hora de catalogarlo. Como regla base, piensa
que cuanto mayor sea el beneficio que el mail te ofrece a ti o a otra
persona, m&aacute;s posibilidades hay de que sea falso. Adem&aacute;s,
hay otras caracter&iacute;sticas clave:</FONT></FONT></FONT></P>
<P STYLE="margin-left: 1.88cm; text-indent: -0.64cm"><FONT COLOR="#ffffff"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&middot;Si
un mail te ofrece dinero / beneficios a ti o a otra persona,
generalmente ser&aacute; falso</FONT></FONT></FONT></P>
<P STYLE="margin-left: 1.88cm; text-indent: -0.64cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">&middot;Si
un mail da datos y hechos concretos y cre&iacute;bles, es posible que
sea verdadero.</FONT></FONT> </FONT>
</P>
<P STYLE="margin-left: 1.88cm; text-indent: -0.64cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">&middot;Si
un mail no pide su reenv&iacute;o, posiblemente sea verdadero.</FONT></FONT>
</FONT>
</P>
<H3><FONT COLOR="#ffcc00"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><U><B>Finalidad</B></U></FONT></FONT></FONT></H3>
<P STYLE="margin-bottom: 0cm"><FONT COLOR="#ffffff"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Bien,
pero la gente, &iquest;por qu&eacute; hace todo eso?. Se me ocurren
tres situaciones:</FONT></FONT></FONT></P>
<P STYLE="margin-left: 1.27cm; text-indent: -0.64cm"><FONT COLOR="#ffffff"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>-<B>Lamer</B>:
lo hace para sentirse mas macho (o hembra, no discriminemos :-).
Luego mandar&aacute; un mail con un &#147;seudo&#148; virus, un mail
cargado que tarde mucho en bajarse, textos u im&aacute;genes
ofensivas... a todas sus v&iacute;ctimas. PAT&Eacute;TICO. Lector,
espero que tengas dos dedos de frente y demuestres haber dejado el
primer estadio moral (el de la infancia) y no hagas cosas de cr&iacute;os.</FONT></FONT></FONT></P>
<P STYLE="margin-left: 1.27cm; text-indent: -0.64cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">-<B>Hacker</B>:
usar&aacute; la informaci&oacute;n para una causa m&aacute;s noble,
aunque (por desgracia) ilegal. Buscar&aacute; el mail que le
interesa, y lo dem&aacute;s lo borrar&aacute;, no es su objetivo. Yo
declaro abiertamente haber hecho varios mailsnakes encuadr&aacute;ndome
en este marco. En particular, el &uacute;ltimo lo hice para saber la
direcci&oacute;n de un t&iacute;o que estaba mandando mails obscenos
a una amiga, y que as&iacute; el susodicho idiota pudiera recibir una
lecci&oacute;n. Creo que obr&eacute; bien y lo volver&iacute;a a
hacer.</FONT></FONT> </FONT>
</P>
<P STYLE="margin-left: 1.27cm; text-indent: -0.64cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">-<B>Empesa</B>:
la peor cala&ntilde;a, sin duda (lo siento por los empresarios que
est&eacute;n leyendo esto :-). Muchas lo hacen. Por ejemplo, una
empresa de telefon&iacute;a har&aacute; un mailsnake en un foro o
news de telefon&iacute;a para reunir posibles clientes. Si recibes
este tipo de mailsnake y picas, al cabo de unos d&iacute;as recibir&aacute;s
un mail de la empresa anunci&aacute;ndote sus fant&aacute;sticas
ofertas.</FONT></FONT> </FONT>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffffff">Es
una herramienta mucho m&aacute;s poderosa de lo que pueda parecer, si
la sabes usar correctamente. En concreto, yo he llegado a recibir m&aacute;s
de 200 mails con sus direcciones en unos d&iacute;as y sin ning&uacute;n
esfuerzo.</FONT></FONT>&nbsp; </FONT>
</P>
<P ALIGN=RIGHT><FONT FACE="helvetica, sans-serif"><BR><U><I><FONT SIZE=2><FONT COLOR="#ffffff">Conocimientos:
The Thinker</FONT></FONT></I></U> </FONT>
</P>
<P ALIGN=RIGHT STYLE="margin-bottom: 0cm"><FONT COLOR="#ffcc00"><FONT FACE="helvetica, sans-serif"><FONT SIZE=7><B>KrycheK</B></FONT></FONT></FONT></P>
</BODY>
</HTML>