<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<TITLE></TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice/5.1 (Linux)">
	<META NAME="CREATED" CONTENT="20000618;16561700">
	<META NAME="CHANGEDBY" CONTENT="Miguel Angel Nieto Salazar">
	<META NAME="CHANGED" CONTENT="20000618;16562500">
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
	<STYLE>
	<!--
		TD P { color: #ffffff }
		P { color: #ffffff }
		A:visited { color: #ffcc00 }
		A:link { color: #ffcc00 }
	-->
	</STYLE>
</HEAD>
<BODY TEXT="#ffffff" LINK="#ffcc00" VLINK="#ffcc00" BGCOLOR="#c7c3c7" BACKGROUND="backmain.gif">
<P ALIGN=CENTER><FONT FACE="helvetica, sans-serif"><FONT SIZE=7><I><B>&iquest;COMO
ENTRAR A LOS SITIOS GRATUITOS QUE PIDEN TARJETA DE CREDITO?</B></I></FONT></FONT></P>
<P><BR><BR>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Si los sitios son
gratuitos, o te regalan un acceso de una semana, &iquest;por qu&eacute;
piden un n&uacute;mero de tarjeta de cr&eacute;dito?&nbsp; Seg&uacute;n
ellos, para verificar la edad de quienes lo visitan (se trata casi
siempre de sitios para adultos), pero la realidad es que es una
simple estrategia de ventas.&nbsp; Si ya tienen tu tarjeta s&oacute;lo
requieren tu consentimiento (expreso o no tan expreso) para venderte
cualquier cosa y facturarla de inmediato.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&iquest;No es
acaso un truco INJUSTO?&nbsp; &iquest;Acaso aquellos que no tienen
American Express o Visa no pueden tambi&eacute;n ser mayores de
edad?&nbsp; &iquest;Si lo que ofrecen es &quot;gratis&quot;, acaso
est&aacute; bien pedir a cambio algo, aunque m&aacute;s no sea
informaci&oacute;n sobre la tarjeta de cr&eacute;dito?</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Las respuestas
son:&nbsp; No s&oacute;lo es injusto, es un fraude.&nbsp;&nbsp; Si
ofrecen algo gratis no pueden pedir nada a cambio, esa es la
diferencia entre &quot;regalo&quot; y &quot;promoci&oacute;n&quot;,
as&iacute; c&oacute;mo ocurre con los pobres peatones incautos que
creen haber ganado una c&aacute;mara fotogr&aacute;fica o una estad&iacute;a
en la playa por s&oacute;lo ir a escuchar a un vendedor durante un
rato y rechazar la oferta.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>A un conocido m&iacute;o
le dijeron que hab&iacute;a ganado una semana de estad&iacute;a en la
playa, que lo pasara a retirar, y lo cierto es que no lo dejaron irse
hasta que se llev&oacute;, no solo su estad&iacute;a gratis, sino
tambi&eacute;n un &quot;tiempo compartido&quot; (modalidad de
vacaciones) que tuvo que pagar 10.000 d&oacute;lares.&nbsp; Tal es la
habilidad de los vendedores, que &eacute;l reci&eacute;n cay&oacute;
en cuenta esa noche, en su casa, que lo que se hab&iacute;a
comprometido a pagar era excesivo para su presupuesto.</FONT> <BR>&nbsp;
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Y tal es el
fraude, y la presi&oacute;n a la que fu&eacute; expuesto, que un juez
lo liber&oacute; del compromiso.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Distinto fu&eacute;
el caso de un bu&eacute;n amigo m&iacute;o, que (seg&uacute;n lo que
&eacute;l me relat&oacute;) en cuanto entr&oacute; a la editorial
sudamericana Larousse, a retirar el premio de una &quot;raspadita&quot;
(&quot;scratch 'n win&quot; para los que no entiendan el t&eacute;rmino),
lo invitaron a presenciar la presentaci&oacute;n de una espectacular
enciclopedia.&nbsp; &Eacute;l aclar&oacute; al vendedor que no
deseaba comprarla, a lo cual le respondieron que no habr&iacute;a
ning&uacute;n problema, que se quedara si deseaba apreciar la
presentaci&oacute;n, lo trataron muy amablemente, caf&eacute; de por
medio, sin presiones, y al retirarse le entregaron el vale por esa
semana de estad&iacute;a en la costa que hab&iacute;a ganado.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Todos estos casos
tienen algo en com&uacute;n.&nbsp; Lo primero en llegar son los
premios y los regalos, que casi siempre son: una c&aacute;mara
fotogr&aacute;fica (y la posibilidad de ganar un coche) o una semana
de vacaciones, y en el caso de estos sitios web, una semana de
membres&iacute;a gratuita.&nbsp; Lo que llega despu&eacute;s es una
largu&iacute;sima sesi&oacute;n de ventas &quot;one to one&quot; (uno
a uno, el vendedor trata directamente con el comprador, hasta hacerlo
ceder, y la orden es no dejarlo ir hasta que compre, sobre todo si ya
lograron que informe el n&uacute;mero de su tarjeta de cr&eacute;dito).</FONT>
<BR>&nbsp; </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>En el caso de
estas p&aacute;ginas web, el truco es que apretes alg&uacute;n bot&oacute;n
&quot;Aceptar&quot; que no explica exactamente qu&eacute; es lo que
vas a aceptar.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>Se plantea otro
interrogante:&nbsp; &iquest;Est&aacute; bien, sospechando las
intenciones de qui&eacute;n nos lo interroga, informar un n&uacute;mero
de tarjeta de cr&eacute;dito que no sea el nuestro?</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>La respuesta es
que no.&nbsp; Si el n&uacute;mero es inventado, corremos el riesgo de
que lo chequeen y sea inv&aacute;lido.&nbsp; Si es un n&uacute;mero
obtenido con un programa como el que nombro abajo, probablemente sea
la tarjeta de otra persona, y no es correcto usarlo.&nbsp; Adem&aacute;s
siempre cabe la posibilidad de estar tratando con gente de bien, como
el caso de la editorial &quot;Larousse&quot;.</FONT> </FONT>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>De
todos modos el programa se puede bajar de</FONT>
<BR></FONT><A HREF="http://angelfire.com/ar/NetSphere/images/hpacardgen1.zip"><FONT SIZE=2><FONT FACE="helvetica, sans-serif">http://angelfire.com/ar/NetSphere/images/hpacardgen1.zip</FONT></FONT></A><FONT FACE="helvetica, sans-serif">
<BR>&nbsp; </FONT>
</P>
<P ALIGN=RIGHT><A HREF="mailto:donatien@stones.com"><B><FONT SIZE=7><FONT FACE="helvetica, sans-serif">DONATIEN</FONT></FONT></B></A><FONT FACE="helvetica, sans-serif">
</FONT>
</P>
<P ALIGN=RIGHT STYLE="margin-bottom: 0cm"><A HREF="http://www.dzone.com.ar/"><FONT SIZE=2><FONT FACE="helvetica, sans-serif">http://www.dzone.com.ar</FONT></FONT></A></P>
</BODY>
</HTML>