<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<TITLE>Villaburrios</TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice/5.1 (Linux)">
	<META NAME="AUTHOR" CONTENT="Bugnick">
	<META NAME="CREATED" CONTENT="20000618;16564800">
	<META NAME="CHANGEDBY" CONTENT="Miguel Angel Nieto Salazar">
	<META NAME="CHANGED" CONTENT="20000618;16570400">
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
	<STYLE>
	<!--
		TD P { color: #ffffff }
		P { color: #ffffff }
		A:visited { color: #ffcc00 }
		A:link { color: #ffcc00 }
	-->
	</STYLE>
</HEAD>
<BODY TEXT="#ffffff" LINK="#ffcc00" VLINK="#ffcc00" BGCOLOR="#000000" BACKGROUND="backmain.gif">
<P ALIGN=CENTER><FONT FACE="helvetica, sans-serif"><B><I><FONT SIZE=7><FONT COLOR="#ffffff">THE
VILLABURRIOS WITCH PROJECT</FONT></FONT></I></B> </FONT>
</P>
<P ALIGN=CENTER><FONT FACE="helvetica, sans-serif"><B><FONT SIZE=2><FONT COLOR="#cccccc">Hace
unos cuantos a&ntilde;os (en Resaka somos demasiado vagos como para
ponernos a buscar fechas) 3 estudiantes de un ciclo formativo de
grado medio de Picapedrero de Madrid se internaron en los bosques de
Villaburrios, &Aacute;vila, con el fin de rodar un exhaustivo
documental con su cinexin sobre la leyenda de la bruja de
Villaburrios, que d&eacute;cadas atr&aacute;s (en Resaka somos
demasiado vagos como para ponernos a buscar fechas. Creo que esto lo
acabo de decir antes. No importa) termin&oacute; con la vida de 10 de
los 15 habitantes del pueblo que tuvieron la osad&iacute;a de
introducirse en el bosque de los cojones ya entrada la noche (aunque
a decir verdad tres v&iacute;ctimas entraron por el d&iacute;a, pero
&quot;ya entrada la noche&quot; queda mejor). Y como esto se est&aacute;
haciendo un poquit&iacute;n pesao, mejor que paremos y empecemos con
el relato de una vez.</FONT></FONT></B> </FONT>
</P>
<P ALIGN=CENTER><FONT COLOR="#cccccc"><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><B>Ya
s&eacute; que lo que os interesa es ver el documento que filmaron,
pero os jod&eacute;is y os conformais con leer extractos de los
diarios de los pardillos esos. En Resaka somos demasiado vagos como
para ponernos a buscar documentos filmados. Me da la sensaci&oacute;n
de que empiezo a repetirme. No s&eacute;...</B></FONT></FONT></FONT></P>
<P><BR><BR>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#000099">[DIARIO
DE JIMMY]</FONT></B> <BR><B><FONT COLOR="#000099">D&Iacute;A ANTES DE
COMENZAR EL RODAJE</FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<FONT SIZE=2>
&iexcl;Qu&eacute; nervios! Ma&ntilde;ana, Alvarillo, Pablo, su
hermana y yo vamos a Villaburrios para rodar nuestro documental. Dice
Pablo que si aunque nos salga una mierda de grabaci&oacute;n puede
ser un &eacute;xito si lo promocionamos debidamente. S&oacute;lo
tenemos que filmar chorradas, dejar caer la c&aacute;mara cuando
quede poco de cinta y pegar un grito, y entonces seremos famosos. Pa
m&iacute; que el t&iacute;o este est&aacute; gilipollas perd&iacute;o,
pero g&uuml;eno...</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Como estoy seguro de que nos vamos a morir de aburrimiento llevar&aacute;
algunas cositas para pasar el rato: 5 kilitos de marihuana, 12
bolsitas de coca, 3 botellas de whisky Dyc, 20 pastillas de &eacute;xtasis,
jeringuillas, hero&iacute;na y un parch&iacute;s... no, hach&iacute;s
no, un parch&iacute;s... &iquest;pero qui&eacute;n os hab&eacute;is
cre&iacute;do que soy?</FONT> <BR>&nbsp; </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#cc0000">[DIARIO
DE ALVARILLO]</FONT></B> <BR><B><FONT COLOR="#cc0000">D&Iacute;A
ANTES DE COMENZAR ESO DE COGER UNA C&Aacute;MARA Y QUE OTRO SE PONGA
DELANTE</FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
<FONT SIZE=2>Ma&ntilde;ana me boy con esa panda de pringaos a pasar
unos d&iacute;as en el vosque. Todav&iacute;a no tengo mui claro lo
que bamos a azer pero mientras no sea nada de dar por culo a los
zierbos i a las ardiyas es probable que les eche una mano. Como estoi
seguro de que nos bamos a morir de avurrimiento llebar&eacute;
algunas cositas para pasar el rato: mi AK47 con 10 cargadores, dos
sacos de granadas, la colecci&oacute;n de Uzis con acavado en madera
que compr&eacute; en la teletienda, el lanzayamas, la recortada con
16 cajas de cartuchos, el Gaitling modelo 1882 i el cuaderniyo de
ortograf&iacute;a que me a recomendado mam&aacute;.</FONT> <BR>&nbsp;
<BR>&nbsp; </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#cc33cc">[DIARIO
DE LA HERMANA DE PABLO]</FONT></B> <BR><B><FONT COLOR="#cc33cc">D&Iacute;A
ANTES DE COMENZAR EL RODAJE DEL DOCUMENTAL M&Aacute;S CHACHIPIRULI DE
LA HISTORIA DE LOS DOCUMENTALES</FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
<FONT SIZE=2>Querid&iacute;simo superdiario:</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
&iexcl;J&oacute;, qu&eacute; chachi!&iexcl;Ma&ntilde;ana me voy con
mi hermano a rodar su superdocumental!&iexcl;Qu&eacute; guay nos lo
vamos a pasar, un fin de semana en el bosque con los animalitos y las
plantas! He o&iacute;do que van a venir dos amigos suyos, espero que
no sean esos tipos raros, el gordo y el otro con pinta de colgado...</FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
He le&iacute;do en la Super Pop que en el bosque como m&aacute;s
chachi te lo pasas es llevando lo esencial y desconectando de la
superaburrida rutina diaria, o sea que he hecho una lista de cosas de
acuerdo con la revista: 5 maletas de ropa de marca, la tele de 30
pulgadas del sal&oacute;n, mis tres tel&eacute;fonos m&oacute;viles
(&iexcl;cada uno con una melod&iacute;a distinta al sonar!), el
Discman con los CDs de Hanson y los Back Street Boys, mis 106
pintalabios de Christian Dior, los relojes de oro Cartier; y a lo
mejor me llevo el saco de dormir de Al salir de clase. Por supuesto,
todo eso lo va a cargar mi hermano; oigs, porque como se me rompa una
u&ntilde;a...</FONT> <BR>&nbsp; </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#ffffff">[DIARIO
DE PABLO]</FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
*Aqu&iacute; tendr&iacute;a que ir el extracto correspondiente al
diario del miembro restante de esta suerte de expedici&oacute;n, pero
no hemos tenido acceso a dicho material porque en Resaka somos
demasiado vagos como para ponernos a buscar diarios perdidos (si me
repito, avisadme, por favor). Adem&aacute;s, no hay g&uuml;ebos de
meterse en el culo de un sueco de metro noventa llamado Gustav para
hallar dicho material.</FONT> <BR>&nbsp; </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#000099">[DIARIO
DE JIMMY]</FONT></B> <BR><B><FONT COLOR="#000099">PRIMER D&Iacute;A
DE RODAJE</FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
<FONT SIZE=2>Como era de esperar hemos mandado a tomar por culo (y
nunca mejor dicho) a Pablo a las primeras de cambio. El muy cabr&oacute;n
me estaba quemando la sangre a base de repetir una y otra vez la
misma toma; as&iacute; que trinqu&eacute; la c&aacute;mara y entre
Alvarillo y yo lo dejamos encerrado en los servicios de un bar del
pueblo que se llamaba &quot;La Ostra Azul&quot;. Tenemos planes para
su hermana, que est&aacute; m&aacute;s buena de lo que pens&aacute;bamos...</FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Lo que no s&eacute; es por qu&eacute; veo a los Teletubbies bailar
ante m&iacute; en este momento.</FONT> <BR>&nbsp; </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#cc0000">[DIARIO
DE ALVARILLO]</FONT></B> <BR><B><FONT COLOR="#cc0000">PRIMER D&Iacute;A
DE AZER EL JILIPOYAS</FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
<FONT SIZE=2>&iexcl;Esto mola m&aacute;s de lo que pensava! Nos emos
re&iacute;do lo que emos querido con todos los biejos que emos
entrevistado i como Pablo se estava poniendo mui pesado lo acavamos
de dejar a merced de doze docenas de gays atolondrados. Lo mejor de
todo es que e descubierto que Jimmy guarda golosinas en una volsa de
su mochila &iexcl;y no me hav&iacute;a dicho nada!&iexcl;ser&aacute;
mam&oacute;n!</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Por suerte coj&iacute; unas poquitas i como soi vuena persona las
repart&iacute; entre los ancianitos del lugar. Deven de estar
contentos porque uno acava de saltar por la ventana de su casa
agitando los brazos mientras gritaba algo as&iacute; como &quot;Espinete,
boy hazia ti&quot;.</FONT> <BR>&nbsp; </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#cc33cc">[DIARIO
DE LA HERMANA DE PABLO]</FONT></B> <BR><B><FONT COLOR="#cc33cc">PRIMER
D&Iacute;A EN NUESTRO ASCENSO HACIA LA FAMA. DENTRO DE POQUITO
ESTAREMOS AL NIVEL DE SNOOPY</FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
<FONT SIZE=2>Querid&iacute;simo superdiario:</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
&iexcl;Chupi! Estoy superagotada, pero es que nos hemos pasado el d&iacute;a
entrevistando viejecitos y pregunt&aacute;ndoles sobre la bruja que
se cree que viv&iacute;a en el lugar. Una abuelita megasimp&aacute;tica
nos dijo que nos fu&eacute;semos &quot;a la mierda&quot; (tengo que
buscar d&oacute;nde est&aacute; eso en el mapa que tiene el tipo
gordito) y nos solt&oacute; tres dobermans detr&aacute;s de nosotros;
pero el gordito sac&oacute; tres alcachofas y se las dio de comer a
los perritos. No les debieron de sentar muy bien porque luego
pusieron mala cara y explotaron.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Otro abuelito nos dijo que no exist&iacute;a tal bruja si no que se
trataba de una ermita&ntilde;a loca que, o sea, mataba gente con
extra&ntilde;os fines. Lo curioso era la manera de matarlos:</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Asesin&aacute;ndolos.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Horrible.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Menos mal que los viejecitos parecen felices con nuestra visita.
Mira, si hasta se ba&ntilde;an en la fuente con los pantalones sobre
la cabeza.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Los dos tipos raros han dicho que mi hermano va a quedarse unos d&iacute;as
&quot;para que ciertos habitantes del pueblo le conozcan m&aacute;s a
fondo&quot;. Supongo que ser&aacute; para ganarse su confianza y
entrevistarlos de nuevo.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Eso quiere decir que nos toca a nosotros filmar algo en el bosque.</FONT>
<BR>&nbsp; </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#000099">[DIARIO
DE JIMMY]</FONT></B> <BR><B><FONT COLOR="#000099">SEGUNDO D&Iacute;A
EN EL CULO DEL MUNDO</FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<FONT SIZE=2>
&iexcl;&iexcl;Esto es una mierrrda (con un sutil acento en la &quot;r&quot;)!!</FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Vale, todo ha empezado de puta madre.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Nos echamos unas risas, nos libramos del pesao y nos quedamos con la
chica. Todos contentos. Pero la chica no se entera de nada y sigue
con el juego. Hala, ahora dice que nos vamos al bosque a Cojonudo.
Ahora la sigo y a ver si por fin me la tiro. Al otro t&iacute;o
tambi&eacute;n le da por venir. Aun sabiendo que esto podr&iacute;a
convertirse en un m&egrave;nage &agrave; trois, dejo que nos
acompa&ntilde;e. Podr&iacute;a ser &uacute;til.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Todo de la hostia; no pod&iacute;a ir mejor.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Hasta que nos da la gilipollez y cada vez nos metemos m&aacute;s y
m&aacute;s dentro del bosque. Primer error.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Le damos el mapa a Alvarillo. Segundo error. El muy cabr&oacute;n
debe de haber estudiado papiroflexia (quiz&aacute; amargado por su
suspenso en plastilina) porque ha hecho una pajarita de papel con
tanta fortuna que ech&oacute; a volar y ya ha fundado una peque&ntilde;a
familia al este de Botswana, donde lleva una vida alegre y pac&iacute;fica
buscando celulosa cada ma&ntilde;ana para dar de comer a sus cr&iacute;as.</FONT>
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Y ya para acabarla de gi&ntilde;ar, dejamos nuestras mochilas al
cuidado de la pija mientras vamos a echar una meada. Por supuesto, al
volver ya no estaban all&iacute;.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Lo peor es que Tinky-Winky acaba de pegarle una hostia a Dipsy y
ahora &eacute;ste quiere contraatacar con un gancho de izquierda
seguido de una patada en los huevos.</FONT> <BR>&nbsp; </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#cc33cc">[DIARIO
DE LA HERMANA DE PABLO]</FONT></B> <BR><B><FONT COLOR="#cc33cc">SEGUNDO
D&Iacute;A, O SEA</FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
<FONT SIZE=2>Querid&iacute;simo superdiario:</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
&iexcl;No lo comprendo! Jol&iacute;n, todos me echan la culpa por
hacer una buena acci&oacute;n.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Resulta que los chicos me dejan un momento a cargo de sus mochilas y
de repente aparece un se&ntilde;or as&iacute; como con pinta de estos
que cantan flamenco y me pide superamablemente las mochilas porque
necesita algo para que no se lleve el viento su tienda de campa&ntilde;a.
Tambi&eacute;n me estaba pidiendo todo mi dinero mientras me ense&ntilde;aba
una navaja. Un poco cara s&iacute; que era, pero le dije que s&iacute;
se la compraba, aunque cuando le di el dinero sali&oacute;
hiperdisparado con las mochilas.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Y luego me dicen esos dos que me he dejado enga&ntilde;ar por un
gitano.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Qu&eacute; ignorantes, lo que tienen es envidia por no ser tan buenas
personas como yo.</FONT> <BR>&nbsp; </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#cc0000">[DIARIO
DE ALVARILLO]</FONT></B> <BR><B><FONT COLOR="#cc0000">EL D&Iacute;A
QUE VA DESPU&Eacute;S DEL PRIMER D&Iacute;A</FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
<FONT SIZE=2>Jimmy se queja porque me e cargado su mapa.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
&iquest;Qu&eacute; ser&aacute; un mapa?</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
De todas maneras, otra cosa me preocupa m&aacute;s... Tengo la
sensaci&oacute;n de que me falta algo...</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
...</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
...</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
...</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
&iexcl;&iexcl;Mi cuaderniyo de ortograf&iacute;a!!</FONT> <BR>&nbsp; </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#000099">[DIARIO
DE JIMMY]</FONT></B> <BR><B><FONT COLOR="#000099">TERCER D&Iacute;A.
MANDA HUEVOS</FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
<FONT SIZE=2>Ahora s&iacute; que puedo decir que la cosa est&aacute;
malita.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
La t&iacute;a sigue sin enterarse de nada y contin&uacute;a rodando
el puto documental, y claro, nosotros vamos detr&aacute;s como unos
gilipollas. Durante nuestro trayecto han pasado una serie de cosas
raras. Raras pero m&iacute;nimamente aceptables:</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Elvis Presley, crucificado bocabajo en un cacahuete gigante me ha
saludado y me recuerda que le tengo que devolver unos discos que me
prest&oacute; el mes pasado.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Marilyn dice que de cenar nada, que ya se lo pasa bastante bien con
John.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
El Papa se queja de que hace a&ntilde;os que no voy a misa.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Unos extraterrestres me han pedido hora para ser abducido el martes
que viene.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Etc., etc,...</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Vale, todo esto es normal. Si ni siquiera me he quejado por haber
dormido esta noche en el suelo.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Lo realmente acojonante ha ocurrido al llegar a un claro donde &iacute;bamos
a descansar: all&iacute; hab&iacute;a una serie de palitos de pescado
dispuestos de manera aleatoria que, al ser contemplados desde el
&aacute;ngulo obtuso de la funci&oacute;n y=3nx por el plano
trigonom&eacute;trico axial de la teor&iacute;a darwiniana de los
pedos con mechero, formaban la imagen de...</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
&iexcl;Pedro Ruiz!</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
&iexcl;Argh!</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
&iquest;Cu&aacute;nto de verdad habr&aacute; en la leyenda de la
bruja...?</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Tinky-Winky, eso parece un desgarre anal.</FONT> <BR>&nbsp; </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#cc33cc">[DIARIO
DE LA HERMANA DE PABLO]</FONT></B> <BR><B><FONT COLOR="#cc33cc">TERCER
D&Iacute;A CHACHI</FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
<FONT SIZE=2>Querid&iacute;simo superdiario:</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
&iexcl;Qu&eacute; guay! Hoy hemos visto a mucha gente en el bosque:
uno con tup&eacute; que estaba bocabajo, un viejecito que parec&iacute;a
ir a pilas, unos se&ntilde;ores peque&ntilde;itos con grandes ojos
negros...</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Y en el lugar donde estamos ahora hay unos palitos de pescado que si
los miras del rev&eacute;s tienen la forma de ese presentador tan
listo y tan megasexy de la tele....</FONT> <BR>&nbsp; </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#cc0000">[DIARIO
DE ALVARILLO]</FONT></B> <BR><B><FONT COLOR="#cc0000">EL D&Iacute;A
QUE VA DESPU&Eacute;S DEL D&Iacute;A QUE VA DESPU&Eacute;S DEL PRIMER
D&Iacute;A</FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
<FONT SIZE=2>Pues llo no e bisto nada.</FONT> <BR>&nbsp; </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#cc33cc">[DIARIO
DE LA HERMANA DE PABLO]</FONT></B> <BR><B><FONT COLOR="#cc33cc">CUARTO
D&Iacute;A HIPER-RARO</FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
<FONT SIZE=2>Querid&iacute;simo superdiario:</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
El tipo raro con pinta de colgado ha desaparecido esta noche. Por la
ma&ntilde;ana, al despertarme, ten&iacute;a al lado un v&oacute;mito
y una botella de whisky.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Es totalmente imposible establecer una conexi&oacute;n entre estos
dos hechos, con lo que deduzco que... &iexcl;la bruja de Villaburrios
existe!</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Tengo miedo...</FONT> <BR>&nbsp; </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#cc0000">[DIARIO
DE ALVARILLO]</FONT></B> <BR><B><FONT COLOR="#cc0000">CUARTO D&Iacute;A
EN GENERAL</FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<FONT SIZE=2>&nbsp;
Esta noche no e podido dormir. Una boz misteriosa entonava sin zesar
la canci&oacute;n de <B><FONT COLOR="#ffff00">Pok&eacute;mon</FONT></B>,
y cuando iva por la 160 empieza a cantar &quot;Grandes melod&iacute;as
de la aristocracia turca del Barroco, vol. II&quot;, en plan
jam-session de <B><FONT COLOR="#3333ff">Pitufos</FONT></B>, Tres
Tenores y <B><FONT COLOR="#ff99ff">Furbys</FONT></B>.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Por si fuera poco, me da que aqu&iacute; falta alguien...</FONT> <BR>&nbsp;
</FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#cc33cc">[DIARIO
DE LA HERMANA DE PABLO]</FONT></B> <BR><B><FONT COLOR="#cc33cc">QUINTO
D&Iacute;A</FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<FONT SIZE=2>
Queri&nbsp;&nbsp;&nbsp;&nbsp; d&iacute;si&nbsp; mo superdiari&nbsp;
o:</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Vamo&nbsp;&nbsp;&nbsp; s</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
A</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Ver.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Ups</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Ahora s&iacute;.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Estoy escribiendo esto por la noche, mientras el gordo y yo corremos
para zafarnos de una muerte supersegura. Mejor ser&aacute; que
empecemos por el principio...</FONT> <BR>&nbsp; </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#cc0000">[DIARIO
DE ALVARILLO]</FONT></B> <BR><B><FONT COLOR="#cc0000">YA HE PERDIDO
LA CUENTA</FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
<FONT SIZE=2>...A la imv&eacute;zil &eacute;sta le da por vuscar a
Jimmy i tras patearnos todo el puto vosque yegamos a un caser&oacute;n
de mierda en el que unas ratas &quot;jipis&quot; an levantado de la
nada una sociedad ideal sin jerarqu&iacute;a alguna en la que las
televisiones p&uacute;vlicas emiten pel&iacute;culas pornogr&aacute;ficas
todas las noches y la tarifa plana es una realidad.</FONT> <BR><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
El caso es que me estoy desviando del tema...</FONT> <BR>&nbsp; </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#cc33cc">[DIARIO
DE LA HERMANA DE PABLO]</FONT></B> <BR><B><FONT COLOR="#cc33cc">QUINTO
D&Iacute;A</FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<FONT SIZE=2>
... As&iacute; que entramos en el caser&oacute;n. Era un poco
ruinoso, pero no hab&iacute;a nada extra&ntilde;o en &eacute;l.
Bueno, las paredes estaban manchadas de sangre, pero eso no tiene
nada de extra&ntilde;o, al igual que las v&iacute;sceras dispersas
por el suelo de manera que pod&iacute;a leerse:</FONT> </FONT>
</P>
<P ALIGN=CENTER><FONT COLOR="#ff0000"><FONT FACE="helvetica, sans-serif"><B>&quot;BAJAD
AL S&Oacute;TANO&quot;</B></FONT></FONT></P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<FONT SIZE=2>&nbsp;
De repente, en un superarrranque de lucidez, lo vi todo claro y
deduje que si el tipo raro con pinta de colgado no estaba en ning&uacute;n
otro lugar de la casa, se encontrar&iacute;a en alguna especie de
s&oacute;tano.</FONT> <BR>&nbsp; </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#cc0000">[DIARIO
DE ALVARILLO]</FONT></B> <BR><B><FONT COLOR="#cc0000">YA HE PERDIDO
LA CUENTA</FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Vajamos al s&oacute;tano sin pensarlo, inconscientes del peligro
mortal que nos aguardaba al final de la interminavle escalera de
orror que descend&iacute;a a las puertas del aberno... Un aberno con
olor a ...&iquest;&iexcl;Favada Litoral?!</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Aqueya imposible ebidencia se izo patente cuando ovserb&eacute; una
grotesca figura envuelta en sombras, ense&ntilde;&aacute;ndome un
vote de favada que sosten&iacute;a con su mano izquierda. Ese vote
era Jimmy. Y en la mano derecha, la figura empu&ntilde;ava una
afilada oz de metro y medio.</FONT> <BR>&nbsp; </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#cc33cc">[DIARIO
DE LA HERMANA DE PABLO]</FONT></B> <BR><B><FONT COLOR="#cc33cc">QUINTO
D&Iacute;A</FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;<FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Entonces salimos corriendo y aqu&iacute; estamos, perseguidos por una
mujer que nos gana terreno al grito de &quot;no hay pricha, no hay
pricha&quot;. Qu&eacute; ordinariez, oigs.</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Cuidado, imb&eacute;cil, que te va a alcanzar...</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#cc0000">[DIARIO
DE ALVARILLO]</FONT></B> <BR><B><FONT COLOR="#cc0000">YA HE PERDIDO
LA CUENTA</FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
&iexcl;No soy imb&eacute;cil! <BR>&nbsp; </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#cc33cc">[DIARIO
DE LA HERMANA DE PEDRO]</FONT></B> <BR><B><FONT COLOR="#cc33cc">QUINTO
D&Iacute;A</FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;<FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
&iexcl;&iexcl;Detr&aacute;s de ti!!</FONT> <BR>&nbsp; </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#cc0000">[DIARIO
DE ALVARILLO]</FONT></B> <BR><B><FONT COLOR="#cc0000">YA HE PERDIDO
LA CUENTA</FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
<FONT SIZE=2>&iquest;Qu&eacute; dicesaaaaaaaaaaaaaaaaaaaaaaaaargh!!!!</FONT>
<BR>&nbsp; </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Co&ntilde;o, que me e muerto.</FONT> <BR>&nbsp; </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><B><FONT COLOR="#cc33cc">[DIARIO
DE LA HERMANA DE PEDRO]</FONT></B> <BR><B><FONT COLOR="#cc33cc">QUINTO
D&Iacute;A</FONT></B> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<FONT SIZE=2>&nbsp;&nbsp;
Ver&aacute;, se&ntilde;ora abuela de la Fabada, entre usted y yo, ese
conjunto blanco y negro con esa faja es un poco as&iacute;
comoaaaaaaaaaaaaaaaaaaaaargh!!!</FONT> </FONT>
</P>
<P><FONT FACE="helvetica, sans-serif"><FONT SIZE=2>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Cielos, se me ha olvidado cerrar la llave del gas al salir de casa.</FONT>
<BR>&nbsp; <BR>&nbsp; </FONT>
</P>
<P ALIGN=CENTER><FONT FACE="helvetica, sans-serif"><FONT SIZE=2><FONT COLOR="#ffff99">PR&Oacute;XIMAMENTE,
CORTES&Iacute;A DE</FONT><FONT COLOR="#ffff00"> KEROPI TM</FONT><FONT COLOR="#ffff99">,
KENNY McCORMICK DIRIGIR&Aacute;</FONT></FONT> <BR><B><FONT SIZE=2><FONT COLOR="#ffff99">&quot;THE
VILLABURRIOS WITCH PROJECT: LA PEL&Iacute;CULA&quot;.</FONT></FONT></B>
<BR><FONT SIZE=2><FONT COLOR="#ffff99">EST&Aacute;N TODOS USTEDES
INVITADOS AL FUNERAL DE KENNY McCORMICK EL D&Iacute;A DESPU&Eacute;S
DEL PREESTRENO.</FONT></FONT></FONT></P>
<P ALIGN=RIGHT><FONT FACE="helvetica, sans-serif"><B><U><FONT SIZE=7><FONT COLOR="#ffcc00">KENNY</FONT></FONT></U></B>
</FONT>
</P>
<P ALIGN=RIGHT STYLE="margin-bottom: 0cm"><A HREF="http://www.dreamers.com/resaka"><U><FONT SIZE=2><FONT FACE="helvetica, sans-serif"><FONT COLOR="#ffcc00">http://www.dreamers.com/resaka</FONT></FONT></FONT></U></A></P>
</BODY>
</HTML>