<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>Barata Eletrica numero 27</TITLE>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/3.01Gold (WinNT; I) [Netscape]">
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFFF" LINK="#FF8000" VLINK="#008000">

<PRE>&nbsp;____&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; _&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ______ _&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; _&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; _&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
|&nbsp; _ \&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; | |&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; |&nbsp; ____| |&nbsp;&nbsp;&nbsp; | |&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (_)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
| |_) | __ _ _ __ __ _| |_ __ _&nbsp; | |__&nbsp; | | ___| |_ _ __ _&nbsp; ___ __ _&nbsp;&nbsp;
|&nbsp; _ &lt; / _` | '__/ _` | __/ _` | |&nbsp; __| | |/ _ \ __| '__| |/ __/ _` |&nbsp;
| |_) | (_| | | | (_| | || (_| | | |____| |&nbsp; __/ |_| |&nbsp; | | (_| (_| |&nbsp;
|____/ \__,_|_|&nbsp; \__,_|\__\__,_| |______|_|\___|\__|_|&nbsp; |_|\___\__,_|&nbsp;


BARATA ELETRICA, numero 27&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Sao Paulo, 22/07/2002

Cidade Universit&aacute;ria



<HR WIDTH="100%">

</PRE>

<CENTER><P><IMG SRC="bar.jpg" ALT="" HEIGHT=190 WIDTH=177 ALIGN=CENTER>
<BR>
P&aacute;gina Inicial <A HREF="http://www.inf.ufsc.br/barata">http://www.inf.ufsc.br/barata</A>
Email <A HREF="mailto:derneval@bigfoot.com">derneval@bigfoot.com</A> <BR>
http://barataeletrica.cjb.net http://barataeletrica.rg3.net</P></CENTER>

<UL>
<LI>&Iacute;ndice </LI>

<LI>Introdu&ccedil;&atilde;o </LI>

<LI><A HREF="http://www.inf.ufsc.br/barata/credi.htm">Cr&eacute;ditos</A>
</LI>

<LI><A HREF="23hacker27.html">O filme 23 e o ativismo hacker</A></LI>

<LI><A HREF="continua.html">Retrospectiva do fanzine</A> (Continuando &nbsp;&quot;como
come&ccedil;ar uma cena hacker&nbsp;&quot;)</LI>

<LI><A HREF="faltagrana27.html">Como viver sem grana</A> (sem perder a
pose) </LI>

<LI><A HREF="mestrado27.html">Encarando o Mestrado</A><A HREF="../c%7C/temp/mestrado27.html">.</A></LI>

<LI><A HREF="nerdafet27.html">Micos de namoro</A></LI>

<LI><A HREF="entrevist27.html">O&nbsp;Hacker e a fantasia de ser entrevistado</A></LI>

<LI><A HREF="biblioint27.html">A Biblioteca P&uacute;blica e a Pornografia
na Internet</A></LI>

<LI><A HREF="news27.html">News, Dicas, etc.</A>.</LI>
</UL>

<CENTER><P>Visite tamb&eacute;m o Blog do Barata El&eacute;trica:</P></CENTER>

<CENTER><P><A HREF="http://barataeletrica.blogspot.com">http://barataeletrica.blogspot.com</A>
</P></CENTER>

<CENTER><P>
<HR></P></CENTER>

<P>E a&iacute;, gente. Espero que curtam esta vers&atilde;o do fanzine.
A cada dia que passa &eacute; aquela dificuldade. Mais e mais eu sinto
a necessidade de mais gente para fazer as coisas. A&iacute; me lembro que
sou fanzineiro, n&atilde;o business-man. Faz parte do trabalho, fazer tudo.
Se colocar mais gente vou ter que gastar mais tempo discutindo e influindo
no resultado final do que me divertindo. E o fanzine at&eacute; que n&atilde;o
est&aacute; ruim. O Blog permite colocar um monte de pequenas coisas que
normalmente teriam que esperar a sa&iacute;da do novo n&uacute;mero para
aparecer. Tem gente que est&aacute; gostando. </P>

<P>A &uacute;ltima que fiz foi um artigo fazendo uma esp&eacute;cie de
retrospectiva sobre o fanzine. &Agrave;s vezes acho que viajo muito na
maionese. A&iacute; chega algu&eacute;m e fala que n&atilde;o, que meus
textos s&atilde;o o maior barato. Mas por via das d&uacute;vidas, vai a&iacute;
um pouco da minha hist&oacute;ria..</P>

<P>O texto sobre Biblioteca pode ou n&atilde;o ser interessante para a
maioria dos caras. Fiz um curso na Escola de Comunica&ccedil;&otilde;es
e Artes da USP (2a Gradua&ccedil;&atilde;o) e saiu este texto que mexe
com o uso de internet em bibliotecas. Capaz que vai interessar a muita
gente. Sei l&aacute;, fiz em cima da hora, montes de defeitos. Acho que
os links ser&atilde;o de utilidade para o pessoal que est&aacute; pesquisando
essa coisa de vigil&acirc;ncia de conte&uacute;do e pornografia na internet.
O texto sobre Mestrado tem a ver com algo cada vez mais comum, nos dias
de hoje. A necessidade de aprimoramento profissional para ter alguma chance
no mercado de trabalho. J&aacute; o da falta de grana, bom, isso &eacute;
com todo mundo, n&atilde;o &eacute; s&oacute; com viciado em inform&aacute;tica.
O dos micos no namoro, bom, isso eu acho que j&aacute; aconteceu com todo
mundo. Ia colocar um texto bem espec&iacute;fico sobre hacking e hackativismo,
mas na &uacute;ltima hora resolvi que vou substituir por outra coisa. Volte
daqui uns dias. Esse neg&oacute;cio do blog est&aacute; sendo uma m&atilde;o
na roda para fazer as not&iacute;cias e dicas. J&aacute; o da entrevista,
bom, isso &eacute; uma vontade de aparecer no J&ocirc; Soares. Apesar que
acho besteira, at&eacute; t&ocirc; considerando a id&eacute;ia.</P>

<P>&Eacute; isso. Espero atualizar com mais freq&uuml;&ecirc;ncia e trazer
not&iacute;cias mais interessantes. Fiquem ligados no <A HREF="http://barataeletrica.blogspot.com">http://barataeletrica.blogspot.com</A>
para pequenas dicas, truques, besteiras e fofocas.. </P>

</BODY>
</HTML>
