<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>A Biblioteca P&uacute;blica e a Pornografia na Internet</TITLE>
   <META NAME="Author" CONTENT="Derneval R.R. Cunha">
   <META NAME="GENERATOR" CONTENT="Mozilla/3.01Gold (WinNT; I) [Netscape]">
   <META NAME="Description" CONTENT="Um texto sobre a vigilância quanto ao acesso de pornografia em terminais públicos">
   <META NAME="KeyWords" CONTENT="biblioteca, bibliotecário, pornografia, vigilância, cyberporn, pedofilia">
</HEAD>
<BODY TEXT="#FFFF00" BGCOLOR="#400040" LINK="#0000EE" VLINK="#551A8B" ALINK="#FF0000">

<CENTER><P><A HREF="http://www.inf.ufsc.br/barata/index.html">Homepage</A>
<A HREF="http://barataeletrica.blogspot.com">Blog do Fanzine</A> <A HREF="http://www.inf.ufsc.br/barata/barata27.html">&Iacute;ndice
No 27</A> <A HREF="http://www.inf.ufsc.br/barata/ind.htm">&Iacute;ndice
N&uacute;meros Anteriores</A> <A HREF="http://www.inf.ufsc.br/barata/emai.htm">Contato</A>
<BR>
http://barataeletrica.cjb.net http://www.inf.ufsc.br/<BR>
Vers&atilde;o Txt <A HREF="http://www.barataeletrica.rg3.net">http://www.barataeletrica.rg3.net</A>
</P></CENTER>

<CENTER><P><B><FONT SIZE=+1>A Biblioteca P&uacute;blica e a Pornografia
na Internet</FONT></B></P></CENTER>

<CENTER><P><B><FONT SIZE=+1>ou</FONT></B></P></CENTER>

<CENTER><P><B><FONT SIZE=+1>Como entender a web-vigil&acirc;ncia em lugares
de acesso p&uacute;blico</FONT></B></P></CENTER>

<P>Derneval Ribeiro Rodrigues da Cunha</P>

<P>(*) Trabalho final do curso “Biblioteca e Sociedade” - Escola de Comunica&ccedil;&atilde;o
e Artes - Universidade de S&atilde;o Paulo Professor: Prof. Dr. Luis Milanesi.
N&atilde;o &eacute; bem o tipo de trabalho que se encaixe neste fanzine,
mas achei que valia a pena. Sempre usei a internet em lugares p&uacute;blicos.
Se tivesse acesso &agrave; internet em casa provavelmente n&atilde;o dormiria.</P>

<P><B>Sum&aacute;rio:</B></P>

<P>INTRODU&Ccedil;&Atilde;O</P>

<P>HIST&Oacute;RICO</P>

<P>A POL&Ecirc;MICA DO PORN&Ocirc; INFANTIL</P>

<P>A EXPERI&Ecirc;NCIA AMERICANA COM POL&Iacute;TICAS RESTRINGINDO O ACESSO</P>

<P>SOFTWARES DE CENSURA</P>

<P>O C&Oacute;DIGO DE &Eacute;TICA DO BIBLIOTEC&Aacute;RIO E A REDE</P>

<P>CONCLUS&Atilde;O</P>

<P>BIBLIOGRAFIA</P>

<P><B>INTRODU&Ccedil;&Atilde;O</B></P>

<P>A internet come&ccedil;ou como um projeto de pesquisa visando uma rede
de comunica&ccedil;&otilde;es capaz de se manter em funcionamento, mesmo
em caso de ataque nuclear, durante o per&iacute;odo da chamada “Guerra
Fria”. Atualmente, s&atilde;o milh&otilde;es de computadores e usu&aacute;rios
trocando mensagens e disponibilizando informa&ccedil;&atilde;o de todo
tipo, com o n&uacute;mero de usu&aacute;rios crescendo em ordem geom&eacute;trica.
A maior parte da informa&ccedil;&atilde;o da humanidade est&aacute; dispon&iacute;vel
na internet, de forma instant&acirc;nea. O desenvolvimento de ferramentas
de pesquisa facilitou o seu uso para o usu&aacute;rio comum, dispensando
a necessidade de treinamento ou de assist&ecirc;ncia humana na maior parte
dos casos. A internet &eacute; um meio relativamente democr&aacute;tico
de transmitir informa&ccedil;&atilde;o. Qualquer pessoa pode, sem grandes
custos, disponibilizar informa&ccedil;&atilde;o para milhares ou milh&otilde;es
de indiv&iacute;duos. Atualmente, h&aacute; centenas de p&aacute;ginas
na internet, com os mais variados tipos de assuntos, em diferentes l&iacute;nguas,
para diferentes p&uacute;blicos.</P>

<P>A necessidade de uso de instrumentos como um computador para se ter
acesso a essa nova m&iacute;dia, coloca um obst&aacute;culo ao pleno acesso
dessa Como fonte de informa&ccedil;&atilde;o numa biblioteca, seu uso enfrenta
alguns obst&aacute;culos para o bibliotec&aacute;rio. N&atilde;o existe
um meio termo seguro entre o livre acesso &agrave; informa&ccedil;&atilde;o
e o n&atilde;o acesso. Disponibilizar um computador para acesso &agrave;
internet numa biblioteca significa</P>

<P>O problema do acesso a sites envolvendo pornografia infantil precisa
ser trabalhado, uma vez que terminais de acesso &agrave; internet est&atilde;o
sendo instalados em bibliotecas p&uacute;blicas e ag&ecirc;ncias de correio.
Como ent&atilde;o desenvolver pol&iacute;ticas de acesso que permitam ao
usu&aacute;rio sem recursos participar dos aspectos positivos desse mundo
digital ao inv&eacute;s dese tornar um “exclu&iacute;do digital”.</P>

<P><B>A POL&Ecirc;MICA DO PORN&Ocirc; INFANTIL</B></P>

<P>O problema de conte&uacute;do da internet n&atilde;o seria t&atilde;o
problem&aacute;tico, caso n&atilde;o existisse alguns abusos, como os previstos
no Estatuto da crian&ccedil;a e do adolescente[1], que especifica:</P>

<UL>
<P><TT>Art. 240 - Produzir ou dirigir representa&ccedil;&atilde;o teatral,
televisiva ou pel&iacute;cula cinematogr&aacute;fica, utilizando-se de
crian&ccedil;a ou adolescente em cena de sexo expl&iacute;cito ou pornogr&aacute;fica:
Pena - reclus&atilde;o de um a quatro anos, e multa.</TT></P>

<P><TT>Par&aacute;grafo &Uacute;nico - Incorre na mesma pena quem, nas
condi&ccedil;&otilde;es referidas neste artigo, contracena com crian&ccedil;a
ou adolescente.</TT></P>

<P><TT>Art. 241 - Fotografar ou publicar cena de sexo expl&iacute;cito
ou pornogr&aacute;fica envolvendo crian&ccedil;a ou adolescente: Pena -
reclus&atilde;o de um a quatro anos.</TT></P>
</UL>

<P>O medo da Pornografia Infantil ou o Cyberporn&ocirc; foi bastante explorado
pela revista Time, em reportagem de capa do mesmo nome, em 3/07/95. O artigo,
baseado no texto de Martin Rimm, “Marketing Pornography on the Information
Superhighway[2]” , colocava que 83.5% das imagens dispon&iacute;veis na
internet naquele per&iacute;odo eram obscenas. Tal fato foi desmentido
ad nauseum. O fato de que o estudo que deu origem &agrave; reportagem foi
feito por um estudante de gradua&ccedil;&atilde;o de Engenharia e estava
cheio de falhas como um aparente desconhecimento b&aacute;sico do que &eacute;
“amostra significativa” criou fama n&atilde;o impediu que a mat&eacute;ria,
altamente sensasionalista, fosse freq&uuml;entemente mencionada por grupos
radicais interessados numa regulamenta&ccedil;&atilde;o que tornasse a
internet “saud&aacute;vel para crian&ccedil;as”. </P>

<P>A possibilidade de que usu&aacute;rios possam utilizar-se de terminais
p&uacute;blicos para atividades il&iacute;citas foi um grande temor nos
EUA, motivando a cria&ccedil;&atilde;o, pelo Congresso americano, de legisla&ccedil;&atilde;o
espec&iacute;fica, como o “Communications Decency Act of 1996” e o “Child
Online Protection Act of 1998”, que tentavam estabelecer padr&otilde;es
“aceit&aacute;veis” de utiliza&ccedil;&atilde;o da internet. Ambas foram
canceladas por violarem a Primeira Emenda da Constitui&ccedil;&atilde;o
americana[3]. </P>

<P>De acordo com a Suprema Corte dos EUA[4], “Obscenidade e pornografia
infantil s&atilde;o ilegais. Os estatutos federais e estaduais, os &uacute;ltimos
variando ligeiramente dependendo da jurisdi&ccedil;&atilde;o, pro&iacute;bem
tais materiais.(..) A Corte Suprema dos EUA resolveu a maioria das quest&otilde;es
a respeito de quais estatutos da obscenidade e da pornografia infantil
s&atilde;o v&aacute;lidos:</P>

<UL>
<P><TT>Obscenidade deve ser determinada usando um teste de tr&ecirc;s partes.
Para ser obsceno, (1) a pessoa comum, aplicando padr&otilde;es da comunidade
contempor&acirc;nea, deve achar que o trabalho, tomado como um todo, apela
&agrave; interesses pudendos; (2) o trabalho deve mostrar ou descrever,
numa forma ofensiva declarada, conduta sexual tal como especificada nos
estatutos aplic&aacute;veis; e (3) o trabalho, tomado como um todo, deve
ter falta de s&eacute;rio valor art&iacute;stico, liter&aacute;rio, pol&iacute;tico
ou cient&iacute;fico.</TT></P>

<P><TT>Pornografia Infantil deve envolver representa&ccedil;&otilde;es
de conduta sexual especificadas nos estatutos aplic&aacute;veis e usar
imagens de crian&ccedil;as menores do que determinada idade”.</TT></P>
</UL>

<P><B>A EXPERI&Ecirc;NCIA AMERICANA COM POL&Iacute;TICAS RESTRINGINDO O
ACESSO</B></P>

<P>A quest&atilde;o da restri&ccedil;&atilde;o ao acesso de material pornogr&aacute;fico
na internet ficou em evid&ecirc;ncia ap&oacute;s os casos de demiss&otilde;es
nas filiais brasileiras da General Motors e tamb&eacute;m da Ford Motors.
Em ambos os casos aconteceu de correspond&ecirc;ncia pornogr&aacute;fica
interna chegar por engano na caixa de email de funcion&aacute;rios das
respectivas matrizes americanas[5]. </P>

<P>Nos EUA, 95% das bibliotecas que adotaram a internet desenvolveram pol&iacute;ticas
de uso, algumas vezes denominadas de “uso aceit&aacute;vel” ou “protetores
governantes”[6], algumas mais restritivas, outras menos. Em alguns casos
o conte&uacute;do &eacute; liberado totalmente, incluindo a visualiza&ccedil;&atilde;o
de material pornogr&aacute;fico (mas s&oacute; em terminais espec&iacute;ficos).
Outras pro&iacute;bem todo material envolvendo sexo e outras restringem
o acesso a sites que contenham informa&ccedil;&otilde;es ofensivas do tipo
que envolvam &oacute;dio racial ou at&eacute; mesmo inofensivas, como servi&ccedil;os
de namoro via internet. A necessidade de se fazer tais pol&iacute;ticas
veio tamb&eacute;m de problemas enfrentados por usu&aacute;rios que deixavam
o micro com a tela aberta em sites ofensivos.</P>

<P>Os m&eacute;todos utilizados para regular o uso s&atilde;o divis&iacute;veis
em quatro categorias:</P>

<OL>
<LI>Direcionamento do uso da internet: Oferecer treinamento para os usu&aacute;rios
em como usar a internet, incluindo o acesso &agrave; informa&ccedil;&atilde;o
e qual tipo de sites n&atilde;o devem ser acessados. Tal m&eacute;todo
pode incluir tamb&eacute;m a limita&ccedil;&atilde;o de acesso para sites
j&aacute; liberados para consulta pelos bibliotec&aacute;rios ou lista
de “sites recomend&aacute;veis”, selecionados pelos mesmos crit&eacute;rios
j&aacute; usados no desenvolvimento de uma biblioteca. </LI>

<LI>Separa&ccedil;&atilde;o de usu&aacute;rios nos terminais. A coloca&ccedil;&atilde;o
do terminal &eacute; projetada de forma que cada usu&aacute;rio s&oacute;
consegue enxergar a tela do computador que est&aacute; usando. </LI>

<LI>Coloca&ccedil;&atilde;o dos terminais de forma que fiquem &agrave;
vista dos bibliotec&aacute;rios ou ajudantes para vigil&acirc;ncia do conte&uacute;do.</LI>

<LI>Uso de filtragem de conte&uacute;do. </LI>
</OL>

<P>Outras pol&iacute;ticas envolveram o uso do chamado “tapinha no ombro”
de usu&aacute;rios que acessavam p&aacute;ginas de conte&uacute;do indevido.
Tal m&eacute;todo, que pode ser utilizado com a possibilidade de suspens&atilde;o
do acesso &agrave; internet pelo usu&aacute;rio, traz algumas caracter&iacute;sticas
negativas, j&aacute; que os funcion&aacute;rios encarregados tendem a achar
desconfort&aacute;vel o contato com usu&aacute;rios acessando material
explicitamente sexual. O caso da Biblioteca P&uacute;blica de Greenville,
em dezembro de 1999 &eacute; significativo porque demonstra a aplica&ccedil;&atilde;o
de v&aacute;rias pol&iacute;ticas restritivas:</P>

<P>Ao come&ccedil;arem as reclama&ccedil;&otilde;es de que crian&ccedil;as
estavam sendo expostas &agrave; vis&atilde;o de pornografia, houve um aviso
de que a biblioteca teria que obedecer aos estatutos de obscenidade do
estado da Carolina do Sul (EUA) e impor medidas restritivas ao acesso &agrave;
material obsceno, pornografia infantil e materiais sob outras proibi&ccedil;&otilde;es.
Uma das formas utilizadas foi o “tapinha no ombro”, o uso de um limite
de 2 horas por dia de uso da internet, reconfigura&ccedil;&atilde;o da
localiza&ccedil;&atilde;o interna dos computadores de forma que os bibliotec&aacute;rios
pudessem ter contato visual com o material sendo acessado. Remo&ccedil;&atilde;o
de “telas de privacidade” dos terminais com acesso &agrave; internet.</P>

<P>As medidas n&atilde;o impediram o acesso &agrave; sites contendo material
relativo &agrave; sexo, al&eacute;m de haver um grande aumento no n&uacute;mero
de bibliotec&aacute;rios de refer&ecirc;ncia se recusando a trabalhar de
frente para os terminais com acesso &agrave; internet. Foi implementado
ent&atilde;o o uso de software software espec&iacute;fico, projetado para
impedir o acesso &agrave; sites potencialmente ofensivos. </P>

<P><B>SOFTWARES DE CENSURA</B></P>

<P>Tais softwares, denominados pelos americanos de Smut Blockers, s&atilde;o
tamb&eacute;m conhecidos pelo nome de “censorware” ou software de filtragem.
H&aacute; v&aacute;rios modelos diferentes, alguns com pre&ccedil;os espec&iacute;ficos
para uso em redes de computadores e alguns est&atilde;o dispon&iacute;veis
para uso gratuito. </P>

<P>S&atilde;o normalmente alardeados por pol&iacute;ticos preocupados com
a excessiva libera&ccedil;&atilde;o do conte&uacute;do e tamb&eacute;m
por pais preocupados com o acesso dos filhos &agrave; internet. Alguns
exemplos s&atilde;o os americanos Cyber Patrol, Cyber Snoop, Net Nanny
e WizGuard. Em sua maioria, eles bloqueiam o acesso ao endere&ccedil;o
internet considerado “ofensivo” e cada um deles tem sua lista pr&oacute;pria,
divida em v&aacute;rias categorias, desde “sites adultos” at&eacute; “viol&ecirc;ncia”
ou “jogatina”.</P>

<P>Problema: N&atilde;o h&aacute; como indexar ou catalogar a internet.
Tal lista &eacute; constantemente atualizada, mas pode sofrer v&aacute;rias
incoer&ecirc;ncias, como os exemplos abaixo:</P>

<UL>
<LI>Restringir a pesquisa de um usu&aacute;rio com c&acirc;ncer nos &oacute;rg&atilde;os
genitais de procurar informa&ccedil;&atilde;o sobre sua condi&ccedil;&atilde;o.
</LI>

<LI>Impedir o acesso de adolescentes &agrave; orienta&ccedil;&atilde;o
b&aacute;sica sobre sua vida sexual, fornecida por pessoal especializado.
</LI>

<LI>Restringir o acesso do p&uacute;blico gay &agrave; sites de grupos
ou Organiza&ccedil;&otilde;es N&atilde;o Governamentais espec&iacute;ficas.
</LI>

<LI>H&aacute; tamb&eacute;m o caso escandaloso de um abuso de autoridade
na Inglaterra que foi tamb&eacute;m inclu&iacute;dos na lista de sites
censurados, entre outros. </LI>
</UL>

<P>Os sites que entram na lista s&atilde;o escolhidos atrav&eacute;s de
m&aacute;quinas de busca como o Alta Vista ou o Lycos e em alguns casos
s&atilde;o diretamente catalogados por seres humanos, mas n&atilde;o h&aacute;
revis&atilde;o do conte&uacute;do do site, uma vez que entre na lista.
Se o site alterar seu conte&uacute;do permanece com a mesma denomina&ccedil;&atilde;o
de ofensivo ou censur&aacute;vel, por exemplo. Se foi mal catalogado, assim
permanece, at&eacute; que algu&eacute;m pe&ccedil;a a libera&ccedil;&atilde;o.
Algumas bibliotecas permitem que o usu&aacute;rio pe&ccedil;a o “desbloqueio”
do site, mas isso envolve uma carga de trabalho adicional ao pessoal. </P>

<P><B>O C&Oacute;DIGO DE &Eacute;TICA DO BIBLIOTEC&Aacute;RIO E A REDE</B></P>

<P>O C&oacute;digo de &Eacute;tica do Bibliotec&aacute;rio, que especifica
os deveres e obriga&ccedil;&otilde;es do profissional da Biblioteconomia,
n&atilde;o cont&eacute;m nenhum artigo espec&iacute;fico ao uso da rede,
por&eacute;m os artigos: 3&ordm;, 7&ordm; e 10 podem servir de refer&ecirc;ncia
com rela&ccedil;&atilde;o a esta m&iacute;dia:</P>

<UL>
<P><TT>Art. 3&ordm;:- Cumpre ao profissional de Biblioteconomia:</TT></P>

<P><TT>j) estimular a utiliza&ccedil;&atilde;o de t&eacute;cnicas modernas
objetivando o controle da qualidade e a excel&ecirc;ncia da presta&ccedil;&atilde;o
de servi&ccedil;os ao usu&aacute;rio; (..)</TT></P>

<P><TT>Art.7&ordm; - O Bibliotec&aacute;rio deve, em rela&ccedil;&atilde;o
aos usu&aacute;rios e clientes, observar as seguintes condutas: a) aplicar
todo zelo e recursos ao seu alcance no atendimento ao p&uacute;blico, n&atilde;o
se recusando a prestar assist&ecirc;ncia profissional, salvo por relevante
motivo; b) tratar os usu&aacute;rios e clientes com respeito e urbanidade;
c) orientar a t&eacute;cnica da pesquisa e a normaliza&ccedil;&atilde;o
do trabalho intelectual de acordo com suas compet&ecirc;ncias. (..)</TT></P>

<P><TT>Art.10 - Quando consultor, &eacute; responsabilidade do Bibliotec&aacute;rio
apresentar m&eacute;todos e t&eacute;cnicas compat&iacute;veis com o trabalho
oferecido, objetivando o controle da qualidade e a excel&ecirc;ncia da
presta&ccedil;&atilde;o de servi&ccedil;os, durante e ap&oacute;s a execu&ccedil;&atilde;o
dos trabalhos.</TT></P>
</UL>

<P>Ou seja, a ado&ccedil;&atilde;o da internet numa biblioteca p&uacute;blica
torna necess&aacute;ria uma adequa&ccedil;&atilde;o do profissional &agrave;s
caracter&iacute;sticas da nova m&iacute;dia, cuja maior caracter&iacute;stica
&eacute; exatamente a dificuldade de se estabelecer limites tanto pelo
aumento do n&uacute;mero de usu&aacute;rios como pela disponibilidade cada
vez maior de conte&uacute;do. Tal aumento de conte&uacute;do acaba por
gerar novos padr&otilde;es de consumo de informa&ccedil;&atilde;o e novos
tipos de usu&aacute;rios, sem falar em novas t&eacute;cnicas de pesquisa.</P>

<P>Para se ter sucesso com uma pol&iacute;tica de permitir acesso ao manacial
de informa&ccedil;&atilde;o que a internet coloca a disposi&ccedil;&atilde;o
do usu&aacute;rio e impedir o acesso &agrave; informa&ccedil;&atilde;o
potencialmente danosa, o profissional de biblioteconomia deveria ser treinado
como usu&aacute;rio e ter inclu&iacute;do no seu curr&iacute;culo, um treinamento
que o capacitasse a se adaptar &agrave;s mudan&ccedil;as que a rede sofre,
ao longo do seu crescimento. S&oacute; assim seria capaz de interagir com
o p&uacute;blico que usa os terminais.</P>

<P><B>CONCLUS&Atilde;O:</B></P>

<P>N&atilde;o h&aacute; caminho f&aacute;cil para a resolu&ccedil;&atilde;o
do problema de conte&uacute;do da internet, uma vez instalados os terminais
em Bibliotecas P&uacute;blicas. Qualquer pol&iacute;tica de restri&ccedil;&atilde;o
no uso da internet acaba esbarrando no seguintes problemas:</P>

<P>H&aacute; falta de solu&ccedil;&otilde;es t&eacute;cnicas vi&aacute;veis
para o problema. A utiliza&ccedil;&atilde;o de software espec&iacute;fico
ou pol&iacute;ticas de restri&ccedil;&atilde;o para vigiar ou controlar
o usu&aacute;rio s&atilde;o solu&ccedil;&otilde;es paliativas e n&atilde;o
resolvem o problema de forma definitiva. </P>

<P>Uma pol&iacute;tica pr&eacute;-coordenada de utiliza&ccedil;&atilde;o
tende a se desatualizar, diante das caracter&iacute;sticas da Internet.
O bibliotec&aacute;rio que enveredar por esse caminho precisar&aacute;
de atualiza&ccedil;&atilde;o constante. </P>

<P>O problema do acesso &agrave; Pornografia infantil e outros usos que
possam entrar em conflito com a legisla&ccedil;&atilde;o vigente n&atilde;o
podem ser responsabilidade da biblioteca, que &eacute; mera fornecedora
do servi&ccedil;o de acesso. </P>

<P>A exist&ecirc;ncia de computadores ligados a internet demanda uma atualiza&ccedil;&atilde;o
constante do bibliotec&aacute;rio ou necessita de pessoal especializado
capaz de resolver os problemas &agrave; medida que forem surgindo. </P>

<P>O uso de software de censura ou mesmo de separar pessoal para a implanta&ccedil;&atilde;o
de pol&iacute;ticas de restri&ccedil;&atilde;o &agrave; conte&uacute;do
dificulta o acesso do usu&aacute;rio &agrave; informa&ccedil;&atilde;o,
al&eacute;m de representar uma maior carga de servi&ccedil;o, que pode
ser desagrad&aacute;vel para os funcion&aacute;rios. </P>

<P>A solu&ccedil;&atilde;o talvez esteja no bom senso e na cria&ccedil;&atilde;o
de pol&iacute;ticas que permitam a cada biblioteca p&uacute;blica uma liberdade
de cria&ccedil;&atilde;o de sua pr&oacute;pria pol&iacute;tica de acesso
e que priorize um certo investimento da Biblioteca na conscientiza&ccedil;&atilde;o
atrav&eacute;s de palestras e cursos. Dessa forma o usu&aacute;rio passa
a ser ele tamb&eacute;m respons&aacute;vel pela administra&ccedil;&atilde;o
e manuten&ccedil;&atilde;o do privil&eacute;gio de acesso &agrave; essa
m&iacute;dia. Ao inv&eacute;s de se restringir o acesso da comunidade de
usu&aacute;rios ao conte&uacute;do, o bibliotec&aacute;rio deveria trabalhar
e procurar interagir para conseguir que a comunidade desenvolvesse uma
&eacute;tica que respeitasse a os limites da legisla&ccedil;&atilde;o.
A pr&oacute;pria legisla&ccedil;&atilde;o deve ser reescrita para acompanhar
as mudan&ccedil;as que a internet pode provocar. </P>

<P><B>BIBLIOGRAFIA:</B></P>

<P>American Library Association. Guidelines and Considerations for Developing
a Public Library Internet Use Policy. &lt; http://www.ala.org/alaorg/oif/internet.html&gt;.
Acesso em 08 de junho de 2002.</P>

<P>BRASIL. Lei n&ordm; 8.069, de 13 de julho de 1990. Disp&otilde;e sobre
o Estatuto da Crian&ccedil;a e do Adolescente, e d&aacute; outras provid&ecirc;ncias.
ESTATUTO DA CRIAN&Ccedil;A E DO ADOLESCENTE Dispon&iacute;vel em &lt;http://www.unicef.org/brazil/esttit7.htm&gt;.
Acesso em 08 de junho de 2002.</P>

<P>BRASIL. CONSELHO FEDERAL DE BIBLIOTECONOMIA. RESOLU&Ccedil;&Atilde;O
CFB N.&ordm; 42 DE 07 DE JANEIRO DE 2002. Dispon&iacute;vel em &lt;http://www.crb8.org.br/Templates/cod_etica003.htm
&gt;. Acesso em 08 de junho de 2002.</P>

<P>Champelli. L. Develop an &quot;Acceptable Use Policy&quot; (AUP) for
Schools and Public Libraries. Dispon&iacute;vel em &lt; http://www.monroe.lib.in.us/~lchampel/netadv3.html&gt;.
Acesso em 08 de junho de 2002.</P>

<P>Champelli. L. Respond to Inaccurate Perceptions of Porn on the Net .
Dispon&iacute;vel em &lt;http://www.monroe.lib.in.us/~lchampel/netadv1.html&gt;.
Acesso em 08 de junho de 2002.</P>

<P>Champelli. L. The Internet Advocate. A Web-based Resource Guide for
Librarians and Educators Interested in Providing Youth Access to the Net.
</P>

<P>Cnet.Com. Sex on the Web. Dispon&iacute;vel em &lt;http://home.cnet.com/internet/0-3805-7-280113.html&gt;.
Acesso em 08 de junho de 2002.</P>

<P>Dispon&iacute;vel em &lt;http://www.shub-internet.org/cp4/cp4break.html&gt;.
Acesso em 08 de junho de 2002.</P>

<P>EUA. Corte do Distrito do Leste de Pensilv&acirc;nia. AMERICAN LIBRARY
ASSOCIATION: CIVIL ACTION. Dispon&iacute;vel em: &lt;http://www.paed.uscourts.gov/documents/opinions/02D0414P.HTM&gt;.
Acesso em: 08 de junho 2002.</P>

<P>FRANCO, Carlos Alberto Di.&Eacute;tica e pornografia. Dispon&iacute;vel
em &lt;http://www.hottopos.com/mirand3/internet.htm&gt;. Acesso em 08 de
junho de 2002.</P>

<P>Futrelle, David. In These Times magazine coverage of Rimm scandal. 28
Jul 1995 Na lista alt.censorship. Dispon&iacute;vel na Internet &lt; http://www.cybernothing.org/jdfalk/media-coverage/archive/msg02808.html
&gt;. Acesso em 08 de junho de 2002.</P>

<P>Jansson, Eddy L O &amp; Skala, Matthew. The Breaking of Cyber Patrol&reg;
4.</P>

<P>JournoPorn: HotWired Special Report. Dispon&iacute;vel em &lt;http://hotwired.lycos.com/special/pornscare/&gt;.
Acesso em 08 de junho de 2002.</P>

<P>Kinnaman, Dave. Critiquing Acceptable Use Policies. Dispon&iacute;vel
em &lt;http://www.io.com/~kinnaman/aupessay.html&gt;. Acesso em 08 de junho
de 2002.</P>

<P>PONTIFICIO CONSEJO PARA LAS COMUNICACIONES SOCIALES. &Eacute;TICA EN
INTERNET Dispon&iacute;vel em: &lt;http://www.vatican.va/roman_curia/pontifical_councils/pccs/documents/rc_pc_pccs_doc_20020228_ethics-internet_sp.html
&gt;. Acesso em: 08 de junho de 2002.</P>

<P>--------------------------------------------------------------------------------</P>

<P>[1] BRASIL. Lei n&ordm; 8.069, de 13 de julho de 1990. Disp&otilde;e
sobre o Estatuto da Crian&ccedil;a e do Adolescente, e d&aacute; outras
provid&ecirc;ncias. ESTATUTO DA CRIAN&Ccedil;A E DO ADOLESCENTE Dispon&iacute;vel
em &lt;http://www.unicef.org/brazil/esttit7.htm&gt;. Acesso em 08 de junho
de 2002.</P>

<P>[2] Curiosamente, o mesmo estudante mais tarde fez um guia do cyberporn&oacute;grafo
(The Pornographer&sup1;s Handbook), ensinado como buscar pornografia na
internet. </P>

<P>[3]“Congress shall make no law respecting an establishment of religion,
or prohibiting the free exercise thereof; or abridging the freedom of speech,
or of the press; or the right of the people peaceably to assemble, and
to petition the government for a redress of grievances”.</P>

<P>Trad. O Congresso n&atilde;o far&aacute; lei alguma respeitando o estabelecimento
de religi&atilde;o, ou proibindo o livre exerc&iacute;cio de; ou restringindo
a liberdade de opini&atilde;o ou de imprensa; ou o direito das pessoas
pacificamente montarem e endere&ccedil;arem questionamentos ao governo.
</P>

<P>[4] Tal como mencionado em American Library Association. Guidelines
and Considerations for Developing a Public Library Internet Use Policy.
&lt; http://www.ala.org/alaorg/oif/internet.html&gt;. Acesso em 08 de junho
de 2002.</P>

<P>[5] YURI, Fl&aacute;via. E-mail porn&ocirc; d&aacute; justa causa na
Ford. plant&atilde;o info / TI . Dispon&iacute;vel em &lt;http://www2.uol.com.br/info/aberto/infonews/062002/06062002-28.shl&gt;.
Acesso em: 08 de junho de 2002 </P>

<P>[6] Interne Use Police in Public Libraries. In: EUA. Corte do Distrito
do Leste de Pensilv&acirc;nia. AMERICAN LIBRARY ASSOCIATION: CIVIL ACTION.
Dispon&iacute;vel em: &lt;http://www.paed.uscourts.gov/documents/opinions/02D0414P.HTM&gt;.
Acesso em: 08 de junho 2002. </P>

</BODY>
</HTML>
