<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE></TITLE>
   <META NAME="Author" CONTENT="">
   <META NAME="GENERATOR" CONTENT="Mozilla/3.01Gold (WinNT; I) [Netscape]">
</HEAD>
<BODY TEXT="#80FF00" BGCOLOR="#400040" LINK="#0000EE" VLINK="#551A8B" ALINK="#FF0000">

<CENTER><P><A HREF="http://www.inf.ufsc.br/barata/index.html">Homepage</A>
<A HREF="http://barataeletrica.blogspot.com">Blog do Fanzine</A> <A HREF="http://www.inf.ufsc.br/barata/barata27.html">&Iacute;ndice
No 27</A> <A HREF="http://www.inf.ufsc.br/barata/ind.htm">&Iacute;ndice
N&uacute;meros Anteriores</A> <A HREF="http://www.inf.ufsc.br/barata/emai.htm">Contato</A>
<BR>
http://barataeletrica.cjb.net http://www.inf.ufsc.br/<BR>
Vers&atilde;o Txt <A HREF="http://www.barataeletrica.rg3.net">http://www.barataeletrica.rg3.net</A>
</P></CENTER>

<CENTER><P><B>RETROSPECTIVA(r):</B></P></CENTER>

<CENTER><P><B>CONTINUA&Ccedil;&Atilde;O DE &quot;COMO COME&Ccedil;AR UMA
CENA HACKER&quot;</B></P></CENTER>

<P>Derneval R.R. Cunha</P>

<P>Muita gente me pergunta hoje como &eacute; que n&atilde;o fiquei rico
com a Internet ou como est&atilde;o as coisas. Normalmente s&atilde;o pessoas
que j&aacute; perderam o contato com o fanzine faz tempo. E reconhe&ccedil;o,
&eacute; dif&iacute;cil ler tudo o que escrevo. &Eacute; muita coisa. Mas,
resumindo:</P>

<P>Ap&oacute;s aquilo que descrevi como sendo o in&iacute;cio do Barata
El&eacute;trica, muita coisa aconteceu. Os historeadores de plant&atilde;o
v&atilde;o me perdoar a aus&ecirc;ncia de datas e de nomes. As datas est&atilde;o
em emails, guardados a 7 chaves, esperando o dia em que vou fazer um trabalho
acad&ecirc;mico sobre o assunto (falta s&oacute; orientador). Os nomes
e nicks eu vou guardar tamb&eacute;m por qu&ecirc; j&aacute; vi que aparecer
no Barata El&eacute;trica tanto pode ser uma boa como uma muito ruim. A
pessoa fica marcada como hacker ou como cracker. E o que &eacute; pior,
usa meu nome como propaganda. &quot;Sou amigo do Derneval&quot; como se
isso fosse algo incr&iacute;vel (e de repente at&eacute; &eacute;). Ent&atilde;o
vamos aos eventos: </P>

<P>Minha vida pessoal se misturou com a do Fanzine, coisa horr&iacute;vel.
No in&iacute;cio de 97, um carinha apareceu querendo continuar onde eu
tinha parado, com aquela coisa de reunir uns carinhas de S&atilde;o Paulo
para montar a base para um encontro maior, regional e depois um encontro
de Hackers tipo os de Amsterdam ou de Nova York. Parecia sincero, veio
com um papo de que queria montar encontros em S&atilde;o Paulo e come&ccedil;ou
a reunir uns indiv&iacute;duos. At&eacute; concordei em aparecer. A maioria
dos caras eram colegas de trabalho dele. Era um aproveitador, com l&aacute;bia,
mas nada de hacking na cabe&ccedil;a, s&oacute; me dei conta disso bem
depois. At&eacute; hoje ele coloca meu nome na p&aacute;gina comercial
dele como se fosse um trof&eacute;u e f&ocirc;ssemos amigos ou tivessemos
alguma forma de contato (alguns amigos meus, que tem menos experi&ecirc;ncia
de vida, confiam nesse cara at&eacute; hoje, vide o caso da novela de Roque
Santeiro). Deletei o cara da minha lista e agora tanto o nick quanto o
nome dele s&atilde;o palavr&atilde;o.</P>

<P>Mas com minha ajuda (recomendei para muita gente) os encontros em S&atilde;o
Paulo viraram uma realidade. Claro que hoje tem v&aacute;rios e v&aacute;riados
tipos de profissionais se encontrando via internet ou em bares. Mas na
&eacute;poca n&atilde;o tinha nada do g&ecirc;nero e v&aacute;rios programadores
e aficcionados s&oacute; tinham vida social nesses encontros de s&aacute;bado
a noite. As vezes vinham at&eacute; 30 a 40 pessoas. Eram pessoas que traziam
pessoas que traziam pessoas. A internet n&atilde;o era uma coisa t&atilde;o
difundida quanto hoje. Era uma minoria. Dentro dessa minoria estavam os
caras que participavam dos encontros de S&atilde;o Paulo, perto da USP.
Isso, por volta de julho de 97 em diante (faz alguns anos que isso terminou,
&eacute; bom frisar). Era o ano em que poderia at&eacute; ter ido pros
EUA e criado algo como o Yahoo ou o Cad&ecirc; aqui no Brasil, mas preferi
ir para a P&oacute;s-gradua&ccedil;&atilde;o. Ao mesmo tempo terminei meu
curso na USP, fiquei desempregado e tamb&eacute;m tive que mudar de endere&ccedil;o.
E mais ou menos a &eacute;poca em que a Linuxsp come&ccedil;ou com os encontros
de linuxeiros e tamb&eacute;m que as revistas come&ccedil;aram a distribuir
CDs de Linux da Conectiva, (altamente invad&iacute;vel, na &eacute;poca).</P>

<P>Naquele ano de 97 houve tamb&eacute;m o encontro de Hackers em Nova
York, o BEYOND HOPE e em Amsterd&atilde;, o HIP, HACKIN IN PROGRESS, j&aacute;
descrito em n&uacute;meros anteriores do fanzine, vide URL:&nbsp; <A HREF="http://www.inf.ufsc.br/barata/hip97.htm">http://www.inf.ufsc.br/barata/hip97.htm</A>
. Eu me xingo at&eacute; hoje por n&atilde;o ter participado, mas como
contei acima, estava aguardando uma vaga de emprego. A revista Super-Interessante
n&atilde;o se interessou em financiar minha ida para Amsterd&atilde;, ent&atilde;o
cortei todo o papo com a imprensa. Mal sabia eu que imprensa brasileira
&eacute; assim mesmo: ningu&eacute;m paga por reportagem. As reportagens
quase sempre s&atilde;o c&oacute;pias de assuntos que fazem sucesso l&aacute;
fora ou ent&atilde;o s&atilde;o divulga&ccedil;&atilde;o de produtos em
forma de not&iacute;cia. Eles n&atilde;o iriam pagar nem um centavo para
que eu fosse at&eacute; l&aacute; cobrir o evento, mas adorariam ler o
que eu escrevesse sobre o assunto. </P>

<P>Cancelei a id&eacute;ia e fui me concentrar no meu mestrado. Resolvi
tamb&eacute;m parar de ajudar rep&oacute;rteres. Um que era amigo e virou
diretor de revista me ofereceu uma vaga de colunista, mas acredita: me
deu um n&uacute;mero de telefone onde a secret&aacute;ria sempre informava
&quot;ele n&atilde;o est&aacute; na sala no momento, tem um n&uacute;mero
de telefone para retornar a liga&ccedil;&atilde;o&quot;. N&atilde;o importava
a hora do dia em que ligasse(*). Nada de email detalhando o quanto eu ia
receber para escrever a coluna. Outra revista me ofereceu grana, mas queria
pagar s&oacute; depois que a(s) reportagem(ns) sa&iacute;sse(m) nas bancas.
Queriam que eu contasse tudinho tudinho (coisas que talvez colocassem amigos
em dificuldades) para (noventa dias) depois (quem sabe) me pagar R$50,00
ou R$100,00. Se eu chegar num &ocirc;nibus em S&atilde;o Paulo, com roupa
de rato de praia e falar: &nbsp;&quot;Gente: n&atilde;o vi aqui para assaltar
nem roubar ningu&eacute;m: sou apenas um jovem desesperado por que minha
avozinha, coitada, est&aacute; l&aacute; na minha casa de praia, em Angra
dos Reis, triste, desesperada, desconsolada por qu&ecirc; quebrou uma pe&ccedil;a
do Jet-ski dela! E tem que importar de Miami a reposi&ccedil;&atilde;o.
Eu pediria a voc&ecirc;s uma modesta contribui&ccedil;&atilde;o, vale qualquer
coisa, Vale-transporte, Vale-cargo-p&uacute;blico, ticket-refei&ccedil;&atilde;o,
por favor, ajudem a minha av&oacute; a voltar de novo a usar o Jet-ski
dela&quot;.. se eu fizer isso nos &ocirc;nibus de S&atilde;o Paulo, &eacute;
capaz que em 1 ou 2 dias acumulo bem mais do que R$50,00 ou R$100,00 e
olha que paulista est&aacute; dif&iacute;cil de abrir a carteira.</P>

<P>Quantos rep&oacute;rteres n&atilde;o me procuraram para reportagens
e aparecer na televis&atilde;o? S&oacute; de televis&atilde;o recusei pelo
menos umas 4 ou 5 ofertas, incluindo web-TV. Uma me procurou falando que
a coisa era espec&iacute;fica comigo. Depois de 20 minutos de conversa,
me pediu para levar junto tamb&eacute;m um &nbsp;&quot;hacker do mal&quot;
para se contrapor a mim. A TVUSP eu at&eacute; concordei em ajudar a fazer
um document&aacute;rio sobre o assunto, que ficou muuiiito bom. O resultado
mais interessante (da minha recusa em ajudar jornalista) foi uma da Revista
GALILEU. Nem me dei ao trabalho de falar mal da reportagem do cara no fanzine,
seria propaganda. O sujeito se baseou no canal Discovery para se informar
sobre o assunto. E como escrevia mal. Contei uns 20 ou 30 erros, desde
erro de digita&ccedil;&atilde;o simples (errou meu nome e o de outros sujeitos)
at&eacute; erros conceituais (gozado &eacute; que v&aacute;rios trechos
da reportagem foram repetidos em livros vagabundos sobre &quot;hackers&quot;
e minha tagline &quot;eu acesso, logo existo&quot; foi comentada sem receber
o cr&eacute;dito). Claro que toda essa &nbsp;falta de ajuda teve uma resposta
a altura: fazem a hist&oacute;ria da internet brasileira e n&atilde;o tocam
nunca na exist&ecirc;ncia do fanzine. Tem reportagem sobre hacker, nem
mencionam, na maioria das vezes.</P>

<P>Outro tipo de pedido de ajuda foram de pessoas querendo dicas sobre
hackers para escrever livros. Algumas para melhorarem a capacidade de trabalho.
Poderia fazer um livro com os diferentes tipos de email que tinham como
objetivo me perguntar como se invadia sistemas, zerava a conta de telefone
ou &quot;quero ser hacker, me ensina&quot;. N&atilde;o sei como o pessoal
pode me achar capaz de fazer esse tipo de coisa. Pela l&oacute;gica, seria
dar bandeira, o mesmo que sair na rua com uma camiseta &nbsp;&quot;sou
assaltante, me prenda&quot;. Mas todo dia chegava email. Durante um tempo
fiz um email com auto-responder: a pessoa mandava o email para l&aacute;,
j&aacute; recebia automaticamente uma resposta educada, falando que eu
n&atilde;o fazia isso. Pagar pela ajuda, acho que s&oacute; uma pessoa
falou nisso.. </P>

<P>Mas, voltando ao assunto.. houve um ano em que aquilo que a M&iacute;dia
poderia chamar de &quot;Movimento Hacker&quot; (coisa meio fantasiosa,
de certa forma) estava efervescente. Com o Windows 95 era bastante f&aacute;cil
o acesso &agrave; internet. Os CDs de instala&ccedil;&atilde;o com o Internet
Explorer poupavam o sujeito de ficar aprendendo sobre o computador dele,
coisa que era quase um ritual de inicia&ccedil;&atilde;o. O cavalo de tr&oacute;ia
&nbsp;&quot;Back Orifice&quot; ainda n&atilde;o era a mania que virou mais
tarde, com todo mundo mandando &quot;presentes de grego&quot; possibilitando
invas&otilde;es de micro que usavam Win95. A revista Internet World publicou
um conjunto de reportagens sobre inseguran&ccedil;a inform&aacute;tica,
que (junto com material meu, foram reunidas em livro por um cara que nem
sequer deu o nome dos autores) detalhando quase todas as dicas para as
inseguran&ccedil;as do Windows95, o sistema operacional que montes de caras
como eu se recusaram a aprender a usar, durante bastante tempo. As reportagens
ficaram desatualizadas em pouco tempo. Mas tanto aqui como em outros lugares
do Pa&iacute;s, as palavras de ordem para qualquer imbecil era &quot;nukar&quot;,
&quot;mailbomb&quot;, &quot;Denial of Service&quot;, &nbsp;&quot;Trojan&quot;,
&quot;lamer&quot;. As pessoas que entendiam isso se denominavam &quot;hackers&quot;.
A lista &nbsp;&quot;hackers&quot; da Unicamp foi pro saco. Era quase a
primeira em n&uacute;mero de assinantes. Detalhe: houve &eacute;poca em
que um ter&ccedil;o deles era de email &nbsp;&quot;gov.br&quot;. Vai saber
por qu&ecirc;.. (eu at&eacute; sei, mas fica pro livro).</P>

<P>A pior e a melhor parte foi um encontro da Faculdade de Comunica&ccedil;&atilde;o
da UFBA, em Salvador. Detalhei isso no fanzine, dispon&iacute;vel no URL&nbsp;
<A HREF="http://www.inf.ufsc.br/barata/combah.htm">http://www.inf.ufsc.br/barata/combah.htm</A>
. Muitas palestras foram interessantes e esse foi o lado bom, a melhor
parte. A parte que foi ruim foi a palestra da representante do UOL, uma
palestra da Marion Strecker, a toda-poderosa do UOL, na &eacute;poca um
portal muito bom que permitia ler jornal tipo Folha de S&atilde;o Paulo
e outras revistas de gra&ccedil;a. A menina dos olhos do UOL era um estudo
do p&uacute;blico leitor do UOL. A Marion terminou a palestra comentando
que tipos de funcion&aacute;rios a empresa queria. Isso eu nunca vou me
esquecer, queria ter gravado em fita cassete. </P>

<P>&nbsp;<I>&quot;N&oacute;s do UOL queremos algu&eacute;m com:</I></P>

<UL>
<LI><I>Conhecimento de v&aacute;rios idiomas</I></LI>

<LI><I>Viv&ecirc;ncia no estrangeiro</I></LI>

<LI><I>Conhecimento de todas as ferramentas da internet, html, etc..</I></LI>

<LI><I>Estilo de escrita sarc&aacute;stico e interessante</I></LI>

<LI><I>etc..&nbsp;&quot;</I></LI>
</UL>

<P>Coisa inspiradora de se ouvir quando se &eacute; estudante de comunica&ccedil;&atilde;o
como a maioria dos presentes. S&oacute; que o UOL tinha aberto uma vaga
para redator, mais ou menos um m&ecirc;s e meio antes. Inscri&ccedil;&atilde;o
On-line. A minha grande chance: espero ela, a grande chefe do UOL terminar
sua palestra e pergunto, na frente de todo mundo por que &eacute; que eu,
que tenho todas as qualidades ali descritas como essenciais para o UOL,
por que eles abriram um processo on-line de inscri&ccedil;&atilde;o e al&eacute;m
de n&atilde;o me escolheram n&atilde;o me enviaram o resultado. Fui educado
e n&atilde;o fiz isso. Acabei optando por deixar para perguntar na sa&iacute;da.
A &uacute;nica resposta foi &quot;&eacute;, eles deviam ter enviado um
email pelo menos&quot;. Tamb&eacute;m aproveitei para perguntar se o conte&uacute;do
do UOL ia continuar gratuito e batata: segunda-feira seguinte j&aacute;
estavam restringindo para quem era assinante. </P>

<P>Com a explos&atilde;o da internet no Brasil, as op&ccedil;&otilde;es
se restringiram um pouco. Em pouco tempo, o conhecimento de Unix deixou
de ser um diferencial, passou a ser desnecess&aacute;rio. Os &quot;manuais&quot;
de vandalismo eletr&ocirc;nico que inclu&iacute;ram isso fizeram um monte
de palermas estudarem isso a toa. A toa por que quem estuda UNIX a s&eacute;rio
n&atilde;o se liga em vandalismo eletr&ocirc;nico. Tem muita coisa para
estudar para se ficar pensando em ferrar com a vida dos outros. Quem estuda
pouco n&atilde;o acha gra&ccedil;a em nada. O ambiente Windows por outro
lado, nem &eacute; preciso comentar. E o fato &eacute; que muita gente
comprou livro que ficou encostado na estante. Serviu s&oacute; para mostrar
pro amigo. As salas de Chat aprenderam rapidinho a fechar suas portas pros
v&acirc;ndalos. </P>

<P>O fanzine Barata El&eacute;trica deixou de ser o &uacute;nico. V&aacute;rios
outros come&ccedil;aram, como o Alternetive (ainda em funcionamento at&eacute;
hoje, veja minha entrevista pro autor no URL <A HREF="http://www.ufsm.br/alternet/zine/be.html">http://www.ufsm.br/alternet/zine/be.html</A>
continua l&aacute;), o Hack.br (baseado no Barata), o Technor&aacute;culo,
o Mundi, o Dr.Byte, Infotime, Uivo, etc.. (tem uma lista no <A HREF="http://www.inf.ufsc.br/barata/barata9.html">http://www.inf.ufsc.br/barata/barata9.html</A>
. Se eu parar para escrever fa&ccedil;o um livro s&oacute; com o material
que eu tenho. Em todo o Brasil o Barata El&eacute;trica foi praga, incluindo
nas BBSes onde tamb&eacute;m foi o primeiro fanzine. Chato &eacute; que
n&atilde;o falava quase nada do ambiente mais comum de transmiss&atilde;o,
que eram as BBSes (isso at&eacute; a internet tomar conta). Quanto a ezines
hackers, putz! O &uacute;nico que me lembro ter gostado foi o Nethack.
Coloquei uma rela&ccedil;&atilde;o deles em <A HREF="http://www.inf.ufsc.br/barata/new.htm">http://www.inf.ufsc.br/barata/new.htm</A>
mas nem tentei ir muito fundo na descri&ccedil;&atilde;o desses fanzines,
daria um livro, um monte deles era c&oacute;pia uns dos outros, ficou para
outro dia. O Axur 05 foi o grande concorrente em popularidade. Falavam
mal do meu fanzine pra caramba. Editaram pouco, cerca de 4 exemplares.
No &uacute;ltimo moderaram o tom, a gente fez as pazes e qualquer dia conto
o resto (ou vc pode ler em <A HREF="http://www.inf.ufsc.br/barata/hackpoa22.html">http://www.inf.ufsc.br/barata/hackpoa22.html</A>
).</P>

<P>Tendo come&ccedil;ado o mestrado na USP, foram tempos dif&iacute;ceis.
</P>

<P>Sofri persegui&ccedil;&otilde;es. Como por exemplo, um cara que j&aacute;
tinha conseguido meses de suspens&atilde;o, v&aacute;rias reclama&ccedil;&otilde;es
por comportamento agressivo entre outras. Queria uma briga comigo, n&atilde;o
topei. Para tentar me for&ccedil;ar, espalhou e tentou convencer gente
que eu era capaz de alterar a nota dele no sistema de notas da USP. At&eacute;
que gostaria de ter essa capacidade. Teria terminado meu curso mais cedo,
teria entrado na P&oacute;s-gradua&ccedil;&atilde;o quando era algo quase
autom&aacute;tico, receber bolsa de P&oacute;s, entre outras facilidades.
A sorte (dele) &eacute; que a coisa n&atilde;o deu em nada. O pessoal de
inform&aacute;tica da USP, salvo exce&ccedil;&otilde;es que n&atilde;o
est&atilde;o no topo da hierarquia, n&atilde;o gosta da minha pessoa. Talvez
por conta da primeira vez que apareci numa reportagem de jornal como &quot;hacker&quot;,
no jornal Estado de S&atilde;o Paulo, 26 de abril de 96. Shimamura prendendo
o Mitnick. Me ferrei nessa. O Carlos Graieb me colocou como o &nbsp;&quot;hacker
mais conhecido do Brasil&quot;. Mas &quot;hacker&quot; no contexto da reportagem
seria algu&eacute;m que invade sistemas. Teve funcion&aacute;rio que entendeu
t&atilde;o errado que repete por a&iacute; que eu tinha sido preso. E a
lenda se espalhou. Se houvesse jeito de comprovar algo contra mim, n&atilde;o
manteriam meu email rodrigde@usp.br quando entrei na P&oacute;s. </P>

<P>O segundo pior epis&oacute;dio desse preconceito foi um sujeito que
chegou a trabalhar comigo num lugar uns 6 meses. Conseguiu ser Root legalmente,
cuidava da seguran&ccedil;a de um laborat&oacute;rio de computa&ccedil;&atilde;o.
Fora da USP, digamos. Parecia ser algu&eacute;m competente e respons&aacute;vel.
E at&eacute; era, s&oacute; que ficou paran&oacute;ico de tanto ler sobre
seguran&ccedil;a inform&aacute;tica. Uma dia decidiu que ia fazer um ftp
site com fanzines hacker e pediu minha ajuda. Sem avisar, tentei fazer
um upload de uma p&aacute; de zines para o local. N&atilde;o tinha se&ccedil;&atilde;o
de &quot;incoming&quot;. Desisti de jogar os arquivos dentro do site. No
dia seguinte ele me mandou email dizendo que eu tinha tentado invadir o
site dele! At&eacute; que ele foi competente. Quis me ouvir primeiro. A
bronca que eu dei no telefone foi memor&aacute;vel, tanto em volume quanto
em raz&otilde;es e ele foi muito decente em ouvir at&eacute; o fim. Por
que eu nunca seria capaz de fazer isso, danificar o trabalho de outra pessoa
e &oacute;bvio dos &oacute;bvios tamb&eacute;m n&atilde;o usaria meu pr&oacute;prio
nick durante o processo, etc, etc.. O Derneval que faz o fanzine Barata
El&eacute;trica n&atilde;o pode fazer isso. Foi uma situa&ccedil;&atilde;o
dif&iacute;cil de segurar. Isso aconteceu com um cara que trabalhou comigo.
Minha conclus&atilde;o &eacute; que servi&ccedil;o de seguran&ccedil;a
inform&aacute;tica realmente deixa qualquer um paran&oacute;ico e que a
pessoa fica procurando chifre em urubu se n&atilde;o tomar cuidado. Olhando
desse &acirc;ngulo, coitado do pessoal da USP que ficou vigiando minha
vida na internet pensando que um dia iam comprovar que sou perigoso.. tanto
trabalho em v&atilde;o. Eu n&atilde;o posso atirar a primeira pedra nesse
assunto de paran&oacute;ia. Se bem que paran&oacute;ia &eacute; quando
voc&ecirc; *imagina* uma persegui&ccedil;&atilde;o. Meu caso &eacute; de
ver minha conta internet travada por motivos est&uacute;pidos ou sem motivo
nenhum e uma grande lista de &quot;coincid&ecirc;ncias&quot; e outras coisas
estranhas, muito estranhas.</P>

<P>Uma vez telefonei para um pessoal l&aacute; no RS. Disse que n&atilde;o
podia ir por falta de carona. Tr&ecirc;s dias depois recebi oferta de carona
exatamente para Porto Alegre, via email. Algu&eacute;m tinha colocado meu
email num servi&ccedil;o de caronas via internet! Detalhe: a pessoa com
quem falei jurou que n&atilde;o tinha falado isso para ningu&eacute;m,
mas que ela mesma j&aacute; tinha checado seu telefone para grampo e detectado
que podia estar grampeado. Nunca soube quem foi. Outra foi o aparecimento
de uma menina pedindo para usar o micro no meu lugar de trabalho. Assistiu
Shrek? Lembra da princesa? Se a menina vestisse igual, iam falar que saiu
da tela. Inclusive fazia cafun&eacute;. E .. tamb&eacute;m queria ser hacker.
A&iacute; a d&uacute;vida: eu tinha anunciado para meio mundo que estava
escrevendo um livro sobre hackers. N&atilde;o foi a &uacute;nica loira.
Teve outra, ambas com algo em comum: eram parecidas com a foto de um poster
que eu tinha na parede do meu quarto. Qualquer dia vou colocar an&uacute;ncio
vendendo para o pessoal que acredita em simpatia: basta colocar este poster
numa parede voltada para a janela que d&aacute; de frente para outro apartamento
e aparece uma igual na sua vida.</P>

<P>O que n&atilde;o quer dizer que ser conhecido como hacker d&aacute;
sorte com as mulheres. Namorei uma garota por cerca de 4 anos. Acabou,
dois anos depois quis me encontrar com ela de novo. Ela ficou adiando at&eacute;
que um dia me mandou uma carta por correio normal: n&atilde;o queria me
dar seu email por que tinha medo de hackers. Duas bebedeiras depois fui
falar com ela e at&eacute; descobri que usava Internet Explorer e Outlook
como mailer. Coitada. As melhores portas de entrada para v&iacute;rus de
computador e outros c&oacute;digos maliciosos. Como &eacute; que &eacute;
a can&ccedil;&atilde;o mesmo? &quot;&Eacute;, nessa minha casa tem goteira..
pinga ni mim.. pinga ni mim.&quot; </P>

<P>A parte boa da coisa de ser famoso &eacute; poder ir em qualquer lugar
e fazer amizades quase inst&atilde;ntaneas com gente legal. Ou encontrar
ao vivo gente que j&aacute; conheci de nome, on-line. Foi assim com o criador
do manual de viola&ccedil;&atilde;o de telefones. Eu estava com uma camiseta
do fanzine numa discoteca e o cara me descobriu. Em Salvador tamb&eacute;m
foi assim. Conheci um sujeito de MG que tinha sua pr&oacute;pria turma
de fu&ccedil;adores em MG. Outra estava vendo um cara estudando no &ocirc;nibus,
conversei, depois de um tempo perguntei, o cara quase engasgou. &Eacute;
legal ver essa rea&ccedil;&atilde;o (positiva) das pessoas. O chato &eacute;
quando voltam com aquela velha pergunta: &quot;me ensina a ser hacker&quot;?
Ou pior, querem tirar foto junto comigo. Normalmente d&aacute; azar e a
amizade acaba ou diminui drasticamente em pouco tempo. A pessoa arma uma
situa&ccedil;&atilde;o constrangedora onde eu topo tirar a foto e pouco
tempo depois descubro que era arma&ccedil;&atilde;o. Teve um caso em que
continuei falando com a pessoa, mas perdi o contato. Noutro caso, o sujeito
armou uma viagem s&oacute; para conseguir o feito. Tirar foto &eacute;
algo que pode at&eacute; ser inocente, mas o qu&ecirc; o cara faz com ela?
Fazer propaganda pros colegas que me conhece? T&ocirc; fora. Exce&ccedil;&otilde;es
at&eacute; existem mas s&atilde;o poucas. Minha orientadora, por exemplo.</P>

<P>A luta agora &eacute; tentar fazer um doutorado, j&aacute; que estou
terminando o mestrado, com a disserta&ccedil;&atilde;o &quot;Entre Gabeira
e Guevara: Notas sobre os escritos da Luta Armada&quot;. Era para ser sobre
a vida na clandestinidade, coisa explorada no document&aacute;rio de Patr&iacute;cia
Moran, &quot;Clandestinos&quot;, vide a mostra de document&aacute;rios
&quot;&Eacute; tudo verdade&quot; <A HREF="http://www.kinoforum.org/php/kino_docs/ficha.php?op=show&index=7581">http://www.kinoforum.org/php/kino_docs/ficha.php?op=show&amp;index=7581</A>
. Nem cheguei a assistir, mas a sinopse fala a id&eacute;ia que eu tinha
quando comecei. Sim, claro que minha prefer&ecirc;ncia inicial seria usando
o tema hackers, mas como n&atilde;o fiz a gradua&ccedil;&atilde;o nem o
mestrado em &aacute;reas de inform&aacute;tica, ficou meio dif&iacute;cil.
E n&atilde;o sei se vou poder fazer doutorado usando o tema de seguran&ccedil;a
inform&aacute;tica. Como minha forma&ccedil;&atilde;o n&atilde;o &eacute;
de soci&oacute;logo (para fazer algo na &aacute;rea de Antropologia &eacute;
necess&aacute;rio) analisar a turma tamb&eacute;m est&aacute; meio fora,
depende muito do orientador. At&eacute; tive uma oferta de orienta&ccedil;&atilde;o,
mas para fazer em 2 anos. Ainda estou pensando. O tema hackers me &eacute;
muito caro, mas nem tudo na vida &eacute; como a gente quer, vamos ver,
os dados est&atilde;o rolando.</P>

<P>(*) N&atilde;o existe coisa mais nojenta do que ter que &quot;ca&ccedil;ar&quot;
a pessoa via telefone. Muito dif&iacute;cil eu fazer isso, principalmente
pra jornalista.</P>

</BODY>
</HTML>
