<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>Roteiro para Entrevista</TITLE>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/3.01Gold (WinNT; I) [Netscape]">
   <META NAME="Author" CONTENT="Derneval R.R. Cunha">
   <META NAME="KeyWords" CONTENT="interview, jôsoares, josoares, Jô Soares, entrevista, talk-show, talkshow, Marília Gabi Gabriela">
</HEAD>
<BODY TEXT="#FFFFCC" BGCOLOR="#330033" LINK="#0000EE" VLINK="#551A8B" ALINK="#FF0000">

<CENTER><P><A HREF="http://www.inf.ufsc.br/barata/index.html">Homepage</A>
<A HREF="http://barataeletrica.blogspot.com">Blog do Fanzine</A> <A HREF="http://www.inf.ufsc.br/barata/barata27.html">&Iacute;ndice
No 27</A> <A HREF="http://www.inf.ufsc.br/barata/ind.htm">&Iacute;ndice
N&uacute;meros Anteriores</A> <A HREF="http://www.inf.ufsc.br/barata/emai.htm">Contato</A>
<BR>
http://barataeletrica.cjb.net http://www.inf.ufsc.br/<BR>
Vers&atilde;o Txt <A HREF="http://www.barataeletrica.rg3.net">http://www.barataeletrica.rg3.net</A>
</P></CENTER>

<CENTER><P><B>O HACKER E O TALK SHOW: AS FANTASIAS DE&nbsp; ENTREVISTADOS</B>
</P></CENTER>

<P>Derneval R.R. Cunha </P>

<P>Eu n&atilde;o sou a melhor pessoa do mundo para falar em entrevista.
J&aacute; fui entrevistado v&aacute;rias v&ecirc;zes, inclusive na TV (no
SBT, tenho a fita para comprovar). De l&aacute; para c&aacute;, tenho recusado
fazer isso (apesar que se o J&ocirc; me convidar, sei n&atilde;o). Quem
nunca teve a vontade de aparecer l&aacute;? Acho que s&oacute; quem n&atilde;o
viu televis&atilde;o. Seja no J&ocirc; Soares, seja na Mar&iacute;lia Gabi
Gabriela, seja onde for. Conhe&ccedil;o a sensa&ccedil;&atilde;o de ser
entrevistado. D&aacute; um &quot;barato&quot; que dura dias. Voc&ecirc;
fica incapaz de raciocinar de forma adequada. Quase fui assaltado, uma
vez (n&atilde;o pelo entrevistador, &oacute;bvio, &eacute; que dei mole
quando sa&iacute; para comemorar e um bando de pivetes veio atr&aacute;s).
Hackers s&atilde;o seres humanos (independente do que voc&ecirc; considere
hacker) e pass&iacute;veis de ficarem vulner&aacute;veis numa dessas. Sobre
os rep&oacute;rteres, j&aacute; n&atilde;o tenho tanta certeza. O problema
deles &eacute; que quando conseguem um trabalho, defendem com unhas e dentes.
Fazem a mat&eacute;ria sobre voc&ecirc; e depois o editor.. edita. Corta
e recorta, faz um tro&ccedil;o. </P>

<P><B>Para que serve uma entrevista</B> </P>

<P>Basicamente, para se promover. Voc&ecirc; pode ter a fantasia de que
ser&aacute; lindo e maravilhoso, ver sua cara e ouvir sua voz l&aacute;
na telinha. Seria legal todo mundo ter aqueles &quot;15 minutos de fama&quot;
que o Andy Wharol falava. Alguns v&atilde;o ter essa fama quando aparecerem
nas p&aacute;ginas policiais. Outros quando aparecer o aviso f&uacute;nebre.
Mas voltando ao assunto, essa coisa de falar que a pessoa parece ator e
portanto poderia aparecer na TV n&atilde;o significa nada. Veja o caso
de B&oacute;ris Karlof, Ernest Borgnine e o pr&oacute;prio Charles Bronson.
Vai tamb&eacute;m ver os programas do Faust&atilde;o, do S&eacute;rgio
Malandro ou do Ratinho para ver outras formas de aparecer. </P>

<P>Ent&atilde;o, aparecer na TV &eacute; algo que se pode at&eacute; contar
para os netinhos. Por isso se compra aquelas c&acirc;meras de v&iacute;deo.
Aparecer numa not&iacute;cia, &oacute;timo. Agora, aparecer num Talk-Show,
isso &eacute; para quem pode. &Eacute; preciso ter algo a dizer. H&aacute;
muitos boatos at&eacute; que o sujeito paga para aparecer, que n&atilde;o
&eacute; de gra&ccedil;a. Sei l&aacute;. Vendo o que aparece, acredito
que tem dois tipos de pessoas que aparecem nos Talk-Show: os que s&atilde;o
de interesse do p&uacute;blico e os que s&atilde;o de interesse da emissora.
S&oacute; isso explicaria umas entrevistas onde o sujeito tem que tirar
&quot;sangue de pedra&quot; para ver algo interessante sair. Ainda me lembro
do J&ocirc; Soares tendo um &quot;surto&quot; de raiva com um entrevistado
que deu comida de presente (sendo o J&ocirc; gordo, poderia ter tudo a
ver, mas o cara faz regime). </P>

<P>Mas para quem precisa lan&ccedil;ar um livro, um espet&aacute;culo,
quem precisa se promover, um Talk-Show &eacute; o caminho para sair do
anonimato. O problema &eacute; o que acontece com a vida da pessoa, depois.
</P>

<P><B>Minha experi&ecirc;ncia</B> </P>

<P>Umas 3 ou 4 entrevistas que dei acabaram saindo em publica&ccedil;&otilde;es.
Como j&aacute; comentei em outros textos, algumas tinham exageros fant&aacute;sticos.
Num pa&iacute;s de analfabetos funcionais (gente que sabe ler, mas que
n&atilde;o l&ecirc; com a devida aten&ccedil;&atilde;o), isso &eacute;
meio perigoso. Virar not&iacute;cia foi legal para o fanzine, porqu&ecirc;
consegui que gente do norte ao sul do pa&iacute;s soubesse o que &eacute;
hacker e o que n&atilde;o &eacute; (pena que isso foi esquecido r&aacute;pido).
A id&eacute;ia era fazer uma grande associa&ccedil;&atilde;o de &quot;man&iacute;acos
de computador&quot; que se reunisse em S&atilde;o Paulo ou outro lugar.
Ou melhor ainda, que todo lugar tivesse seu grupinho de fu&ccedil;adores
(ou fussadores) que poderiam ou n&atilde;o se intitularem hackers ou coisa
do g&ecirc;nero. Com a minha ajuda, durante um tempo teve gente aqui em
Sampa se reunindo, chegavam a ser 20 ou 30, durante um tempo, em Pinheiros.
Todo mundo virou &quot;hacker&quot;, a coisa come&ccedil;ou a declinar
e s&oacute; alguns continuaram. Mas a imprensa escrita foi importante.
</P>

<P>A &uacute;nica entrevista onde minha voz apareceu sem edi&ccedil;&otilde;es
foi uma que fiz junto com um outro fussador, para a r&aacute;dio Globo,
creio eu, acho que em 1995. Algum dia vou colocar trechos dela online.
Foi um sucesso e depois pintou a entrevista com a Super-Interessante, que
realmente divulgou o fanzine. Era um tema novo, ningu&eacute;m sabia muita
coisa. No in&iacute;cio foi legal, mas depois come&ccedil;aram a pressionar
por coisas ligando hacker a vandalismo e crime por computador. Tenho orgulho
de dizer que sempre consegui me esquivar de reportagens que iriam para
as p&aacute;ginas policiais. </P>

<P><B>O esquema da entrevista</B> </P>

<P>Primeiro: N&atilde;o v&atilde;o te pagar por ela, a n&atilde;o ser que
voc&ecirc; seja o PC Farias ou o irm&atilde;o do Collor. 99% das pessoas
entrevistas est&atilde;o recebendo por conta da divulga&ccedil;&atilde;o
de seus produtos. O entrevistado est&aacute; na verdade fazendo propaganda
e o entrevistador, defendendo o dele atrav&eacute;s da propaganda que rola
nos comerciais.&nbsp; N&atilde;o custa pedir, dependendo do tipo de problema
que a divulga&ccedil;&atilde;o vai te trazer. Voc&ecirc; pode precisar
da grana para sumir do mapa, depois da entrevista. Pessoalmente, n&atilde;o
aconselho a nenhum pretendente a &quot;hacker&quot;, &quot;cracker&quot;,
a fazer entrevista sem considerar esse barato.&nbsp; Se eu topar alguma
entrevista em talk-show, &eacute; porqu&ecirc; quero divulgar meu trabalho
no fanzine&nbsp; usando a entrevista como &quot;gancho&quot;. </P>

<P>Segundo: Rep&oacute;rteres e entrevistadores n&atilde;o manjam patavinas
do que voc&ecirc; ir&aacute; estar falando. No caso do assunto &quot;hackers&quot;
eles podem at&eacute; entender que existem &quot;bandidos&quot; e &quot;mocinhos&quot;.
Mas isso n&atilde;o quer dizer muito, j&aacute; que ter&atilde;o que fazer
perguntas de forma a explicar o assunto para o p&uacute;blico. </P>

<P>Terceiro: Existe uma equipe encarregada do Talk-Show. . Eles tem o &quot;ponto
eletr&ocirc;nico&quot;, que &eacute; um fone de ouvido onde recebem instru&ccedil;&otilde;es
da equipe. E n&atilde;o decidem na hora o que v&atilde;o perguntar. Eles
tamb&eacute;m tem um roteiro ou &quot;cola&quot; do assunto. Tudo &eacute;
planejado com anteced&ecirc;ncia. O trabalho do entrevistador &eacute;
mais ou menos tornar tudo algo mais &quot;vivo&quot;.&nbsp; E &eacute;
o que faz a diferen&ccedil;a, porqu&ecirc; algumas v&ecirc;zes o conte&uacute;do
da pessoa n&atilde;o contribui muito. Lembro da entrevista da Tiazinha
com a Gabi-Gabriela e a da Carla Perez sendo entrevistada pelo J&ocirc;
Soares, bom, n&atilde;o d&aacute; para dizer muita coisa.. O sujeito que
est&aacute; l&aacute; sendo entrevistado &eacute; mais um boneco de decora&ccedil;&atilde;o
do que uma pessoa. &Eacute; que nem beijo de novela. </P>

<P>O Talk-Show em si &eacute;&nbsp; um programa como qualquer outro. Foi
inspirado em programas americanos. &Eacute; entretenimento em forma de
entrevista. A arte est&aacute; em fazer o telespectador se sentir como
algu&eacute;m que est&aacute; sentado ali do lado. O fato do J&ocirc; Soares
tirar sarro do entrevistado n&atilde;o &eacute; s&oacute; para o divertimento
do p&uacute;blico: &eacute; uma forma de provocar o aparecimento de alguma
coisa interessante. Ningu&eacute;m quer falar que faz j&aacute; soltou
peido dentro de elevador nem que molhava a fralda quando pequeno. </P>

<P><B>Acertando a entrevista</B> </P>

<P>Algo interessante de se fazer &eacute; j&aacute; ter planejado o que
se vai e o que n&atilde;o se vai falar. Provavelmente algu&eacute;m da
equipe do entrevistador vai te perguntar isso. Quem faz isso para a maioria
das pessoas s&atilde;o profissionais de Rela&ccedil;&otilde;es P&uacute;blicas.
&Eacute; ele que monta o roteiro da entrevista, com sugest&otilde;es para
os pontos fortes e fracos. No caso de um &quot;hacker&quot; (hahahahahahahahahahaha
- desculpe, mas tenho que rir quando lembro de alguns que apareceram na
TV e de gente que.. deixa para l&aacute;) provavelmente o cara iria l&aacute;
como not&iacute;cia e n&atilde;o como algo pautado. No caso da entrevista
que eu diria &quot;pautada&quot; (com roteiro mais ou menos acertado de
perguntas e respostas), a&iacute; realmente acontece aquela coisa gostosa
das perguntas e respostas. Principalmente porqu&ecirc; o entrevistador
pode n&atilde;o seguir a pauta e conseguir uns &quot;lances incr&iacute;veis&quot;
do entrevistado. Fica vis&iacute;vel, a arte. Como eu sei disso? Bom, conheci
um grande fu&ccedil;ador de micro que &eacute; filho de algu&eacute;m l&aacute;
da tal equipe do programa. Tinha tamb&eacute;m um carinha que participava
dos encontros aqui em S&atilde;o Paulo que se gabava de entrar no email
do J&ocirc;, no tempo em que era do SBT. &Eacute; constrangedor saber que
tinha mensagens meio.. bom, deixa para l&aacute;, provavelmente o email
do J&ocirc; n&atilde;o era usado s&oacute; pelo J&ocirc;. Acho que o cara
tinha a caixa postal inteira, do tempo em que o SBT come&ccedil;ou com
o sol.com.br, mas apagou a coisa quando rolou a.. &eacute; melhor deixar
esse material para o livro. </P>

<P>Voltando aos acertos, &eacute; besteira algu&eacute;m achar que pode
chegar na TV e ter certeza que n&atilde;o v&atilde;o filmar um monte e
s&oacute; usar trechos espec&iacute;ficos da grava&ccedil;&atilde;o. Quando
apareci na TV, foram umas 2 horas de prepara&ccedil;&atilde;o e s&oacute;
usaram 20 segundos da minha fala, dilu&iacute;dos no meio de 2 minutos
de imagens variadas. Eu tenho a suspeita que aqueles intervalos entre uma
e outra piada do J&ocirc; tem cortes fant&aacute;sticos. O programa talvez
n&atilde;o seja digamos &quot;ensaiado&quot;, mas tenho d&uacute;vidas
de que n&atilde;o seja &quot;editado&quot;. Se isso n&atilde;o ocorre em
Talk-shows, acontece na maioria das entrevistas. </P>

<P><B>Fazendo sua pr&oacute;pria pauta</B> </P>

<P>N&atilde;o &eacute; lance que se fa&ccedil;a de um dia pro outro. N&atilde;o
se pode pedir para algu&eacute;m fazer porqu&ecirc; &eacute; besteira,
se a pessoa n&atilde;o sabe o qu&ecirc; voc&ecirc; quer divulgar. &Agrave;s
v&ecirc;zes nem voc&ecirc; sabe direito. No meu caso, se eu fosse num Talk-show,
iria divulgar a diferen&ccedil;a entre esses caras que est&atilde;o produzindo
livros sobre o assunto versus o que realmente vi e conversei com muita
gente, quando s&oacute; os bons de inform&aacute;tica &eacute; que trafegavam
na internet. Era uma &eacute;poca em que voc&ecirc; n&atilde;o tinha Windows
para ajudar e era trabalho at&eacute; para saber o qu&ecirc; fazer. N&atilde;o
era o vandalismo de hoje. Claro que algumas coisas precisam ser reformuladas.
Falar de cria&ccedil;&atilde;o de v&iacute;rus num tempo em que isso se
transmite via internet &eacute; besteira. Melhor comentar &quot;pesquisas
no campo da intelig&ecirc;ncia artificial&quot;. Os caras que conheci que
mexiam com isso viam um v&iacute;rus de computador realmente pensavam mais
dessa forma (eram do tipo que inclusive n&atilde;o soltavam suas cria&ccedil;&otilde;es).
</P>

<P>&Eacute; mais ou menos como ser parado na rua. A pol&iacute;cia te revista
(coisa muito comum, quando se &eacute; jovem, pelo menos no meu tempo de
adolescente era). O policial encontra algo &quot;estranho&quot; e pergunta
se &eacute; para defesa pessoal. Se voc&ecirc; responde que sim, ele pode
te colocar &quot;portando arma ofensiva&quot;. A&iacute; o juiz depois
d&aacute; voz de pris&atilde;o, porqu&ecirc; estar na rua com arma ofensiva
pressup&otilde;e inten&ccedil;&atilde;o negativas, etc, etc.. exemplo meio
idiota, mas &eacute; por a&iacute;. &Eacute; perigoso falar para todo mundo
o que voc&ecirc; faz, se voc&ecirc; n&atilde;o sabe como isso pode ser
mal-interpretado. </P>

<P>Por exemplo, a primeiro coisa que eu colocaria seria o fato de que apenas
escrevo sobre o assunto e estou iniciando o doutorado nesse tema. Sei muito
porqu&ecirc; pesquiso isso pra caramba desde que fui para a Argentina,
j&aacute; escrevi para publica&ccedil;&otilde;es &quot;hacker&quot; antol&oacute;gicas,
como o &quot;2600-Hacker Quaterly&quot;, fiz o primeiro fanzine brasileiro
sobre o assunto, de certa forma iniciei a moda de &quot;quero ser hacker,
me ensina&quot;, mas que n&atilde;o invado computadores de ningu&eacute;m.
O fanzine ali&aacute;s &eacute; mais sobre &eacute;tica hacker. Invadir
computadores seria o mesmo que usar uma camiseta escrito &quot;me prenda&quot;.
Numa segunda parte da entrevista explicaria como foi que a publica&ccedil;&atilde;o
come&ccedil;ou, o que era o tal &quot;computer underground&quot;, minha
participa&ccedil;&atilde;o na &quot;FREEKEVIN&quot;, que para quem n&atilde;o
sabe come&ccedil;ou no Brasil, em Porto Alegre. Da&iacute; para frente
poderia falar de muita coisa, desde as mudan&ccedil;as na legisla&ccedil;&atilde;o
para tentar prender esse pessoal (como aconteceu com um rapaz de 14 anos,
que invadiu um sistema de uma f&aacute;brica de bombas nucleares nos EUA).
Poderia contar v&aacute;rias caracter&iacute;sticas do Computer Underground,
como funciona (se n&atilde;o tirarem muito o sarro da minha cara). E l&oacute;gico,
tudo no passado, porqu&ecirc; falar do presente &eacute; expor muita gente
que hoje j&aacute; mudou de vida e n&atilde;o trabalha mais na (in)seguran&ccedil;a
inform&aacute;tica. Na verdade tudo poderia falar sobre esse lado <B>vital
para a soberania nacional</B>, que &eacute; a seguran&ccedil;a inform&aacute;tica.
Se os EUA consideram o uso de &quot;hackers&quot; como arma de guerra (vide
a guerra do Golfo e os conflitos nos Balc&atilde;s), o Brasil deveria fazer
um estudo mais aprofundado, j&aacute; que os sistemas operacionais mais
usados no Brasil s&atilde;o de origem americana e sujeitos a terem problemas,
em caso de necessidade. &Eacute; um verdadeiro absurdo que se saiba t&atilde;o
pouco sobre o assunto. Para terminar, iria falar de algumas dificuldades
relativas ao in&iacute;cio do Doutorado e no mercado de trabalho, por conta
de ter feito nome nessa &aacute;rea. </P>

<P>Enfim, isso acima &eacute; sugerir uma pauta. &Eacute; colocar os assuntos
que interessam e que podem ser de interesse deles. Deles, subentenda-se
os anunciantes e o p&uacute;blico. Tire da cabe&ccedil;a qualquer id&eacute;ia
que vai ser um &quot;barato&quot; conversar com o J&ocirc; ou com Mar&iacute;lia
Gabi Gabriela frente a frente. Quando se &eacute; entrevistado sem experi&ecirc;ncia,
a pessoa fica num medo horroroso. Nem sei como os caras conseguem desinibir
os entrevistandos. O chato &eacute; que o sujeito que &quot;trava&quot;
com medo fica &quot;ruim&quot;, n&atilde;o exp&otilde;e o assunto. J&aacute;
teve sujeitos no programa do J&ocirc; que iam l&aacute; para expor sua
m&uacute;sica e na &quot;canja do J&ocirc;&quot; foram tocar alguma coisa
tipo Vin&iacute;cius de Morais (ou seja, n&atilde;o expuseram coisa alguma
deles). O espectador t&ecirc;m uma impress&atilde;o que aquilo ali &eacute;
um bate-papo que raras v&ecirc;zes a gente v&ecirc; na vida real. Na verdade
&eacute; um enorme esfor&ccedil;o de equipe, onde o cara tem que suar para
parecer que &eacute; &quot;aut&ecirc;ntico&quot;, &quot;espont&acirc;neo&quot;
e &quot;interessante&quot;. Cada minuto naquele hor&aacute;rio s&atilde;o
milhares de Reais em preparativos. E se voc&ecirc; sonha com aquele carinha
que vai te tornar famoso, falando na TV, de gra&ccedil;a, numa conversa
como se vc fosse uma visita que est&aacute; chegando, esquece. Tudo aquilo
&eacute; &quot;show-business&quot;. S&oacute; com muita assessoria de imprensa
vc chega l&aacute;. O mais prov&aacute;vel &eacute; que usem uma fala sua,
tipo &quot;invadi a Nasa&quot; no meio de duas horas de fala, para ilustrar
alguma ilegalidade.</P>

<P><B>Outros tipos de entrevista</B></P>

<P>Bom, escrevi tudo aquilo acima pensando no Programa do J&ocirc; ou no
da Gabi. H&aacute; programas e programas. Claro, est&aacute; desesperado
para aparecer, vai l&aacute; Faust&atilde;o. Ou no Ratinho. Talvez no Jo&atilde;o
Kl&eacute;ber. No Marcos Mion. Acho que at&eacute; o Clodovil faz entrevista.
Mas cuidado. Me contaram que teve uma menina fez isso para divulgar o livro
dela. Ouviu umas perguntas do tipo: &quot;voc&ecirc; topa transar com mulher&quot;
e sobre o livro, n&atilde;o perguntaram nem deixaram falar nada. Outro
tipo de entrevista &eacute; aquela para &nbsp;&quot;p&oacute;s-gradua&ccedil;&atilde;o&quot;
de algu&eacute;m. Beleza. Estou at&eacute; pensando em xerocar o resultado
de umas entrevistas de colegas meus. Pegaram umas frases fora de contexto
(tinha &quot;hacker&quot; falando de filho) e usaram como pretexto para
defender um texto que sei l&aacute;, n&atilde;o tem muito o que ver e que
a meu ver, n&atilde;o contribui muito para elucidar o que se propunha.
Talvez esteja vendendo por a&iacute;, j&aacute; que &eacute; um livro que
tem &quot;hacker&quot; no t&iacute;tulo. O trabalho do sujeito &eacute;
t&atilde;o incompleto que nem menciona o Barata El&eacute;trica na bibliografia.
Para quem faz p&oacute;s-gradua&ccedil;&atilde;o que nem eu, isso &eacute;
uma heresia. As chances de algu&eacute;m de se divulgar atrav&eacute;s
de trabalhos acad&ecirc;micos &eacute; m&iacute;nima. O verdadeiro tempo
para aparecer como &quot;hacker&quot;, seja do bem ou do mal, esse j&aacute;
se foi. Quem se promove hoje, &eacute; para ver se alavanca a carreira
ou exalta o ego. E se n&atilde;o tomar cuidado, vai sofrer persegui&ccedil;&atilde;o
de v&aacute;rios tipos, por conta do que falou (ou do que resolveram mostrar
dele).</P>

<P>H&aacute; exce&ccedil;&otilde;es: Richard Stallman, que est&aacute;
divulgado o software GNU, (uma alternativa gratuita e dispon&iacute;vel
ao Windows e Microsofts da vida). Esse realmente merece a denomina&ccedil;&atilde;o
de &quot;hacker&quot;, leg&iacute;timo.</P>

</BODY>
</HTML>
