<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>Como viver sem dinheiro sem perder a pose</TITLE>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Author" CONTENT="Derneval R.R. Cunha">
   <META NAME="GENERATOR" CONTENT="Mozilla/3.01Gold (WinNT; I) [Netscape]">
   <META NAME="KeyWords" CONTENT="dinheiro, mendicância, grana, bufunfa, prata, trabalho, emprego, bolsa de estudos, pós-graduação, graduação">
</HEAD>
<BODY TEXT="#FFFF00" BGCOLOR="#400040" LINK="#0000EE" VLINK="#551A8B" ALINK="#FF0000">

<CENTER><P><A HREF="http://www.inf.ufsc.br/barata/index.html">Homepage</A>
<A HREF="http://barataeletrica.blogspot.com">Blog do Fanzine</A> <A HREF="http://www.inf.ufsc.br/barata/barata27.html">&Iacute;ndice
No 27</A> <A HREF="http://www.inf.ufsc.br/barata/ind.htm">&Iacute;ndice
N&uacute;meros Anteriores</A> <A HREF="http://www.inf.ufsc.br/barata/emai.htm">Contato</A>
<BR>
http://barataeletrica.cjb.net http://www.inf.ufsc.br/<BR>
Vers&atilde;o Txt <A HREF="http://www.barataeletrica.rg3.net">http://www.barataeletrica.rg3.net</A>
</P></CENTER>

<CENTER><P><FONT SIZE=+1><B>COMO VIVER SEM DINHEIRO (e sem perder a cabe&ccedil;a)</B>
</FONT></P></CENTER>

<P>Derneval R.R. Cunha </P>

<P>A falta de dinheiro &eacute; a raiz de todos os males (J.R.R. Tolkien)
</P>

<P>H&aacute; poucas coisas na vida das quais voc&ecirc; n&atilde;o pode
ter certeza, mas falta de dinheiro &eacute; algo bastante comum. Pessoalmente,
s&oacute; duas coisas existem realmente, na vida: morte e falta de grana.
Todo o resto &eacute; ilus&atilde;o. Talvez eu esteja&nbsp; &quot;viajando
na maionese&quot;. Mas quem tem d&uacute;vidas pode perguntar para o pessoal
l&aacute; da Argentina, se eles concordam comigo. Pergunta para o pessoal
da Bahia, quando o banco deles foi para o brejo e at&eacute; o (hoje finado)
Jorge Amado estava na passeata para tirar o dele. Talvez concordem. Falta
de dinheiro pode acontecer com qualquer um. Talvez aconte&ccedil;a com
todo mundo, quando o novo presidente assumir (independente de quem seja).
Mesmo se n&atilde;o acontecer com todo mundo, n&atilde;o interessa. Sabe
qual a diferen&ccedil;a entre a Recess&atilde;o e a Depress&atilde;o? Recess&atilde;o
&eacute; quando os outros perdem o emprego. Depress&atilde;o &eacute; quando
voc&ecirc; perde o emprego. E mesmo que n&atilde;o perca. Acredita em mim:
a falta de &quot;grana&quot; (bufunfa, prata, d&oacute;lar) ainda pode
chegar at&eacute; voc&ecirc;. N&atilde;o acredita, ent&atilde;o me manda
algum que a coisa est&aacute; brava, por aqui. </P>

<P><B>A quest&atilde;o monet&aacute;ria</B> </P>

<P>&quot;Dinheiro n&atilde;o &eacute; tudo, mas &eacute; 100%&quot;, j&aacute;
dizia o Falc&atilde;o. Mas o dinheiro &eacute; uma inven&ccedil;&atilde;o
humana. O poder econ&ocirc;mico &eacute; mais importante do que o dinheiro
em si. Qual&eacute; a diferen&ccedil;a entre um e outro? Bom, o dinheiro
n&atilde;o vale nada se voc&ecirc; n&atilde;o pode comprar o que voc&ecirc;
quer. E tamb&eacute;m n&atilde;o significa nada se voc&ecirc; tem tudo
o que quer. Um &iacute;ndio precisa de dinheiro? S&oacute; quando vai lidar
com o homem branco. &Eacute; puro papel. S&atilde;o apenas el&eacute;trons
num computador de um banco, falando que seu saldo est&aacute; positivo
ou negativo. Numa ilha deserta, dinheiro &eacute; s&oacute; papel. Essas
s&atilde;o as necessidades b&aacute;sicas para a sobreviv&ecirc;ncia de
um ser humano: </P>

<P>Ar, &Aacute;gua, Comida, Roupas e Abrigo. </P>

<P>Mas talvez seu maior problema n&atilde;o seja viver numa ilha deserta
que nem o Tom Hanks no filme &quot;N&aacute;ufrago&quot;( Cast Away ).
Talvez seu problema seja n&atilde;o dar um tiro na cabe&ccedil;a, enquanto
a solu&ccedil;&atilde;o n&atilde;o vem. Conhe&ccedil;o gente que acreditava
piamente que &quot;homem que &eacute; homem n&atilde;o chora&quot;. A&iacute;
um dia a bolsa de mestrado atrasou por 2 meses.. podia falar tamb&eacute;m
daqueles dias do famoso&nbsp; &quot;Plano Brasil Novo&quot;, algu&eacute;m
se lembra? Conseguir viver sem dinheiro d&aacute; uma auto-confian&ccedil;a
bastante grande. Rico se suicida. Pobre n&atilde;o. Voc&ecirc; v&ecirc;
o cara l&aacute; na sarjeta, est&aacute; na pior, mas chega o carnaval
ou a vit&oacute;ria do time dele, est&aacute; l&aacute;, rindo. A falta
de dinheiro pode ser fonte de inspira&ccedil;&atilde;o, vide o livro &quot;Anjo
Pornogr&aacute;fico&quot; (Ruy Castro) &eacute; que mostra bem esse lado
da vida. </P>

<P>&nbsp;O que voc&ecirc; realmente precisa para viver, nos dias de hoje:
</P>

<UL>
<LI>amigos</LI>

<LI>ocupa&ccedil;&atilde;o</LI>

<LI>vestu&aacute;rio</LI>

<LI>alimenta&ccedil;&atilde;o</LI>

<LI>divers&atilde;o</LI>

<LI>transporte</LI>
</UL>

<P><B>Amigos e parentes</B> </P>

<P>Se existe um benef&iacute;cio em ficar sem dinheiro, &eacute; descobrir
o quanto voc&ecirc; vale como ser humano. Porqu&ecirc; a&iacute; voc&ecirc;
descobre algo melhor do que dinheiro: ter algu&eacute;m ao seu lado. E
&eacute; nessa hora que se descobre tanto se os amigos e parentes que tem
s&atilde;o solid&aacute;rios ou n&atilde;o.&nbsp; Se voc&ecirc; tem companhia,
pode ter tudo. Apenas tem que se lembrar que agora a situa&ccedil;&atilde;o
&eacute; outra. N&atilde;o pode nem se &quot;enconstar&quot; nos amigos
nem pode ficar cobrando deles uma ajuda. Uma vez li um artigo (copiado
de alguma publica&ccedil;&atilde;o americana) onde se comentava a vida
de ex-socialites. Tipo o antes e o depois de uma socialite. J&aacute; parou
para pensar como vive uma ex-high-society?&nbsp; Falo daquelas que n&atilde;o
engravidaram antes de largar o cara. Pois &eacute;. Uma delas inventou
o m&eacute;todo de continuar vivendo o mesmo estilo de vida de antes, mas
morando uma noite em cada lugar. Tipo: &quot;xi, o hor&aacute;rio do &ocirc;nibus
j&aacute; foi, posso passar a noite aqui&quot;. Isso depende muito da capacidade
de cada um de ficar pulando de galho em galho. Durante o tempo de estudante,
vi muito isso. Ali&aacute;s, quando morei no exterior, tamb&eacute;m passei
por algo parecido (cada noite num lugar), mas foi em Paris. &Eacute; preciso
muita, mas muita disciplina e simancol para se antecipar aos problemas
que fatalmente acontecem, como&nbsp; cobran&ccedil;as das mais variadas.
Detalhe: as cobran&ccedil;as e picuinhas sempre existem. Quando voc&ecirc;
est&aacute; sem grana &eacute; que fica mais sens&iacute;vel a elas. <BR>
&nbsp; <BR>
&nbsp; </P>

<P><B>Ocupa&ccedil;&atilde;o</B> </P>

<P>N&atilde;o se pode ficar simplesmente parado. Isso &eacute; o mais b&aacute;sico.
Lutar pela sobreviv&ecirc;ncia &eacute; sempre algo que exige disciplina.
E muita.&nbsp; &Eacute; preciso organizar a vida, mesmo se n&atilde;o h&aacute;
nada o que fazer com ela. N&atilde;o se pode simplesmente ficar esperando
sentado dentro do banco at&eacute; o dinheiro chegar na conta. O des&acirc;nimo
toma conta rapidinho. E a&iacute;, meu caro, voc&ecirc; est&aacute; perdido.
Vai precisar de algu&eacute;m para te empurrar para fazer as coisas. E
para baixo, todo santo ajuda. Algum tipo de ocupa&ccedil;&atilde;o sempre
ajuda a manter o contato com a realidade. E quando se est&aacute; sem dinheiro,
&eacute; fundamental ver al&eacute;m do que est&aacute; a sua frente para
poder alterar essa realidade. Uma vez fiquei ilhado num aeroporto, por
quase 3 dias, antes de poder voltar para o Brasil. Escrevia todos os meus
passos, um verdadeiro livro sobre como foi minha estadia na europa. Deu
v&aacute;rias p&aacute;ginas de papel. De tempos em tempos ia fazendo outras
coisas, conversando com gente. Foram 3 dias produtivos. O texto acabou
se perdendo por conta do zelo do pessoal do aeroporto, que jogou fora pensando
que fosse lixo, mas cumpriu com a sua finalidade. </P>

<P><B>Vestu&aacute;rio</B> </P>

<P>Roupa nova torna-se um luxo. O interessante &eacute; manter um conjunto
de roupas com apar&ecirc;ncia de novas para quando for necess&aacute;rio.
Sempre existe necessidade. Pode ser uma entrevista de emprego, uma festa
(comes e bebes &agrave; vontade) ou mesmo para freq&uuml;entar um ambiente
onde o dinheiro n&atilde;o &eacute; necess&aacute;rio, como a casa da namorada.
A pior parte da vida sem dinheiro &eacute; ficar se comparando &agrave;
outras pessoas que podem, por exemplo, comprar roupa nova. O problema n&atilde;o
&eacute; a aus&ecirc;ncia de roupa nova, &eacute; ficar se comparando &agrave;s
outras pessoas. &Eacute; dif&iacute;cil enxergar isso. Claro que com o
passar do tempo, a pr&oacute;pria preocupa&ccedil;&atilde;o da pessoa com
a roupa passa para as pessoas ao lado e elas come&ccedil;am a cobrar uma
atitude quanto ao vestu&aacute;rio. Sei l&aacute; como sair disso, o fundamental
&eacute; manter a roupa limpa e passada. &Eacute; a&iacute; que entra a
necessidade de se manter ocupado. Quando se est&aacute; desocupado totalmente,
gasta-se tempo (&agrave; toa) se preocupando com uma besteira dessas. A
preocupa&ccedil;&atilde;o deveria ser dirigida para formas de se manter
a roupa limpa ou sei l&aacute;, alguma alternativa obscura. </P>

<P><B>Divers&atilde;o</B> </P>

<P>Para n&atilde;o perder a cabe&ccedil;a, &eacute; preciso alguma forma
de distra&ccedil;&atilde;o. Em cidade grande, sempre existem formas alternativas
de se manter a cabe&ccedil;a alegre, sem grandes gastos financeiros. O
problema pode ser o quesito transporte, mas sempre existe. Nessas horas
&eacute; que se percebe como a sociedade de consumo te aleija de oportunidades
simples de curtir a vida. Quando o Collor assumiu o governo, assisti quase
todos os filmes de um ciclo de cinema japon&ecirc;s do p&oacute;s-guerra,
que por acaso estava passando gratuitamente num cinema perto de casa. Tudo
bem que foram filmes que detestei, mas era um tipo de divers&atilde;o.
A divers&atilde;o n&atilde;o &eacute; s&oacute; gastar e consumir, mas
tamb&eacute;m usar a cabe&ccedil;a para produzir divers&atilde;o. Se a
sua cabe&ccedil;a n&atilde;o est&aacute; legal, n&atilde;o existe divers&atilde;o.
Pergunte para qualquer noivo no dia do casamento se ele est&aacute; achando
gra&ccedil;a na cerim&ocirc;nia. Talvez o grande problema seja se divertir
com os amigos. Vai ser um pouco mais dif&iacute;cil. Precisa um pouco de
pr&aacute;tica, j&aacute; que a sociedade de consumo faz do consumo um
elo de liga&ccedil;&atilde;o. Aproveite isso como introspec&ccedil;&atilde;o.
Muitas v&ecirc;zes, o gasto de dinheiro &eacute; apenas uma forma de evitar
o t&eacute;dio. &Eacute; preciso ent&atilde;o espantar o t&eacute;dio de
outra forma.&nbsp; No in&iacute;cio, &eacute; dif&iacute;cil &quot;planejar&quot;
a alegria. A grande dica &eacute; ser a &quot;alma da festa&quot;. Ser
aquele cara que conta os &quot;causos&quot; e piadas.&nbsp; A necessidade
faz o sapo pular. </P>

<P><B>Alimenta&ccedil;&atilde;o</B> </P>

<P>Com certeza ser&aacute; necess&aacute;rio alterar os h&aacute;bitos
alimentares. Maxim's, Ritz, MacDonalds&nbsp; por exemplo, tudo isto est&aacute;
fora. Que mais? &Eacute; preciso planejar para que entre um card&aacute;pio
mais ou menos equilibrado na sua nova dieta. Porqu&ecirc; a comida influencia
a cabe&ccedil;a. Se voc&ecirc; come mal, pensa mal e acaba fazendo besteiras
as mais variadas (lembra do que falei sobre disciplina). Recomendo investir
em frutas e vegetais, na feira. &Eacute; mais barato e sustenta bem. Chato
&eacute; que tem pouca prote&iacute;na e digere bem r&aacute;pido, a&iacute;&nbsp;
voc&ecirc; pode sentir fome de novo. O jeito de combater isso &eacute;
ter hor&aacute;rios espec&iacute;ficos de comida e s&oacute; comer naquele
hor&aacute;rio. Os m&eacute;dicos recomendam, assim como recomendam vitamina
C todo santo dia. Umas p&iacute;lulas de 500 ml (mais do que isso o organismo
n&atilde;o absorve) bastam. Ou outro complemento vitam&iacute;nico. Mas
fique longe do &aacute;lcool enquanto isso. Uma porqu&ecirc; vicia e duas
porqu&ecirc; a ressaca fica bem pior. </P>

<P><B>Transporte</B> </P>

<P>Esse &eacute; outro problema. Viajar &eacute; quase imposs&iacute;vel.
A n&atilde;o ser que voc&ecirc; seja um tipo aventureiro e saiba viajar
de carona. Gra&ccedil;as &agrave; internet, h&aacute; v&aacute;rias formas
de se combinar viagens desse tipo. Mesmo sem a internet, &eacute; poss&iacute;vel
se conseguir, basta esticar o ded&atilde;o na sa&iacute;da de alguma cidade
e manda ver. S&oacute; que o motorista vai querer bater papo e a&iacute;
&eacute; s&oacute; jogar aquela hist&oacute;ria de que sua av&oacute; est&aacute;
inconsol&aacute;vel com o jet-ski dela parado por falta de uma pe&ccedil;a
(como bom netinho, voc&ecirc; vai de carona para economizar). Dentro da
cidade, a&iacute; j&aacute; &eacute; outro problema. H&aacute; trocentas
formas de se usar um &ocirc;nibus ou metr&ocirc; sem pagar a passagem.
Mas um amigo meu, (vagamente parecido com o J&ocirc; Soares, depois de
anos de cerveja), se acostumou a ir a p&eacute; para tudo quanto &eacute;
lado. Eu aconselho j&aacute; que isso economiza no quesito exerc&iacute;cio.
Ajuda a manter a cabe&ccedil;a no lugar. </P>

<CENTER><P><B>Religi&atilde;o versus Ideologia versus Classe Social</B>
</P></CENTER>

<P>&Eacute; muito f&aacute;cil ser humilde quando n&atilde;o se tem imagina&ccedil;&atilde;o.
E muito dif&iacute;cil ser arrogante quando n&atilde;o se tem grana. Nunca
entendi muito bem como &eacute; que um pa&iacute;s como o nosso pode eleger
gente como o Collor (e isso foi antes da urna eletr&ocirc;nica). Mas tamb&eacute;m
n&atilde;o entendo como &eacute; que elegeram o Menem tantas v&ecirc;zes
na Argentina, muito menos como o Maluf ainda concorre at&eacute; hoje.
Em alguns casos, torna-se necess&aacute;rio repensar a op&ccedil;&atilde;o
pol&iacute;tica. Porqu&ecirc; se voc&ecirc; n&atilde;o tem dinheiro, provavelmente
vai ter algo em comum com muitos caras que est&atilde;o na pior que nem
voc&ecirc;. Voc&ecirc; est&aacute; na classe dos &quot;exclu&iacute;dos&quot;.
</P>

<P>Outra coisa &eacute; a quest&atilde;o religiosa. A cren&ccedil;a em
Deus aumenta proporcionalmente ao vazio do bolso. &Eacute; nessas horas
que aparecem os &quot;bate-papos evang&eacute;licos&quot;, os &quot;disc&iacute;pulos
do caos&quot;, todo um bando de gente querendo ajudar. E &eacute; bom estar
preparado para aceitar ou recusar essa ajuda. Um (ex) amigo me contou que
topou uma festinha &quot;b&iacute;blica&quot; s&oacute; por conta do rod&iacute;zio
de pizzas que acompanhava. Foram horas e horas de enche&ccedil;&atilde;o
de saco (leitura de passagens da b&iacute;blia e discurso evang&eacute;lico)
at&eacute; vir a comida. Depois teve um &quot;teatrinho&quot; onde cada
participante tinha que fazer de conta que era um bicho, tipo &quot;eu sou
uma borboleta&quot; (a&iacute; ficava com os bra&ccedil;os esticados abrindo
e fechando, subindo e descendo pela sala). Depois.. vinha a proposta de
&quot;inicia&ccedil;&atilde;o b&iacute;blica&quot;. Era escolhida uma pessoa
do grupo que seria o respons&aacute;vel pelo seu &quot;estudo b&iacute;blico&quot;.
Era um grupo que n&atilde;o tinha nenhum preconceito, aceitava todos os
tipos de cheques pr&eacute;-datados para parcelar a inicia&ccedil;&atilde;o.
</P>

<CENTER><P><B>Cr&eacute;dito</B> </P></CENTER>

<P>Todo mundo precisa acreditar em alguma coisa. Gente que empresta precisa
ter muita f&eacute; em Deus e &eacute; preciso que voc&ecirc; estimule
a f&eacute; daquele que vai te emprestar, pois ele &eacute; sagrado. E
aconselho a n&atilde;o dar calote. Pague religiosamente o que deve. &Eacute;
mais f&aacute;cil voltar a pedir emprestado depois. &Eacute; bastante importante
lembrar que os amigos que v&atilde;o saber das min&uacute;cias dos seus
problemas n&atilde;o devem ter qualquer forma de contato com aqueles que
v&atilde;o te emprestar dinheiro. Ah, sim, uma hist&oacute;ria triste vai
longe, dependendo de onde voc&ecirc; e com quem convive. Da&iacute; o que
falei sobre disciplina, manter a cabe&ccedil;a no lugar e uma ocupa&ccedil;&atilde;o.
Socialmente falando, voc&ecirc; pode ficar doente, mas insolvente, nunca.
Deus do C&eacute;u, fico at&eacute; envergonhado de contar tudo isso. Mas
qualquer pessoa, seja rico, seja pobre, sabe bem do que estou falando.
Podem at&eacute; mentir e dizer que n&atilde;o. Faz parte do jogo. Mas
no que se refere ao cr&eacute;dito, somos todos iguais. </P>

<CENTER><P><B>Drogas</B> </P></CENTER>

<P>Isso est&aacute; virando um livro, j&aacute;. Mas como falei acima,
fique longe da bebida (apesar que Malzbier, Carac&uacute; ou Xing&uacute;
+ um salgadinho &eacute; &oacute;timo para aplacar a fome, em emerg&ecirc;ncias).&nbsp;
J&aacute; vi tamb&eacute;m gente &quot;viciada&quot; em aspirina. Outros
ficam assistindo sess&atilde;o da tarde (n&atilde;o entendo como liberam
a sess&atilde;o da tarde e proibem a maconha, sinceramente). Ficar assistindo
televis&atilde;o direto &eacute; a pior coisa que um ser humano pode fazer,
quando em situa&ccedil;&atilde;o desesperada. Se drogando idem. Fumar cigarro
ent&atilde;o nem pensar. Se a falta de dinheiro &eacute; um supl&iacute;cio,
&eacute; preciso tentar encarar de cara limpa, sem aliena&ccedil;&atilde;o
(pelo menos sem aliena&ccedil;&atilde;o todo dia). Claro que falar &eacute;
muito mais f&aacute;cil do que fazer. </P>

<CENTER><P><B>Mantendo o moral alto</B> </P></CENTER>

<P>Seria muito f&aacute;cil falar que isso &eacute; o essencial. &Eacute;
o mais dif&iacute;cil de tudo. Veja bem: ningu&eacute;m ag&uuml;enta gente
hist&eacute;rica. Nem p&atilde;o-dura. Se voc&ecirc; &eacute; convidado
para uma festa, resista &agrave; tenta&ccedil;&atilde;o de levar alguma
coisa para comer depois ou mesmo cair de boca na comida. O pr&ecirc;mio
de resistir a tenta&ccedil;&atilde;o &eacute; ser convidado para outras
festas. Outra coisa &eacute; contar at&eacute; 100 antes de conversar assuntos
delicados. Existem v&aacute;rios truques para se manter a calma, mas nem
vou ensinar. Ou se aprende sozinho ou n&atilde;o se aprende. S&oacute;
se sobrevive&nbsp; a uma crise mantendo a calma. Lembre-se sempre a m&aacute;xima
de Nietsche: o que n&atilde;o te mata, te torna mais forte. </P>

<P><B>Est&oacute;rias e Fontes de inspira&ccedil;&atilde;o</B> </P>

<P>Uma &oacute;tima forma de se entender melhor a grande mudan&ccedil;a
que &eacute; ficar sem recursos &eacute; recorrer aos livros e bibliotecas.
&Eacute; outro tipo de aliena&ccedil;&atilde;o, mas l&aacute; pelo menos
pode-se conhecer gente e se manter longe de problemas. Algumas entrevistas
s&atilde;o &oacute;timas. Tinha uma autor, acho que pr&ecirc;mio Nobel
de literatura que era &quot;morador de rua&quot;.&nbsp; Ficava noites inteiras
no metr&ocirc; de Londres, durante o inverno, at&eacute; fechar. Ficou
desse jeito, at&eacute; conseguir uma editora, v&aacute;rios meses. E depois
mais alguns meses, at&eacute; o livro come&ccedil;ar a vender. E ele poder
receber o suficiente em dinheiro para poder finalmente sair dessa rotina.
Qualquer dia descubro onde li isso. Outra hist&oacute;ria que li numa revista
de motociclismo foi de um mec&acirc;nico de competi&ccedil;&otilde;es tipo
&quot;Paris-Dakar&quot; que fez a faculdade toda morando na rua. Isso &eacute;
apenas um trecho da entrevista, ele n&atilde;o aprofunda muito isso. Mas
tamb&eacute;m perdi a refer&ecirc;ncia. John Paul-Getty (acho que foi ele)
contava que no in&iacute;cio ele precisava vender o almo&ccedil;o para
comprar o jantar (at&eacute; ganhar uma heran&ccedil;a e ficar rico).&nbsp;
Mickey Rourke &eacute; que tinha uma biografia fant&aacute;stica no que
diz respeito &agrave; falta de dinheiro, at&eacute; ficar famoso. A hoje
famosa Madonna j&aacute; fez fotos nuas para faturar algum. </P>

<P>Outra entrevista que poderia inspirar muita gente passou no J&ocirc;Soares,
no tempo do SBT. Era um cara que ficou famoso nos EUA, n&atilde;o lembro
qual o barato que ele fez que justificava a entrevista, parece-me que era
algo a ver com participar do filme &quot;2001 - uma odiss&eacute;ia no
espa&ccedil;o&quot; (ainda estou procurando o nome dele nos cr&eacute;ditos).
Mas enfim, o que interessa &eacute; que ele &quot;venceu&quot; em Hollywood.
A&iacute; contava ele que no in&iacute;cio ele sabia muito pouco ingl&ecirc;s
e foi aprendendo aos poucos. No in&iacute;cio era s&oacute; &quot;hot-dog&quot;.
Depois &quot;bread&quot;. Depois de um tempo ele aprendeu a falar &quot;butter&quot;.
E com o passar do tempo foi aumentando o vocabul&aacute;rio. Claro que
nessa altura da conversa ficava claro que o que ele estava contando N&Atilde;O
era uma piada.&nbsp; A&iacute; o J&ocirc; perguntou, para mudar um pouco
o assunto: &quot;com todas essas dificuldades, qual que voc&ecirc; acha
mais dif&iacute;cil, fazer sucesso aqui no Brasil ou l&aacute; nos EUA&quot;.
A&iacute;&nbsp; a cara dele mudou totalmente, ficou alegre: &quot;J&ocirc;,
fazer sucesso l&aacute; &eacute; muito mais f&aacute;cil, nem tem compara&ccedil;&atilde;o&quot;.
Dram&aacute;tico, dram&aacute;tico. </P>

<P>Legal mesmo s&atilde;o os filmes. Alguns s&atilde;o altamente recomend&aacute;veis,
como &quot;O pescador de ilus&otilde;es&quot;. Literatura sobre o assunto
tem muita. Os primeiros t&iacute;tulos que v&ecirc;m &agrave; cabe&ccedil;a
s&atilde;o &quot;Um dia na vida de Ivan Denisovitch&quot; (Soljenitsyn)
e &quot;Crime e Castigo&quot; (Dostoi&eacute;visky). George Orwell escreveu
&quot;Na pior em Paris e Londres&quot;, mas esse eu sei de cor, nem precisei
ler (estive l&aacute;).&nbsp; &quot;On the Road - P&eacute; na estrada&quot;
do Jack Kerouack &eacute; muito bom, tamb&eacute;m. Recomendaria meu pr&oacute;prio
livro, &quot;O CRUSP visto por um mineiro&quot;, dispon&iacute;vel gratuito
em PDF e em html&nbsp; na internet, na p&aacute;gina (n&atilde;o oficial)
do CRUSP no <A HREF="http://www.crusp.virtualave.net">http://www.crusp.virtualave.net</A>
.&nbsp; Quem quiser dar algumas id&eacute;ias, pode mandar para o meu email
derneval(arroba)softhome.net com subject &quot;vivendo sem grana&quot;.
</P>

<P><B>O extremo do extremo </B></P>

<P>Bom, h&aacute; o limite do limite. Quando a aus&ecirc;ncia de dinheiro
se torna cr&ocirc;nica, &eacute; prov&aacute;vel que, por mais que haja
amigos, parentes, alternativas, pinte um quadro que torna a conviv&ecirc;ncia
meio chata. Fica mais chata ainda quando se descobre que n&atilde;o tem
vaga no Juqueri nem no Pinel. Os primeiros sintomas s&atilde;o os mesmos
exibidos pelo Michael Douglas no filme &quot;Dia de F&uacute;ria&quot;.
&Eacute; um filme para se rever. &Eacute; o per&iacute;odo ideal para sair
com US$500.000,00 no bolso. Ningu&eacute;m te assalta para voc&ecirc; poder
matar em leg&iacute;tima defesa. Parece brincadeira, mas a coisa pode ir
num crescendo at&eacute; atingir o ponto em que atitudes desesperadas s&atilde;o
consideradas, tipo aquele empres&aacute;rio que fez um seguro de vida e
conseguiu que algu&eacute;m cortasse fora a m&atilde;o dele, alegando d&iacute;vida
com a M&aacute;fia ou coisa do g&ecirc;nero. &Eacute;, algu&eacute;m fez
isso. E tamb&eacute;m foi manchete no mundo todo. Dias depois descobriu-se
que o cara realmente tinha conseguido que algu&eacute;m cortasse a m&atilde;o
dele s&oacute; para simular um atentado. Vers&atilde;o de rico do que acontece
nas f&aacute;bricas. O sujeito est&aacute; ruim de grana, &quot;apronta&quot;
para perder o dedo dele num &quot;acidente&quot;. A&iacute; embolsa o seguro
e alivia a situa&ccedil;&atilde;o. Quem me contou essa hist&oacute;ria
jura que &eacute; bastante comum.</P>

<P>A coisa fica preocupante quando as pessoas come&ccedil;am a n&atilde;o
te ouvir. &Eacute; impressionante, mas nessa situa&ccedil;&atilde;o, a
pessoa perde a no&ccedil;&atilde;o de di&aacute;logo. E algumas pessoas
farejam a fraqueza e usam isso como arma. &Eacute; muito legal, porqu&ecirc;
a pessoa que conversa contigo percebe a dificuldade de auto-controle e
joga isso na cara da pessoa, praticamente estimulando um &quot;ataque&quot;
ou &quot;surto&quot;. Quando acontece no meio do emprego, o passo seguinte
&eacute; jogar isso na cara do sujeito toda vez que o cara for pedir aumento
de sal&aacute;rio ou recusar uma tarefa dif&iacute;cil. Da&iacute; a necessidade
de cabe&ccedil;a fria e ficar escutando m&uacute;sica cl&aacute;ssica direto.
Ajuda um pouco. Mas &eacute; bom saber que voc&ecirc; inconscientemente
estar&aacute; buscando um saco de pancadas. O&nbsp;desagrad&aacute;vel
&eacute; que se acontecer de encontrar, vai se arrepender. Provavelmente
ser&aacute; algu&eacute;m inocente e que n&atilde;o merece. N&atilde;o
&eacute; que as coisas v&atilde;o parar de dar certo. &Eacute; que o normal
(nessas circunst&atilde;ncias) &eacute; agir por impulso, sem pensar. Qualquer
coisa que voc&ecirc; fizer e der errado, v&atilde;o contabilizar. Voc&ecirc;
mesmo vai contabiliza e ficar se culpando, como se pular no abismo n&atilde;o
fosse suficiente para compensar o(s) erro(s).</P>

<P>Se algo n&atilde;o for feito para reverter esse quadro negativo, a pessoa
para de pensar no futuro ou de achar que amanh&atilde; o sol vai nascer.
Minha teoria &eacute; que em alguns casos, fica cega para ver a kombi,
quando atravessar a rua. Nesses dias o melhor &eacute; ficar em casa. </P>

<P><B>T&eacute;cnicas e truques de sobreviv&ecirc;ncia. </B></P>

<P>Essa &eacute; a parte mais interessante, mas vai ficar para outra ocasi&atilde;o.
<BR>
&nbsp; </P>

<P><A HREF="http://www.shares.net/moneywisdom.htm">http://www.shares.net/moneywisdom.htm</A>
</P>

</BODY>
</HTML>
