<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE></TITLE>
   <META NAME="Author" CONTENT="">
   <META NAME="GENERATOR" CONTENT="Mozilla/3.01Gold (WinNT; I) [Netscape]">
</HEAD>
<BODY TEXT="#FFFF80" BGCOLOR="#400040" LINK="#0000EE" VLINK="#551A8B" ALINK="#FF0000">

<CENTER><P><A HREF="http://www.inf.ufsc.br/barata/index.html">Homepage</A>
<A HREF="http://barataeletrica.blogspot.com">Blog do Fanzine</A> <A HREF="http://www.inf.ufsc.br/barata/barata27.html">&Iacute;ndice
No 27</A> <A HREF="http://www.inf.ufsc.br/barata/ind.htm">&Iacute;ndice
N&uacute;meros Anteriores</A> <A HREF="http://www.inf.ufsc.br/barata/emai.htm">Contato</A>
<BR>
http://barataeletrica.cjb.net http://www.inf.ufsc.br/<BR>
Vers&atilde;o Txt <A HREF="http://www.barataeletrica.rg3.net">http://www.barataeletrica.rg3.net</A>
</P></CENTER>

<CENTER><P><B><FONT SIZE=+1>Como iniciar um Mestrado:</FONT></B></P></CENTER>

<P>Derneval R.R. Cunha</P>

<P><B>A vida ap&oacute;s o diploma:</B></P>

<P>As pessoas que n&atilde;o entenderam a minha demora em trazer um novo
n&uacute;mero deste fanzine talvez n&atilde;o saibam o que &eacute; p&oacute;s-gradua&ccedil;&atilde;o.
&Eacute; aquela coisa: a vida inteira voc&ecirc; vai na escola e tenta
ser um aluno aplicado (ou n&atilde;o). Passa um suor danado e consegue
(ou n&atilde;o passar no Vestibular). Entra na faculdade querendo ser o
melhor aluno da classe, aquele que vai passar em tudo, tirar dez, fazer
o curso no prazo m&iacute;nimo. Chega no 2o ano, come&ccedil;a a descobrir
que o barzinho da faculdade &eacute; muito bom. No terceiro ano acha que
vai formar em cinco anos. No 4o ano j&aacute; come&ccedil;a a encher o
saco. No 5o ano est&aacute; xingando todos os professores. Se n&atilde;o
desisitiu e conseguiu se formar, ufa! Dependendo do caso, recebe um telefonema,
pedindo que traga umas xeroxs de documentos. Chegou l&aacute;, pedem para
assinar aqui e ali. Pronto: Adeus! N&atilde;o tem ningu&eacute;m tirando
foto nem cumprimentando. Acabou mais um per&iacute;odo da sua vida. Legal.</P>

<P>Come&ccedil;a-se ent&atilde;o o problema: procurar emprego. Mas mesmo
encontrando trabalho (n&atilde;o confundir com emprego, que tem carteira
assinada e s&oacute; os outros &eacute; que tem), como fazer com aquele
h&aacute;bito de ir &agrave; aula. Para alguns &eacute; super-f&aacute;cil.
Basta casar e ter filhos para tirar da cabe&ccedil;a qualquer id&eacute;ia
de voltar a estudar. Para quem mora em cidade grande, como S&atilde;o Paulo,
se formar significa perder um monte de amigos. Aquele pessoal que encontrava
todo dia na sala de aula, agora s&oacute; quando tem tempo (e ningu&eacute;m
tem tempo depois que come&ccedil;a a trabalhar). &Eacute; um tal de encontrar
novos amigos e torcer para que eles queiram aparecer na sua casa. Gra&ccedil;as
a internet, isso n&atilde;o &eacute; mais necess&aacute;rio. Para as mulheres
deve ficar mais interessante: agora tem que ir a luta atr&aacute;s de algu&eacute;m,
nos bares da vida, conhecer estranhos completos e decidir em minutos se
volta para casa para assistir novela ou se achou o &nbsp;&quot;homem ideal&quot;.
</P>

<P>A parte mais chata &eacute; que a vida j&aacute; n&atilde;o tem o mesmo
objetivo. A curiosidade de aprender &eacute; v&iacute;cio. Depois v&ecirc;m
a constata&ccedil;&atilde;o: todo mundo tem diploma. O&nbsp;mercado de
trabalho valoriza uma p&oacute;s-gradua&ccedil;&atilde;o. Ter diploma &eacute;
o mesmo que ter 2o grau completo. Os melhores empregos pedem algo mais.
O &uacute;nico jeito &eacute; voltar para a Faculdade... Como fazer?</P>

<P><B>Pr&oacute;s e Contras:</B></P>

<P>Retomar os estudos tem algumas vantagens em rela&ccedil;&atilde;o &agrave;
gradua&ccedil;&atilde;o:</P>

<UL>
<LI>A pessoa j&aacute; sabe o que quer da vida</LI>

<LI>Pode conseguir Bolsa de Estudos</LI>

<LI>&Eacute; algo s&eacute;rio, n&atilde;o &eacute; o mesmo que aguentar
a vida de graduando</LI>
</UL>

<P>H&aacute; desvantagens, como:</P>

<UL>
<LI>N&atilde;o pode reprovar na mat&eacute;ria nem repetir (pega mal para
o curr&iacute;culo e impede concess&atilde;o de bolsas)</LI>

<LI>Os professores levam a s&eacute;rio aquilo que voc&ecirc; escreve.</LI>

<LI>N&atilde;o existe possibilidade de se levar com a barriga (quem faz
isso dificilmente chega at&eacute; o final)</LI>

<LI>N&atilde;o se pode fazer P&oacute;s sem ter gradua&ccedil;&atilde;o
antes, apesar que uma p&oacute;s n&atilde;o impede que (o masoquista) fa&ccedil;a
outra gradua&ccedil;&atilde;o(1).</LI>
</UL>

<P>Existe o Mestrado e o Doutorado. V&aacute;rios professores com quem
conversei me deram o toque que o Mestrado &eacute; apenas uma esp&eacute;cie
de &quot;treinamento&quot; para a fase mais importante, o Doutorado. O&nbsp;Mestrado,
que d&aacute; ao indiv&iacute;duo o t&iacute;tulo de Mestre, permite, entre
outras coisas, dar aulas para o 3o grau. O que n&atilde;o &eacute; pouco,
se considerarmos o desemprego no Pa&iacute;s e a quantidade de aulas de
gradua&ccedil;&atilde;o que s&atilde;o dadas por gente sem t&iacute;tula&ccedil;&atilde;o.
</P>

<P><B>Primeiros Passos:</B></P>

<P>Decidir com o que tema se quer trabalhar. Em outras palavras, qual o
seu projeto de estudo. Deveria definir isso antes, mas fica pra depois.
Se voc&ecirc; n&atilde;o se arrependeu da gradua&ccedil;&atilde;o que fez,
essa &eacute; a hora de procurar seus antigos professores (caso voc&ecirc;
j&aacute; n&atilde;o tenha feito antes de se formar) e ver se algum daqueles
que voc&ecirc; mais gosta tem interesse em ter voc&ecirc; como <I>&quot;orientando&quot;</I>.
Por que o orientador &eacute; t&atilde;o importante? H&aacute; uma f&aacute;bula
que n&atilde;o vou repetir agora, mas que explica tudo, veja no final do
texto. H&aacute; v&aacute;rios tipos de <I>&quot;orienta&ccedil;&atilde;o&quot;,</I>
como ir&aacute; descobrir:</P>

<UL>
<LI>Os que acham voc&ecirc; inteligente mas n&atilde;o tem vagas</LI>

<LI>Os que acham voc&ecirc; inteligente mas n&atilde;o entendem o seu projeto
de mestrado</LI>

<LI>Os que acham voc&ecirc; inteligente, seu projeto est&aacute; bom, mas
n&atilde;o tem tempo de orientar ningu&eacute;m, se vira</LI>

<LI>Os que acham voc&ecirc; inteligente, mas gostariam de orientar somente
pessoas que fossem dentro de seu universo de pesquisa (Um professor de
alem&atilde;o n&atilde;o pode orientador ningu&eacute;m com foco em oceanografia,
por exemplo)</LI>

<LI>Etc, etc..</LI>
</UL>

<P>O orientador pode lhe ajudar a entender toda a problem&aacute;tica da
P&oacute;s. Um bom orientador abre os horizontes do orientando e permite
queimar etapas. Se houver vontade de fazer a P&oacute;s j&aacute; durante
a gradua&ccedil;&atilde;o, a dica &eacute; fazer as chamadas &nbsp;&nbsp;&quot;Inicia&ccedil;&otilde;es
Cient&iacute;ficas&quot;, que s&atilde;o pesquisas com bolsa, orientadas
por professores, nem todas as faculdades tem isso, algumas nem sabem que
isso existe. O&nbsp;aluno auxilia o professor a fazer alguma coisa, tipo
&quot;catalogar suspiros de borboletas&quot; e recebe uma ajuda financeira.
&Eacute; o tipo de atividade que ajuda a ganhar pontos para uma futura
carreira acad:&ecirc;mica. </P>

<P>Muito importante &eacute; saber colocar o projeto em palavras. Se a
carreira que escolheu n&atilde;o tem trabalho de conclus&atilde;o de curso
ou equivalente, &eacute; importante encontrar algum curso que ensine metodologia.
Isso ensina como deve ser escrito um projeto nos seus m&iacute;nomos detalhes.
N&atilde;o &eacute; a mesma coisa que fazer reda&ccedil;&atilde;o de vestibular.
&Eacute; preciso definir o objeto de estudo, como se ir&aacute; pesquisar,
quais ser&atilde;o as ferramentas, a hip&oacute;tese, etc, etc.. Se come&ccedil;o
a escrever sobre isso, me desvio do assunto principal. Quanto a import&acirc;ncia
de definir seus objetivos em papel, basta dizer que n&atilde;o te d&atilde;o
bolsa se isso n&atilde;o estiver muito, mas muito bem definido. A melhor
maneira de se informar, depois de fazer cursos de metodologia e ler livros,
&eacute; ter orienta&ccedil;&atilde;o de quem j&aacute; passou pelo sufoco.
A leitura do livro do Humberto Eco &nbsp;&nbsp;<I>&quot;Como fazer uma
Tese&quot;</I> para mim foi muito boa, mas &eacute; preciso reler com calma
e mesmo assim, h&aacute; coisas que s&oacute; fazem sentido bem depois.</P>

<P><B>Tema da disserta&ccedil;&atilde;o:</B></P>

<P>Devagar se vai longe. Esse &eacute; talvez o mais importante (&eacute;
preciso ser muito bom de estudo para se pesquisar um tema que se deteste).
&Eacute; preciso escolher o que vai se estudar, e em qual setor se encaixa
sua pesquisa. Vamos ver um tema aleat&oacute;rio para demonstrar o problema.
Pode-se pesquisar sobre <I>&quot;Borboletas Azuis da Patag&ocirc;nia&quot;</I>.
Mas onde, em que faculdade estudar isso? Na literatura? No meio ambiente?
Ou como as tais borboletas influem na avia&ccedil;&atilde;o comercial?
N&atilde;o se pode simplemente escolher um tema e escrever tudo sobre ele.
A&iacute; cai-se no que os orientadores chamam de fazer uma tese sobre
&nbsp;<I>&quot;Deus e seu tempo&quot;</I>. Nunca fica pronta. .</P>

<P>N&atilde;o. O objetivo &eacute; escrever algo do tipo, sei l&aacute;:
&nbsp;<I>&quot;A influ&ecirc;ncia do peyotl no incremento da capacidade
reprodutiva de Borboletas Azuis da Patag&ocirc;nia&quot;</I>. Claro que
isso especifica (a palavra adequada &eacute; delimita) o que se vai fazer
com o objeto de estudo. Quanto mais delitmitado o objeto de estudo, mais
f&aacute;cil fica do orientador acreditar que voc&ecirc; ser&aacute; capaz
de levar isso adiante. Mas tamb&eacute;m n&atilde;o basta somente escrever
o t&iacute;tulo nem apenas definir e detalhar os procedimentos que ir&atilde;o
lhe dar os resultados da pesquisa. Seria muito bom que tudo fosse assim
t&atilde;o f&aacute;cil. &Eacute; necess&aacute;rio tamb&eacute;m que a
pesquisa seja algo novo. Que adianta fazer algo que todo mundo j&aacute;
conhece? &Eacute; preciso alterar nem que seja a metodologia usada. E outro
detalhe importante. O&nbsp;orientador precisa estar capacitado a orient&aacute;-lo
nesse tema. N&atilde;o se pede a algu&eacute;m de Letras para orientar
uma tese sobre Energia Nuclear.</P>

<P><B>Como se decidir</B></P>

<P>A escolha do tema tem a ver com o rumo da sua carreira universit&aacute;ria.
A grande maioria dos que eu conhe&ccedil;o faz o mestrado para dar aulas
para o 3o grau, ou seja, virar professor universit&aacute;rio. Atualmente,
h&aacute; muitas faculdades e universidades por a&iacute;, vendendo (isso
mesmo, vendendo) o sonho de ser algu&eacute;m com diploma e com gente sem
mestrado dando aula. Ent&atilde;o &eacute; poss&iacute;vel &nbsp;&quot;garantir&quot;
(se voc&ecirc; n&atilde;o for despedido depois que o fiscal do MEC for
embora) o ganha-p&atilde;o dando aulas para gente que quer se formar na
mesma profiss&atilde;o que voc&ecirc;. H&aacute; outros que est&atilde;o
preocupados apenas com o t&iacute;tulo de Mestre, como alguns que est&atilde;o
trabalhando e precisam do t&iacute;tulo para uma promo&ccedil;&atilde;o.</P>

<P>Uma forma de se definir o rumo &eacute; fazer mat&eacute;rias na P&oacute;s-gradua&ccedil;&atilde;o
como <I>&quot;aluno especial&quot;</I>. &Eacute; uma op&ccedil;&atilde;o
dispon&iacute;vel ou n&atilde;o nas faculdades. Basicamente se escolhe
uma disciplina que tem a ver com o tema que se quer estudar, depois se
conversa com o professor, cursa as aulas e v&ecirc; se at&eacute; o final
do curso, a luz aparece para iluminar o seu caminho. Voc&ecirc; n&atilde;o
&eacute; ainda p&oacute;s-graduando, mas talvez consiga fazer com que a
nota e a frequ&ecirc;ncia sejam validadas para sua p&oacute;s, quando come&ccedil;ar
a cursar. O lado ruim &eacute; que dependendo da faculdade, voc&ecirc;
paga para fazer essa mat&eacute;ria.</P>

<P><B>Esbo&ccedil;o de Projeto:</B></P>

<P>Esse texto abaixo eu me baseei noutro que n&atilde;o sei se foi na Escola
de Comunica&ccedil;&otilde;es e Artes ou se foi em outro lugar que peguei.
Pode ser que seja do CNPQ ou da FAPESP. Os coment&aacute;rios s&atilde;o
de minha autoria.</P>

<CENTER><TABLE BORDER=1 WIDTH="80%" >
<TR>
<TD>Normas para apresenta&ccedil;&atilde;o de projeto de pesquisa <BR>
N&iacute;vel: Mestrado ou doutorado 
<P>OBS: O projeto de pesquisa deve ser apresentado em linguagem clara.
A pessoa tem que mostrar que sabe escrever. Saber escrever no caso, &eacute;
algo diferente de reda&ccedil;&atilde;o para o vestibular, diga-se de passagem.
Significa mais que usar a crase ou conjugar verbos. Exige um tipo de cr&iacute;tica
que amigo n&atilde;o faz quando l&ecirc;, mesmo que saiba portugu&ecirc;s
bem (a n&atilde;o ser que esse amigo seja p&oacute;s-graduando e j&aacute;
passou pelo processo). Ser bom em reda&ccedil;&atilde;o n&atilde;o significa
ser bom em reda&ccedil;&atilde;o de projeto de pesquisa, por que implica
em portugu&ecirc;s t&eacute;cnico. Para se ter uma id&eacute;ia (depois
que vi p&oacute;s-graduando perguntar se exato era com s ou com z, dentro
da USP, &eacute; bom explicar) isso que eu escrevo no El&eacute;trica &eacute;
coloquial e sem revis&atilde;o ortogr&aacute;fica, apesar do meu esfor&ccedil;o
em colocar bibliografia. </P>

<P>Sugiro colocar as id&eacute;ias no papel, depois ler, reler e reescrever
sei l&aacute; quantas vezes. &Eacute; preciso estruturar e conceituar o
que se pretende em menos de 20 p&aacute;ginas datilografadas ou digitadas
de espa&ccedil;o duplo (fonte: Times New Roman, tamanho 12), incluso a
bibliografia. Quanto mais conciso e intelig&iacute;vel, maior a chance
de um orientador topar ler at&eacute; o fim.</P>

<P>O conjunto de pap&eacute;is denominado &nbsp;&quot;projeto de pesquisa&quot;
&eacute; dividido nas seguintes partes:</P>

<P>CAPA:</P>

<P>Que deve conter:</P>

<UL>
<LI>t&iacute;tulo explicando o projeto (pode ser alterado DEPOIS que voc&ecirc;
conseguiu o mestrado, mas isso &eacute; DEPOIS)</LI>

<LI>n&iacute;vel do projeto, se &eacute; mestrado ou doutorado</LI>

<LI>&aacute;rea de concentra&ccedil;&atilde;o (n&atilde;o adianta submeter
um projeto de matem&aacute;tica em uma faculdade de literatura celta)</LI>

<LI>linha de pesquisa</LI>

<LI>nome do autor</LI>
</UL>

<P>A p&aacute;gina 1 obrigatoriamente deve ter um m&aacute;ximo de 5 linhas
com o t&iacute;tulo e resumo do projeto</P>

<P>PROJETO DE PESQUISA</P>

<P>1) INTRODU&Ccedil;&Atilde;O</P>

<P>Dispensa-se maiores coment&aacute;rios. </P>

<P>2) OBJETO</P>

<P>Compreende: </P>

<UL>
<LI>Assunto e problema de pesquisa (problema subentende-se que alguma indaga&ccedil;&atilde;o
ou d&uacute;vida ou sei l&aacute; o qu&ecirc; que merece ser estudada dentro
do assunto).</LI>

<LI>Justificativa (pra qu&ecirc; se dar ao trabalho de ficar investigando
isso, se vai diminuir o desemprego, se a vida sexual dos cangurus vai melhorar,
qualquer coisa S&Eacute;RIA que justifique o esfor&ccedil;o - ganhar bolsa
de mestrado n&atilde;o vale, mesmo por que as chances s&atilde;o m&iacute;nimas,
bem m&iacute;nimas de conseguir, sem falar que seu projeto pode ser adornado
com um hieroglifo vermelho enorme semelhante &agrave; letra &quot;X&quot;
se a pessoa encarregada de ler seu material captar essa inten&ccedil;&atilde;o
e .. n&atilde;o adianta repetir uma pesquisa que j&aacute; deu certo para
algu&eacute;m no ano passado, deve ser algo original, novo). </LI>
</UL>

<P>3) QUADRO TE&Oacute;RICO DE REFER&Ecirc;NCIA</P>

<P>N&atilde;o se tira o projeto de pesquisa de dentro da cabe&ccedil;a.
N&atilde;o. Mesmo que se fa&ccedil;a um projeto ligado &agrave; artes pl&aacute;sticas
(donde realmente o que conta &eacute; a sua capacidade de tirar as coisas
de dentro da cabe&ccedil;a), o projeto de pesquisa tem que estar inserido
&nbsp;dentro das pesquisas existentes e a bibliografia tem que ter alguma
coisa a ver com a bibliografia fundamental.</P>

<P>4) OBJETIVOS</P>

<P>Dividem-se em objetivos gerais e espec&iacute;ficos ou te&oacute;ricos
e pr&aacute;ticos. </P>

<P>5) PROCEDIMENTOS METODOL&Oacute;GICOS</P>

<P>Seria explicitar os m&eacute;todos e t&eacute;cnicas de investiga&ccedil;&atilde;o
que ser&atilde;o utilizados e por que esses m&eacute;todos s&atilde;o adequados
ao projeto. Podia me detalhar mais sobre isso, mas seria facilitar muito
a vida. Apenas digo que se isso n&atilde;o estiver muito claro, n&atilde;o
adianta.</P>

<P>6) CONSIDERA&Ccedil;&Otilde;ES FINAIS</P>

<P>Como diz o nome..</P>

<P>7) SUM&Aacute;RIO DA PESQUISA</P>

<P>Vamos por partes, como dizia Jack (TheRipper). &Eacute; preciso ordenar
o projeto. &Iacute;tens, t&oacute;picos, cap&iacute;tulos, partes. Se vc
aprendeu html sem esses editores de hoje, mas no bra&ccedil;o, com toda
aquela m&atilde;o de obra de conhecer de cabe&ccedil;a as tags, ent&atilde;o
pode entender o por qu&ecirc; de tanta coisa relativa &agrave; ordena&ccedil;&atilde;o
de &iacute;tens. O in&iacute;cio do uso de html (sem aquelas frescuras
de javascript, php e flash) visava a publica&ccedil;&atilde;o de trabalhos
acad&ecirc;micos. Ent&atilde;o essa divis&atilde;o de temas, subtemas,
etc.. &eacute; essencial. </P>

<P>8) REFER&Ecirc;NCIAS BIBLIOGR&Aacute;FICAS</P>

<P>Existe norma para tudo. Inclusive para se relacionar as fontes bibliogr&aacute;ficas
que ser&atilde;o usadas no projeto de pesquisa. Lembra dos livros que voc&ecirc;
leu, aquele jeito estranho de se relacionar o nome do autor, livro, editora,
local, data, etc, etc? Por a&iacute;. Tem que ser daquele jeito, denominado
ABNT, vide http://www.bu.ufsc.br/home982.html. Atualmente p&aacute;gina
de internet tamb&eacute;m vale como refer&ecirc;ncia. Ex:</P>

<P>CUNHA, Derneval R.R..&quot;Como iniciar um Mestrado&quot;. Maio de 2002.
In: <B>El&eacute;trica Fanzine. </B>Dispon&iacute;vel em http://www.inf.ufsc.br//mestrado.html.
Acesso em: 08/05/2002.</P>

<P>M&aacute;ximo de 3 p&aacute;ginas de bibliografia. E n&atilde;o vai
esquecendo, meu: essa coisa de bibliografia faz um p(*) duma diferen&ccedil;a.
N&atilde;o vai marcar bobeira com isso que voc&ecirc; se estrepa.</P>

<P>9) CRONOGRAMA DAS ATIVIDADES DE PESQUISA</P>

<P>J&aacute; ouviu falar disso? Pois &eacute;, a gente nem sabe se vai
morrer atropelado amanh&atilde;, mas tem que fazer um planejamento para
2 anos (pelo menos na&nbsp;USP) de estudos. Em outras palavras, esclarecer
quanto tempo vai se levar para cursar os cr&eacute;ditos e quanto tempo
ir&aacute; ficar pesquisando. Depois de um tempo m&iacute;nimo tem a qualifica&ccedil;&atilde;o,
ap&oacute;s o que tem a reda&ccedil;&atilde;o da disserta&ccedil;&atilde;o
e por fim a defesa da Disserta&ccedil;&atilde;o.</P>
</TD>
</TR>
</TABLE></CENTER>

<P><B>Como aprender essas quest&otilde;es de metodologia</B></P>

<P>Existe uma car&ecirc;ncia de cursos bons sobre metodologia. &Eacute;
essencial por&eacute;m procurar bons livros sobre o assunto, tanto para
redigir o projeto de pesquisa como para fazer o trabalho depois. Aqueles
que tiveram o mart&iacute;rio de entregar os famosos TCCs, Trabalho de
Conclus&atilde;o de Curso (alguns cursos universit&aacute;rios exigem que
o aluno escreva sobre algum tema para receber o diploma). V&atilde;o estar
um pouco mais a frente daqueles que n&atilde;o tem nada disso no curr&iacute;culo.
Curso de metodologia &eacute; algo que pode ser chato como aprender a programar
em COBOL ou fazer declara&ccedil;&atilde;o do imposto de renda (daqueles
que n&atilde;o s&atilde;o isentos), mas n&atilde;o existe alternativa.
</P>

<P><B>Diferen&ccedil;as entre Mestrado e Doutorado</B></P>

<P>O Mestrado &eacute; considerado pelos acad&ecirc;micos como treinamento
para o doutorado. Em teoria pode-se ir direto para o Doutorado, mas sofre-se
mais um pouco. No Mestrado &eacute; exigida a profici&ecirc;ncia em uma
l&iacute;ngua estrangeira. No Doutorado s&atilde;o duas l&iacute;nguas.
Se voc&ecirc; acha que saber ingl&ecirc;s &eacute; dif&iacute;cil, imagina
saber ingl&ecirc;s e outra l&iacute;ngua. S&oacute; no final do mestrado
&eacute; que se realmente entende o significado da palavra &nbsp;&quot;Doutorado&quot;
e por que o Brasil tem t&atilde;o poucos doutores. &Eacute; t&atilde;o
complexo explicar o que &eacute; Doutorado para leigos que nem vou me dar
ao trabalho. </P>

<P><B>As provas de Mestrado</B></P>

<P>Isso &eacute; um enigma. N&atilde;o sei o que falar.</P>

<P><B>In&iacute;cio do Mestrado</B></P>

<P>Vc conseguiu. Passou nos exames, arrumou orientador, j&aacute; est&aacute;
come&ccedil;ando as aulas. Leu o Regimento da P&oacute;s? Provavelmente
n&atilde;o. Talvez sim. Quem sabe. Se ler, ir&aacute; descobrir que existem
coisas como limite de prazo p. completar o Mestrado, &iacute;ndice de aproveitamento,
n&uacute;mero de mat&eacute;rias, etc, etc.. </P>

<P>Algumas coisas &eacute; bom saber antes de fazer a matr&iacute;cula:
por exemplo, que n&atilde;o pode bombar nas mat&eacute;rias (isso se voc&ecirc;
pretende ter Bolsa de Estudos algum dia). Fazer muitas mat&eacute;rias
logo de cara tamb&eacute;m &eacute; besteira. Mestrado r&aacute;pido, s&oacute;
se voc&ecirc; tiver pa(i)troc&iacute;nio ou bolsa. Quantas mat&eacute;rias?
O ideal seria no m&aacute;ximo 2 mat&eacute;rias por semestre. 3 mat&eacute;rias
por semestre &eacute; coisa para quem quer terminar o mestrado r&aacute;pido.
Atualmente est&atilde;o querendo que a pessoa fa&ccedil;a tudo em 2 anos,
ent&atilde;o tenta n&atilde;o estragar a coisa fazendo 4 ou 5 mat&eacute;rias
de uma s&oacute; vez que voc&ecirc; se estrepa. Leva em considera&ccedil;&atilde;o
n&atilde;o s&oacute; o tempo em que ir&aacute; ficar sentado tendo aulas,
mas tamb&eacute;m o tempo em que n&atilde;o poder&aacute; estar trabalhando
por que estar&aacute; lendo ou fazendo trabalhos. Para n&atilde;o falar
em curso de l&iacute;ngua estrangeira. </P>

<P><B>Qualifica&ccedil;&atilde;o</B></P>

<P>O Mestrado compreende 2 fases, uma onde voc&ecirc; estuda, outra onde
voc&ecirc; s&oacute; pesquisa e redige a disserta&ccedil;&atilde;o. A qualifica&ccedil;&atilde;o
&eacute; um marco divis&oacute;rio entre estas fases e acontece quando:</P>

<UL>
<LI>Vc n&atilde;o est&aacute; preparado</LI>

<LI>J&aacute; fez todas as disciplinas ou cursos necess&aacute;rios</LI>

<LI>Tem algu&eacute;m (da secret&aacute;ria de P&oacute;s-gradua&ccedil;&atilde;o)
te amea&ccedil;ando com jubilamento se voc&ecirc; n&atilde;o ficar ligado
no prazo.</LI>
</UL>

<P>Ent&atilde;o voc&ecirc; prepara um texto significativo que seria uma
amostra (tipo um ou dois cap&iacute;tulos) e fica perante um monte de gente
(na verdade 3 ou 4 pessoas) explicando o que &eacute; que voc&ecirc; est&aacute;
fazendo da vida. Tem um monte de conselhos quanto a isso, mas e da&iacute;?
&Eacute; um rito de passagem, que nem passar no Vestibular. Mais tarde
voc&ecirc; chega na pessoa que acabou de passar por isso e faz a c&eacute;lebre
pergunta:</P>

<P>- Foi bom para voc&ecirc; tamb&eacute;m?</P>

<P><B>Fase de Pesquisa (vulgo reda&ccedil;&atilde;o da Disserta&ccedil;&atilde;o)</B></P>

<P>A pior fase da sua vida. Voc&ecirc; descobre que n&atilde;o est&aacute;
pronto para completar tudo, que falta uma por&ccedil;&atilde;o de coisas,
mas tem que fazer do mesmo jeito. E nunca se termina isso se n&atilde;o
parar de incluir dados no material j&aacute; coletado. Uma coisa &eacute;
colher material. Outra &eacute; usar o material para se chegar &agrave;
conclus&atilde;o ou &agrave;s conclus&otilde;es. Mas daqui para frente,
&eacute; morro abaixo.</P>

<P><B>Defesa de Disserta&ccedil;&atilde;o</B></P>

<P>Lembra como foi a qualifica&ccedil;&atilde;o. Sem coment&aacute;rios.
</P>

<P><B>Vida ap&oacute;s a P&Oacute;S.</B></P>

<P>N&atilde;o sei se existe. Voc&ecirc; s&oacute; sabe quando chega l&aacute;
e eu, n&atilde;o sei nem se vou estar vivo semana que vem.</P>

<P><B><FONT SIZE=+1>Bibliografia:</FONT></B></P>

<P>Quase ia me esquecendo. O ideal &eacute; procurar se informar e correr
atr&aacute;s de tudo quanto &eacute; texto relacionado &agrave; metodologia.
O que est&aacute; acima &eacute; meramente introdut&oacute;rio. N&atilde;o
vou colocar uma lista porqu&ecirc; &agrave;s v&ecirc;zes a pessoa vai que
nem barata tonta atr&aacute;s e n&atilde;o encontra. </P>

</BODY>
</HTML>
