<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>A vida afetiva dos Nerds</TITLE>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Author" CONTENT="Derneval R.R. Cunha">
   <META NAME="GENERATOR" CONTENT="Mozilla/3.01Gold (WinNT; I) [Netscape]">
   <META NAME="Description" CONTENT="Uma pequena relação de truques e joguinhos que atrapalham a vida de nerds quando estão tentando arrumar alguém para sair nas noites de sábado.">
   <META NAME="KeyWords" CONTENT="namoro, amor, micos, batalha pela mente, retórica,  nerd, nerds, paquera, chaveco, traição">
</HEAD>
<BODY TEXT="#FFFF80" BGCOLOR="#400040" LINK="#0000EE" VLINK="#551A8B" ALINK="#FF0000">

<CENTER><P><A HREF="http://www.inf.ufsc.br/barata/index.html">Homepage</A>
<A HREF="http://barataeletrica.blogspot.com">Blog do Fanzine</A> <A HREF="http://www.inf.ufsc.br/barata/barata27.html">&Iacute;ndice
No 27</A> <A HREF="http://www.inf.ufsc.br/barata/ind.htm">&Iacute;ndice
N&uacute;meros Anteriores</A> <A HREF="http://www.inf.ufsc.br/barata/emai.htm">Contato</A>
<BR>
http://barataeletrica.cjb.net http://www.inf.ufsc.br/<BR>
Vers&atilde;o Txt <A HREF="http://www.barataeletrica.rg3.net">http://www.barataeletrica.rg3.net</A>
</P></CENTER>

<CENTER><P><B>NERDS E O NAMORO (ALGUNS MICOS COMUNS)</B> </P></CENTER>

<P>Derneval R.R. Cunha </P>

<P>Os &quot;joguinhos&quot; s&atilde;o a caracter&iacute;stica da maioria
dos fracassos amorosos (pelo menos at&eacute; alguns anos atr&aacute;s,
com o aparecimento do verbo &quot;ficar&quot;, isso est&aacute; meio fora
de moda), tanto para Nerds como para o p&uacute;blico em geral. Mulher
odeia ser generalizada, mas odeia mais ainda o fato de que fica sozinha
porque n&atilde;o encontra &quot;homens&quot;. Subentende-se que os &quot;homens&quot;
que as mulheres procuram topariam aquilo que as amigas, as novelas, os
contos, o que talvez at&eacute; a m&atilde;e dela diz que&nbsp; funciona,
para &quot;la&ccedil;ar&quot; o cara: os famosos &quot;fazer o cara sofrer&quot;.
&Eacute; uma m(*). Do ponto de vista masculino, isso significa que s&oacute;
sendo &quot;canalha&quot; ou &quot;ter grana&quot; &eacute; que se consegue
a mulher sem passar por isso. Para o Nerd, &eacute; um argumento muito
bom em favor do V&iacute;deo-cassete e do site porn&ocirc;. </P>

<P>H&aacute; diversos argumentos pr&oacute; e contra os &quot;joguinhos&quot;,
nem vou entrar muito no assunto: </P>

<UL>
<LI>A mulher acha que&nbsp; &quot;homem gosta de dificuldade&quot;.</LI>

<LI>O cara algumas v&ecirc;zes acha que&nbsp; &quot;a mulher n&atilde;o
vale a pena porque se &eacute; f&aacute;cil com ele, &eacute; f&aacute;cil
com todo mundo&quot;.</LI>

<LI>Seus amigos n&atilde;o te enchem o saco quando voc&ecirc; n&atilde;o
consegue esta ou aquela menina &quot;n&atilde;o-invis&iacute;vel&quot;.</LI>

<LI>Seus amigos te enchem o saco porque voc&ecirc; &eacute; incompetente
para namorar at&eacute; mesmo a mulher&nbsp; &quot;invis&iacute;vel&quot;.</LI>

<LI>Etc..</LI>
</UL>

<P>O porqu&ecirc; n&atilde;o interessa muito quando simplesmente se curte
uma menina. O problema n&atilde;o &eacute; a mulher se fazer ou n&atilde;o
de dif&iacute;cil. O lance &eacute; que a menina vai&nbsp; &quot;se fingir
de dif&iacute;cil&quot;. A palavra chave do texto &eacute;&nbsp; &quot;fingir&quot;.
Finge, portanto mente. Se ela est&aacute; afim, porqu&ecirc; se faz de
dif&iacute;cil? E porque&nbsp; &quot;cai&quot; t&atilde;o f&aacute;cil
de amores com caras que reconhecidamente (todo cara conhece) n&atilde;o&nbsp;
&quot;prestam&quot;? &Eacute;, os testes e joguinhos deveriam prevenir
contra esses caras, vai ver. S&oacute; assim elas saberiam separar o joio
do trigo. Ou vai ver, &eacute; uma coisa que as m&atilde;es ensinam ou
cobram das filhas para ver se elas demoram mais para perder a virgindade,
n&atilde;o sei. </P>

<P>Um exemplo que tirei de uma palestra em Porto Alegre (SBPC): a menina
fica louca para testar sua capacidade de atra&ccedil;&atilde;o, como fazer?
Chega num cara e tenta cativa-lo. Quando o cara decide que ela est&aacute;
falando&nbsp; &quot;s&eacute;rio&quot;, a menina inventa uma desculpa,
vira as costas e vai embora. Pronto, ela satisfez a curiosidade dela se
est&aacute; ou n&atilde;o &quot;atraente&quot;. O cara que se dane. Deve
ser legal pacas para elas. Fazem o cara se sentir l&aacute; em cima e depois
puxam o tapete. Algumas mant&eacute;m o cara &quot;de correntinha&quot;.
Nunca tem nada com ele, mas o sujeito fica anos a fio seguindo ela para
cima e para baixo, como se fosse a Gisele B&uuml;ndchen, mas apenas amigo.
Tem um filme a&iacute; com a Cameron Diaz (Tudo para ficar com ele) que
deve explicar isso bem melhor.</P>

<P>Para quem entende que a menina est&aacute; enrolando, s&oacute; existe
uma coisa a fazer: virar o jogo. </P>

<P><B>Como se proteger dos&nbsp; &quot;joguinhos&quot;:</B> </P>

<P>A mulher j&aacute; sabe, no momento em que encontra o cara, nos primeiros
15 segundos, o que pretende dele, se &eacute; namoro s&eacute;rio ou&nbsp;
&quot;ficar&quot;. Mas n&atilde;o fala. Deixa acontecer. Faz o &quot;jogo&quot;
dela. Depois que sabe o bastante (tem a fase da coleta de informa&ccedil;&otilde;es
sobre a v&iacute;tima), parte para os &quot;joguinhos&quot;. Mas a&iacute;
estou generalizando. Fui burro de gastar grana com uma palestra de psic&oacute;logo
sobre &quot;arte do namoro&quot;. Em seu livro ele sugere de forma expl&iacute;cita
que os&nbsp; &quot;testes&quot; s&atilde;o uma forma &oacute;tima de cortar
etapas no processo amoroso. Ou que os&nbsp; &quot;joguinhos&quot; al&eacute;m
de testar, servem para &quot;fazer nascer o amor no cora&ccedil;&atilde;o
de um homem&quot;. Mistura de &quot;sele&ccedil;&atilde;o de pessoal&quot;
com &quot;lavagem cerebral&quot;. Tudo quanto &eacute; filme de Hollywood
tem cena com algo do g&ecirc;nero. A mocinha independente xinga o cara
e ele vai atr&aacute;s como um cachorrinho amestrado buscando o osso. Mais
o menos o que a Debbie Reynolds faz com o Gene Kelly no &quot;Cantando
na Chuva&quot;. </P>

<P>Cada coisa.. enfim. N&atilde;o sou psic&oacute;logo. Mas acho que o
cara lucra mais escrevendo que isso funciona. Se as mulheres parassem de
acreditar que &quot;passar suadouro em homem&quot; n&atilde;o funciona,
a Rede Globo ia &agrave; fal&ecirc;ncia. Vc tem namorada e acha podre o
que estou dizendo? O dia em que ela te deixar voc&ecirc; me d&aacute; raz&atilde;o.
Porque o primeiro sintoma &eacute; aquele pensamento &quot;n&atilde;o quero
mais ver mulher nenhuma na vida&quot;. Batata. Voc&ecirc; procura desesperadamente
um amigo para poder falar isso para ele, como se fizesse diferen&ccedil;a.
&Eacute; sempre dif&iacute;cil esquecer algu&eacute;m. </P>

<P>Como ensinar algu&eacute;m a se prevenir contra os &quot;joguinhos&quot;
se a mulher treina e comenta isso a vida inteira? A dificuldade aumenta
de acordo com a necessidade que se tem do produto. &Eacute; um treinamento
de longo prazo. A curto prazo, &eacute; s&oacute; namorar mulheres pelas
quais n&atilde;o se sinta absolutamente nada. Se ela descobrir que voc&ecirc;
gosta dela, vai &quot;fugir&quot; para ver se voc&ecirc; corre atr&aacute;s.
&Eacute; aquela coisa: &eacute; muito mais f&aacute;cil arrumar outra mulher
quando se j&aacute; tem uma. Nesse caso, os &quot;joguinhos&quot; n&atilde;o
funcionam. </P>

<P>&Eacute; bom saber que mesmo nos casos em que rola atra&ccedil;&atilde;o
entre as duas partes (para qu&ecirc; joguinho ent&atilde;o), as amigas
dela s&atilde;o capazes de estimular esse tipo de atitude por parte da
garota. Porqu&ecirc;? Simples, meu caro. Se n&atilde;o fizerem isso, a
menina n&atilde;o vai contar nada de voc&ecirc; ou do que voc&ecirc;s dois
fizeram juntos para elas. Estimular sua garota a fazer assim ou assado
&eacute; uma forma das amigas ouvirem hist&oacute;rias altamente &quot;er&oacute;ticas&quot;
e &quot;detalhadas&quot;. O namoro vai continuar se as amigas dela derem
uma for&ccedil;a. Os joguinhos duram enquanto a mocinha n&atilde;o enche
o saco de contar tudo para os outros. As amiguinhas dela tamb&eacute;m
podem tamb&eacute;m brincar de experimentar com diferentes t&aacute;ticas
sem &quot;queimar os dedos&quot;. Qualquer coisa o problema &eacute; da
sua garota. Se voc&ecirc; vai namorar uma menina, sempre pense nesse detalhe
importante: voc&ecirc; n&atilde;o est&aacute; com uma pessoa s&oacute;,
mas com v&aacute;rias. As v&ecirc;zes &eacute; a m&atilde;e, as v&ecirc;zes
&eacute; a irm&atilde;, a colega de trabalho. </P>

<P><B>Tipos de joguinhos:</B> </P>

<P><B>Jogo do telefone (geladeira):</B> </P>

<P>&Eacute; antigo, esse tipo de coisa de coisa. Agora est&aacute; sendo
feita com email. A pessoa come&ccedil;a a s&oacute; atender secret&aacute;ria
eletr&ocirc;nica e n&atilde;o responde aos recados. A&iacute; a &uacute;nica
solu&ccedil;&atilde;o &eacute; encontrar a pessoa pessoalmente. Se a coisa
acontece em cidade pequena ou qualquer outro lugar onde o contato humano
&eacute; freq&uuml;ente, n&atilde;o &eacute; t&atilde;o problem&aacute;tico,
apesar de dar uma raiva (esse &eacute; o objetivo do joguinho). <BR>
&nbsp; </P>

<P><B>Seria t&atilde;o bom se voc&ecirc; fosse..</B> </P>

<P>&Eacute;, quem desdenha quer comprar.. a mulher faz isso quando se vai
com muita sede ao pote. Ou quando descobre que conseguiu deixar o sujeito
com muita sede. N&atilde;o confundir esse tipo de papo com outro que rola
depois que relacionamento est&aacute; rolando. </P>

<P><B>Me empresta seu ..</B> </P>

<P>Voc&ecirc; nomeia o qu&ecirc;. Normalmente ela te pede emprestado aquilo
que voc&ecirc; considera mais sagrado e voc&ecirc; &eacute; que vai dizer
isso para ela, por isso, cuidado com a l&iacute;ngua. Ser sincero &eacute;
muito legal, quando se sabe que a outra pessoa n&atilde;o vai tomar vantagem
da situa&ccedil;&atilde;o, mas estou mudando de assunto. Depois que voc&ecirc;
emprestou, d&aacute; adeus! &Eacute; que nem o peixe quando mordeu o anzol
(o peixe &eacute; voc&ecirc;). Tem v&aacute;rias outras brincadeiras que
ela pode fazer contigo. Isso, antes de voc&ecirc; fazer umas baixarias
para obrig&aacute;-la a devolver. Sim, porque acredite em mim, nem todo
mundo que empresta, devolve. A&iacute; voc&ecirc; se v&ecirc; na condi&ccedil;&atilde;o
de fazer umas baixarias pra conseguir de volta. </P>

<P><B>Vamos manter segredo..</B> </P>

<P>Opini&atilde;o do pato: qu&aacute;!, qu&aacute;!, qu&aacute;!, qu&aacute;!,
qu&aacute;!, qu&aacute;!, qu&aacute;!.... Mulher que guarda segredo do
namorado? Do marido at&eacute; se pode acreditar. Mas ela s&oacute; n&atilde;o
sai contando para todo mundo se voc&ecirc; botar num caixote e enterrar.
Se ela for esp&iacute;rita, nem assim. Mesmo que pudesse e tivesse raz&otilde;es
para ficar calada, as outras mulheres enxergam o ar de felicidade. Pode
ser a mulher mais solit&aacute;ria do mundo. </P>

<P><B>Vamos na festa de anivers&aacute;rio da minha colega..</B> </P>

<P>Pode ser verdade. E pode ser uma maneira de apresentar voc&ecirc; para
um monte de gente que vai dar opini&atilde;o sobre a sua pessoa. Lembre-se,
ela contou para todo mundo que conhece voc&ecirc;, que melhor maneira de
te exibir do que inventar uma &quot;festa&quot;? </P>

<P><B>Voc&ecirc; &eacute; ruim porqu&ecirc;..</B> </P>

<P>&Eacute; uma varia&ccedil;&atilde;o do&nbsp; &quot;joguinho&quot; acima.
Toda vez que ela quiser te obrigar a fazer alguma coisa, vai usar alguma
atitude sua que seja dif&iacute;cil de mudar. Ou condicionar isso ou aquilo
&agrave; determinada mudan&ccedil;a de atitude. </P>

<P><B>Voc&ecirc; n&atilde;o pensa em mim..</B> </P>

<P>&Oacute;bvio que n&atilde;o pensa. &Agrave;s v&ecirc;zes elas soltam
essa depois que voc&ecirc; gastou uma nota preta levando-a para algum lugar
caro e legal. Ou fez algo que deu muito trabalho. Pode tanto ser for&ccedil;ar
a separa&ccedil;&atilde;o ou para evitar cobran&ccedil;a futura (se voc&ecirc;
fez algo, espera algo em troca, um m&iacute;nimo que ela n&atilde;o quer
pagar). </P>

<P><B>Vamos ser amigos?</B> </P>

<P>A mulher VSA. Puxa, essa &eacute; dif&iacute;cil. Merece mais texto.
Um ex-amigo meu falou que depois de ficar amigo, &eacute; quest&atilde;o
de tempo &quot;chegar&quot; na menina. N&atilde;o sei. &Eacute; muito mais
f&aacute;cil ser amigo de algu&eacute;m quando a pessoa em quest&atilde;o
n&atilde;o &eacute; sexualmente atraente. E quando se tem um monte de assuntos
em comum. Mas vou te dar umas dicas do que a mulher faz quando acha algu&eacute;m
que topa ser amigo sem ter assuntos legais em comum: </P>

<UL>
<LI>fica perguntando sobre os seus amigos (aqueles com quem ela realmente
quer alguma coisa s&eacute;ria)</LI>

<LI>fica contando ou pedindo opini&atilde;o sobre os casos de amor que
ela teve, vai ter ou n&atilde;o tem coragem de ter.</LI>

<LI>fica te alugando para ensinar coisas que ela n&atilde;o tem paci&ecirc;ncia
para aprender sozinha.</LI>

<LI>fica te usando como enfeite (quando precisa ir numa festa acompanhada
ou num lugar perigoso).</LI>
</UL>

<P>Conhe&ccedil;o gente (que n&atilde;o precisa ler este texto para se
informar sobre estes assuntos) que at&eacute; consegue virar o jogo, mas
isso &eacute; trabalho de longo prazo. As vezes pode demorar anos. O pior
&eacute; que como amiga, ela pode perguntar detalhes da sua vida que voc&ecirc;
n&atilde;o gostaria que ningu&eacute;m soubesse (e a&iacute; todo mundo
vai saber, porque ela vai contar). O pior &eacute; que amigo ou n&atilde;o,
mulher gosta de exclusividade. O pior &eacute; que sair com ela pode afastar
as outras meninas. N&atilde;o estou dizendo que n&atilde;o se deva ter
amigas do sexo oposto, mas amizades acontecem, n&atilde;o s&atilde;o feitas
por &quot;decreto&quot;, tipo &quot;vamos? &quot;. Outra variante &eacute;:
&quot;N&atilde;o quero estragar nossa amizade&quot;. </P>

<P><B>Me d&aacute; um tempo..</B> </P>

<P>As v&ecirc;zes a menina est&aacute; saindo de uma aventura amorosa,
est&aacute; se sentindo muito vulner&aacute;vel. E da&iacute;? Medo de
ficar sozinha. Que coisa, n&eacute;? Mas a&iacute; vem aquele monte de
lembran&ccedil;as amargas do que aconteceu. E voc&ecirc; l&aacute;, ouvindo,
como se seu ouvido fosse pinico. As v&ecirc;zes &eacute; legal, se voc&ecirc;
souber filtrar. Mas n&atilde;o recomendo n&atilde;o. Ela pode gostar da
sua companhia e depois voltar para o sujeito. Numa boa e sem remorso. </P>

<P><B>Escovar os dentes..</B> </P>

<P>As v&ecirc;zes &eacute; acidente (as v&ecirc;zes &eacute; de prop&oacute;sito).
Ela n&atilde;o escova os dentes antes do primeiro (segundo, terceiro ou
en&eacute;simo) beijo. Pelo contr&aacute;rio, parece que passou a semana
inteira sem escovar. N&atilde;o vou nem descrever a cena, ela pode at&eacute;
estar de mini-saia e sem suti&atilde; por baixo da blusa. Nunca, jamais,
saia sem chicletes de caixinha. Vc pega um para voc&ecirc; e oferece o
outro. </P>

<P><B>Programa de &Iacute;ndio</B> </P>

<P>Pensa num&nbsp; &quot;programa&quot; que voc&ecirc; detesta. O que quer
que seja. Conta para ela. Ela vai usar isso de v&aacute;rias formas diferentes.
As v&ecirc;zes ela detesta tamb&eacute;m o programa, mas vai achar divertido
ficar olhando para sua cara e contando para as amigas depois. Tudo depende
da situa&ccedil;&atilde;o. Se voc&ecirc; fingir que est&aacute; gostando,
pode ser que consiga reverter. </P>

<P><B>Ambiguidade</B> </P>

<P>Mulher normalmente gosta de ficar brincando de falar &quot;talvez&quot;
ao inv&eacute;s de &quot;sim&quot; ou&nbsp; &quot;n&atilde;o&quot;. T&iacute;pico.
Mas para ilustrar melhor, fica o depoimento abaixo: </P>

<P><I>Estou conversando com uma mulher num determinado evento e ent&atilde;o
ela me diz:&nbsp; &quot;Vamos sair daqui e ir ao bar assim, assim.&quot;
O qual &eacute; um bar de l&eacute;sbicas. Vamos para o bar e, horas depois,
ela diz: &quot;Vamos tomar um caf&eacute; em outro lugar.&quot; Ent&atilde;o
vamos tomar o caf&eacute; num botequim e, de repente, &agrave;s 3 da manh&atilde;,
nos vemos a meio quarteir&atilde;o do apartamento dela. Finalmente, ela
diz: &quot;Tudo bem, foi &oacute;timo, boa noite.&quot; Ou seja, ela est&aacute;
se despedindo para voltar para casa sozinha. E eu digo: &quot;O qu&ecirc;?
N&atilde;o vamos para o seu apartamento?&quot; Ela: &quot;N&atilde;o.&quot;
Eu: &quot;Mas como?&quot; Ela&quot; &quot;Voc&ecirc; pensou que eu estava
insinuando alguma coisa?&quot; Puta que pariu! Imagina meu &oacute;dio.
&Agrave;quela altura, eu j&aacute; estava olhando para ela e... Enfim,
se eu fosse um garoto de 18 anos, e n&atilde;o uma mulher de 45, teria
esfaqueado aquela vaca. Nunca me senti t&atilde;o humilhada e furiosa.
Se fosse um rapaz e estivesse de pau duro, eu a teria atacado. (Camille
Paglia, entrevista &agrave; revista PLAYBOY, junho 95).</I> </P>

<P>Faltou falar que a Camille Paglia &eacute; uma pessoa famos&iacute;ssima,
feminista (?) e l&eacute;sbica. D&aacute; para pensar muito em cima disso.
Uma &eacute; que mulher tamb&eacute;m fica fora de si quando se sente enganada.
Duas &eacute; que mulher n&atilde;o entende mulher sempre. E por a&iacute;
vai. J&aacute; perdi v&aacute;rias oportunidades por conta disso. </P>

<P><B>Pera&iacute; que eu j&aacute; volto</B> </P>

<P>N&atilde;o volta. Se ela tiver te deixado com um monte de coisas dela,
deixa com algu&eacute;m, sen&atilde;o, arruma uma forma de deixar um bilhete
e v&aacute; embora. &Eacute; o meu conselho. As v&ecirc;zes ela faz isso
quando a conversa est&aacute; no melhor ponto. &Eacute; interessante. Fazer
esc&acirc;ndalo? &Eacute; isso o que ela quer. Ver como &eacute; que voc&ecirc;
fica quando est&aacute; nervoso. </P>

<P><B>Me encontra naquele lugar (l&aacute; no fim de mundo) &agrave; tal
hora</B> </P>

<P>Ela marca o encontro, mas n&atilde;o vai. Ou te deixa esperando horas.
</P>

<P><B>A gente precisa falar sobre aquele assunto..</B> </P>

<P>N&atilde;o interessa muito o assunto. Pode ser at&eacute; uma defini&ccedil;&atilde;o
sobre casamento no futuro. N&atilde;o interessa. Mas &eacute; uma coisa
que vem justo naquele momento em que voc&ecirc; n&atilde;o espera. No bem-bom.
No &aacute;gua-com-a&ccedil;&uacute;car. Ap&oacute;s um beijo. &Eacute;
sempre um assunto que voc&ecirc; preferia deixar para depois. Voc&ecirc;
s&oacute; escapa de dar a resposta se estiver sempre (e isso quer dizer
sempre) alerta. </P>

<P><B>Eu n&atilde;o quero me casar, nem ter filhos..</B> </P>

<P>Opini&atilde;o do boi: hummmmmmmm! Isso tanto pode ser verdade, como
pode ser uma pegadinha, como pode ser uma forma de saber at&eacute; que
ponto voc&ecirc; se desinteressa pelo t&oacute;pico. </P>

<P><B>Minha hist&oacute;ria de vida &eacute; triste</B> </P>

<P>Essa da&iacute; &eacute; complicada que nem novela mexicana. A menina
n&atilde;o quer contar nada da inf&atilde;ncia, adolesc&ecirc;ncia, etc,
n&atilde;o quer contar nada da fam&iacute;lia, n&atilde;o quer apresentar
ningu&eacute;m ou se apresenta &eacute; s&oacute; rapidinho e nunca mais.
Pessoalmente, acho roubada perguntar do passado da pessoa. A menina pode
resolver contar umas hist&oacute;rias fant&aacute;sticas, coisa de livro
de N&eacute;lson Rodrigues mesmo, tipo o papel da Luc&eacute;lia Santos
em &quot;Bonitinha mas ordin&aacute;ria&quot;. A quest&atilde;o da hist&oacute;ria
&eacute; o momento em que ela est&aacute; sendo contada e o porqu&ecirc;.
No filme, uma hist&oacute;ria era alterada para iludir o coitado do personagem
principal para se casar com algu&eacute;m. N&atilde;o &eacute; coisa de
novela. Acontece na vida real e verdadeira ou n&atilde;o, o objetivo pode
ser deixar a pessoa com sentimento de culpa. A&iacute; n&atilde;o acaba
com a rela&ccedil;&atilde;o. Como se escapa disso? &Eacute; amadurecer
e entender que todo mundo tem uma hist&oacute;ria triste. A de algumas
mulheres come&ccedil;a no dia em que a bunda cai. A sua pode come&ccedil;ar
no momento em que resolver ajudar algu&eacute;m &agrave; sair da merda.
</P>

<P><B>Aquele cara mexeu comigo</B> </P>

<P>Isso acontece muito, quando se sai com algu&eacute;m e a mulher &eacute;
bonita. Todo mundo quer tirar uma lasquinha. Sair no bra&ccedil;o com todo
mundo j&aacute; saiu de moda. Desaconselho totalmente, fazer isso numa
cidade grande. Cidade pequena, tamb&eacute;m desaconselho. Se voc&ecirc;
est&aacute; acompanhado, v&aacute; com amigos. Ou converse depois. Parece
simples, chegar e tirar satisfa&ccedil;&otilde;es, mas n&atilde;o &eacute;.
E n&atilde;o &eacute; objetivo deste texto explicar porqu&ecirc;. Na d&uacute;vida,
saia de &oacute;culos escuros ou espelhados. Existe tamb&eacute;m a menina
que &eacute; doida para ver o namorado brigando por ela e fica provocando
briga com outros caras. Cada um &eacute; cada um, mas eu abandonava a menina.
</P>

<CENTER><P><B>A Quest&atilde;o das Brigas</B> </P></CENTER>

<P>At&eacute; onde sei, ningu&eacute;m (sexo masculino) entra nessa de
namoro para ficar brigando e fazendo as pazes de novo. Afinal de contas,
para que? Voc&ecirc; namoraria algu&eacute;m por conta se soubesse que
&eacute; problem&aacute;tica? Acredite em mim, h&aacute; mulheres usam
o namorado como saco de pancada. Minha sugest&atilde;o &eacute; simples:
come&ccedil;ou a brigar regularmente por coisa a toa, caia fora! E reserva
uns meses de problema porque a pessoa provavelmente vai tentar de tudo
para te trazer de volta, at&eacute; aquilo que voc&ecirc; sempre quis e
nunca teve. N&atilde;o tope. N&atilde;o queira descobrir o porqu&ecirc;.
Resista a qualquer tenta&ccedil;&atilde;o. Caia fora. D&ecirc; gra&ccedil;as
aos c&eacute;us que voc&ecirc; &eacute; homem e pode, no desespero, recorrer
a expedientes mais ruins (e custosos). Mas caia fora. A n&atilde;o ser,
&eacute; l&oacute;gico, que seu neg&oacute;cio seja sossegar o facho e
casar logo de uma vez. Prepara a grana pro div&oacute;rcio e a pens&atilde;o
aliment&iacute;cia para os filhos, que mulher desse tipo as v&ecirc;zes
apela para o recurso de engravidar. </P>

<P>O problema das brigas &eacute; que al&eacute;m do motivo em si, podem
haver outros. J&aacute; conheci uma mulher que brigava s&oacute; para poder
sair com outro cara sem botar chifre. Depois reatava. Outra possibilidade?
Fazer voc&ecirc; desistir de pedir determinado tipo de coisa. Fazer voc&ecirc;
se sentir culpado (mesmo que a culpa seja dela). Fazer voc&ecirc; se sentir
um trouxa que tem que aceitar que ela &eacute; mais inteligente e portanto
ela &eacute; que deveria tomar as decis&otilde;es de fazer o qu&ecirc;,
onde. Claro que d&aacute; para aproveitar a ocasi&atilde;o e pedir o fim
do namoro (pode ser interessante). O &quot;business&quot; &eacute; estar
alerta. Uma coisa &eacute; a briga por motivo justo. Outra &eacute; a briga
encenada com 2as ou 3as inten&ccedil;&otilde;es, como por exemplo, provocar
at&eacute; voc&ecirc; bater nela. Acredite em mim, tem mulher que tenta
isso. O objetivo &eacute; dar queixa na delegacia. </P>

<P>O problema das brigas &eacute; que voc&ecirc; se esguela durante o que
parece horas e dia seguinte, com que cara voc&ecirc; vai sair e encontrar
a&nbsp; &quot;gata&quot;. Acha que est&aacute; tudo acabado, j&aacute;
era e ent&atilde;o ela te recebe com um: &quot;Oi, benzinho! Puxa, tava
sentindo tanto sua falta, me d&aacute; um beijinho?&quot;. &Eacute; uma
forma de fazer &agrave;s pazes ou de impedir um &quot;contra-ataque&quot;.
</P>

<P>Anota a&iacute;: quanto mais experimentada e vivida, maior o sufoco
que ela vai te fazer passar (pode ser vivida e n&atilde;o saber fazer isso).
A coisa varia desde briguinhas que podem parar na delegacia at&eacute;
aqueles esc&acirc;ndalos escabrosos que v&atilde;o fazer voc&ecirc; nunca
mais ter coragem de olhar na cara de metade das pessoas que viram a cena
(a metade masculina, porqu&ecirc; a metade feminina fica com medo da megera).
Claro que isso s&atilde;o casos extremos mas.. pode acontecer com voc&ecirc;.
Acho que Dostoievsky tinha uma mulher dessas em casa (esse da&iacute; foi
o escritor russo, autor de &quot;Recorda&ccedil;&otilde;es da casa dos
mortos&quot;, &quot;O Idiota&quot;,&nbsp; &quot;Crime e castigo&quot;,
etc, etc..). </P>

<P><B>Conclus&atilde;o</B> </P>

<P>Ter algu&eacute;m na sua vida &eacute; algo mais complicado do que parece.
Pelo menos comparada &agrave; vida que a pessoa tem, ficando na frente
do computador. &Eacute; preciso ficar de olho em v&aacute;rias atitudes,
se quiser realmente ter alguma alegria com a coisa e n&atilde;o apenas
ficar pagando mico. &Eacute; tecnicamente imposs&iacute;vel experimentar
todo o tipo de coisas descritas nesse texto. Poucos aguentam tantos micos
de uma s&oacute; vez. Alguns ficam t&atilde;o imbecilizados que at&eacute;
experimentam v&aacute;rios micos descritos, mas &eacute; experi&ecirc;ncia
jogada fora. &Eacute; preciso entender que a mulher n&atilde;o &eacute;
assim ou assado por essa ou aquela raz&atilde;o. &Eacute; mulher e ponto
final. V&aacute;rios dos truques poderiam ser usados contra elas e at&eacute;
s&atilde;o. Basta ter a experi&ecirc;ncia. No per&iacute;odo inicial acontece
muita coisa boa. Depois que a euforia acaba, tem-se que conviver com a
pessoa no seu estado normal. Sei l&aacute;. </P>

<P>Porque o mundo est&aacute; cheio de coisas desse tipo, meu. </P>

<P>E como dizia John Lennon,&nbsp; &quot;Life is very short for fussing
and fighting, my friend&quot;. A vida &eacute; curta.</P>

<P>(*) Porqu&ecirc; minha insist&ecirc;ncia&nbsp; nuns textos desse tipo
- Porque sim, sei l&aacute;. Apesar do p&uacute;blico objetivo ser marmanjo,
mulher l&ecirc; e morre de rir. A&iacute; eu tenho assunto para discutir
quando encontro alguma. Marmanjo tamb&eacute;m l&ecirc; e no m&iacute;nimo,
pode talvez aprender alguma coisa e talvez diminuir o n&uacute;mero de
micos. As rea&ccedil;&otilde;es que tive quando apresentei este tema abaixo
foram interessantes. Na verdade, tive que cortar um monte de partes desse
texto, t&aacute; com a metade do tamanho. Algum dia reuno e boto num livro.
Querendo, me manda alguma id&eacute;ia no derneval(arroba)bigfoot.com</P>

</BODY>
</HTML>
